[{"text": "Alexander Rae Baldwin III (born April 3, 1958) is an American actor, comedian, and producer. He is known for his leading and supporting roles in a variety of genres, from comedy to drama, and has received numerous accolades including three Primetime Emmy Awards and three Golden Globe Awards as well as nominations for an Academy Award, a BAFTA Award, and Tony Award."}, {"text": "Baldwin first gained recognition by appearing on the sixth and seventh seasons of primetime soap opera Knots Landing (1984–1985). In the early part of his film career he played both leading and supporting roles in Beetlejuice (1988), Working Girl (1988), Married to the Mob (1988) and Glengarry Glen Ross (1992). He played Jack Ryan in The Hunt for Red October (1990). He received nominations for the Academy Award for Best Supporting Actor for The Cooler (2003) and the BAFTA Award for Best Supporting Actor for It's Complicated (2010). He has acted in the films The Royal Tenenbaums (2001), Along Came Polly (2004), The Aviator (2004), The Departed (2006), To Rome with Love (2012), Blue Jasmine (2013), Mission: Impossible – Rogue Nation (2015) and Mission: Impossible – Fallout (2018). He voiced the titular role in The Boss Baby film franchise."}, {"text": "From 2006 to 2013, Baldwin received critical acclaim starring alongside Tina Fey as Jack Donaghy on the NBC sitcom 30 Rock, winning two Primetime Emmy Awards, three Golden Globe Awards, and seven Screen Actors Guild Awards for Best Actor in a comedy series, making him the male performer with the most SAG Awards in history. Baldwin has received critical acclaim for his portrayal of Donald Trump on the NBC sketch series Saturday Night Live, a role that won him his third Primetime Emmy in 2017. He was nominated again in 2018 and 2021.Baldwin made his Broadway debut in Loot (1986). He portrayed Stanley Kowalski in the 1992 production of A Streetcar Named Desire for which he earned a Tony Award for Best Actor in a Play nomination. He returned to Broadway in Twentieth Century (2004) and Orphans (2013). He hosted the 82nd Academy Awards in 2010. He is also a columnist for The Huffington Post. He was the host of Match Game from 2016 until 2021."}, {"text": "In 2021, while on the Rust film set, Baldwin discharged a revolver used as a prop, which killed cinematographer Halyna Hutchins and injured director Joel Souza. Baldwin was charged with two counts of involuntary manslaughter in Santa Fe County, New Mexico in January 2023, but the charges were dropped in April 2023 pending further investigation. He was indicted again for the charge on January 19, 2024."}, {"text": "== Early life and education ==Alexander Rae Baldwin III was born on April 3, 1958, in Amityville, New York, and raised in the Nassau Shores neighborhood of nearby Massapequa, the eldest son of Carol Newcomb (née Martineau; December 15, 1929 – May 26, 2022) from Syracuse, New York and Alexander Rae Baldwin Jr. (October 26, 1927 – April 15, 1983), a high school history/social studies teacher and football coach from Brooklyn. He has three younger brothers, Daniel (b. 1960), William (b. 1963), and Stephen (b. 1966), who also became actors. He also has two sisters, Elizabeth \"Beth\" Baldwin Keuchler (b. 1955) and Jane Ann Baldwin Sasso (b. 1965).Alec and his siblings were raised as Roman Catholics. They are of Irish, French, and English ancestry. Through his father, Baldwin is descended from Mayflower passenger John Howland, and through this line, is the 13th generation of his family born in North America and the 14th generation to live in North America.Baldwin attended Alfred G. Berner High School in Massapequa and played football there under Coach Bob Reifsnyder. In New York City, Baldwin worked as a busboy at the famed discotheque, Studio 54. From 1976 to 1979, he attended George Washington University. In 1979, he lost the election for student body president and received a personal letter from former U.S. president Richard Nixon (with whom he had a common friend) encouraging him to use the loss as a learning experience.Afterward, he transferred to the Tisch School of the Arts of New York University (NYU) where he studied with, among others, Geoffrey Horne and Mira Rostova at the Lee Strasberg Theatre Institute. Later, he was accepted as a member of the Actors Studio. In 1994, he completed his Bachelor of Fine Arts degree at NYU."}, {"text": "=== 1980–1992: Rise to prominence ===Baldwin's first acting role was as Billy Aldrich in the NBC daytime soap opera The Doctors from August 20, 1980, to 1982. In the fall of 1983, he starred in the short-lived television series Cutter to Houston. The actor made his TV movie debut playing the titular Sheriff Ed Cassaday in The Sheriff and the Astronaut (1984). He went on to appear as the brother of Valene Ewing and son of Lilimae Clements (played by Joan Van Ark and Julie Harris, respectively) in Knots Landing from 1984 to 1985. In 1986, Baldwin starred in Dress Gray, a four-hour made-for-television miniseries, as an honest cadet sergeant who tries to solve the mystery of a murdered gay classmate. Baldwin made his Broadway debut in 1986 in a revival of Joe Orton's Loot alongside Zoë Wanamaker, Željko Ivanek, Joseph Maher, and Charles Keating. This production closed after three months."}, {"text": "=== 1980–1992: Rise to prominence ===Baldwin made his feature film debut with a minor role in the 1987 comedy-mystery Forever, Lulu. In 1988, he rose to prominence acting in five major films. He starred in Tim Burton fantasy horror comedy Beetlejuice (1988) opposite Michael Keaton and Geena Davis. He had supporting roles in the Mike Nichols romantic comedy Working Girl and Jonathan Demme's crime comedy Married to the Mob. He also co-starred in Oliver Stone's drama Talk Radio opposite Eric Bogosian and in the John Hughes romantic drama She's Having a Baby with Kevin Bacon and Elizabeth McGovern."}, {"text": "=== 1980–1992: Rise to prominence ===He gained further recognition as a leading man with his role as Jack Ryan in The Hunt for Red October (1990). That same year, he also starred in the black comedy crime film Miami Blues alongside Jennifer Jason Leigh and Fred Ward. Baldwin met his future wife Kim Basinger when they played lovers in the 1991 film The Marrying Man. Next, Baldwin played a ferocious sales executive in Glengarry Glen Ross (1992), a part added to the film version of David Mamet's Pulitzer Prize-winning stage play (including the monologue \"Coffee's for closers\"). Later that same year, he starred in Prelude to a Kiss with Meg Ryan, which was based on the Broadway play. The film received a lukewarm reception by critics and grossed only $22 million worldwide."}, {"text": "=== 1993–2005: Established actor ===He appeared with Basinger again in The Getaway, a 1994 remake of the 1972 Steve McQueen film of the same name. Also, in 1994, Baldwin made a foray into pulp fiction-based movies with the role of the title character in The Shadow. The film made $48 million. In 1996 and 1997 he starred in several more thrillers, including The Edge, The Juror, and Ghosts of Mississippi. His other Broadway credits include Caryl Churchill's Serious Money with Kate Nelligan and a revival of Tennessee Williams' A Streetcar Named Desire, for which his performance as Stanley Kowalski garnered a Tony Award nomination for Best Actor. Baldwin also received an Emmy nomination for the 1995 television version of the production, in which both he and Jessica Lange reprised their roles, alongside John Goodman and Diane Lane. In 1998, Baldwin played the title role in Macbeth at The Public Theater alongside Angela Bassett and Liev Schreiber in a production directed by George C. Wolfe. From 1998 to 2002, he became the third narrator and George Carlin's replacement for the fifth and sixth seasons of Thomas & Friends. Baldwin wrote an episode of Law & Order entitled \"Tabloid\", which aired in 1998. In 2000, he played Mr. Conductor in the Thomas & Friends film Thomas and the Magic Railroad. In 2002, he acted in The Cat in the Hat."}, {"text": "=== 1993–2005: Established actor ===In 2002, Baldwin appeared in two episodes of Friends as Phoebe's overly enthusiastic love interest, Parker. He also portrayed a recurring character in several seasons 7 and 8 episodes of Will & Grace, in which he played Malcolm, a \"top secret agent\" and the lover of Karen Walker (Megan Mullally). He also guest-starred in the first live episode of the series. He played Dr. Barrett Moore, a retired plastic surgeon, in the series Nip/Tuck. Baldwin shifted towards character acting, beginning with Pearl Harbor in 2001. He played Lt. Col. Jimmy Doolittle in the film. With a worldwide box office of $449,220,945, this film remains the highest-grossing film Baldwin has appeared in during his acting career. Baldwin directed and starred in The Devil and Daniel Webster with Anthony Hopkins, Jennifer Love Hewitt and Dan Aykroyd in 2001. The then-unreleased film became an asset in a federal bank fraud trial when investor Jed Barron was convicted of bank fraud while the movie was in production. The film was eventually acquired by The Yari Group without Baldwin's involvement.Baldwin was nominated for an Academy Award, a Golden Globe, and the Screen Actors Guild Award for Best Actor for his performance in the 2003 gambling drama The Cooler. He received acclaim for the role with Roger Ebert writing, \" This is one of Alec Baldwin's best performances, as a character who contains vast contradictions. He can be kind and brutal simultaneously; affection and cruelty are handmaidens\". Baldwin collaborated with Martin Scorsese portraying Juan Trippe in the biographical drama The Aviator (2004) and Capt. George Ellerby in the crime drama The Departed (2006). In 2004, Baldwin starred in a revival of Broadway's Twentieth Century about a successful and egomaniacal Broadway director (Baldwin), who has transformed a chorus girl (Anne Heche) into a leading lady. Charles Isherwood of Variety gave the production a mixed review writing of Baldwin's performance, \"Baldwin is an earthy actor with a natural contemporary style, and his hoity-toity faux-British accent sounds more off-key than it should\".On June 9, 2005, he appeared in a concert version of the Rodgers and Hammerstein musical South Pacific at Carnegie Hall. He starred as Luther Billis, alongside Reba McEntire as Nellie and Brian Stokes Mitchell as Emile. The production was taped and telecast by PBS on April 26, 2006. In 2006, he starred in the film Mini's First Time. He performed opposite Sarah Michelle Gellar in Suburban Girl (2007)."}, {"text": "=== 2006–2013: Career resurgence with 30 Rock ===In 2006, Baldwin made theater news in Roundabout Theatre Company's Off-Broadway revival of Joe Orton's Entertaining Mr. Sloane. In 2010, Baldwin starred opposite Sam Underwood in a critically acclaimed revival of Peter Shaffer's Equus, directed by Tony Walton at Guild Hall in East Hampton, New York. In 2007, the Yari Film Group announced that it would give the film, now titled Shortcut to Happiness, a theatrical release in the spring, and cable film network Starz! announced that it had acquired pay TV rights for the film. Shortcut to Happiness was finally released in 2008. Baldwin, displeased with the way the film had been cut in post-production, demanded that his directorial credit be changed to the pseudonym \"Harry Kirkpatrick\".He starred as Jack Donaghy on NBC's 30 Rock, which first aired in October 2006. He met his future co-stars Tina Fey and Tracy Morgan while appearing on Saturday Night Live. Since season 3, Baldwin was credited as one of 30 Rock's producers. Barry Garron of The Hollywood Reporter praised Baldwin's character writing, \"Donaghy is a perfect example of what's right with this show.\" Baldwin has won three Primetime Emmy Awards for Outstanding Lead Actor in a Comedy Series, two Golden Globe awards and seven Screen Actors Guild Awards for his role. He received his second Emmy nomination in 2008, marking his seventh Primetime Emmy nomination and first win. He won again in 2009.Baldwin co-authored the book A Promise to Ourselves: A Journey Through Fatherhood and Divorce with Mark Tabb in 2008. Baldwin joined TCM's The Essentials Robert Osborne as co-host beginning in March 2009. In 2008 he had a voice role as the main antagonist in the DreamWorks Animated film Madagascar: Escape 2 Africa. In 2009, he appeared in a series of commercials for Hulu that premiered during the Super Bowl broadcast. On January 12, 2009, Baldwin became the host of The New York Philharmonic This Week, the nationally syndicated radio series of the New York Philharmonic. He has recorded two nationally distributed public service radio announcements on behalf of the Save the Manatee Club. In 2010, he made a five-second cameo appearance with comedian Andy Samberg in a musical video titled \"Great Day\" featured on the bonus DVD as part of Lonely Island's album Turtleneck & Chain."}, {"text": "=== 2006–2013: Career resurgence with 30 Rock ===Baldwin co-starred in the hit romantic comedy It's Complicated (2009) with Meryl Streep and Steve Martin. Together Streep and Baldwin received positive reviews for their on-screen chemistry. Manohla Dargis of The New York Times wrote, \"Mr. Baldwin does with Jake, who, with his shark smiles and thrusting gut, beautifully conveys male vanity in its twilight\". Kirk Honeycut of The Associated Press wrote, \"Baldwin has developed a second career in films and television by more or less spoofing his macho image\". Baldwin went on to receive a nomination for the BAFTA Award for Best Supporting Actor for his performance. That same year, Baldwin co-hosted the 82nd Academy Awards with Steve Martin in 2010. The Boston Globe television critic Matthew Gilbert lauded the hosts performance saying that \"The delivery was expert and warmly conversational, like one of those old-school comedy teams.\"He has hosted Saturday Night Live 17 times as of February 11, 2017, and holds the record for most times hosting the show. On October 24, 2011, WNYC public radio released the first episode of Baldwin's podcast Here's the Thing, a series of interviews with public figures including artists, policy-makers, and performers. The first two episodes featured actor Michael Douglas and political consultant Ed Rollins. Between 2011 and 2020, Baldwin completed more than 150 interviews, with guests who included musician Wynton Marsalis, filmmaker Edward Norton, comedian David Letterman, violinist Itzhak Perlman, and pianist Lang Lang, among many others. Here's the Thing was developed for Baldwin by Lu Olkowski, Trey Kay, Kathy Russo, and Emily Botein. On February 4, 2012, he hosted the 2011 NFL Honors awards show. He later hosted the second show on February 2, 2013.Baldwin returned to Broadway as Harold in Orphans. The show, which opened April 18, 2013, was also to have starred Shia LaBeouf as Treat, but LaBeouf left the production in rehearsals and was replaced by Ben Foster. Marilyn Stasio of Variety described Baldwin's performance as being \"executed with humor and compassion\". That same year Baldwin briefly hosted Up Late with Alec Baldwin on MSNBC. On November 26, 2013, the program was cancelled after only five episodes, due in part to a street tirade captured on video, in which he allegedly called the videographer a \"cocksucking fag\". Baldwin denied that he used the word \"fag\", and later cited this incident as a major turning point in his public life. Beginning in 2010, Baldwin appeared in a television campaign for Capital One as their spokesperson. Following the 2013 confrontation with a videographer, his contract was not renewed, and he was succeeded in the campaign by Jennifer Garner."}, {"text": "=== 2014–present ===Baldwin co-starred in Mission: Impossible – Rogue Nation, the fifth installment of the Mission: Impossible series, released on July 31, 2015, and reprised the role in Mission: Impossible – Fallout, released on July 27, 2018. In 2016 Baldwin began hosting a reboot of the game show Match Game on ABC. That same year Baldwin gained acclaim and notoriety for his portrayal of Republican nominee Donald Trump during SNL's coverage of the 2016 Presidential election, to critical acclaim. In 2017, he won the Primetime Emmy Award for Outstanding Supporting Actor in a Comedy Series for his portrayal of Trump. Baldwin continued in the role until Trump's defeat in the 2020 election.In 2017, he took over as sole host of TCM's The Essentials following the death of his co-host, Robert Osborne. In August 2017, Baldwin's production company, El Dorado Pictures, signed a first-look deal with ABC Studios. His 2017 memoir Nevertheless debuted at No. 5 on The New York Times hardcover nonfiction best-seller list. On March 3, 2018, following the broadcast of the 90th Academy Awards, ABC broadcast a preview episode of the talk show The Alec Baldwin Show, at the time called Sundays With Alec Baldwin, scheduled to formally debut with a nine-episode order that fall. On August 27, 2018, it was announced that Baldwin would join the cast for Joker, playing Thomas Wayne, father of Bruce Wayne. Later, on August 29, 2018, Baldwin withdrew from the role. That same year, Baldwin made cameo appearances in Spike Lee's historical drama BlacKkKlansman and Bradley Cooper's musical drama A Star Is Born as Dr. Kennebrew Beaureguard and himself, respectively. That same year, he guest-starred as George Tenet in the Hulu miniseries The Looming Tower.Baldwin was the subject of the 2019 edition of the Comedy Central Roast, which included among the roastees a surprise appearance by his daughter Ireland. In 2021, Baldwin starred opposite Jamie Dornan and Christian Slater in the miniseries Dr. Death on Peacock. He has a voice cameo as himself interviewing Lydia Tár played by Cate Blanchett in Tár (2022), directed by Todd Field."}, {"text": "== Acting credits and accolades ==Baldwin has also received a number of awards and nominations throughout his career for stage, television, and film roles. He has been nominated for the Academy Award, BAFTA Award, and Tony Award and has received three Primetime Emmy Awards, three Golden Globe Awards, and eight Screen Actors Guild Awards."}, {"text": "== Acting credits and accolades ==On May 12, 2010, Baldwin gave a commencement address at New York University and was awarded a Doctor of Fine Arts degree, honoris causa.Baldwin was named Esteemed Faculty by Stony Brook University after teaching a master class in acting at Stony Brook Southampton."}, {"text": "== Philanthropy ==Baldwin, along with his mother Carol, created the Carol M. Baldwin Cancer Research Fund in 1996, and dedicated the Carol M. Baldwin Breast Care Center at the Stony Brook University Hospital in her honor. During his 2010–2013 stint as a spokesperson for Capital One, Baldwin's contract was written to fund Baldwin's charity foundation. He was paid $15 million over nearly five years. After taxes and accounting fees, the remainder, $14.125 million, was given to charity.In March 2011, Baldwin donated $1 million to the New York Philharmonic (on whose board he served), and $500,000 to the Roundabout Theatre Company, where he has performed plays in New York. In recent years, his foundation has donated bookstore gift certificates to Long Island libraries to support literacy programs."}, {"text": "== Personal life ==Baldwin was briefly engaged in 1983 to actress Janine Turner. He also dated Lori Loughlin, Lori Singer, Holly Gagnier and Jennifer Love Hewitt."}, {"text": "==== Kim Basinger ====In 1990, Baldwin met actress Kim Basinger when they played lovers in the film The Marrying Man. They married on August 19, 1993, and had a daughter, Ireland (b. October 23, 1995). They separated on December 5, 2000 and divorced on September 3, 2002. Baldwin has called the attorneys in the case \"opportunists\", and characterized Basinger's psychologists as part of the \"divorce industry\". In his memoir, he stated that he blamed them more than Basinger, writing that \"She is a person, like many of us, doing the best she can with what she has.\"In his memoir, Baldwin stated that these issues placed stress on his relationship with his daughter. Baldwin wrote that he had to spend over a million dollars, put time aside from his career, travel extensively, and find a house in California, having previously lived in New York, in order to stay in his daughter's life.On April 11, 2007, he left a voicemail message in response to an unanswered arranged call, in which he called his 11-year-old daughter a \"rude, thoughtless little pig\". The tape was sold to TMZ, which published the recording despite laws against publishing media related to a minor without the permission of both parents. Baldwin described the incident as a mistake that did not make him a bad parent. During an interview with Playboy in June 2009, he stated that he contemplated suicide after the voicemail leaked to the public, but sought professional help. He stated that he felt Basinger would have considered it \"a victory\" if he committed suicide and that it was her \"avowed goal\" to destroy him.In late 2008, Baldwin toured in support of his book on fatherhood and divorce, speaking about his experiences related in it."}, {"text": "==== Hilaria Baldwin ====By August 2011, Baldwin began dating Hilaria Thomas, a yoga instructor with Yoga Vida in Manhattan. Baldwin and Thomas moved from the Upper West Side to Greenwich Village that August. The couple became engaged in April 2012 and married on June 30, 2012, at St. Patrick's Old Cathedral in New York City. They have seven children together."}, {"text": "=== 1995 photographer incident ===On October 26, 1995, Baldwin allegedly assaulted a photographer for videotaping Basinger and their three-day-old daughter. The couple was returning from the hospital and was confronted by the photographer outside their Los Angeles home. Whoopi Goldberg praised Baldwin for his actions during her opening monologue while hosting the 68th Academy Awards."}, {"text": "=== 2011 plane incident ===In December 2011, Baldwin was on an American Airlines flight at Los Angeles International Airport, playing Words with Friends on his phone while waiting for takeoff. When instructed to put away the \"electronic device\" by the flight attendant, he reportedly became belligerent and was eventually removed from the plane. The incident was humorously referenced in the following months in TV commercials for Capital One credit cards and Best Buy electronics stores. Baldwin also spoofed the incident during a cameo appearance on Saturday Night Live's Weekend Update segment."}, {"text": "=== Health and dieting ===Baldwin and his wife are pescatarians who eat a predominantly plant-based diet with fish and eggs. Baldwin gave up eating beef in 1991 and is a supporter of People for the Ethical Treatment of Animals. In 2019, he authored an article for CNN supporting the EAT Lancet report and recommended a plant-based diet due to global environmental issues."}, {"text": "=== 2021 shooting incident ===On October 21, 2021, Baldwin was filming on the set of the upcoming film Rust, of which he was also a producer, at the Bonanza Creek Ranch in Santa Fe, New Mexico, when he discharged a gun being used as a prop, killing cinematographer Halyna Hutchins and injuring director Joel Souza. This was reported in the press as the Rust shooting incident. The Hutchins family filed a wrongful death suit against Baldwin for his part in the fatal shooting. On October 5, 2022, Baldwin reached an undisclosed settlement with Hutchins' family in their wrongful death lawsuit.On January 19, 2023, Santa Fe District Attorney Mary Carmack-Altwies announced that Baldwin would be charged with two counts of involuntary manslaughter by the end of the month. He was charged on January 31, 2023. The elevated second charge was eventually dropped after his lawyers argued that he was being incorrectly charged with a version of the law that was not passed until months after the shooting, meaning that if he was found guilty, he would have faced a maximum of 18 months in prison. On February 23, he pleaded not guilty to involuntary manslaughter.In April 2023, lawyers for Baldwin announced that the criminal charges against him had been dropped by prosecutors. In a statement, Baldwin's attorneys said \"We are pleased with the decision to dismiss the case against Alec Baldwin and we encourage a proper investigation into the facts and circumstances of this tragic accident.\" On October 17, 2023, New Mexico special prosecutors would announce that their findings indicated that Baldwin may be guilty of involuntary manslaughter. Rust completed filming in May 2023 and is currently in post-production. In 2023, Baldwin has been associated with four other film projects including Supercell, 97 Minutes, Atrabilious and Billie's Magic World. He also appeared in a cameo on Saturday Night Live in October 2023, in an episode hosted by Timothée Chalamet, making it one of his first live appearances since the Rust incident and first appearance on the show since 2020.In January 2024, a grand jury indicted Baldwin on an involuntary manslaughter charge. The indictment provides prosecutors with two options for pursuing this charge: one based on negligent use of a firearm, and the other for felony misconduct \"with the total disregard or indifference for the safety of others.\""}, {"text": "== Political views ==Baldwin is a Democrat and endorsed Barack Obama in his two presidential campaigns. He serves on the board of People for the American Way. He is an animal rights activist and a staunch supporter of PETA, for which he has done work that includes narrating the video entitled Meet Your Meat. Baldwin lent his support to the Save the Manatee Club by donating his time to record several public service announcements for the group, which had contacted him following his role in \"The Bonfire of the Manatees\", an episode of The Simpsons in which he was the voice of a biologist working to save the endangered mammals. Baldwin also gave his support for Farm Sanctuary's Adopt A Turkey Project and stated, \"At least 46 million turkeys suffer heartbreaking fear and pain before being killed each and every Thanksgiving...\"During his appearance on the comedy late night show Late Night with Conan O'Brien on December 11, 1998, eight days before President Bill Clinton was to be impeached, Baldwin said, \"If we were in another country ... we would stone Henry Hyde to death and we would go to their homes and kill their wives and their children. We would kill their families, for what they're doing to this country.\" Baldwin later apologized for the remarks, and the network explained that it was meant as a joke and promised not to re-run it.Baldwin said in a 2006 interview with The New York Times that if he did become involved in electoral politics, he would prefer to run for Governor of New York. When asked if he was qualified for the office, Baldwin responded that he considered himself more qualified than California Governor Arnold Schwarzenegger. On December 21, 2011, Baldwin, addressing speculation, said he was abandoning plans to run for mayor of New York City and would instead continue in his role on 30 Rock. That April, he suggested he might change his mind, saying, \"Let's see what things are like in 2014. I would love to do it.\"In February 2009, Baldwin spoke out to encourage state leaders to renew New York's tax break for the film and television industry, stating that if the \"tax breaks are not reinstated into the budget, film production in this town is going to collapse and television production is going to collapse and it's all going to go to California\".During the 63rd Primetime Emmy Awards in 2011, televised by Fox, Baldwin was slated to appear in a taped skit. However, the producers of the show cut a portion of the skit containing a reference to Rupert Murdoch and the News International phone hacking scandal. Baldwin subsequently boycotted the Emmy Awards and requested that his entire appearance be removed from the broadcast. Producers complied and he was replaced with Leonard Nimoy."}, {"text": "== Further reading ==Brown, Scott (December 15, 2009). \"Stay in the Game: The Fall and Rise of Alec Baldwin\". Wired. No. January 2010. pp. 86–87. Archived from the original on December 19, 2009."}, {"text": "== Further reading ==Baldwin, Alec (2008). A Promise to Ourselves: A Journey Through Fatherhood and Divorce. New York: St. Martin's Press. ISBN 978-0-312-36336-9. OCLC 222666774. Retrieved January 7, 2016."}, {"text": "== External links ==Official website "}, {"text": "== External links ==Alec Baldwin at Curlie"}, {"text": "== External links ==Alec Baldwin at IMDb "}, {"text": "== External links ==Alec Baldwin at the Internet Broadway Database "}, {"text": "== External links ==Alec Baldwin at the Internet Off-Broadway Database "}, {"text": "== External links ==Alec Baldwin at Playbill Vault "}, {"text": "== External links ==Alec Baldwin at AllMovie "}, {"text": "== External links ==Alec Baldwin's Charity Work"}, {"text": "== External links ==Alec Baldwin at Emmys.com"}]