[{"text": "Anderson Hays Cooper (born June 3, 1967) is an American broadcast journalist and political commentator currently anchoring the CNN news broadcast show Anderson Cooper 360°. In addition to his duties at CNN, Cooper serves as a correspondent for 60 Minutes on CBS News. After graduating from Yale University with a Bachelor of Arts in 1989, he began traveling the world, shooting footage of war-torn regions for Channel One News. Cooper was hired by ABC News as a correspondent in 1995, but he soon took more jobs throughout the network, working for a short time as a co-anchor, reality game show host, and fill-in morning talk show host."}, {"text": "In 2001, Cooper joined CNN, where he was given his own show, Anderson Cooper 360°, in 2003; he has remained the show's host since. He developed a reputation for his on-the-ground reporting of breaking news events, with his coverage of Hurricane Katrina causing his popularity to sharply increase. For his coverage of the 2010 Haiti earthquake, Cooper received a National Order of Honour and Merit, the highest honor granted by the Haitian government. From September 2011 to May 2013, he also served as the host of his own syndicated daytime talk show, Anderson Live."}, {"text": "Cooper has won 18 Emmy Awards and two Peabody Awards, as well as an Edward Murrow Award from the Overseas Press Club in 2011. A member of the Vanderbilt family, he came out as gay in 2012, becoming \"the most prominent openly gay journalist on American television\". In 2016, Cooper became the first openly LGBT person to moderate a presidential debate, and he has received several GLAAD Media Awards."}, {"text": "== Early life and education ==Cooper was born in Manhattan, New York City, the younger son of writer Wyatt Emory Cooper and artist Gloria Vanderbilt. His maternal grandparents were millionaire equestrian Reginald Claypoole Vanderbilt of the Vanderbilt family and socialite Gloria Morgan Vanderbilt, and Reginald's patrilineal great-grandfather was business magnate Cornelius Vanderbilt, who founded the prominent Vanderbilt shipping and railroad fortune. He has two older half-brothers, Leopold Stanislaus \"Stan\" Stokowski (b. 1950) and Christopher Stokowski (b. 1952), from Gloria's ten-year marriage to conductor Leopold Stokowski. In 2014, Cooper appeared in Henry Louis Gates Jr.'s Finding Your Roots, where he learned of an ancestor, Burwell Boykin, who was a slave owner from the southern United States.Cooper's media experience began early. As a baby, he was photographed by Diane Arbus for Harper's Bazaar. At the age of three, Cooper was a guest on The Tonight Show on September 17, 1970, appearing with his mother. At the age of nine, he appeared on To Tell the Truth as an impostor. From age 10 to 13, Cooper modeled with Ford Models for Ralph Lauren, Calvin Klein and Macy's.Wyatt experienced a series of heart attacks while undergoing open-heart surgery, and died January 5, 1978, at the age of 50. Cooper considers his father's book Families to be \"sort of a guide on... how he would have wanted me to live my life and the choices he would have wanted me to make. And so I feel very connected to him.\"When Cooper was 21, his older brother, Carter Vanderbilt Cooper, committed suicide on July 22, 1988, at age 23, by jumping from the 14th-floor terrace of Vanderbilt's New York City penthouse apartment. Gloria Vanderbilt later wrote about her son's death in the book A Mother's Story, in which she expressed her belief that the suicide was caused by a psychotic episode induced by an allergy to the anti-asthma prescription drug salbutamol. Carter's suicide sparked Anderson's interest in journalism:"}, {"text": "== Early life and education ==Loss is a theme that I think a lot about, and it's something in my work that I dwell on. I think when you experience any kind of loss, especially the kind I did, you have questions about survival: Why do some people thrive in situations that others can't tolerate? Would I be able to survive and get on in the world on my own?"}, {"text": "== Early life and education ==Cooper attended the Dalton School, a private co-educational day school on the Upper East Side of Manhattan. At age 17, after graduating from Dalton a semester early, Cooper traveled around Africa for several months on a \"survival trip\". He contracted malaria on the trip and was hospitalized in Kenya. Describing the experience, Cooper wrote \"Africa was a place to forget and be forgotten in.\" Cooper attended Yale University, where he resided in Trumbull College and was a coxswain on the lightweight rowing team. He was inducted into the Manuscript Society and majored in political science, graduating with a Bachelor of Arts in 1989."}, {"text": "=== Early career ===During college, Cooper spent two summers as an intern at the Central Intelligence Agency while studying political science. He pursued journalism with no formal journalistic education. He is a self-proclaimed \"news junkie since [he] was in utero\". After his first correspondence work in the early 1990s, he took a break from reporting and lived in Vietnam for a year, during which time he studied the Vietnamese language at Vietnam National University, Hanoi."}, {"text": "=== Channel One ===After Cooper graduated from Yale, he tried to gain entry-level employment with ABC answering telephones, but was unsuccessful. Finding it hard to get his foot in the door of on-air reporting, Cooper decided to enlist the help of a friend in making a fake press pass. At the time, Cooper was working as a fact checker for the small news agency Channel One, which produces a youth-oriented news program that is broadcast to many junior high and high schools in the United States. Cooper then entered Myanmar on his own with his forged press pass and met with students fighting the Burmese government.After reporting from Myanmar, Cooper lived in Vietnam for a year to study the Vietnamese language at the University of Hanoi. Persuading Channel One to allow him to bring a Hi8 camera with him, Cooper began filming and assembling reports of Vietnamese life and culture that aired on Channel One. In 1992, he filmed stories from Somalia, Bosnia, and Rwanda.After having been on such assignments for a couple of years, Cooper realized in 1994 that he had slowly become desensitized to the violence he was witnessing around him; the horrors of the Rwandan genocide became trivial: \"I would see a dozen bodies and think, you know, it's a dozen, it's not so bad.\" One particular incident, however, snapped him out of it:"}, {"text": "=== Channel One ===On the side of the road [Cooper] came across five bodies that had been in the sun for several days. The skin of a woman's hand was peeling off like a glove. Revealing macabre fascination, Cooper whipped out his disposable camera and took a closeup photograph for his personal album. As he did, someone took a photo of him. Later that person showed Cooper the photo, saying, \"You need to take a look at what you were doing.\" \"And that's when I realized I've got to stop, [...] I've got to report on some state fairs or a beauty pageant or something, to just, like, remind myself of some perspective.\""}, {"text": "=== ABC ===In 1995, Cooper became a correspondent for ABC News, eventually rising to the position of co-anchor on its overnight World News Now program on September 21, 1999. In 2000, he switched career paths, taking a job as the host of ABC's reality show The Mole:"}, {"text": "=== ABC ===My last year at ABC, I was working overnights anchoring this newscast, then during the day at 20/20. So I was sleeping in two- or four-hour shifts, and I was really tired and wanted a change. I wanted to clear my head and get out of news a little bit, and I was interested in reality TV—and it was interesting."}, {"text": "=== ABC ===Cooper was also a fill-in co-host for Regis Philbin on Live with Regis and Kelly in 2007 when Philbin underwent triple-bypass heart surgery. As of 2019, he still periodically serves as guest co-host on Live when one of the two hosts cannot go in to work."}, {"text": "=== CNN ===Cooper left The Mole after its second season to return to broadcast news. In 2001, he joined CNN, commenting, \"Two seasons was enough, and 9/11 happened, and I thought I needed to be getting back to news.\" His first position at CNN was to anchor alongside Paula Zahn on American Morning. In 2002, he became CNN's weekend prime-time anchor. Since 2002, he has hosted CNN's New Year's Eve special from Times Square."}, {"text": "==== Anderson Cooper 360° ====On September 8, 2003, Cooper became the anchor of Anderson Cooper 360° on CNN. Describing his philosophy as an anchor, he has said:"}, {"text": "==== Anderson Cooper 360° ====I think the notion of traditional anchor is fading away, the all-knowing, all-seeing person who speaks from on high. I don't think the audience really buys that anymore. As a viewer, I know I don't buy it. I think you have to be yourself, and you have to be real and you have to admit what you don't know, and talk about what you do know, and talk about what you don't know as long as you say you don't know it. I tend to relate more to people on television who are just themselves, for good or for bad, than I do to someone who I believe is putting on some sort of persona. The anchorman on The Simpsons is a reasonable facsimile of some anchors who have that problem."}, {"text": "==== Anderson Cooper 360° ====In 2005, Cooper covered the tsunami damage in Sri Lanka; the Cedar Revolution in Beirut, Lebanon; the death of Pope John Paul II; and the royal wedding of Prince Charles and Camilla Parker Bowles. In August 2005, he covered the Niger famine from Maradi."}, {"text": "==== Anderson Cooper 360° ====In 2005, during CNN coverage of the aftermath of Hurricane Katrina, he confronted Sen. Mary Landrieu, Sen. Trent Lott, and the Reverend Jesse Jackson about their perception of the government response. As Cooper said later in an interview with New York magazine, \"Yeah, I would prefer not to be emotional and I would prefer not to get upset, but it's hard not to when you're surrounded by brave people who are suffering and in need.\" A contributor to Broadcasting & Cable magazine wrote: \"In its aftermath, Hurricane Katrina served to usher in a new breed of emo-journalism, skyrocketing CNN's Anderson Cooper to superstardom as CNN's golden boy and a darling of the media circles because of his impassioned coverage of the storm.\"In September 2005, the format of CNN's NewsNight was changed from 60 to 120 minutes to cover the unusually violent hurricane season. To help distribute some of the increased workload, Cooper was temporarily added as co-anchor to Aaron Brown. This arrangement was reported to have been made permanent the same month by the president of CNN's U.S. operations, Jonathan Klein, who has called Cooper \"the anchorperson of the future\". Following the addition of Cooper, the ratings for NewsNight increased significantly; Klein remarked that \"[Cooper's] name has been on the tip of everyone's tongue.\" To further capitalize on this, Klein announced a major programming shakeup on November 2, 2005. Cooper's 360° program would be expanded to two hours and shifted into the 10:00pm ET slot formerly held by NewsNight, with the third hour of Wolf Blitzer's The Situation Room filling in Cooper's former 7:00pm ET slot. With \"no options\" left for him to host shows, Aaron Brown left CNN, ostensibly having \"mutually agreed\" with Jonathan Klein on the matter."}, {"text": "==== Anderson Cooper 360° ====In early 2007, Cooper signed a multi-year deal with CNN that would allow him to continue as a contributor to 60 Minutes, as well as doubling his salary from $2 million annually to a reported $4 million."}, {"text": "==== The Whole Story with Anderson Cooper ====On April 16, 2023, CNN launched a new Sunday primetime series, The Whole Story with Anderson Cooper."}, {"text": "==== CNN Heroes: An All-Star Tribute ====In 2007, he began hosting CNN Heroes: An All-Star Tribute, a show about extraordinary deeds by ordinary people."}, {"text": "==== Planet in Peril documentary ====In October 2007, Cooper began hosting the documentary Planet in Peril with Sanjay Gupta and Jeff Corwin on CNN. In 2008, Cooper, Gupta, and Lisa Ling from National Geographic Explorer teamed up for a sequel, Planet in Peril: Battle Lines, which premiered in December 2008."}, {"text": "==== Syndicated talk show: Anderson Live ====In September 2010, Warner Bros. and Telepictures (both corporate siblings of CNN) announced that Cooper had signed an agreement to host a nationally syndicated talk show. The journalist Brian Stelter (at the time employed by The New York Times, and now by CNN), reported on Twitter that the new Warner Bros. daytime talk show would be named Anderson (now titled Anderson Live). The show premiered on September 12, 2011, and as part of negotiations over the talk show deal, Cooper signed a new multi-year contract with CNN to continue as the host of Anderson Cooper 360°. On October 29, 2012, it was announced that Anderson Live would end at the conclusion of its second season. The show, slightly renamed after season one and revamped with a variety of co-hosts, failed to achieve the ratings distributor Warner Brothers hoped for. The final Anderson Live aired on May 30, 2013."}, {"text": "==== 2016 presidential debates ====Along with Martha Raddatz, Cooper moderated the second presidential election debate between Hillary Clinton and Donald Trump. This made him the first openly LGBT person to moderate a presidential debate in the general election."}, {"text": "==== New Years Eve ====In 2017, Cooper's close friend, Andy Cohen, joined Cooper in succeeding Kathy Griffin as co-host of CNN's New Year's Eve coverage. They again co-hosted CNN's New Year's Eve for 2018, 2019, 2020, 2021, and 2022 ."}, {"text": "=== 60 Minutes ===Cooper has been a correspondent for the CBS News program 60 Minutes since 2007, while concurrently serving as a CNN anchor and correspondent."}, {"text": "==== AC2 ====Andy Cohen and Cooper announced that they would be going on a national tour to perform their conversational stage show AC2 beginning in March 2015. The tour opened in Boston, followed by Miami Beach, Chicago and Atlanta. The idea for the show came about after Cooper interviewed Cohen about his then-latest book, The Andy Cohen Diaries, at an event at the 92nd Street Y in New York City. Since then, the two-man show has continued to tour, reaching more than fifty cities as of October 2018."}, {"text": "==== Broadway ====Cooper was the narrator for the 2011 Broadway revival of How to Succeed in Business Without Really Trying, directed by Rob Ashford and starring Daniel Radcliffe."}, {"text": "==== Writings ====A freelance writer, Cooper has authored a variety of articles that have appeared in many other outlets, including Details magazine.In May 2006, Cooper published a memoir for HarperCollins, Dispatches from the Edge, detailing his life and work in Sri Lanka, Africa, Iraq and Louisiana over the previous year. Some of the book's proceeds are donated to charity. The book topped The New York Times Best Seller list on June 18, 2006.In 2017, Cooper and his mother, Gloria Vanderbilt, co-authored The Rainbow Comes and Goes: A Mother and Son on Life, Love, and Loss. Compiled from a series of emails, the memoir recounts their shared past, and Vanderbilt's tumultuous childhood. Cooper said his goal in writing the book and correspondence was to leave \"nothing left unsaid\" between the pair. It landed on multiple best-seller lists the year of its publication."}, {"text": "==== Jeopardy! ====From April 19 to 30, 2021 Cooper served as a guest host on Jeopardy! following the death of Alex Trebek."}, {"text": "==== Podcast: All There Is ====In 2022, Cooper launched a deeply personal podcast exploring grief and loss. On the show, he interviews other notable people on their experiences with grief. Guests have included TV host Stephen Colbert, musician Laurie Anderson and comedian Molly Shannon. The inspiration for the podcast came from his own life. Reflecting on the loss of his father when he was 10, the loss of his brother to suicide at 21, and the more recent loss of his mother Gloria Vanderbilt, he said “What has struck me is the degree to which I had not dealt with this stuff at all.\" He shared that he wanted to explore this universal human experience. \"I just felt like, ‘Why am I so alone in this? This is something we all go through.' And this idea gave me great strength, that I’m on a road that has been traveled by everybody, in one form or another. Why every time somebody is going down this road should it feel like the first time?” Cooper won a 2023 Webby Award for Best Series for All There Is. His 5-word acceptance speech was \"All There Is, Is Love.\""}, {"text": "== Personal life ==As of 2016, Cooper was not registered to any political party.While promoting his book, Cooper told Oprah Winfrey he had dyslexia as a child.Cooper is openly gay; as of 2012, he was (according to The New York Times) \"the most prominent openly gay journalist on American television\". For years, Cooper avoided discussing his private life in interviews. On July 2, 2012, however, he gave Andrew Sullivan permission to publish an email that stated, in part:"}, {"text": "== Personal life ==I've begun to consider whether the unintended outcomes of maintaining my privacy outweigh personal and professional principle. It's become clear to me that by remaining silent on certain aspects of my personal life for so long, I have given some the mistaken impression that I am trying to hide something—something that makes me uncomfortable, ashamed or even afraid. This is distressing because it is simply not true. ... The fact is, I'm gay, always have been, always will be, and I couldn't be any more happy, comfortable with myself, and proud."}, {"text": "== Personal life ==In 2014, Apple CEO Tim Cook, before making the decision to publicly come out as gay, sought Cooper's advice.In 2014, Cooper and his long-term partner at the time, Benjamin Maisani, purchased Rye House, a historic estate in Connecticut. In March 2018, Cooper confirmed that he and  Maisani had split up.Cooper was friends with Anthony Bourdain, celebrity chef and host of the CNN series Parts Unknown. After Bourdain died by suicide on June 8, 2018, Cooper paid tribute to him in a CNN special program, Remembering Anthony Bourdain. Cooper also paid tribute to Bourdain on the Thanksgiving 2020 episode of Anderson Cooper Full Circle, saying that he was \"proud to call Anthony Bourdain a friend\", and adding: \"He is so, so missed by so many.\"In 2021, Cooper and co-author Katherine Howe published Vanderbilt: The Rise and Fall of an American Dynasty, a history of the Vanderbilt family going back to his Vanderbilt ancestors who came to New Amsterdam in the 17th century."}, {"text": "=== Children ===On April 30, 2020, Cooper announced the birth of his son Wyatt Morgan Cooper by a surrogate on April 27. \"On Monday I became a father. I've never said that out loud and it astonishes me. I have a son,\" he said at the end of a CNN Town Hall on his show, Anderson Cooper 360°. He also went on to make an announcement on Instagram, stating that \"Wyatt Morgan Cooper was born on Monday weighing 7 pounds 2 ounces.\"Though Cooper and Benjamin Maisani are no longer romantically involved, the pair co-parent the child and Maisani was present in the delivery room for Wyatt's birth. Wyatt is named after Cooper's late father, Wyatt Cooper, and his middle name is derived from the Morgan side of his family, being the maiden name of his maternal grandmother Gloria Morgan Vanderbilt.On February 10, 2022, Cooper announced at the beginning of his show on CNN that he had just become a father for a second time to a son named Sebastian Luke Maisani-Cooper. Maisani is in the process of adopting Cooper's son Wyatt, after which Wyatt's surname will become Maisani-Cooper."}, {"text": "== Awards ==Cooper helped lead CNN's Peabody Award-winning coverage of Hurricane Katrina, and the network's Alfred I. duPont–Columbia University Award-winning coverage of the 2004 tsunami. He has won 18 Emmy Awards, including two for his coverage of the earthquake in Haiti, and an Edward R. Murrow Award."}, {"text": "=== Other awards ===Silver Plaque from the Chicago International Film Festival for his report from Sarajevo on the Bosnian War"}, {"text": "=== Other awards ===Bronze Award from the National Education Film and Video Festival for a report on political Islam"}, {"text": "== Career timeline ==1999–2000: World News Now co-anchor"}, {"text": "== Career timeline ==2001–2002: The Mole host"}, {"text": "== Career timeline ==2002–present: New Year's Eve Live co-anchor on CNN and CNN International"}, {"text": "== Career timeline ==2003–present: Anderson Cooper 360° anchor"}, {"text": "== Career timeline ==2005: NewsNight co-anchor"}, {"text": "== Career timeline ==2007–present: 60 Minutes correspondent"}, {"text": "== Career timeline ==2011–2013: Anderson Live"}, {"text": "== Career timeline ==2021: Jeopardy! guest host"}, {"text": "== Filmography ==Chappie (2015)"}, {"text": "== Filmography ==The 33 (2015)"}, {"text": "== Filmography ==Batman v Superman: Dawn of Justice (2016)"}, {"text": "== Filmography ==Black Panther: Wakanda Forever (2022)"}, {"text": "== Books ==Dispatches from the Edge: A Memoir of War, Disasters, and Survival (Harper Perennial, 2006). ISBN 978-0061451515."}, {"text": "== Books ==The Rainbow Comes and Goes (Harper Perennial, 2016). ISBN 978-0062454942."}, {"text": "== Books ==Vanderbilt: The Rise and Fall of an American Dynasty. Hardcover – September 21, 2021 ISBN 0062964615"}, {"text": "== Books ==Astor: The Rise and Fall of an American Fortune. Harper – September 19, 2023 ISBN 978-0062964700"}, {"text": "== See also ==LGBT culture in New York City"}, {"text": "== See also ==List of LGBT people from New York City"}, {"text": "== See also ==New Yorkers in journalism"}, {"text": "== External links ==Anderson Cooper 360° Blog"}, {"text": "== External links ==CNN: Anchors & Reporters: Anderson Cooper (profile)"}, {"text": "== External links ==Appearances on C-SPAN"}, {"text": "== External links ==Anderson Cooper   on Charlie Rose"}, {"text": "== External links ==Anderson Cooper at IMDb"}, {"text": "== External links ==Anderson Cooper collected news and commentary at The New York Times"}, {"text": "== External links ==Anderson Cooper: The Silver Fox"}, {"text": "== External links ==Anderson Cooper at The Interviews: An Oral History of Television"}]