[{"text": "Vickie Lynn Marshall (née Hogan, November 28, 1967 – February 8, 2007), known professionally as Anna Nicole Smith, was an American model, actress, and television personality. Smith started her career as a Playboy magazine centerfold in May 1992 and won the title of 1993 Playmate of the Year. She later modeled for fashion companies, including Guess, H&M, Lane Bryant, Con-Air, and Heatherette."}, {"text": "Smith dropped out of high school in 1984, married in 1985, and divorced in 1993. In 1994, her highly publicized second marriage to 89-year-old billionaire J. Howard Marshall resulted in speculation that she married him for his money, which she denied. Following Marshall's death in 1995, Smith began a lengthy legal battle over a share of his estate. Her cases reached the Supreme Court of the United States: Marshall v. Marshall on a question of federal jurisdiction and Stern v. Marshall on a question of bankruptcy court authority. Smith died in February 2007 in Hollywood, Florida, of a combined drug intoxication."}, {"text": "== Early life ==Smith was born Vickie Lynn Hogan on November 28, 1967, in Houston, Texas, the only daughter of Virgie Arthur (née Tabers), (1951–2018) and Donald Hogan (1947–2009). Smith attended Mexia High School, but teachers at the school said transcripts showed that she had transferred there from a Houston school, attended at least one semester of ninth grade in Mexia, but did not complete a whole term of tenth grade. She had five half-siblings on her father's side. Smith was primarily raised by her mother and her family in Mexia."}, {"text": "== Career ==Smith secured a contract to replace supermodel Claudia Schiffer in a Guess jeans ad campaign featuring a series of sultry black-and-white photographs. During the Guess campaign, she took on the stage name \"Anna Nicole\". Guess photographers noticed Smith bore a striking resemblance to bombshell Jayne Mansfield and showcased her in several Mansfield-inspired photo sessions. In 1993, she modeled for the Swedish clothing company H&M, which led to her picture being displayed on large billboards in Sweden and Norway. Smith was featured on the cover of Marie Claire, shot by Peter Lindbergh in October 1993, and in GQ magazine earlier that year.A photograph of Smith was used by New York magazine on the cover of its August 22, 1994, issue titled White Trash Nation. In the photo, she appears sitting in a short skirt with cowboy boots as she eats chips. In October 1994, Smith initiated a $5 million lawsuit against the magazine, claiming that she did not authorize the use of her photo, and that the article damaged her reputation. The lawsuit was reported to have been settled."}, {"text": "=== Endorsements ===In October 2003, she became a spokeswoman for TrimSpa, which allegedly helped her lose a reported 69 pounds (31 kg). TrimSpa diet product company and Smith were sued in a class-action lawsuit alleging their marketing of a weight loss pill was false or misleading. "}, {"text": "=== Endorsements ===In November 2004, Smith appeared at the American Music Awards to introduce Kanye West and attracted attention because of her slurred speech and behavior. During her live appearance, she threw her arms up and asked, \"Like my body?\" Smith murmured other comments and alluded to TrimSpa. The incident became comic material for presenters throughout the rest of the program."}, {"text": "=== Endorsements ===In March 2005, at the first MTV Australia Video Music Awards in Sydney's Luna Park, Smith spoofed Janet Jackson's wardrobe malfunction by pulling down her dress to reveal both breasts, each covered with the MTV logo."}, {"text": "== Personal life ==While working at Jim's Krispy Fried Chicken in Mexia, Smith met Billy Wayne Smith, a cook at the restaurant, and the couple married on April 4, 1985, when he was sixteen and she was seventeen. She gave birth to their son, Daniel Wayne Smith, on January 22, 1986. Smith and her husband then separated the following year. They divorced in 1993.While performing at a Houston strip club in October 1991, Smith met 86-year-old petroleum tycoon J. Howard Marshall. On June 27, 1994, Smith and Marshall were married in Houston, resulting in speculation that she married him for his money. Marshall died on August 4, 1995, in Houston, at the age of 90."}, {"text": "=== Inheritance court cases ===Even though Smith was not in Marshall's will, she claimed that in return for marriage, Marshall verbally promised her half of his estate, which primarily consisted of a 16% interest in Koch Industries, then worth $1.6 billion. Smith's stepson E. Pierce Marshall disputed the claim. Smith temporarily joined forces with J. Howard's other son, J. Howard Marshall III, who was disowned after attempting to take control of Koch Industries. Howard III also claimed that his father had verbally promised him a portion of the estate; like Smith, Howard III was also left out of his father's will.In 1996, Smith filed for bankruptcy in California as a result of an $850,000 default judgment against her for the sexual harassment of a nanny who cared for her son. Since any money potentially due to her from the Marshall estate was part of her potential assets, the bankruptcy court involved itself in the matter.In September 2000, a Los Angeles bankruptcy judge awarded Smith $449,754,134.00, the amount that  Marshall's interest in Koch Industries appreciated  during their marriage. However, in July 2001, Houston judge Mike Wood affirmed the jury's findings in the probate case by ruling that Smith was entitled to nothing. The judge ordered Smith to pay over a million to cover the legal costs and expenses of E. Pierce Marshall. The conflict between the Texas probate court and California bankruptcy court judgments forced the matter into federal court.In March 2002, a federal judge vacated the California bankruptcy court's ruling and issued a new ruling that reduced the award to $88 million. On December 30, 2004, a three-judge panel of the United States Court of Appeals for the Ninth Circuit reversed that decision on the grounds that the federal courts lacked jurisdiction to overrule the probate court's decision.In September 2005, the U.S. Supreme Court decided to hear the appeal of that decision. The George W. Bush administration directed Paul Clement, the United States Solicitor General, to intercede on Smith's behalf in the interest of expanding federal court jurisdiction over state probate disputes. On May 1, 2006, the Supreme Court unanimously decided in favor of Smith. Justice Ruth Bader Ginsburg wrote the opinion. The decision did not give Smith a portion of her husband's estate, but affirmed her right to pursue a share of it in federal court.On June 20, 2006, E. Pierce Marshall died at age 67 from an infection. His widow, Elaine Tettemer Marshall, pursued the case on behalf of his estate. After Smith's death in 2007, the case continued on behalf of Smith's infant daughter, Dannielynn Birkhead. In March 2010, an appeals court upheld the verdict barring Smith from the estate. Following the decision, lawyers for Smith's estate appealed the decision to the entire Ninth Circuit. On May 6, 2010, the appeal was denied. "}, {"text": "=== Inheritance court cases ===In June 2011, in the case of Stern v. Marshall, the Supreme Court issued a ruling against Smith's estate, stating that the California bankruptcy court decision that gave her estate $475 million was made without subject-matter jurisdiction. The court agreed with the ruling of the Ninth Circuit that a bankruptcy court could not make a decision on an issue outside bankruptcy law.In August 2014, David O. Carter, a federal U.S. District Court judge in Orange County, California, rejected efforts to obtain about $44 million from the J. Howard Marshall estate."}, {"text": "=== Addictions ===Smith was allegedly addicted to prescription medications. A psychiatrist said she met with Smith in April 2006 at Cedars-Sinai Medical Center in Los Angeles stating that Smith had borderline personality disorder."}, {"text": "=== Birth of daughter ===On June 1, 2006, Smith announced her pregnancy in a video clip on her official website.Smith's daughter, Dannielynn, was born on September 7, 2006, in New Providence, The Bahamas. In an interview on CNN's Larry King Live after the death of Smith's son, attorney Howard K. Stern said that he and Smith had been in a relationship for \"a very long time\", and claimed he was the  father. Entertainment photographer Larry Birkhead claimed that he was the baby's father and filed a lawsuit to establish paternity. The Bahamian birth certificate recorded the father as Stern.A judge in the United States ordered that DNA tests be performed to determine the biological father of Smith's daughter. Following Smith's death Birkhead's attorney asked for an emergency DNA sample to be taken from Smith's body. The request was denied by a judge who ordered that Smith's body be preserved until February 20.On February 9, 2007, Zsa Zsa Gabor's husband, Frédéric Prinz von Anhalt, said that he had had a decade-long affair with Smith and could potentially be the father of her daughter. Alexander Denk, a former bodyguard and chef for Smith, also claimed that he had an affair with Smith and that he, too, was potentially the father.After Smith's death, TMZ reported that Smith had been given a prescription for methadone under a false name while she was in her eighth month of pregnancy. The Medical Board of California launched a review into the matter. The prescribing doctor, Sandeep Kapoor, said his treatment was \"sound and appropriate.\"In April 2007, a Bahamian judge ruled that DNA tests had established Birkhead as the father of Smith's daughter. Birkhead subsequently applied for an amended birth certificate listing him as the father, which paved the way for him to obtain a passport for the baby to leave with him for the U.S.. Stern did not contest the DNA results or the ruling and Birkhead returned to the United States with the baby.  Virgie Arthur appealed the ruling, but her appeal was denied and she was ordered to pay costs."}, {"text": "=== Death of son ===Smith's 20-year-old son, Daniel Wayne Smith, died on September 10, 2006, in his mother's hospital room while visiting her and his sister. An autopsy found that he died from a combination of drugs, including methadone and antidepressants. A Bahamian jury determined Daniel died from an accidental drug overdose and recommended no criminal charges.A death certificate was issued on September 21, 2006, so that Daniel could be buried. While Smith remained in the Bahamas with Dannielynn and Stern, her son's family in the U.S., including his father, Billy Smith, gathered with friends on October 7, 2006, in Mexia for a memorial service. Daniel was buried at Lake View Cemetery in New Providence on October 19, 2006, almost six weeks after his death.According to Stern, Smith was devastated over her son's death. \"Anna and Daniel were inseparable. Daniel was without question the most important person in Anna's life,\" Stern said during his testimony at the trial regarding the right to control disposition of Smith's remains. \"At Daniel's funeral, she had them open the coffin and tried to climb inside. She said that 'if Daniel has to be buried, I want to be buried with him. She was ready to go down with him.\" Stern said that, \"Anna saw herself as both mother and father to Daniel. From the time I met her, everything was for Daniel. I would say that physically, she died last week, but in a lot of ways, emotionally she died when Daniel died.\""}, {"text": "=== Commitment ceremony with Stern ===On September 28, 2006, Smith and Stern exchanged vows and rings in an informal commitment ceremony in the Bahamas. Although they pledged their love and made a commitment to be there for each other before a Baptist minister, no marriage certificate was issued and the ceremony was not legally binding.Regarding the questionable timing of the ceremony, Smith's attorney in Nassau said, \"They needed a little adrenaline boost because things have been so hectic and devastating in their life recently.\" Photos of the ceremony were sold through Getty Images to People magazine for around $1 million."}, {"text": "=== Residency in the Bahamas ===Smith and Stern were reportedly staying in the Bahamas to avoid paternity testing of her daughter in the U.S. In late 2006, Smith was granted permanent resident status in the Bahamas by Immigration Minister Shane Gibson. A local newspaper published photographs showing Smith lying clothed in bed in an embrace with Gibson. Gibson resigned after the wave of controversy over his relationship with Smith.The basis of Smith's permanent residency status was the claim that she owned a $900,000 mansion, which she said was given to her by a former boyfriend, real estate developer Gaither Ben Thompson of South Carolina. Thompson asserted that he loaned Smith the finances to purchase the property, which she failed to repay, and that he was attempting to regain control of the property. Thompson sued to evict Smith from the property in the Bahamas Court and received a default judgment against her when she failed to respond to the eviction or appear in court on November 28, 2006. Ford Shelley, Thompson's son-in-law, claimed that methadone was found in Smith's bedroom refrigerator while the mansion was being reclaimed. A photograph provided to TMZ of Smith's refrigerator showed a large bottle of methadone, vials of injectable vitamin B12 (cyanocobalamin), and numerous bottles of diet product SlimFast."}, {"text": "== Death ==On February 8, 2007, Smith was found unresponsive in her room at the Seminole Hard Rock Hotel & Casino in Hollywood, Florida. The wife of Smith's bodyguard, who was an emergency registered nurse, performed cardiopulmonary resuscitation (CPR) for 15 minutes until the bodyguard took over. He had driven back to the hotel after being notified by his wife of Smith's condition. "}, {"text": "== Death ==An investigation was led by Broward County Medical Examiner and forensic pathologist Joshua Perper in conjunction with Seminole police and several independent forensic pathologists and toxicologists. Perper announced that Smith died of \"combined drug intoxication\" with the sleeping medication chloral hydrate as the \"major component\". No illegal drugs were found in her system. The official report states that her death was not considered to be due to homicide, suicide or natural causes.Smith's death was ultimately ruled an accidental drug overdose of the sedative chloral hydrate that became increasingly toxic when combined with other prescription drugs in her system, specifically four benzodiazepines: Klonopin (clonazepam), Ativan (lorazepam), Serax (oxazepam) and Valium (diazepam). Furthermore, she had taken Benadryl (diphenhydramine) and Topamax (topiramate), both of which block sodium channels, likely intensifying the sedative effects of the chloral hydrate and benzodiazepines. Despite rumors of methadone use involved in the death of Smith's son, Perper only found methadone in her bile, indicating it was probably ingested 2–3 days prior to her death, and therefore was not a contributing factor. The autopsy report indicates that abscesses on her buttocks, presumably from prior injections of vitamin B12 in the form of cyanocobalamin, as well as human growth hormone, and viral enteritis were contributory causes of death. Tests for influenza A and B were negative.It was reported that eight of the eleven drugs in Smith's system, including the chloral hydrate, were prescribed to Stern, not Smith. Additionally, two of the prescriptions were written for \"Alex Katz\" and one was written for Smith's friend and psychiatrist, Dr. Khristine Eroshevich. Perper acknowledged that all of the prescriptions were written by Dr. Eroshevich."}, {"text": "== Death ==Smith's funeral took place on March 2, 2007, in the Bahamas."}, {"text": "=== Smith's last will and testament ===Smith's will was prepared by attorney Eric Lund in 2001, in Los Angeles, California. Smith named her son Daniel as the sole beneficiary of her estate, specifically excluded other children and named Stern executor of the estate. It indicated personal property valued at $10,000 and real estate property valued at $1.8 million, with a $1.1 million mortgage, at the time of her death. A petition to probate Smith's will was filed in Los Angeles County Superior Court, listing Birkhead as a party with interest to the estate."}, {"text": "=== Defamation lawsuit by Smith's mother ===In 2008, John O'Quinn, lawyer for Smith's mother, Virgie Arthur, filed the underlying proceedings against Entertainment Tonight, TMZ, CBS, journalist Art Harris, Texas bloggers: Rose Turner, Lyndal Harrington; Larry Birkhead and others, alleging that the defendants conspired to ruin her reputation through defamatory e-mails, blogs and website postings and harmed her efforts to seek custody and visitation of her granddaughter. The court jailed Harrington because she failed to turn over her computer as evidence.Arthur's defamation lawsuit was dismissed after TMZ, CBS Entertainment Tonight, Harris and others won summary judgment. "}, {"text": "== Legacy ==Anna Nicole, an opera by Mark-Anthony Turnage about Smith, premiered on February 17, 2011, at the Royal Opera House, to mixed reviews.In 2017, Smith's primary care physician Sandeep Kapoor published a memoir titled Trust Me, I'm a Doctor.: My Life Before, During and After Anna Nicole Smith. In February 2024, it was reported that Kal Penn will star as Kapoor in an upcoming film based on the book, titled Trust Me, I'm a Doctor.Smith's life is the subject of the 2023 Netflix documentary film Anna Nicole Smith: You Don't Know Me.Sylvia Hoeks will portray Smith in the upcoming film Hurricana."}, {"text": "== External links ==Anna Nicole Smith official website at the Wayback Machine (archive index)"}, {"text": "== External links ==Anna Nicole Smith at Playboy Online"}, {"text": "== External links ==Anna Nicole Smith at IMDb"}, {"text": "== External links ==Anna Nicole Smith at the TCM Movie Database"}, {"text": "== External links ==Anna Nicole Smith at AllMovie"}, {"text": "== External links ==Anna Nicole Smith at People.com"}, {"text": "== External links ==Anna Nicole Smith at the FBI Vault"}]