[{"text": "Ariana Grande-Butera (born June 26, 1993) is an American singer, songwriter, and actress. Regarded as a pop icon and an influential figure in popular music, she is noted for her four-octave vocal range and her signature use of the whistle register. Grande has received numerous accolades throughout her career, including one Brit Award, two Grammy Awards, two Billboard Music Awards, three American Music Awards, nine MTV Video Music Awards, and 35 Guinness World Records. Rolling Stone ranked her amongst the greatest vocalists of all time."}, {"text": "Grande began her career at age 15 by appearing in the Broadway musical 13 (2008). She rose to prominence for her performance as Cat Valentine in the Nickelodeon television series Victorious (2010–2013), as well as the spin-off follow-up series Sam & Cat (2013–2014), and signed with Republic Records in 2011. Grande's debut studio album, Yours Truly (2013), incorporated retro-pop and R&B elements and yielded the successful single \"The Way\". My Everything (2014), her second album, experimented with EDM and catapulted her to worldwide stardom through the singles \"Problem\", \"Break Free\", and \"Bang Bang\". Grande further explored pop and R&B with her third album Dangerous Woman (2016), which solidified her critical and commercial success."}, {"text": "Personal struggles influenced Grande's trap-infused fourth and fifth albums, Sweetener (2018) and Thank U, Next (2019). The former won the Grammy Award for Best Pop Vocal Album, while the latter broke several streaming records and was nominated for Album of the Year. Thank U, Next garnered two Billboard Hot 100 number-one songs with its title track and \"7 Rings\", and made Grande the first solo artist to simultaneously occupy the top three positions on the chart. She broke the record for the most number-one debuts in Hot 100 history with the title track of her trap-influenced sixth album, Positions (2020), and the collaborations \"Stuck with U\" with Justin Bieber and \"Rain on Me\" with Lady Gaga, the latter of which won the Grammy Award for Best Pop Duo/Group Performance. Grande ventured into dance music on her seventh album, Eternal Sunshine (2024), which produced the number-one singles \"Yes, And?\" and \"We Can't Be Friends (Wait for Your Love)\". She returned to acting with the political satire Don't Look Up (2021), and will star as Glinda in the upcoming two-part film adaptation of Wicked (2024–2025)."}, {"text": "Among the world's best-selling music artists, Grande has sold over 90 million records; all of her studio albums have been certified platinum or higher by the Recording Industry Association of America (RIAA). Having amassed 98 billion streams thus far, Grande is one of the most-streamed artists of all time and the most-streamed female artist, as of 2021. She was the most-streamed female act of the 2010s and has the most songs with over a billion streams for a woman, with 14 on Spotify. Grande also has a large social media following; with over 380 million followers, she is the sixth-most-followed individual on Instagram and one of the most-subscribed and most followed musicians on YouTube and Spotify. She was named Woman of the Year (2018) and the most successful female artist to debut in the 2010s by Billboard, featured in listicles such as Time 100 (2016 and 2019), Forbes Celebrity 100 (2019–2020), and ranked the highest-paid female musician of 2020 by Forbes. Outside of music and film, Grande has worked with many charitable organizations and advocates for animal rights, mental health, and gender, racial, and LGBT equality. Her business ventures include R.E.M. Beauty, a cosmetics brand launched in 2021, and a fragrance line that has earned over $1 billion in global retail sales. "}, {"text": "== Early life ==Ariana Grande-Butera was born on June 26, 1993, in Boca Raton, Florida. She is the daughter of Joan Grande, the Brooklyn-born CEO of Hose-McCann Communications, a manufacturer of marine communications equipment owned by the Grande family since 1964, and Edward Butera, a graphic design firm owner in Boca Raton. Grande is of Italian descent and has described herself as an Italian American with Sicilian and Abruzzese roots. She has an older half-brother, Frankie Grande, who is an entertainer and producer. Her family moved from New York to Florida before her birth, and her parents separated when she was eight or nine years old. Grande has a close relationship with her maternal grandmother, Marjorie Grande. At age 8, she sang \"The Star-Spangled Banner\" at the Panthers' home game against the Chicago Blackhawks on January 16, 2002."}, {"text": "== Early life ==As a young child, Grande performed with the Fort Lauderdale Children's Theater, playing her first role as the title character in the musical Annie. She also performed in their productions of The Wizard of Oz and Beauty and the Beast. At age eight, she performed at a karaoke lounge on a cruise ship and with various orchestras such as South Florida's Philharmonic, Florida Sunshine Pops and Symphonic Orchestras. During this time, she attended the Pine Crest School and later North Broward Preparatory."}, {"text": "=== 2008–2013: Career beginnings and Nickelodeon ===When she first arrived in Los Angeles, California to meet with her managers, she expressed a desire to record an R&B album: \"I was like, 'I want to make an R&B album,' They were like 'Um, that's a helluva goal! Who is going to buy a 14-year-old's R&B album?!'\" In 2008, Grande was cast as cheerleader Charlotte in the Broadway musical 13."}, {"text": "=== 2008–2013: Career beginnings and Nickelodeon ===Grande was cast in the Nickelodeon television show Victorious along with 13 co-star Elizabeth Gillies in 2009. In the sitcom, set at a performing arts high school, she played the \"adorably dimwitted\" Cat Valentine. She had to dye her hair red every other week for the role, which severely damaged it. The show premiered in March 2010 to the second-largest audience for a live-action series in Nickelodeon, with 5.7 million viewers. The role helped propel Grande to teen idol status, but she was more interested in a music career, saying that acting is \"fun, but music has always been first and foremost with me.\""}, {"text": "=== 2008–2013: Career beginnings and Nickelodeon ===After the first season of Victorious wrapped, Grande wanted to focus on her music career and began working on her debut album in August 2010. The second season premiered in April 2011 to 6.2 million viewers, becoming the show's highest-rated episode. In May 2011, Grande appeared in Greyson Chance's video for the song \"Unfriend You\" from his album Hold On 'til the Night (2011), portraying his ex-girlfriend. She made her first musical appearance on the track \"Give It Up\" from the Victorious soundtrack in August 2011. While filming Victorious, Grande made several recordings of herself singing covers of songs by Adele, Whitney Houston and Mariah Carey, and uploaded them to YouTube. A friend of Monte Lipman, chief executive officer (CEO) of Republic Records, came across one of the videos. Impressed by her vocals, he sent the links to Lipman, who signed her to a recording contract. Grande voiced the title role in the English dub of the Spanish-language animated film Snowflake, the White Gorilla in November 2011. From 2011 to 2013, she was cast in the role of fairy Princess Diaspro in the Nickelodeon revival of Winx Club."}, {"text": "=== 2008–2013: Career beginnings and Nickelodeon ===In December 2011, Grande released her first single, \"Put Your Hearts Up\", which was recorded for a potential teen-oriented pop album that was never issued. She later disowned the track for its bubblegum pop sound, saying she had no interest in recording music of that genre. The song was later certified Gold by the Recording Industry Association of America (RIAA). On a second soundtrack, Victorious 2.0, released on June 5, 2012, as an extended play, she supplied vocals as part of the show's cast for the song \"5 Fingaz to the Face\". The third and final soundtrack, Victorious 3.0, was released on November 6, 2012, which featured a duet by Grande and Victoria Justice titled \"L.A. Boyz\", with an accompanying music video being released shortly after. In December 2012, Grande collaborated on the single version of \"Popular Song\", a duet with British singer and songwriter Mika."}, {"text": "=== 2008–2013: Career beginnings and Nickelodeon ===After four seasons, Victorious was not renewed, with the finale airing in February 2013. Grande starred as Snow White in the pantomime-style musical theatre production A Snow White Christmas with Charlene Tilton and Neil Patrick Harris at the Pasadena Playhouse. She played Amanda Benson in Swindle, a 2013 Nickelodeon film adaptation of the children's book of the same name. Meanwhile, Nickelodeon created Sam & Cat, an iCarly and Victorious spin-off starring Jennette McCurdy and Grande. Grande and McCurdy reprised their roles as Cat Valentine and Sam Puckett on the buddy sitcom, which paired the characters as roommates who form an after-school babysitting business."}, {"text": "=== 2013–2015: Yours Truly and My Everything ===Grande released her debut album, Yours Truly, on August 30, 2013. A pop and R&B record influenced by 1950s doo-wop, Yours Truly debuted at number one on the US Billboard 200 albums chart, with 138,000 copies sold in its first week. Yours Truly also debuted in the top ten in several other countries, including Australia, the UK, Ireland, and the Netherlands. Its lead single, \"The Way\", featuring Pittsburgh rapper Mac Miller, debuted at number ten on the US Billboard Hot 100, eventually peaking at number nine for two weeks. Grande was later sued by Minder Music for copying the line \"What we gotta do right here is go back, back in time\" from the 1972 song \"Troglodyte (Cave Man)\" by The Jimmy Castor Bunch. The album's second single, \"Baby I\", was released in July. Its third single, \"Right There\", featuring Detroit rapper Big Sean, was released in August 2013. They respectively peaked at number 21 and 84 on the Billboard Hot 100."}, {"text": "=== 2013–2015: Yours Truly and My Everything ===Grande recorded the duet \"Almost Is Never Enough\" with Nathan Sykes of The Wanted, which was released as a promotional single in August 2013. She also joined Justin Bieber on his Believe Tour for three shows and kicked off her own headlining mini-tour, The Listening Sessions. At the 2013 American Music Awards, she won the award for New Artist of the Year. She released a four-song Christmas EP, Christmas Kisses in December 2013. Grande received the Breakthrough Artist of the Year award from the Music Business Association, recognizing her achievements throughout 2013. By January 2014, Grande had begun recording her second studio album, with singer-songwriter Ryan Tedder and record producers Benny Blanco and Max Martin. The same month, she earned the Favorite Breakout Artist award at the People's Choice Awards 2014. In March 2014, Grande sang at the White House concert, \"Women of Soul: In Performance at the White House\". The following month, President Barack Obama and First Lady Michelle Obama invited Grande again to perform at the White House for the Easter Egg Roll event."}, {"text": "=== 2013–2015: Yours Truly and My Everything ===Grande released her second studio album My Everything on August 25, 2014, and debuted atop the Billboard 200. Its lead single, \"Problem\" debuted at number three (eventually climbing to number two) on the Billboard Hot 100. The album's second single, \"Break Free\", featuring German musician and producer Zedd, peaked at number four in the United States. She performed the song as the opening of the 2014 MTV Video Music Awards, and won Best Pop Video for \"Problem\". Grande and Nicki Minaj provided guest vocals on \"Bang Bang\", the lead single from Jessie J's album Sweet Talker, which peaked at number one in the UK and reached number three in the US. With the singles \"Problem\", \"Break Free\", and \"Bang Bang\", Grande joined Adele as the only female artist with three top ten singles simultaneously on the Billboard Hot 100 as a lead artist."}, {"text": "=== 2013–2015: Yours Truly and My Everything ===Grande was the musical performer on Saturday Night Live, with Chris Pratt as the host on September 27, 2014. That same month, the third single from My Everything, \"Love Me Harder\", featuring Canadian recording artist the Weeknd, was released and peaked at number seven in the United States. The song became her fourth top ten single of 2014, the most by any artist that year. In November 2014, Grande was featured in Major Lazer's song \"All My Love\" from the soundtrack album for the film The Hunger Games: Mockingjay – Part 1 (2014). The same month, Grande released a Christmas song titled \"Santa Tell Me\" as a single from the reissue of her first Christmas EP, Christmas Kisses (2014). The following month, she appeared on Nicki Minaj's third album The Pinkprint, with the song \"Get on Your Knees\". She later released the fifth and the final single from My Everything, \"One Last Time\", which peaked at number 13 in the US."}, {"text": "=== 2013–2015: Yours Truly and My Everything ===In February 2015, Grande embarked on her first worldwide concert tour, The Honeymoon Tour, to further promote My Everything, with shows in North America, Europe, Asia and South America. Grande was featured on Cashmere Cat's song \"Adore\", which was released in March 2015. In the spring, she signed an exclusive publishing contract with the Universal Music Publishing Group, covering her entire music catalog. Grande also filmed an episode for the Fox Broadcasting Company reality TV series Knock Knock Live (2015), but the show was canceled before her episode aired. She also guest-starred on several episodes of the Fox comedy-horror television series Scream Queens as Sonya Herfmann/Chanel #2 from September to November 2015. She recorded the duet \"E Più Ti Penso\" with Italian recording artist Andrea Bocelli, which was released in October 2015 as the lead single from Bocelli's album Cinema (2015), and covered the song \"Zero to Hero\", originally from the animated film Hercules (1997), for the compilation album We Love Disney (2015). Grande also released her second Christmas EP, Christmas & Chill in December 2015."}, {"text": "=== 2015–2017: Dangerous Woman ===Grande began recording songs for her third studio album, Dangerous Woman, originally titled Moonlight, in 2015. In October of that year, she released the single \"Focus\", initially intended as the lead single from the album; the song debuted at number seven on the Billboard Hot 100. The next month American singer Who Is Fancy released the single \"Boys Like You\", which features Ariana Grande and Meghan Trainor. She was featured in the remix version of \"Over and Over Again\", a song by English singer Nathan Sykes from his solo debut studio album Unfinished Business, which was released in January 2016. In March 2016, Grande released \"Dangerous Woman\" as the lead single from the retitled album of the same name. The single debuted at number ten on the Billboard Hot 100, making her the first artist to have the lead single from each of their first three albums debut in the top ten. The same month, Grande appeared as host and musical guest of Saturday Night Live, where she performed \"Dangerous Woman\" and debuted the promotional single \"Be Alright\", which charted at number 43 on the Billboard Hot 100. Grande garnered positive reviews for her appearance on the show, including praise for her impressions of various singers, some of which she had done on The Tonight Show Starring Jimmy Fallon."}, {"text": "=== 2015–2017: Dangerous Woman ===Grande released Dangerous Woman on May 20, 2016, which debuted at number two on the Billboard 200. It also debuted at number two in Japan, and at number one in several other markets, including Australia, the Netherlands, Ireland, Italy, New Zealand and the UK. Mark Savage, writing for BBC News, called the album \"a mature, confident record\". In August, Grande released a third single from the album, \"Side to Side\", featuring rapper Nicki Minaj, her eighth top ten entry on the Hot 100, which peaked at number four on that chart. Dangerous Woman was nominated for Grammy Award for Best Pop Vocal Album and the title track for Best Pop Solo Performance."}, {"text": "=== 2015–2017: Dangerous Woman ===Aside from music, Grande played Penny Pingleton in the NBC television broadcast Hairspray Live!, which aired in December 2016. Grande recorded the title track of the soundtrack for the 2017 live-action remake of Disney's 1991 animated film Beauty and the Beast. The recording was released as a duet with American singer John Legend in February 2017. The same month, Grande embarked on her third concert tour, the Dangerous Woman Tour, to promote the album."}, {"text": "=== 2015–2017: Dangerous Woman ===On May 22, 2017, her concert at Manchester Arena was the target of a suicide bombing—a shrapnel-laden homemade bomb detonated by an Islamic extremist, motivated by Muslim casualties from US intervention in the Syrian Civil War, as people were leaving the arena. The Manchester Arena bombing, which occurred at the City Room, caused 22 deaths and injured hundreds more. Grande suspended the remainder of the tour and held a televised benefit concert, One Love Manchester, on June 4, helping to raise $23 million to aid the bombing's victims and affected families. The concert featured performances from Grande, as well as Liam Gallagher, Robbie Williams, Justin Bieber, Katy Perry, Miley Cyrus and other artists. To recognize her efforts, the Manchester City Council named Grande the first honorary citizen of Manchester. The tour resumed on June 7 in Paris and ended in September 2017. In August 2017, Grande appeared in an Apple Music Carpool Karaoke episode, singing musical theatre songs with American entertainer Seth MacFarlane. In December 2017, Billboard magazine named her \"Female Artist of the Year\"."}, {"text": "=== 2018–2019: Sweetener and Thank U, Next ===Grande began working on songs for her fourth studio album, Sweetener with Pharrell Williams in 2016. Grande released \"No Tears Left to Cry\" as the lead single from Sweetener in April 2018, with the song debuting at number three on the Billboard Hot 100, making Grande the only artist to have debuted the lead single of her first four albums in the top ten of the Hot 100. In June 2018, she was featured in \"Bed\", the second single from Nicki Minaj's fourth studio album Queen. The same month, she was featured on Troye Sivan's single \"Dance to This\" from his sophomore album Bloom. The second single, \"God Is a Woman\", peaked at number 8 on the Hot 100 and became Grande's tenth top ten single in the US. Released in August 2018, Sweetener debuted at number one on the Billboard 200 and received acclaim from critics. She simultaneously charted nine songs from the album on the Hot 100, along with a collaboration, making her the fourth female artist to reach the ten-song mark. Grande gave four concerts to promote the album, billed as The Sweetener Sessions, in New York City, Chicago, Los Angeles, and London between August 20 and September 4, 2018. In October 2018, Grande participated in the NBC broadcast, A Very Wicked Halloween, singing \"The Wizard and I\" from the musical Wicked. The following month, the BBC aired a one-hour special, Ariana Grande at the BBC, featuring interviews and performances."}, {"text": "=== 2018–2019: Sweetener and Thank U, Next ===In November 2018, Grande released the single \"Thank U, Next\" and announced her fifth studio album of the same name. The song debuted at number one on the Billboard Hot 100, becoming Grande's first chart topping single in the United States, spending seven non-consecutive weeks atop. Since then, it has been certified five-times platinum in the United States; the song's music video broke records for most-watched music video on YouTube within 24 hours of release and fastest Vevo video to reach 100 million views on YouTube, both of which were later surpassed by other artists. On Spotify, it became the fastest song to reach 100 million streams (11 days) and most-streamed song by a female artist in a 24-hour period, with 9.6 million streams, before being surpassed by her own song \"7 Rings\" (nearly 15 million streams). Later the same month, Grande released, in collaboration with YouTube, a four-part docuseries titled Ariana Grande: Dangerous Woman Diaries. It shows behind the scenes and concert footage from Grande's Dangerous Woman Tour, including moments from the One Love Manchester concert, and follows her professional life during the tour and the making of Sweetener. The series debuted on November 29, 2018. By the end of the year, she became the most streamed female artist on Spotify, and was named Billboard's Woman of the Year. In January 2019, it was announced that Grande would be headlining the Coachella Valley Music and Arts Festival, where she became the youngest and only the fourth female artist ever to headline the festival. Grande brought a number of guest artists to perform with her, including NSYNC, P. Diddy, Nicki Minaj and Justin Bieber. Her set has received critical acclaim."}, {"text": "=== 2018–2019: Sweetener and Thank U, Next ===Grande's second single from Thank U, Next, \"7 Rings\", was released on January 18, 2019, and debuted at number one on the Billboard Hot 100 for the week of February 2, becoming her second single in a row (and overall) to top the charts. It made Grande the third female artist with multiple number-one debuts after Mariah Carey (3) and Britney Spears (2) and fifth artist overall after Justin Bieber and Drake. Spending eight non-consecutive weeks at number one, it became Grande's most successful song on the chart and one of the best selling singles worldwide. Thank U, Next was released on February 8, 2019, and debuted at number one on the Billboard 200 while receiving acclaim from critics. It broke the records for the largest streaming week for a pop album and for a female album in the United States with 307 million on-demand streams."}, {"text": "=== 2018–2019: Sweetener and Thank U, Next ===Grande became the first solo artist to occupy the top three spots on the Billboard Hot 100 with \"7 Rings\" at number one, her third single \"Break Up with Your Girlfriend, I'm Bored\" debuting at number two, and her lead single \"Thank U, Next\" rose to number three, and the overall second artist to do so since the Beatles did in 1964 when they occupied the top five spots. In the United Kingdom, Grande became the second female solo artist to simultaneously hold the number one and two spots and the first musical artist to replace herself at number one, twice consecutively. In February 2019, it was reported Grande wouldn't attend the Grammy Awards after she had a disagreement with producers over a potential performance at the ceremony. Grande ended up earning her first Grammy, for Best Pop Vocal Album, for Sweetener. The same month, Grande won a Brit Award for International Female Solo Artist. She also embarked on her third headlining tour, the Sweetener World Tour, to promote both Sweetener and Thank U, Next, which began on March 18, 2019. Grande was nominated for 9 awards at the 2019 Billboard Music Awards, including Top Artist. She would win two awards for Billboard Chart Achievement and Top Female Artist on May 1, 2019. Grande performed at the event via a pre-recorded performance from her Sweetener World Tour."}, {"text": "=== 2018–2019: Sweetener and Thank U, Next ===In June 2019, Grande announced that she co-executive produced the soundtrack to the film Charlie's Angels; a collaboration with Miley Cyrus and Lana Del Rey, titled \"Don't Call Me Angel\", was released as the lead single on September 13, 2019. It was later nominated for Best Original Song, at the 24th Satellite Awards. In August 2019, she released a single titled \"Boyfriend\" with pop duo Social House. Grande co-wrote singer Normani's debut solo single \"Motivation\", which was released on August 16, 2019. Grande won three awards at the 2019 MTV Video Music Awards, including the Artist of the Year award. She was nominated for 12 awards in total, including Video of the Year for \"Thank U, Next\". Grande was featured on the remix of American singer and rapper Lizzo's song \"Good as Hell\", which was released on October 25, 2019. By the end of the year, Billboard named Grande the most accomplished female artist to debut in the 2010s, while NME named her one of the defining music artists of the decade. She also became the most streamed female artist of the decade on music streaming service Spotify. Also, Forbes ranked her amongst the highest-paid celebrities in 2019, placing at number 62 on the list, while Billboard ranked her as 2019's highest-paid solo musician."}, {"text": "=== 2020–2023: Positions ===In January 2020, Grande received multiple nominations at the 2020 iHeartRadio Music Awards, including Female Artist of the Year. Grande and Justin Bieber released a collaboration song titled \"Stuck with U\" on May 8, 2020; net proceeds from the sales of the song were donated to the First Responders Children's Foundation in light of the COVID-19 pandemic. The song debuted at number one on the Billboard Hot 100, becoming Grande's third chart-topping single. Alongside Bieber, both artists tied Mariah Carey and Drake for the most songs to debut at number one on the Hot 100; Grande is the first artist to have her first three number ones debut at the top, following \"Thank U, Next\" and \"7 Rings\". Grande also released a collaboration with Lady Gaga, \"Rain on Me\", as the second single from Gaga's sixth studio album Chromatica. The song also debuted at number one on the Billboard Hot 100, becoming Grande's fourth number-one single and helping Grande break the record for the most number-one debuts on that chart. The song won the Best Pop Duo/Group Performance category at the 63rd Annual Grammy Awards. In 2020, Grande became the highest-earning woman in music on Forbes's 2020 Celebrity 100 list, placing 17th overall with $72 million. At the 2020 MTV Video Music Awards, she was nominated for nine awards for both \"Stuck with U\" (with Bieber) and \"Rain on Me\" (with Gaga). For the latter, Grande received her third consecutive nomination for Video of the Year. She won four awards, including Song of the Year for \"Rain on Me\"."}, {"text": "=== 2020–2023: Positions ===Grande's sixth studio album, Positions, was released on October 30, 2020. It debuted at number one on the Billboard 200, becoming Grande's fifth number-one album. The eponymous lead single was released on October 23. It debuted at number one on the Billboard Hot 100, becoming Grande's fifth chart-topping single and breaking numerous records. Grande became the first artist to have five number-one debuts on the Hot 100 and the first to have their first five number ones debut at the top. \"Positions\" became her third number-one single in 2020 following \"Stuck with U\" and \"Rain on Me\", making Grande the first artist since Drake to have three number-one singles in a single calendar year and the first female artist to do so since Rihanna and Katy Perry in 2010. Alongside the release of Positions, the song from the album \"34+35\" served as the second single off the album. The song debuted at number 8, becoming Grande's 18th top ten single. Grande released a \"34+35\" remix featuring American rappers Doja Cat and Megan Thee Stallion on January 15, 2021. The remix helped the song reach a new peak at number two, the highest-charting song credited to three or more female soloists on the Hot 100 since Christina Aguilera, Mýa, Pink and Lil' Kim's \"Lady Marmalade\" in 2001. The remix was one of five additional tracks included on the deluxe edition of Positions, released on February 19, 2021. In March, the song \"POV\" was sent to radio as the album's third single. The song reached number 27 on the Hot 100 and would reach the top ten on mainstream radio, making Grande the first artist to have three concurrent songs in the top ten for Pop Airplay. Grande was named the most-played artist on iHeartRadio's stations in 2021, reaching 2.6 billion in audience."}, {"text": "=== 2020–2023: Positions ===On November 13, 2020, Grande made a surprise appearance on the Adult Swim Festival, performing alongside music artist Thundercat, performing his song \"Them Changes\", which Grande had previously covered. Grande and Jennifer Hudson also featured on a remix of Mariah Carey's 2010 Christmas song \"Oh Santa!\". The song was released on December 4, 2020, as part of Mariah Carey's Magical Christmas Special. Grande released the concert film for her Sweetener World Tour, Excuse Me, I Love You, on December 21, 2020, exclusively on Netflix."}, {"text": "=== 2020–2023: Positions ===In April, Grande was featured on a remix of the Weeknd's \"Save Your Tears\". The remix reached number one on the Billboard Hot 100 and Canadian Hot 100, becoming both artists' sixth number one single on both charts. She joined Paul McCartney as the only artist to earn three number-one duets on the Hot 100. With 69 weeks, the remix became one of the ten songs with the most total weeks on the chart. It ranked as the second best-performing song of the year on the Billboard year-end Hot 100 chart of 2021. Grande and the Weeknd performed \"Save Your Tears\" together at the 2021 iHeartRadio Music Awards. On February 24, 2023, following months-long renewed interest in and virality of the Weeknd's 2016 song \"Die for You\", a remix of the song with Grande was released. The remix marked their fourth collaboration. In the Billboard Hot 100 issue dated March 11, 2023, the remix reached the top of the chart, becoming both artists' seventh number one hit. According to the International Federation of the Phonographic Industry (IFPI), it was the fourth best-selling song of 2023 globally. In June, Grande featured on the song \"I Don't Do Drugs\" from Doja Cat's third studio album Planet Her. Her contribution as a songwriter and featured artist on the song earned Grande a nomination for Album of the Year at the 64th Annual Grammy Awards. In December 2021, Grande appeared in Adam McKay's film Don't Look Up, alongside Leonardo DiCaprio, Jennifer Lawrence, and Meryl Streep. With streams of more than 152 million hours in a week, it broke the record for the biggest week of views in Netflix history. To promote the film, Grande released the song \"Just Look Up\", in collaboration with rapper Kid Cudi, on December 3, 2021. At the 27th Critics' Choice Awards, Grande received nominations in the categories Best Song and Best Acting Ensemble, as a part of the cast. She also received a nomination at the 28th Screen Actors Guild Awards for Outstanding Performance by a Cast in a Motion Picture."}, {"text": "=== 2020–2023: Positions ===On August 25, 2023, Grande released a reissue of her debut studio album, Yours Truly (Tenth Anniversary Edition). On December 9, 2023, Grande and Jennifer Hudson made a surprise appearance onstage to sing the \"Oh Santa!\" remix at Mariah Carey's show at the Madison Square Garden, of her Merry Christmas One and All! tour."}, {"text": "=== 2024: Eternal Sunshine and Wicked ===In November 2021, it was announced that Grande would play Glinda for the upcoming two-part film adaptation of the musical Wicked, directed by Jon M. Chu and starring alongside Cynthia Erivo, who will play Elphaba. The first part, Wicked, is slated to be released on November 27, 2024. Both Grande & Erivo attended the 96th Academy Awards on March 10, 2024, where they presented Best Original Score and Best Original Song."}, {"text": "=== 2024: Eternal Sunshine and Wicked ===On January 17, 2024, Grande announced her seventh studio album, titled Eternal Sunshine. Its lead single, \"Yes, And?\", was released with an accompanying music video on January 12, 2024, and debuted atop the Billboard Hot 100. The song topped the Billboard Global 200 and Global Excl. US charts for two weeks. On February 16, a remix of \"Yes, And?\" featuring Mariah Carey, included in the deluxe edition of Eternal Sunshine, was released. The album was released on March 8, along with the second single off the record, \"We Can't Be Friends (Wait for Your Love)\". Both the album and its second single debuted atop the Billboard 200 and the Hot 100 respectively. It also marked Grande's first instance of reaching the top of both the Billboard Hot 100 Songwriters and Hot 100 Producers charts. To promote the album, Grande appeared as the musical guest on Saturday Night Live on March 9, 2024. She performed \"We Can't Be Friends (Wait for Your Love)\" live for the first time, alongside \"Imperfect for You\" from Eternal Sunshine."}, {"text": "=== Musical style ===Grande's music is generally pop and R&B with elements of EDM, hip hop, and trap, the latter first appearing prominently on her Christmas & Chill extended play. While consistently maintaining pop and R&B tones, she has increasingly incorporated trap into her music as her career has progressed, thanks to her work with record producer Tommy Brown. She has collaborated with Brown on every album thus far and stated that \"one of the things I love most about working with Tommy is that none of the beats he plays me ever sound the same.\" Grande learned how to sound engineer and produce her own vocals because she \"love[s] being hands on\" with every project, revealing that rapper Mac Miller first taught her how to use the digital audio workstation Pro Tools. Collaborator Justin Tranter remarked that he felt inspired seeing how involved Grande is in creating her music \"from the writing to the vision to the storytelling and to even engineering and comping her own vocals.\" She has co-written songs addressing a wide variety of themes, such as love, sex, wealth, breakups, independence, empowerment, self-love and moving on from the past."}, {"text": "=== Musical style ===Grande's debut album Yours Truly was complimented for recreating the R&B \"vibe and feel of the 90s\" with the help of songwriter and producer Babyface. Her follow-up record, My Everything, explored EDM and electropop genres. Grande expanded the pop and R&B sound on her third album, Dangerous Woman, which was praised by the Los Angeles Times for integrating elements of different styles, such as reggae-pop (\"Side to Side\"), dance-pop (\"Be Alright\"), and guitar-trap fusion (\"Sometimes\"). Trap-pop was more heavily featured on her fourth and fifth studio albums, Sweetener and Thank U, Next. Elias Leight of Rolling Stone opined that Grande \"set her sights on conquering trap, savage basslines and jittery swarms of drum programming\" and \"embrace[d] the sound of hard-bitten Southern hip-hop\" on Sweetener, exploring funk music with themes of love and prosperity. Craig Jenkins of Vulture noted that she embraced trap and hip hop with undertones of R&B on Thank U, Next, with lyrics about breakups, empowerment, and self-love. Her sixth album, Positions, further emphasized the R&B and trap-pop sound of its two predecessors, with lyrics discussing sex and romance."}, {"text": "=== Influences ===Grande grew up listening mainly to urban pop and 1990s music. She credited Gloria Estefan with inspiring her to pursue a music career after Estefan saw and complimented Grande's performance on a cruise ship when she was eight years old. Mariah Carey and Whitney Houston are her primary vocal influences: \"I love Mariah Carey. She is literally my favorite human being on the planet. And of course Whitney [Houston] as well. As far as vocal influences go, Whitney and Mariah pretty much cover it.\" Grande was also influenced vocally by Destiny's Child, Celine Dion and Madonna. She reflected on her childhood by posting videos of herself singing songs from Dion's 1997 album Let's Talk About Love on her social media. Grande credits Madonna with \"pav[ing] the way for me and also every other female artist\" and admitted to being \"obsessed with her entire discography\"."}, {"text": "=== Influences ===Musically, Grande admires India Arie because her \"music makes me feel like everything is going to be okay\", loves Brandy's songs because \"her riffs are incredibly on point,\" and praised Imogen Heap's \"intricate\" song structure. Grande also named Judy Garland as a childhood influence, admiring her ability to tell \"a story when she sings\". Music producer and collaborator Savan Kotecha stated that he and Grande were influenced by Lauryn Hill when creating her fourth album Sweetener and its lead single \"No Tears Left to Cry\". Kotecha told Variety, \"we were listening to Lauryn Hill about chord changes and why we stick to four chords all the time\"."}, {"text": "=== Influences ===Grande expressed admiration for rappers' unconventional music release strategy. She told Billboard, \"My dream has always been to be—obviously not a rapper, but, like, to put out music in the way that a rapper does. I feel like there are certain standards that pop women are held to that men aren't ... It's just like, 'Bruh, I just want to ... drop [music] the way these boys do.\" It inspired her to release \"Thank U, Next\" without any prior announcement, which The Ringer called \"more of a Drake move than an Ariana Grande move.\""}, {"text": "=== Voice ===Grande has been described as a soprano, possessing a four-octave vocal range and a whistle register. With the release of Yours Truly, critics compared Grande's wide vocal range and music to those of Mariah Carey. Julianne Escobedo Shepherd of Billboard wrote that both Carey and Grande have \"the talent to let their vocals do the talking ... that's not where the similarities end. ... Grande is subverting it with cute, comfortable, and on-trend dresses with a feminine slant.\""}, {"text": "=== Voice ===Mark Savage of BBC News named Grande \"one of pop's most intriguing and gifted singers\" and complimented her \"unrivalled vocal control\". In The New York Times, Jon Pareles noted that Grande's voice \"can be silky, breathy or cutting, swooping through long melismas or jabbing out short R&B phrases; it's always supple and airborne, never forced.\" Composer and playwright Jason Robert Brown wrote in a 2016 Time magazine article, \"[N]o matter how much you are underestimated ... you are going to open your mouth and that unbelievable sound is going to come out. That [...] instrument [...] allows you to shut down every objection and every obstacle.\""}, {"text": "== Public image ==Grande cited Audrey Hepburn as a major style influence in her early career; however, she later found emulating Hepburn's style \"a little boring\". She also drew inspiration from actresses of the 1950s and 1960s, such as Ann-Margret, Nancy Sinatra, and Marilyn Monroe. Grande's modest look early in her career was described as \"age appropriate\" in comparison to contemporary artists who grew up in the public eye. Jim Farber of New York's  Daily News wrote in 2014 that Grande received less attention \"for how little she wears or how graphically she moves than for how she sings.\" That year, she abandoned her earlier style in favor of short skirts and crop tops with knee-high boots in live performances and red carpet events. She also began regularly wearing cat and bunny ears and, subsequently, oversized jackets and hoodies. Grande's style is often imitated by social media influencers and celebrities. After years of dyeing her hair red for her role as Cat Valentine on Nickelodeon, Grande wore extensions as her hair recovered from damage. Anne T. Donahue of MTV News noted that her \"iconic\" high ponytail has received more attention than her fashion choices."}, {"text": "== Public image ==Although Grande drew criticism for alleged impolite interactions with reporters and fans in 2014, she dismissed the reports as \"weird, inaccurate depictions\". Rolling Stone wrote: \"Some may cry 'diva', but it's also Grande just taking a stand to not allow others to control her image.\" In July 2015, Grande sparked controversy after being seen on surveillance video in a doughnut shop licking doughnuts that were on display and saying \"I hate Americans. I hate America. This is disgusting\", referring to a tray of doughnuts. She subsequently apologized, saying that she is \"EXTREMELY proud to be an American\" and that her comments rather referred to obesity in the United States. She later released a video apology for \"behaving poorly\". The incident was parodied by The Muppets. Grande herself poked fun at the incident while hosting Saturday Night Live in 2016, saying, \"A lot of kid stars end up doing drugs, or in jail, or pregnant, or get caught licking a doughnut they didn't pay for.\" In 2020, she said that she stopped doing interviews for a while out of fear that her words would be misconstrued and that she would be labeled a \"diva\"."}, {"text": "== Public image ==With a large following on social media, Grande is one of the most influential celebrities on the internet. As of January 2024, her YouTube channel has over 53 million subscribers, making her among the most subscribed music artists on the platform; her music videos have been viewed a total of over 25 billion times, with eight of them reaching over one billion views; her Spotify profile has amassed over 95 million followers, making her the fourth most-followed artist and second most-followed woman; her Instagram account has over 380 million followers, making her the sixth-most-followed individual and third-most-followed woman; her now deactivated Twitter account had over 80 million followers, making it the seventh-most-followed account, at the time; her Facebook page has over 42 million followers, and her TikTok account has over 34 million followers. Often regarded as a pop icon and triple threat entertainer, wax figures of Grande are found at Madame Tussauds Wax Museums in major cities around the world, including New York, Orlando, Amsterdam, Bangkok, Sydney, Berlin, London, Vienna, Hollywood, Hong Kong and Blackpool."}, {"text": "== Impact ==In 2016 and 2019, Grande was named one of Time's 100 most influential people in the world. In 2017, Celia Almeida of the Miami New Times wrote that of all the biggest pop stars of the past 20 years, Grande made the most convincing transition \"from ingénue to an independent female artist\". In 2018, Bloomberg named her the \"first pop diva of the streaming generation\" in 2020."}, {"text": "== Impact ==Grande was also included in Pitchfork's list of \"The 200 Most Important Artists of Pitchfork's First 25 Years\" for \"emerging with music that pushed her artistry further as it asserted a magical trifecta of hope, joy, and a powerhouse voice\". Her song \"Thank U, Next\" was in Rolling Stone's 2021 revision of their 500 Greatest Songs of All Time. In 2023, the magazine included Grande among the 200 Greatest Singers of All Time."}, {"text": "== Impact ==Many recording artists have cited Grande as an influence, including Madison Beer, Sufjan Stevens, Melanie Martinez, Meghan Trainor, Troye Sivan, Jungkook of BTS, Billie Eilish, Zara Larsson, Bryson Tiller, Lana Del Rey, Michelle Zauner of Japanese Breakfast, Grace VanderWaal, Breanna Yde, Maggie Lindemann, Charlie Puth, Giselle of Aespa, and Tate McRae."}, {"text": "== Achievements ==Throughout her career, Grande has sold over 85 to 90 million records worldwide, making her one of the best-selling music artists of all time. All of Grande's studio albums have been certified platinum or higher by the RIAA and have spent at least one year charting on the Billboard 200 chart. Grande has sold over 100 million units, across albums, singles, and features (when physical, downloads, and streaming-equivalent sales are combined), and 10 million albums and 86.5 million digital singles units as a lead artist in the United States, making her the fifth highest-certified female artist on RIAA's Top Artists (Digital Singles) ranking. In the U.S., Grande has moved 22.4 million album units, and garnered over 23.6 billion streams across lead artist credits, as of 2023, according to Luminate. Grande is also one of the highest-certified artists in the UK, with nearly 28 million units."}, {"text": "== Achievements ==Having amassed 98 billion streams thus far, Grande is the most-streamed female artist as of 2021, and one of the most streamed artists of all time; she is the most streamed female artist of 2010s decade on Spotify and Apple Music. With over 30 billion streams, she is among the ten most-streamed acts ever on Spotify, being only one of two women on the ranking. She became the most-streamed female artist on Spotify in 2020, surpassing Rihanna, and held the record for over two years. Her songs and albums are some of the most streamed of all time. Grande became the first woman with one and two billion streams with one album, 3.5 billion streams on three separate albums, the first artist to have five albums with four billion streams. She also has fourteen songs that have overcome one billion streams, making her the female artist with the most one billion songs on Spotify. As of 2022, she's also the most followed female artist on Spotify."}, {"text": "== Achievements ==Grande has won two Grammy Awards, one BRIT Award, nine MTV Video Music Awards, three MTV Europe Music Awards and three American Music Awards. She has received 39 Billboard Music Award nominations and won two in 2019, including Top Female Artist. Grande has won nine Nickelodeon Kids' Choice Awards, including one in 2014 for Favorite TV Actress for her performance on Sam & Cat, and three People's Choice Awards. In 2014, she received the Breakthrough Artist of the Year Award from the Music Business Association and Best Newcomer at the Bambi Awards. She has won six iHeartRadio Music Awards and twelve Teen Choice Awards. She was named Billboard Women in Music's Rising Star in 2014 and Woman of the Year in 2018, the greatest pop star of 2019, with honorable mention in 2014 and 2018, and the most successful female artist to debut in the 2010s by Billboard."}, {"text": "== Achievements ==Grande has broken numerous Hot 100 records. Nine singles by Grande have topped the US Billboard Hot 100, her most recent being \"We Can't Be Friends (Wait for Your Love)\". Grande has a total of sixteen top ten debuts thus far, beginning with her first single \"The Way\"; the lead single from each of her first seven studio albums have debuted in the top ten, making her the only artist to achieve this. In 2020, she became the first act to have her first five number one singles, \"Thank U, Next\", \"7 Rings\", \"Stuck With U\", \"Rain on Me\", and \"Positions\" debut at number one; that year, Grande also broke the record for the most number one debuts and became the first female artist topping Global 200, Global 200 Excl. US and Hot 100 simultaneously. Grande would also become the first artist to have three singles debut at number one on a single calendar year. She later broke the record for most simultaneously charting songs on the top 40 of the Hot 100 for a female artist with the release of her fifth studio album, Thank U, Next, when eleven of the twelve tracks charted within the region (later surpassed by Billie Eilish). The three singles from Thank U, Next, \"7 Rings\", \"Break Up with Your Girlfriend, I'm Bored\", and \"Thank U, Next\" charted at numbers one, two, and three respectively on the week of February 23, 2019, making Grande the first solo artist to occupy the top three spots of the Billboard Hot 100 and the first artist to do so since the Beatles in 1964. With her album Thank U, Next, Grande set the record for the largest streaming week for a pop album and for a female artist, with 307 million on-demand audio streams. With \"Die for You\" with the Weeknd reaching number one, Grande surpassed Paul McCartney as the artist with the most number-one duets in Hot 100 history, with four songs. As of March 2024, Grande has 85 entries on the Hot 100, tying Grande with Beyonce as the third female artist with the most 100 entries. Grande is also the female artist with the most number one debuts on the Hot 100, breaking her tie with Taylor Swift. She was also named the Billboard Year-End Top Female Artist for 2017 and 2019 and was named the sixth top female artist (twelfth overall) on the magazine's Decade-End Top Artists Chart for the 2010s."}, {"text": "== Achievements == The magazine also ranked her 78th on the Greatest of All Time Hot 100 Artists Charts, respectively."}, {"text": "== Achievements ==As of 2023, Grande has broken thirty-five Guinness World Records. These records included the most songs to debut at No. 1 on the Billboard Hot 100, most followers on Spotify (female), most monthly listeners on Spotify (female), most streamed act on Spotify (female), most streamed track in one week by a female artist on the Billboard charts, fastest hat-trick of UK No. 1 singles by a female artist, first female artist to replace herself at No. 1 on UK singles chart, first solo artist to replace themselves at No. 1 on UK singles chart for two consecutive weeks, most subscribers for a musician on YouTube (female), most streamed album by a female artist in one week (UK), among others. Eleven records were achieved from the success of her album Thank U, Next which was featured in the 2020 edition."}, {"text": "== Philanthropy and activism ==At age ten, Grande co-founded the South Florida youth singing group Kids Who Care, which performed at charitable fund-raisers and raised over $500,000 in 2007 alone. In 2009, as a member of the charitable organization Broadway in South Africa, she and her brother Frankie performed and taught music and dance to children in Gugulethu, South Africa."}, {"text": "== Philanthropy and activism ==She was featured with Bridgit Mendler and Kat Graham in Seventeen magazine in a 2013 public campaign to end online bullying called \"Delete Digital Drama\". After watching the film Blackfish that year, she urged fans to stop supporting SeaWorld. In September 2014, Grande participated at the charitable Stand Up to Cancer television program, performing her song \"My Everything\" in memory of her grandfather, who had died of cancer that July. Grande has adopted several rescue dogs as pets and has promoted pet adoption at her concerts. In 2016, she launched a line of lip shades, \"Ariana Grande's MAC Viva Glam\", with MAC Cosmetics, the profits of which benefited people affected by HIV and AIDS."}, {"text": "== Philanthropy and activism ==In 2015, Grande and Miley Cyrus performed a cover of Crowded House's \"Don't Dream It's Over\" as part of Cyrus' \"Backyard Sessions\" to benefit her Happy Hippie Foundation, which helps homeless and LGBT youths. Later that year, Grande headlined the Dance On the Pier event, part of the LGBT Pride Week in New York City. As a feminist, Grande wrote a well-received, \"empowering\" essay on Twitter decrying the double standard and misogyny in the focus of the press on female musicians' relationships and sex lives instead of \"their value as an individual\". She noted that she has \"more to talk about\" concerning her music and accomplishments rather than her romantic relationships. That year, Grande joined Madonna to raise funds for orphaned children in Malawi; she and Victoria Monét recorded \"Better Days\" in support of the Black Lives Matter movement. To aid the victims of the Manchester Arena bombing in 2017, Grande organized the One Love Manchester concert and re-released \"One Last Time\" and her live performance of \"Over the Rainbow\" at the event as charity singles. The total amount raised was reportedly $23 million (more than £17 million), and she received praise for her \"grace and strength\" in leading the benefit concert. Madeline Roth of MTV wrote that the performance \"bolstered courage among an audience that desperately needed it. ... Returning to the stage was a true act of bravery and resilience\". In 2017, New York magazine's Vulture section ranked the event as the No. 1 concert of the year, and Billboard's Mitchell Harrison called Grande a \"gay icon\" for her LGBT-friendly lyrics and performances and \"support for the LGBTQ community\"."}, {"text": "== Philanthropy and activism ==In September 2017, Grande performed in A Concert for Charlottesville which benefitted the victims of the August 2017 white nationalist rally in Charlottesville, Virginia. In March 2018, she participated in March for Our Lives to support gun control reform. Grande donated the proceeds from the first show in Atlanta on her Sweetener World Tour to Planned Parenthood in a response to the passage of a number of anti-abortion laws in several states including Georgia. During the COVID-19 pandemic, Grande donated between $500 and $1,000 each to a number of fans as financial support. Grande also supported a COVID-19 fund named Project 100, which aimed to provide $1,000 digital payments to 100,000 families who have been greatly impacted by the pandemic. In May 2020, Grande announced that all net proceeds from her collaboration with singer Justin Bieber, \"Stuck With U\", would be donated to the First Responders Children's Foundation to fund grants and scholarships for children of frontline workers who are working during the global pandemic. That month, Grande joined a Los Angeles protest against the murder of George Floyd, demanding justice and asking fans to sign petitions condemning the act of police brutality. She highlighted white privilege and called for more activism outside social media. The following month, she praised a Black-owned coffee shop on Instagram, and encouraged her LA-based followers to support the business. In recent years, Grande surprised kids, who spend the holiday at children's hospitals in L.A. and the UK, with gifts from wish lists at the UCLA Mattel Children's Hospital and the Royal Manchester Children's Hospital, among others. Manchester Foundation Trust Charity revealed that Grande had gifted nearly 1,000 presents to patients across the hospital network's children's wards and newborn intensive care units in 2021."}, {"text": "== Philanthropy and activism ==In June 2021, Grande, along with a dozen other celebrities signed an open letter to Congress to pass the Equality Act highlighting the Act would protect \"marginalized communities\". In the same month, Grande partnered with the online portal BetterHelp, and gave away $2 million worth of therapy to fans. On International Transgender Day of Visibility in 2022, she launched the Protect & Defend Trans Youth Fund to benefit transgender youth, pledging to match every donation up until $1.5 million. In May 2022, Grande was among 160 artists and influencers, who signed a 'Bans Off Our Bodies' full-page advertisement in The New York Times, in support of abortion rights in the US. Grande was also one of 175 entertainers to sign an open letter to oppose books bans in US schools in 2023. In June 2022, Grande endorsed Karen Bass for 2022 Los Angeles mayoral election."}, {"text": "=== Products and endorsements ===In November 2015, she released a limited edition handbag in collaboration with Coach. In January 2016, she launched a makeup collection with MAC Cosmetics, donating 100% of proceeds to the MAC AIDS Fund. In February 2016, Grande launched a fashion line with Lipsy London. Later that year, she teamed up with Brookstone, using the concept art of artist Wenqing Yan, to design cat ear headphones. In 2017, Grande collaborated with Square Enix to create a character based on herself for the mobile game Final Fantasy Brave Exvius. Grande was a limited-time unlockable character as part of the Dangerous Woman Tour event, which also included an orchestral remix of Grande's song \"Touch It\"; the character, Dangerous Ariana, is a magical support character who uses music-based attacks. In September 2017, she became a brand ambassador for Reebok. In August 2018, she partnered with American Express for The Sweetener Sessions, a partnership which continued through the Sweetener World Tour in 2019, alongside T-Mobile. In March 2019, she partnered with Starbucks for the launch of the Cloud Macchiato beverage. In May 2019, Grande was announced as the face of Givenchy's Fall-Winter campaign. The campaign began in July and generated $25.13 million in media impact value. Beats, Samsung, Fiat, Reebok, and Guess products have been featured in Grande's music videos. She has appeared in commercials for Macy's, T-Mobile, and Apple, as well as for her own fragrances. Since 2019, Grande was among the ten of the highest paid individuals on Instagram. In 2023, Grande earns $1.6 million per sponsored Instagram post."}, {"text": "=== Fragrances ===Grande has released thirteen fragrances with Luxe Brands. She launched her debut fragrance, Ari by Ariana Grande, in 2015. In the wake of its success, she launched her third fragrance, Sweet Like Candy, in 2016. Her fifth fragrance, Moonlight, was released in 2017, followed by Cloud (2018), Thank U, Next (2019), R.E.M. (2020), and God Is A Woman (2021), which was later expanded to a body care line. She then released the duo fragrance collection Mod Vanilla and Mod Blush (2022). The line also includes the limited editions Frankie (2016), Sweet Like Candy Limited Edition (2017), Thank U, Next 2.0, Cloud Intense (both 2021), and Cloud Pink (2023). The fragrances won the FiFi Award multiple times, most recently with R.E.M. in 2021. In 2022, it was reported that Cloud was the best-selling fragrance at Ulta, selling one bottle every eleven minutes. Grande's fragrance line is the most-searched celebrity offering, with 4.4 million searches across Google and social media platforms per year. Since its launch in 2015, the franchise has made $1 billion in retail sales globally."}, {"text": "=== R.E.M. Beauty ===In November 2021, Grande launched her makeup line R.E.M. Beauty, which is distributed at Ulta Beauty as of March 2022. The original line featured 12 core products for lips and eyes, and the range has since been expanded with additional skincare and makeup products. Forbes reported in 2022 that R.E.M. Beauty was one of the brands boosting Ulta's driving gross margin due to strong consumer demand. In May, the line won \"Best New Brand\" at the Allure Best of Beauty Awards. In February 2023, it was announced, that the brand will be launching in 81 Sephora stores and 13 online sites, including across Europe."}, {"text": "== Personal life ==Grande has said she struggled with hypoglycemia, which she attributed to poor dietary habits. She has been a vegan since 2013. Fans questioned in 2019 whether she was still a vegan after working with Starbucks to create a special edition of one of her favorite drinks which was revealed to contain eggs. Her nutritionist, Harley Pasternak, told the magazine Glamour that Grande is vegan but that he has got her to \"feel OK about indulging and celebrating sometimes\"."}, {"text": "== Personal life ==Grande developed post-traumatic stress disorder (PTSD) and anxiety after the Manchester Arena bombing; she nearly pulled out of her performance in the 2018 broadcast A Very Wicked Halloween due to anxiety. Grande has also said she has been in therapy for over a decade, having first seen a mental health professional shortly after her parents' divorce."}, {"text": "== Personal life ==Grande was raised Roman Catholic, but left the church during the pontificate of Benedict XVI (circa 2013), opposing its stance on homosexuality and noting that her half-brother Frankie is gay. Grande stated that she and Frankie later visited a Kabbalah Centre and that they both \"really had a connection with it.\" Several of her songs, such as \"Break Your Heart Right Back\", are supportive of LGBT rights. She has also been labeled \"an advocate for a sex-positive attitude\". In November 2019, Grande endorsed Bernie Sanders' second presidential bid."}, {"text": "=== Relationships ===Grande met actor Graham Phillips in the cast of the Broadway musical 13 in 2008 and dated him until 2011. Grande was later involved in an on-again, off-again relationship with Australian YouTuber Jai Brooks from August 2012 to July 2013; the two resumed their relationship from May to August 2014. She dated English singer Nathan Sykes between August and December 2013, and then dated rapper Big Sean from October 2014 to April 2015."}, {"text": "=== Relationships ===After recording \"The Way\" with rapper Mac Miller in 2012, the two began dating in 2016. Grande was featured on Miller's single \"My Favorite Part\" from his album The Divine Feminine (2016); she also provided an uncredited introduction to the album and was the inspiration behind its fifth track, \"Cinderella\". By May 2018, their relationship had ended and Grande entered a whirlwind romance with comedian Pete Davidson. They got engaged in June, after a few weeks of dating, while a song titled after and inspired by Davidson was featured on Grande's album Sweetener (2018). That September, Miller died from an accidental drug overdose; Grande expressed grief over his death on social media and called him her \"dearest friend\". She and Davidson called off their engagement and ended their relationship the following month."}, {"text": "=== Relationships ===Grande began dating real estate agent Dalton Gomez in January 2020. Their relationship, while mostly private, was made public in May 2020, in the music video of her and Justin Bieber's charity single \"Stuck With U\". Grande announced their engagement on December 20, 2020, after 11 months of dating. On May 15, 2021, they married in a private ceremony at her home in Montecito, California. Her wedding pictures became among the most-liked Instagram posts, with over 25 million likes. The couple separated on February 20, 2023, and simultaneously filed for divorce in September, citing \"irreconcilable differences\". Grande and Gomez agreed on a divorce settlement in October 2023, which was finalized in March 2024. Because the couple had a prenuptial agreement, no children, and no significant legal disputes in their split, their divorce moved quickly and cleanly in the court system and only had to wait the required six months before a judge's order could take effect. Under their settlement, Grande was ordered to make a one-time payment of $1.25 million to Gomez with no future alimony, give him half of the proceeds of the sale of their Los Angeles home, and pay up to $25,000 towards his attorney's fees."}, {"text": "== Filmography ==Don't Look Up (2021)"}, {"text": "== Filmography ==Wicked (2024)"}, {"text": "== Filmography ==Wicked Part Two (2025)"}, {"text": "== Discography ==Studio albums"}, {"text": "== Discography ==Yours Truly (2013)"}, {"text": "== Discography ==My Everything (2014)"}, {"text": "== Discography ==Dangerous Woman (2016)"}, {"text": "== Discography ==Sweetener (2018)"}, {"text": "== Discography ==Thank U, Next (2019)"}, {"text": "== Discography ==Positions (2020)"}, {"text": "== Discography ==Eternal Sunshine (2024)"}, {"text": "==== Headlining ====The Listening Sessions (2013)"}, {"text": "==== Headlining ====The Honeymoon Tour (2015)"}, {"text": "==== Headlining ====Dangerous Woman Tour (2017)"}, {"text": "==== Headlining ====Sweetener World Tour (2019)"}, {"text": "==== Promotional ====The Sweetener Sessions (2018)"}, {"text": "==== Opening act ====Justin Bieber – Believe Tour (2013)"}, {"text": "== See also ==List of American Grammy Award winners and nominees"}, {"text": "== See also ==List of artists who have achieved simultaneous UK and US number-one hits"}, {"text": "== See also ==List of artists who reached number one in the United States"}, {"text": "== See also ==List of Billboard Social 50 number-one artists"}, {"text": "== See also ==List of highest-certified music artists in the United States"}, {"text": "== See also ==Honorific nicknames in popular music"}, {"text": "== See also ==UK Singles Chart records and statistics"}, {"text": "== See also ==List of most-streamed songs on Spotify"}, {"text": "== External links ==Official website "}, {"text": "== External links ==Ariana Grande at IMDb"}, {"text": "== External links ==Ariana Grande at the Internet Broadway Database"}]