[{"text": "Barbara Jill Walters (September 25, 1929 – December 30, 2022) was an American broadcast journalist and television personality. Known for her interviewing ability and popularity with viewers, she appeared as a host of numerous television programs, including Today, the ABC Evening News, 20/20, and The View. Walters was a working journalist from 1951 until her retirement in 2015. Walters was inducted into the Television Hall of Fame in 1989, received a Lifetime Achievement Award from the NATAS in 2000 and a star on the Hollywood Walk of Fame in 2007."}, {"text": "Walters began her career at WNBT-TV (NBC's flagship station in New York) in 1953 as writer-producer of a news-and-information program aimed at the juvenile audience, Ask the Camera, hosted by Sandy Becker. She joined the staff of the network's Today show in the early 1960s as a writer and segment producer of women's-interest stories. Her popularity with viewers led to her receiving more airtime, and in 1974 she became co-host of the program, the first woman to hold such a position on an American news program. During 1976 she continued to be a pioneer for women in broadcasting while becoming the first U.S. female co-anchor of a network evening news program, alongside Harry Reasoner on the ABC Evening News. Walters was a correspondent, producer and co-host on the ABC newsmagazine 20/20 from 1979 to 2004. She became known for an annual special aired on ABC, Barbara Walters' 10 Most Fascinating People."}, {"text": "During her career, Walters interviewed every sitting U.S. president and first lady from Richard and Pat Nixon to Barack and Michelle Obama. She also interviewed both Donald Trump and Joe Biden, though not when each was president. She also gained acclaim and notoriety for interviewing subjects such as Fidel Castro, Anwar Sadat, Menachem Begin, Katharine Hepburn, Sean Connery, Monica Lewinsky, Hugo Chávez, Vladimir Putin, Shah Mohammad Reza Pahlavi, Jiang Zemin, and Bashar al-Assad."}, {"text": "Walters created, produced, and co-hosted the ABC daytime talk show The View; she appeared on the program from 1997 until she retired in 2014. Later she continued to host several special reports for 20/20 as well as documentary series for Investigation Discovery. Her final on-air appearance for ABC News was in 2015. Walters last publicly appeared in 2016."}, {"text": "== Early life ==Barbara Jill Walters was born in Boston on September 25, 1929, the daughter of Dena (née Seletsky) and Lou Walters (born Louis Abraham Warmwater); her parents were children of Russian Jewish immigrants. Her paternal grandfather, Abraham Isaac Waremwasser, was born in the Polish city of Łódź and emigrated to England where he changed his surname to Warmwater. Walters' father was born in London in 1898 and moved to New York City with his father and two brothers on August 28, 1909. His mother and four sisters arrived there the following year."}, {"text": "== Early life ==During Walters' childhood her father managed the Latin Quarter nightclub in Boston, which was owned in partnership with E. M. Loew. In 1942, her father opened the club's now-famous New York location. He also worked as a Broadway producer and produced the Ziegfeld Follies of 1943; he was also the entertainment director for the Tropicana Resort and Casino in Las Vegas. He imported the Folies Bergère stage show from Paris to the resort's main showroom. Walters' older brother, Burton, was 14 months old when he died of pneumonia. Her elder sister, Jacqueline, was born with mental disabilities and died of ovarian cancer in 1985."}, {"text": "== Early life ==According to Walters, her father made and lost several fortunes throughout his life in show business. He was a booking agent, and (unlike her uncles in the shoe and dress businesses) his job was not very stable. During the good times she recalled her father taking her to the rehearsals of the nightclub shows he directed and produced. The actresses and dancers would make a huge fuss over her and twirl her around until she was dizzy, after which she said her father would take her out to get hot dogs."}, {"text": "== Early life ==Walters said that being surrounded by celebrities when she was young kept her from being \"in awe\" of them. When she was a young woman, her father lost his night clubs and the family's penthouse on Central Park West. As Walters recalled, \"He had a breakdown. He went down to live in our house in Florida, and then the government took the house, and they took the car, and they took the furniture. [...] My mother should have married the way her friends did, to a man who was a doctor or who was in the dress business.\" During her childhood in Miami Beach, she briefly lived with the mobster Bill Dwyer."}, {"text": "== Early life ==Walters attended Lawrence School, a public school in Brookline, Massachusetts; she left halfway through fifth grade when her father moved the family to Miami Beach in 1939. She continued attending public school in Miami Beach. After her father moved the family to New York City, she spent eighth grade at the private Ethical Culture Fieldston School, after which the family moved back to Miami Beach. She then went back to New York City after tenth grade, where she attended Birch Wathen School, another private school. In 1951, she earned a Bachelor of Arts in English from Sarah Lawrence College in Yonkers, New York."}, {"text": "=== Early career ===Walters was employed for about a year at a small advertising agency in New York City and began working at the NBC network's flagship station WNBT-TV (now WNBC), doing publicity and writing press releases. In 1953 she produced a 15-minute children's program, Ask the Camera, which was directed by Roone Arledge. She also started producing for TV host Igor Cassini (Cholly Knickerbocker), but left the network after Cassini pressured her to marry him and started a fistfight with the man she was interested in. She went to WPIX to produce the Eloise McElhone Show, which was canceled in 1954. She became a writer on The Morning Show at CBS in 1955."}, {"text": "=== The Today Show ===After a few years working at Tex McCrary Inc. as a publicist and as a writer at Redbook magazine, Walters joined NBC's The Today Show as a writer and researcher in 1961. She moved up becoming the show's regular \"Today Girl,\" handling lighter assignments and the weather. In her autobiography, she described this era before the Women's Movement as a time when it was believed that nobody would take a woman seriously reporting \"hard news.\" Previous \"Today Girls\" (whom Walters called \"tea pourers\") included Florence Henderson, Helen O'Connell, Estelle Parsons, and Lee Meriwether. Within a year, she had become a reporter-at-large developing, writing, and editing her own reports and interviews. One very well-received film segment was \"A Day in the Life of a Nun.\" Another was about the daily life of a Playboy Bunny."}, {"text": "=== The Today Show ===Beginning in 1971, Walters hosted her own local NBC affiliate show, Not for Women Only, which ran in the mornings after The Today Show. Walters had a great relationship with host Hugh Downs for years. When Frank McGee was named host in 1971, he refused to do joint interviews with Walters unless he was given the first three questions. She was not named co-host of the show until McGee's death in 1974 when NBC officially designated Walters as the program's first female co-host. She became the first female co-host of a U.S. news program."}, {"text": "=== ABC Evening News and 20/20 ===Walters signed a five-year, $5 million contract with ABC, establishing her as the highest-paid news anchor, either male or female. She and Harry Reasoner co-anchored the ABC Evening News from 1976 to 1978, making her the first U.S. female network news anchor. Reasoner had a difficult relationship with Walters because he disliked having a co-anchor, even though he worked with former CBS colleague Howard K. Smith nightly on ABC for several years. Walters said that the tension between the two was because Reasoner did not want to work with a co-anchor and also because he was unhappy at ABC, not because he disliked Walters personally. In 1981, five years after the start of their short-lived ABC partnership and well after Reasoner returned to CBS News, Walters and her former co-anchor had a memorable (and cordial) 20/20 interview on the occasion of Reasoner's new book release."}, {"text": "=== ABC Evening News and 20/20 ===In 1979, Walters reunited with former The Today Show host Downs as a correspondent on the ABC newsmagazine 20/20. She became Downs' co-host in 1984, and remained with the program until she retired as co-host in 2004. Throughout her career at ABC, Walters appeared on ABC news specials as a commentator, including presidential inaugurations and the coverage of the September 11 attacks. She was also chosen to be the moderator for the third and final debate between candidates Jimmy Carter and Gerald Ford, held on the campus of the College of William and Mary at Phi Beta Kappa Memorial Hall in Williamsburg, Virginia, during the 1976 presidential election. In 1984, she moderated a presidential debate which was held at the Dana Center for the Humanities at Saint Anselm College in Goffstown, New Hampshire."}, {"text": "==== Interviews ====Walters was known for \"personality journalism\" and her \"scoop\" interviews. In 1976, she first aired her highly rated, occasional, primetime Barbara Walters Specials interview program.  Her first guests included a joint appearance by President-elect Jimmy Carter and Rosalynn Carter, and a separate interview with singer-actress Barbra Streisand. In November 1977, she landed the first joint interview with Egyptian president Anwar Al Sadat and Israeli prime minister Menachem Begin, while they were working out the terms of the eventual Egypt–Israel peace treaty.  According to The New York Times, when she went mano a mano with Walter Cronkite to interview both world leaders, at the end of Cronkite's interview, he is heard saying: \"Did Barbara get anything I didn't get?\" Walters had sit-down interviews with world leaders, including the Shah of Iran, Mohammad Reza Pahlavi, and his wife, the Empress Farah Pahlavi; Russia's Boris Yeltsin and Vladimir Putin; China's Jiang Zemin; the UK's Margaret Thatcher; Cuba's Fidel Castro, as well as India's Indira Gandhi, Czechoslovakia's Václav Havel, Libya's Muammar al-Gaddafi, King Hussein of Jordan, King Abdullah of Saudi Arabia, Venezuelan President Hugo Chávez and many others. Walters interviewed other influential people including pop icon Michael Jackson, Katharine Hepburn, Vogue editor Anna Wintour, and Sir Laurence Olivier in 1980. Walters considered Robert Smithdas, a deaf-blind man who spent his life improving the lives of other individuals who are deaf-blind, as her most inspirational interviewee."}, {"text": "==== Interviews ====Walters was widely lampooned for asking actress Katharine Hepburn, \"If you were a tree, what kind would you be?\" On the last 20/20 television episode in which she appears, Walters showed a video of the Hepburn interview, showing the actress saying that she felt like a strong tree in her old age. Walters followed up with the question, \"What kind of a tree?\", and Hepburn responded \"an oak\" because they do not get Dutch elm disease. According to Walters for years Hepburn refused her requests for an interview. When Hepburn finally agreed to one she said she wanted to meet Walters first. Walters walked in all smiles and ready to please, while Hepburn was at the top of the stairs and barked, \"You're late. Have you brought me chocolates?\""}, {"text": "==== Interviews ====Walters had not but said she never showed up without them from then on. They had several other meetings later, mostly in Hepburn's living room where she would give Walters her opinions. These included that careers and marriage did not mix, as well as her feeling that combining children with careers was out of the question. Walters said Hepburn's opinions stuck with her so much, she could repeat them almost verbatim from that point onward."}, {"text": "==== Interviews ====Her television special about Cuban leader Fidel Castro aired on ABC-TV on June 9, 1977. Although the footage of her two days of interviewing Castro in Cuba showed his personality, in part, as freewheeling, charming, and humorous, she pointedly said to him, \"You allow no dissent. Your newspapers, radio, television, motion pictures are under state control.\" To this, he replied, \"Barbara, our concept of freedom of the press is not yours. If you asked us if a newspaper could appear here against socialism, I can say honestly no, it cannot appear. It would not be allowed by the party, the government, or the people. In that sense we do not have the freedom of the press that you possess in the U.S. And we are very satisfied about that.\" She concluded the broadcast saying, \"What we disagreed on most profoundly is the meaning of freedom—and that is what truly separates us.\" At the time, Walters kept quiet that she had seen New York Yankees owner George Steinbrenner, pitcher Whitey Ford, and several coaches in Cuba who were there to assist Cuban ballplayers."}, {"text": "==== Interviews ====On March 3, 1999, her interview with Monica Lewinsky was seen by a record 74 million viewers, the highest rating ever for a news program. Walters asked Lewinsky, \"What will you tell your children when you have them?\" Lewinsky replied, \"Mommy made a big mistake,\" at which point Walters brought the program to a dramatic conclusion, turning to the viewers and saying, \"... that is the understatement of the year.\""}, {"text": "==== Interviews ====Barbara Walters' 10 Most Fascinating People was aired annually starting in 1993. In 2000, she quizzed pop star Ricky Martin about his sexuality years before he publicly came out. The singer later said that \"he felt violated\". In 2010, Walters said that she regretted having pushed him on the issue."}, {"text": "=== The View ===Walters was a co-host of the daytime talk show The View; for 25 years she was also a co-executive producer of BarWall Productions alongside her business partner, Bill Geddie. Geddie and Walters were co-creators of the company. The View premiered on August 11, 1997. In the original opening credits Walters said the show is a forum for women of \"different generations, backgrounds, and views.\" \"Be careful what you wish for...\"  was part of the opening credits of its second season. On The View, she won Daytime Emmy Awards for Best Talk Show in 2003 and Best Talk Show Host (with longtime host Joy Behar, moderator Whoopi Goldberg, Elisabeth Hasselbeck, and Sherri Shepherd) in 2009."}, {"text": "=== The View ===Walters retired from being a co-host on May 15, 2014. She returned as a guest co-host on an intermittent basis in 2014 and 2015 even in retirement."}, {"text": "=== Retirement ===After leaving her role as 20/20 co-host in 2004, Walters remained a part-time contributor of special programming and interviews for ABC News until 2016. On March 7, 2010, Walters announced that she would no longer hold Oscar interviews but would still work for ABC and on The View."}, {"text": "=== Retirement ===On March 28, 2013, numerous media outlets reported that Walters would retire in May 2014 and that she would make the announcement on the show four days later. However, on the April 1 episode, she neither confirmed nor denied the retirement rumors; she said \"if and when I might have an announcement to make, I will do it on this program, I promise, and the paparazzi guys—you will be the last to know\". Six weeks later Walters confirmed that she would be retiring from television hosting and interviewing, as originally reported; she made the official announcement on the May 13, 2013, episode of The View. She also announced that she would continue as the show's executive producer for as long as it \"is on the air\"."}, {"text": "=== Retirement ===On June 10, 2014, it was announced she was \"coming out of retirement\" for a special 20/20 interview with Peter Rodger, the father of the perpetrator of the 2014 Isla Vista killings, Elliot Rodger. In 2015, Walters hosted special 20/20 episodes featuring interviews with Mary Kay Letourneau and Donald and Melania Trump. In 2015, Walters hosted the documentary series American Scandals on Investigation Discovery."}, {"text": "=== Retirement ===Walters continued to host 10 Most Fascinating People on ABC in 2014 and 2015. Her last on-air interview was with Donald Trump for ABC News in December 2015, and she made her final public appearance in 2016. On January 1, 2023, ABC ran a special called \"Our Barbara\" and a 20/20 senior producer noted, \"For a number of years we kept her office just as is (after 2016), the papers came every day. Outside of her office she still retained her office extension.\""}, {"text": "== Personal life ==Walters was married four times to three different men. Her first husband was Robert Henry Katz, a business executive and former Navy lieutenant. They married on June 20, 1955, at the Plaza Hotel in New York City. The marriage was reportedly annulled after eleven months, in 1957. Her second husband was Lee Guber, a theatrical producer and theater owner. They married on December 8, 1963, and divorced in 1976. After Walters had three miscarriages, the couple adopted a baby girl named Jacqueline Dena Guber (born in 1968 and adopted the same year; she was named for Walters' sister). Walters' third husband was Merv Adelson who at the time was the CEO of Lorimar Television. They married in 1981 and divorced in 1984. They remarried in 1986 and divorced for the second time in 1992."}, {"text": "== Personal life ==Walters dated lawyer Roy Cohn in college; he said that he proposed marriage to Walters the night before her wedding to Lee Guber, but Walters denied this happened. She explained her lifelong devotion to Cohn as gratitude for his help in her adoption of her daughter, Jacqueline. In her autobiography, Walters says she also felt grateful to Cohn because of legal assistance he had provided to her father. According to Walters, her father was the subject of an arrest warrant for \"failure to appear\" after he failed to show up for a New York court date because the family was in Las Vegas; Cohn was able to have the charge dismissed. Walters testified as a character witness at Cohn's 1986 disbarment trial."}, {"text": "== Personal life ==Walters dated future U.S. Federal Reserve chairman Alan Greenspan in the 1970s and was linked romantically to United States Senator John Warner in the 1990s."}, {"text": "== Personal life ==In Walters's autobiography Audition, she wrote that she had an affair in the 1970s with Edward Brooke, then a married United States Senator from Massachusetts. It is not clear whether Walters also was married at the time. Walters said they ended the affair to protect their careers from scandal. In 2007, she dated Pulitzer Prize–winning gerontologist Robert Neil Butler."}, {"text": "== Personal life ==Walters was a close friend of Tom Brokaw, Woody Allen, Joan Rivers, and Fox News head Roger Ailes."}, {"text": "== Personal life ==In 2013, Walters said she regretted not having more children."}, {"text": "== Health issues and death ==In May 2010, Walters said she would be having an open-heart operation to replace a faulty aortic valve. She had known that she was suffering from aortic stenosis, even though she was symptom-free. Four days after the operation, Walters' spokeswoman, Cindi Berger, said that the procedure to fix the faulty heart valve \"went well, and the doctors are very pleased with the outcome\". Walters returned to The View and her Sirius XM satellite show, Here's Barbara, in September 2010. Walters retired permanently from both shows four years later."}, {"text": "== Health issues and death ==Walters died at her home in Manhattan, on December 30, 2022, at age 93. She had been suffering from dementia in her later years. Her last words were, \"No regrets – I had a great life.\" Those words were etched into her gravestone at Lakeside Memorial Park in Doral, Florida."}, {"text": "== Legacy and awards ==Walters began her career when the prevalent view among television executives was that women reporting news about war, politics and other important matters would be taken lightly by viewers. Her success is credited with creating career opportunities for future female network anchors, including Jane Pauley, Katie Couric and Diane Sawyer. Walters often got her interviewees to speak about their perspectives and share anecdotes. She was inducted into the Television Hall of Fame in 1989. On June 15, 2007, Walters received a star on the Hollywood Walk of Fame. She won Daytime and Prime Time Emmy Awards, a Women in Film Lucy Award, and a GLAAD Excellence in Media award."}, {"text": "== Legacy and awards ==In 2008, Walters was honored with the Disney Legends award, given to those who made an outstanding contribution to The Walt Disney Company, which owns the network ABC. That same year, she received the Lifetime Achievement Award from the New York Women's Agenda. On September 21, 2009, Walters was honored with a Lifetime Achievement Award at the 30th Annual News and Documentary Emmy Awards at New York City's Lincoln Center."}, {"text": "== Legacy and awards ==Walters' status as a prominent figure in popular culture was reflected by Gilda Radner's gentle parody of her as \"Baba Wawa\" on Saturday Night Live in the late 1970s, featuring Walters' distinctive speech including her rounded \"R's\". Her name appeared in the January 23, 1995 New York Times Monday Crossword Puzzle."}, {"text": "=== Awards and nominations ===1985: Paul White Award, Radio Television Digital News Association"}, {"text": "=== Awards and nominations ===Daytime Emmy Awards"}, {"text": "=== Awards and nominations ===1975 Award for Daytime Emmy for Outstanding Talk Show Host (Today)"}, {"text": "=== Awards and nominations ===1998 Nomination for Best Talk Show (The View)"}, {"text": "=== Awards and nominations ===2000 Nomination for Best Talk Show (The View)"}, {"text": "=== Awards and nominations ===2000 Nomination for Best Talk Show Host (The View)"}, {"text": "=== Awards and nominations ===2001 Nomination for Best Talk Show (The View)"}, {"text": "=== Awards and nominations ===2001 Nomination for Best Talk Show Host (The View)"}, {"text": "=== Awards and nominations ===2002 Nomination for Best Talk Show (The View)"}, {"text": "=== Awards and nominations ===2002 Nomination for Best Talk Show Host (The View)"}, {"text": "=== Awards and nominations ===2003 Award for Best Talk Show (The View)"}, {"text": "=== Awards and nominations ===2003 Nomination for Best Talk Show Host (The View)"}, {"text": "=== Awards and nominations ===2006 Nomination for Best Talk Show (The View)"}, {"text": "=== Awards and nominations ===2006 Nomination for Best Talk Show Host (The View)"}, {"text": "=== Awards and nominations ===2007 Nomination for Best Talk Show (The View)"}, {"text": "=== Awards and nominations ===2007 Nomination for Best Talk Show Host (The View)"}, {"text": "=== Awards and nominations ===2008 Nomination for Best Talk Show (The View)"}, {"text": "=== Awards and nominations ===2008 Nomination for Best Talk Show Host (The View)"}, {"text": "=== Awards and nominations ===2009 Award for Daytime Emmy for Outstanding Talk Show Host (The View) (with Whoopi Goldberg, Joy Behar, Elisabeth Hasselbeck, and Sherri Shepherd)"}, {"text": "=== Awards and nominations ===2010 Nomination for Best Talk Show Host (The View)"}, {"text": "=== Awards and nominations ===NAACP Image Award"}, {"text": "=== Awards and nominations ===2009 Award for Best Talk Series (The View)"}, {"text": "=== Awards and nominations ===2010 Nomination for Best Talk Series"}, {"text": "=== Awards and nominations ===Women in Film Crystal + Lucy Awards"}, {"text": "=== Awards and nominations ===1998 Lucy Award in recognition of her excellence and innovation in her creative works that have enhanced the perception of women through the medium of television."}, {"text": "=== Awards and nominations ===Golden Plate Award of the American Academy of Achievement"}, {"text": "=== Awards and nominations ===1991 Golden Plate Award presented by Awards Council member Beverly Sills."}, {"text": "== Bibliography ==In the late 1960s, Walters wrote a magazine article, \"How to Talk to Practically Anyone About Practically Anything\", which drew upon the kinds of things people said to her, which were often mistakes. Shortly after the article appeared, she received a letter from Doubleday expressing interest in expanding it into a book. Walters felt that it would help \"tongue-tied, socially awkward people—the many people who worry that they can't think of the right thing to say to start a conversation.\""}, {"text": "== Bibliography ==Walters published the book How to Talk with Practically Anybody About Practically Anything in 1970, with the assistance of ghostwriter June Callwood. To Walters's great surprise, the book was a success. As of 2008, it had gone through eight printings, sold hundreds of thousands of copies worldwide, and had been translated into at least six languages."}, {"text": "== Bibliography ==Walters published her autobiography, Audition: A Memoir, in 2008."}, {"text": "== See also ==New Yorkers in journalism"}, {"text": "== Further reading ==Gutgold, Nichola D. (2008). Seen and Heard: The Women of Television News. Lexington Books."}, {"text": "== External links ==Barbara Walters at IMDb "}, {"text": "== External links ==Television Interview – Television Academy Interviews"}, {"text": "== External links ==Appearances on C-SPAN"}]