[{"text": "Betty Marion Ludden (née White; January 17, 1922 – December 31, 2021) was an American actress and comedian. A pioneer of early television with a career spanning almost seven decades, she was noted for her vast number of television appearances acting in sitcoms, sketch comedy, and game shows. She produced and starred in the series Life with Elizabeth (1953–1955), thus becoming the first woman to produce a sitcom.After moving from radio to television, White became a staple panelist of American game shows such as Password, Match Game, Tattletales, To Tell the Truth, The Hollywood Squares, and The $25,000 Pyramid. Dubbed \"the first lady of game shows\", she became the first woman to receive the Daytime Emmy Award for Outstanding Game Show Host for the show Just Men! in 1983. She then became more widely known for her guest and recurring appearances on shows such as The Carol Burnett Show, Mama's Family, The Bold and the Beautiful and Boston Legal."}, {"text": "White's biggest roles include Sue Ann Nivens on the CBS sitcom The Mary Tyler Moore Show (1973–1977), Rose Nylund on the NBC sitcom The Golden Girls (1985–1992), and Elka Ostrovsky on the TV Land sitcom Hot in Cleveland (2010–2015). She had a late career resurgence when she starred in the romantic comedy film The Proposal (2009) and hosted Saturday Night Live the following year, garnering her a Primetime Emmy Award for Outstanding Guest Actress in a Comedy Series. The 2018 documentary Betty White: First Lady of Television detailed her life and career.For her lengthy work in radio, television, and film, White twice earned the Guinness World Record for the longest TV career by a female entertainer in both 2014 and 2018. She received various awards and nominations, including seven Emmy Awards, three Screen Actors Guild Awards, and a Grammy Award. She received a star on the Hollywood Walk of Fame and was inducted into the Television Hall of Fame in 1995."}, {"text": "== Early life ==Betty Marion White was born in Oak Park, Illinois, on January 17, 1922. She later clarified that \"Betty\" was her legal name and not a shortened version of \"Elizabeth\" as some people had assumed. She was the only child of housewife Christine Tess (née Cachikis) and lighting company executive Horace Logan White. Her father was from Michigan. White's maternal grandfather was Greek, her paternal grandfather was Danish, both of her grandmothers were Canadians of English descent, and her other ancestry included Welsh. When she was one year old, her family moved to Alhambra, California, and later to Los Angeles during the Great Depression. To make extra money, her father built crystal radios and sold them wherever he could. Since it was the height of the Depression and hardly anyone had a sizable income, he would trade the radios for other goods, which sometimes included dogs.White was educated in Beverly Hills, where she attended Horace Mann Elementary School and Beverly Hills High School, graduating from the latter in 1939. Her interest in wildlife was sparked by family vacations to the Sierra Nevada. She initially aspired to become a forest ranger, but was unable to do so because women were not allowed to serve as rangers at the time. She instead pursued an interest in writing; she wrote and played the lead in a graduation play at Horace Mann School and discovered her interest in performing. Inspired by her idols Jeanette MacDonald and Nelson Eddy, she decided to pursue a career as an actress.One month after White graduated from high school, she and a classmate sang songs from The Merry Widow on an experimental television show, at a time when the medium of television itself was still in development. She found work as a model, and her first professional acting job was at the Bliss Hayden Little Theatre. After the U.S. entered World War II in 1941, she volunteered for the American Women's Voluntary Services. Her assignment included driving a PX truck with military supplies to the Hollywood Hills. She also participated in events for troops before they were deployed overseas. Commenting on her wartime service, she later said that it was \"a strange time and out of balance with everything\"."}, {"text": "=== 1951–1969: Early career and breakthrough ===After the war, White made the rounds to movie studios looking for work, but was turned down because she was \"not photogenic\". She started to look for radio jobs, where being photogenic did not matter. Her first radio jobs included reading commercials and playing bit parts, and sometimes even doing crowd noises. She made about five dollars a show. She would do just about anything, like singing on a show for no pay. She appeared on shows such as Blondie, The Great Gildersleeve, and This Is Your FBI. She was then offered her own radio show, called The Betty White Show."}, {"text": "=== 1951–1969: Early career and breakthrough ===In 1949, she began appearing as co-host with Al Jarvis on his daily live television variety show Hollywood on Television, originally called Make Believe Ballroom, on KFWB and then on KLAC-TV (now KCOP-TV) in Los Angeles.White began hosting the show by herself in 1952 after Jarvis's departure, spanning five and a half hours of live ad lib television six days per week, over a continuous four-year span. In all of her various variety series over the years, White would sing at least a couple of songs during each broadcast. In 1951, she was nominated for her first Emmy Award as \"Best Actress\" on television, competing with Judith Anderson, Helen Hayes, and Imogene Coca; the award went to Gertrude Berg. At this point, the award was for body of work, with no shows named in nominations."}, {"text": "==== The Betty White Show (1952–1954) ====From 1952 to 1954, White hosted and produced her own daily talk/variety show, The Betty White Show, first on KLAC-TV and then on NBC (her first television, but second show to feature that title). Like her sitcom, she had creative control over the series, and was able to hire a female director. In a first for American network variety television, her show featured an African-American performer, but the show faced criticism for the inclusion of tap dancer Arthur Duncan as a regular cast member. The criticism followed when NBC expanded the show nationally. Local Southern stations in the Jim Crow era threatened to boycott unless Duncan was removed from the series. In response, White said \"I'm sorry. Live with it\", and gave Duncan more airtime. Initially a ratings success, the show repeatedly changed time slots and suffered lower viewership. By the end of the year, NBC quietly cancelled the series."}, {"text": "==== Life with Elizabeth (1953–1955) ====In 1952, the same year that she began hosting Hollywood on Television, White co-founded Bandy Productions with writer George Tibbles and Don Fedderson, a producer. The trio worked to create new shows using existing characters from sketches shown on Hollywood on Television. White, Fedderson, and Tibbles created the television comedy Life with Elizabeth, with White portraying the title character. The show was originally a live production on KLAC-TV in 1951, and won White a Los Angeles Emmy Award in 1952. Life with Elizabeth was nationally syndicated from 1953 to 1955, allowing White to become one of the few women in television with full creative control in front of and behind the camera. The show was unusual for a sitcom in the 1950s because it was co-produced and owned by a twenty-eight-year-old woman who still lived with her parents. White said they did not worry about relevance in those days, and that usually the incidents were based on real-life situations that happened to her, the actor who played Alvin, and the writer. White also performed in television advertisements seen on live television in Los Angeles, including a rendition of the \"Dr. Ross Dog Food\" advertisement at KTLA during the 1950s. She guest-starred on The Millionaire in the 1956 episode \"The Virginia Lennart Story\", as the owner of a small-town diner who received an anonymous gift of $1 million.Following the end of Life with Elizabeth, she appeared as Vicki Angel on the ABC sitcom Date with the Angels from 1957 to 1958. As originally intended, the show, loosely based on the Elmer Rice play Dream Girl, would focus on Vicki's daydreaming tendencies. However, the sponsor was not pleased with the fantasy elements and was pressured to have them eliminated. \"I can honestly say that was the only time I have ever wanted to get out of a show\", White later said. The sitcom was a critical and rating disaster, but ABC wouldn't allow White out of her contractual agreement and required her to fill the remaining thirteen weeks in their deal. Instead of a retooled version of the sitcom, White rebooted her old talk/variety show, The Betty White Show, which aired until her contract was fulfilled.\"The sitcom did give White some positive experiences: she first met Lucille Ball while working on it, as both Date With the Angels and I Love Lucy were filmed on the same Culver Studios lot. The two quickly struck up a friendship over their accomplishments in taking on the male-dominated television business of the 1950s. They relied on one another through divorce, illness, personal loss, and even competed against one another on various game shows. In July 1959, White made her professional stage debut in a week-long production of the play, Third Best Sport, at the Ephrata Legion Star Playhouse in Ephrata, Pennsylvania."}, {"text": "==== Game and talk show appearances ====By the 1960s, White was a staple of network game shows and talk shows: including both Jack Paar and later Johnny Carson's era of The Tonight Show. She made many appearances on the hit Password show as a celebrity guest from 1961 through 1975. She married the show's host, Allen Ludden, in 1963. She subsequently appeared on the show's three updated versions, Password Plus, Super Password, and Million Dollar Password. White made frequent game show appearances on What's My Line? (starting in 1955), To Tell the Truth (in 1961, 1990, and 2015), I've Got a Secret (in 1972–73), Match Game (1973–1982), and Pyramid (starting in 1982). She made her feature film debut as fictional Kansas Senator Elizabeth Ames Adams in the 1962 drama Advise & Consent; in 2004, on talk show Q&A, host Brian Lamb remarked on White's longevity as an actress besides the fact she was playing a strong female senator in 1962. He and Donald A. Ritchie noted that viewers would have seen the Senator Adams character to reflect Margaret Chase Smith. In 1963, White starred in a production of The King and I at the St. Louis Municipal Opera Theatre, with Charles Korvin co-starring as the king.NBC offered her an anchor job on their flagship breakfast television show Today. She turned the offer down because she did not want to move permanently to New York City (where Today is produced). The job eventually went to Barbara Walters. Through the 1950s and 1960s, White began a nineteen-year run as hostess and commentator on the annual Rose Parade broadcast on NBC (co-hosting with Roy Neal and later Lorne Greene), and appeared on a number of late-night talk shows, including Jack Paar's The Tonight Show, and various other daytime game shows."}, {"text": "==== The Mary Tyler Moore Show (1973–1977) ====White made several appearances in the fourth season (1973–74) of The Mary Tyler Moore Show, as the \"man-hungry\" Sue Ann Nivens. Although considering the role a highlight of her career, White described the character's image as \"icky sweet\", feeling she was the very definition of feminine passivity, owing to the fact she always satirized her own persona onscreen in just such a way. The Mary Tyler Moore Show's producers made Sue Ann Nivens a regular character and brought White into the main cast starting with the fifth season, after Valerie Harper, who played Rhoda Morgenstern, left the program.A running gag was how Sue Ann's aggressive, cynical personality was the complete opposite of her relentlessly perky TV persona on the fictional WJM-TV show, The Happy Homemaker. \"We need somebody who can play sickeningly sweet, like Betty White\", Moore suggested at a production meeting, which resulted in casting White herself. White won two Emmy Awards back-to-back for her role in the hugely popular series, in 1975 and 1976.Mary Tyler Moore and her husband Grant Tinker were close friends with White and her husband Allen Ludden. In a 2010 The Interviews: An Oral History of Television interview, Moore explained that producers, aware of Moore and White's friendship, were initially hesitant to audition White for the role, for fear that if she hadn't been right, it would create awkwardness between the two."}, {"text": "==== The Mary Tyler Moore Show (1973–1977) ====In 1975, NBC replaced White as commentator hostess of the Tournament of Roses Parade, feeling that she was identified too heavily with rival network CBS's The Mary Tyler Moore Show. White admitted to People that it was difficult \"watching someone else do my parade\", although she would soon start a ten-year run as hostess of the Macy's Thanksgiving Day Parade for CBS. Following the end of The Mary Tyler Moore Show in 1977, White was offered her own sitcom on CBS, her fourth, entitled The Betty White Show (the first of the name running a quarter century earlier), in which she co-starred with John Hillerman and former Mary Tyler Moore co-star Georgia Engel. Running up against Monday Night Football in its timeslot, the ratings were poor and it was canceled after one season."}, {"text": "==== The Mary Tyler Moore Show (1973–1977) ====White appeared several times on The Carol Burnett Show and The Tonight Show Starring Johnny Carson appearing in many sketches, and began guest-starring in a number of television movies and television miniseries, including With This Ring, The Best Place to Be, Before and After, and The Gossip Columnist. In 1983, White became the first woman to win a Daytime Emmy Award in the category of Outstanding Game Show Host, for the NBC entry Just Men! Due to the amount of work she did on them, she was deemed the \"First Lady of Game Shows\"."}, {"text": "==== The Golden Girls (1985–1992) ====From 1983 to 1984, White had a recurring role playing Ellen Harper Jackson on the series Mama's Family, along with future Golden Girls co-star Rue McClanahan. White had originated this character in a series of sketches on The Carol Burnett Show in the 1970s. In 1985, White scored her second signature role and the biggest hit of her career as the St. Olaf, Minnesota native Rose Nylund on The Golden Girls. The series chronicled the lives of four widowed or divorced women in their \"golden years\" who shared a home in Miami. The Golden Girls, which also starred Bea Arthur, Estelle Getty, and Rue McClanahan, was immensely successful and ran from 1985 through 1992. White won one Primetime Emmy Award, for \"Outstanding Lead Actress in a Comedy Series\", for the first season of The Golden Girls and was nominated in that category every year of the show's run (Getty was also nominated every year, but in the supporting actress category).White had a strained relationship with her The Golden Girls co-star Bea Arthur on and off the set of their television show, commenting that Arthur \"was not that fond of me\" and that \"she found me a pain in the neck sometimes. It was my positive attitude – and that made Bea mad sometimes. Sometimes if I was happy, she'd be furious.\" After Arthur's death in 2009, White said, \"I knew it would hurt, I just didn't know it would hurt this much.\" Despite their differences, The Golden Girls was a positive experience for both actresses and they had great mutual respect for the show, their roles, and the achievements made as an ensemble cast.White was originally offered the role of Blanche in The Golden Girls, and Rue McClanahan was offered the role of Rose (the two characters being similar to roles they had played in Mary Tyler Moore and Maude, respectively). Jay Sandrich, the director of the pilot, suggested that since they had played similar roles in the past, they should switch roles, Rue McClanahan later said in a documentary on the series. White originally had doubts about her ability to play Rose, until Sandrich explained to her that Rose was \"terminally naive\". White says \"if you told Rose you were so hungry you could eat a horse, she'd call the ASPCA.\"The Golden Girls ended in 1992 after Arthur announced her decision to depart the series. White, McClanahan, and Getty reprised their roles as Rose, Blanche, and Sophia in the spin-off The Golden Palace. The series was short-lived, lasting only one season. In addition, White reprised her Rose Nylund character in guest appearances on the NBC shows Empty Nest and Nurses, both set in Miami."}, {"text": "=== 1993–2009: Continued roles ===After The Golden Palace ended, White guest-starred on a number of television programs including Suddenly Susan, The Practice, and Yes, Dear where she received Emmy nominations for her individual appearances. She won an Emmy in 1996 for Outstanding Guest Actress in a Comedy Series, appearing as herself on an episode of The John Larroquette Show. In that episode, titled \"Here We Go Again\", a parody on Sunset Boulevard, a diva-like White convinces Larroquette to help write her memoir. At one point Golden Girls co-stars McClanahan and Getty appear as themselves. Larroquette is forced to dress in drag as Bea Arthur, when all four appear in public as the \"original\" cast members.  White also appeared in films  such as Lake Placid (1999) and Bringing Down the House (2003) during this time."}, {"text": "=== 1993–2009: Continued roles ===In December 2006, White joined the soap opera The Bold and the Beautiful in the role of Ann Douglas (where she would make 22 appearances), the long-lost mother of the show's matriarch, Stephanie Forrester, played by Susan Flannery. She also began a recurring role in ABC's Boston Legal from 2005 to 2008 as the calculating, blackmailing gossip-monger Catherine Piper, a role she originally played as a guest star on The Practice in 2004.White appeared several times on The Tonight Show with Jay Leno and The Late Late Show with Craig Ferguson appearing in many sketches and returned to Password in its latest incarnation, Million Dollar Password, on June 12, 2008, (episode #3), participating in the Million Dollar challenge at the end of the show. On May 19, 2008, she appeared on The Oprah Winfrey Show, taking part in the host's Mary Tyler Moore Show reunion special alongside every surviving cast member of the series."}, {"text": "=== 1993–2009: Continued roles ===Beginning in 2007, White was featured in television commercials for PetMed Express, highlighting her interest in animal welfare."}, {"text": "==== The Proposal (2009) ====In 2009, White starred in the romantic comedy The Proposal alongside Sandra Bullock and Ryan Reynolds. Also in 2009, the candy company Mars, Incorporated launched a global campaign for their Snickers bar; the campaign's slogan was: \"You're not you when you're hungry\". White appeared, alongside Abe Vigoda, in the company's advertisement for the candy during the 2010 Super Bowl XLIV. The advertisement became very popular, and won the top spot on the Super Bowl Ad Meter."}, {"text": "=== 2010–2021: Career resurgence ===Following the success of the Snickers advertisement, a grassroots campaign on Facebook called \"Betty White to Host SNL (Please)\" began in January 2010. The group was approaching 500,000 members when NBC confirmed on March 11, 2010, that White would in fact host Saturday Night Live on May 8. The appearance made her, at age 88, the oldest person to host the show, beating Miskel Spillman, the winner of SNL's \"Anybody Can Host\" contest, who was 80 when she hosted in 1977. In her opening monologue, White thanked Facebook and joked that she \"didn't know what Facebook was, and now that I do know what it is, I have to say, it sounds like a huge waste of time.\" The appearance earned her a 2010 Primetime Emmy Award for Outstanding Guest Actress in a Comedy Series. White and Jean Smart are the only actresses to have wins in all three comedy Emmy categories."}, {"text": "==== Hot in Cleveland (2010–2015) ====In June 2010, White took on the role of Elka Ostrovsky, the house caretaker on TV Land's original sitcom Hot in Cleveland along with Valerie Bertinelli, Jane Leeves, and Wendie Malick. Hot in Cleveland was TV Land's first attempt at a first-run scripted comedy (the channel has rerun other sitcoms since its debut). White was only meant to appear in the pilot of the show but was asked to stay on for the entire series. In 2011, she was nominated for a Primetime Emmy Award for Outstanding Supporting Actress in a Comedy Series for her role as Elka, but lost to Julie Bowen for Modern Family. The series ran for six seasons, a total of 128 episodes, with the hour-long final episode airing on June 3, 2015.White also starred in the Hallmark Hall of Fame presentation of The Lost Valentine on January 30, 2011 (this presentation garnered the highest rating for a Hallmark Hall of Fame presentation in the previous four years and according to the Nielsen Media Research TV rating service won first place in the prime time slot for that date), and from 2012 to 2014, White hosted and executive produced Betty White's Off Their Rockers, in which senior citizens play practical jokes on the younger generation. For this show, she received three Emmy nominations."}, {"text": "==== Hot in Cleveland (2010–2015) ====A Betty White calendar for 2011 was published in late 2010. The calendar features photos from White's career and with various animals. She also launched her own clothing line on July 22, 2010, which features shirts with her face on them. All proceeds go to various animal charities she supported.White's success continued in 2012 with her first Grammy Award for Best Spoken Word Recording for her bestseller If You Ask Me. She also won the UCLA Jack Benny Award for Comedy, recognizing her significant contribution to comedy in television, and was roasted at the New York Friars Club. A television special, Betty White's 90th Birthday Party, aired on NBC a day before her birthday on January 16, 2012. The show featured appearances of many stars whom White worked with over the years as well as a message from then sitting president Barack Obama. In January 2013, NBC once again celebrated White's birthday with a TV special featuring celebrity friends, including former president Bill Clinton; the special aired on February 5.On February 15, 2015, White made her final appearance on Saturday Night Live when she attended the 40th Anniversary Special. She participated in \"The Californians\" sketch alongside members of the current SNL cast as well as Bill Hader, Taylor Swift and Kerry Washington. In the memorable sketch White ends up kissing Bradley Cooper.On August 18, 2018, White's career was celebrated in a PBS documentary called Betty White: First Lady of Television. The documentary was filmed over a period of ten years, and featured archived footage and interviews from colleagues and friends. In 2019, White appeared in Pixar's Toy Story 4, providing the voice of Bitey White, a toy tiger that was named after her. The other toys she shared a scene with were named and played by Carol Burnett, Carl Reiner, and Mel Brooks. White commented that \"It was wonderful the way they incorporated our names into the characters ... And I'm a sucker for animals, so the tiger was perfect!\""}, {"text": "==== Betty White: A Celebration (2022) ====In December 2021, before White's death, it was announced that a new documentary-style film about her, Betty White: A Celebration would be released in U.S. theatres on what would have been her 100th birthday, January 17, 2022. It features a cast of friends including Ryan Reynolds, Tina Fey, Robert Redford, Lin-Manuel Miranda, Clint Eastwood, Morgan Freeman, Jay Leno, Carol Burnett, Craig Ferguson, Jimmy Kimmel, Valerie Bertinelli, James Corden, Wendie Malick, and Jennifer Love Hewitt. In addition to the planned documentary, People magazine featured her as the cover story of its January 10, 2022, newsstand publication and a separate commemorative edition to celebrate the anticipated milestone, which were released days before her death.Following White's death, producers Steve Boettcher and Mike Trinklein of the event distributors Fathom Events announced in a Facebook post that the pre-filmed production would be going ahead as scheduled."}, {"text": "== Achievements and honors ==White won five Primetime Emmy Awards, two Daytime Emmy Awards (including the 2015 Daytime Emmy for Lifetime Achievement), and received a Los Angeles Emmy Award in 1952. White was the first woman to have received an Emmy in all performing comedic categories, and also holds the record for longest span between Emmy nominations for performances—her first was in 1951 and her last was in 2014, a span of over 60 years. In 2015, she received the Lifetime Achievement Daytime Emmy. She also won three American Comedy Awards (including a Lifetime Achievement Award in 1990), and two Viewers for Quality Television Awards. She was inducted into the Television Hall of Fame in 1995 and has a star on the Hollywood Walk of Fame at Hollywood Boulevard alongside the star of her late husband Allen Ludden. In 2009, White received the TCA Career Achievement Award from the Television Critics Association."}, {"text": "== Achievements and honors ==In 1955 she was named the honorary Mayor of Hollywood. White was the recipient of The Pacific Pioneer Broadcasters Golden Ike Award and the Genii Award from the Alliance for Women in Media in 1976. The American Comedy Awards awarded her the award for Funniest Female in 1987 as well as the list of lifetime achievement awards in 1990.The American Veterinary Medical Association awarded White with its Humane Award in 1987 for her charitable work with animals. The City of Los Angeles further honored her for her philanthropic work with animals in 2006 with a bronze commemorative plaque near the Gorilla Exhibit at the Los Angeles Zoo. The City of Los Angeles named her \"Ambassador to the Animals\" at the dedication ceremony.In September 2009, the Screen Actors Guild (SAG) announced plans to honor White with the Screen Actors Guild Life Achievement Award at the 16th Screen Actors Guild Awards. Actress Sandra Bullock presented White with the award on January 23, 2010, at the ceremony, which took place at the Shrine Auditorium in Los Angeles. She was a Kentucky Colonel. In 2009, White and her Golden Girls cast mates Bea Arthur, Rue McClanahan, and Estelle Getty were awarded Disney Legends awards. White was inducted into the California Hall of Fame in December 2010. In 2010, she was chosen as the Associated Press's Entertainer of the Year.On November 9, 2010, the USDA Forest Service, along with Smokey Bear, made White an honorary forest ranger, fulfilling her lifelong dream. White said in previous interviews that she wanted to be a forest ranger as a little girl but that women were not allowed to do that then. When White received the honor, more than one-third of Forest Service employees were women.In January 2011, White received a SAG Award for Outstanding Performance by a Female Actor in a Comedy Series for her role as Elka Ostrovsky in Hot in Cleveland. The show itself was also nominated for an award as Outstanding Performance by an Ensemble in a Comedy Series, but it lost to the cast of Modern Family. She won the same award again in 2012 and later received a third nomination.In October 2011, White was awarded an honorary degree and a white doctor's coat by Washington State University at the Washington State Veterinary Medical Association's centennial gala in Yakima, Washington.A 2011 poll conducted by Reuters and Ipsos revealed that White was considered the most popular and most trusted celebrity among Americans, beating the likes of Denzel Washington, Sandra Bullock, and Tom Hanks.In 2017, after 70 years in the industry, White was invited to become a member of the Academy of Motion Picture Arts and Sciences. At age 95, this made her the oldest new member at the time."}, {"text": "== Personal life ==While volunteering with the American Women's Voluntary Services, White met Air Force P-38 pilot Dick Barker. After the war, they were married in 1945 and moved to Belle Center, Ohio, where Barker owned a chicken farm; he wanted to embrace a simpler life, but White did not enjoy doing so. They returned to Los Angeles and divorced within a year. She married Hollywood talent agent Lane Allen in 1947, and they divorced in 1949 because he wanted to start a family but she wanted to focus on her career rather than having children.On June 14, 1963, White married television host Allen Ludden, whom she had met as a celebrity guest on his game show Password in 1961. Her legal name was changed to Betty Marion Ludden. He proposed to her at least twice before she accepted, and they remained married until he died from stomach cancer in Los Angeles on June 9, 1981. The couple appeared together in an episode of The Odd Couple featuring Felix's and Oscar's appearance on Password.Writer John Steinbeck was in White and Ludden's group of high-profile friends, and White wrote about the friendship in her 2011 book If You Ask Me (And of Course You Won't). Ludden had attended the same school as actress Elaine Anderson (Steinbeck's future wife) and Steinbeck later gave an early draft of his Nobel Prize in Literature acceptance speech to Ludden as a birthday gift. The couple also had a close friendship with blind musician and motivational speaker Tom Sullivan, whom they had met in 1968 while Sullivan was singing in a small club at the same time that White and Ludden were performing in a play on Cape Cod. White and Sullivan co-wrote a book, Leading Lady, about Sullivan's first seeing eye dog, who lived with White after being retired.White and Ludden had no children together, though she was the stepmother of his three children with Margaret McGloin Ludden, who had died of cancer in 1961. During an interview on Larry King Live, she was asked why she never remarried after Ludden's death. She replied, \"Once you've had the best, who needs the rest?\" When asked by James Lipton on Inside the Actors Studio in 2010 what she would like God to say to her if Heaven exists, she replied, \"Come on in, Betty. Here's Allen.\"White attended the Unity Church, part of the New Thought movement."}, {"text": "== Death ==On December 25, 2021, White suffered a stroke. On the morning of December 31, she died in her sleep at her home in the Brentwood neighborhood of Los Angeles at the age of 99. Her remains were cremated.White's death was met with statements of sympathy and tributes from many people and organizations around the world. The United States Army released a statement as White had volunteered with the American Women's Voluntary Services during World War II. The Martin Luther King Jr. Center also offered their condolences and praised White for her early support of racial equality. There were additional tributes from numerous media organizations, entertainers, political commentators, sports teams, politicians, and other public figures. White's star on the Hollywood Walk of Fame was flooded with flowers and tributes within hours of the announcement of her death.White's two California homes in Brentwood and Carmel were sold in April and June 2022 respectively, with her personal belongings sold at auction that September and proceeds donated to several charities. Her estate also donated a substantial portion of her television memorabilia to the National Comedy Center, including wardrobe pieces, annotated notes, and five of her Emmy Awards."}, {"text": "=== Animal welfare ===White was a pet enthusiast and animal welfare advocate, who worked with organizations including the Los Angeles Zoo Commission, The Morris Animal Foundation, African Wildlife Foundation, and Actors and Others for Animals. Her interest in animal welfare began in the early 1970s while she was producing and hosting the syndicated series The Pet Set, which spotlighted celebrities and their pets. As of 2009, White was the president emerita of the Morris Animal Foundation, where she served as a trustee of the organization beginning in 1971. She was a member of the board of directors of the Greater Los Angeles Zoo Association since 1974. Additionally, White served the association as a Zoo Commissioner for eight years.According to the Los Angeles Zoo & Botanical Garden's ZooScape member newsletter, White hosted \"History on Film\" from 2000 to 2002. White donated nearly $100,000 to the zoo in the month of April 2008 alone. White served as a judge at the 2011 American Humane Hero Dog Awards ceremony.White served as a judge alongside Whoopi Goldberg and Wendy Diamond for American Humane's Hero Dog Awards on the Hallmark Channel on November 8, 2011."}, {"text": "=== Racial equality ===In 1954, as The Betty White Show became national across the United States, White was criticized by many in the Southern states for having Arthur Duncan, a Black tap dancer, on her variety show and was asked to remove him. In the 2018 documentary Betty White: First Lady of Television, White recalled threats to take the show off-air \"if we didn't get rid of Arthur, because he was Black.\" She refused, saying \"he stays, live with it\".In 2017, sixty-three years after the show was canceled, Duncan appeared as a surprise guest on the series premiere of the reality talent series Little Big Shots: Forever Young, where he performed and reunited with White, later thanking her again for her support."}, {"text": "=== LGBT rights ===A supporter and advocate of LGBT rights, White said in 2010, \"If a couple has been together all that time – and there are gay relationships that are more solid than some heterosexual ones – I think it's fine if they want to get married. I don't know how people can get so anti-something. Mind your own business, take care of your affairs, and don't worry about other people so much.\" In a 2011 interview, she revealed that she always knew her close friend Liberace was gay and that she sometimes accompanied him to premieres to help him hide it."}, {"text": "== Discography ==In September 2011, White teamed up with English singer Luciana to produce a remix of her song \"I'm Still Hot\". The song was released digitally on September 22 and the video later premiered on October 6. It was made for a campaign for a life settlement company, The Lifeline Program, and it is her only commercial single to date, peaking at number 1 on the Dance Club Songs chart. White also covered songs on her live television shows, such as \"Nevertheless I'm in Love with You\", \"It's a Good Day\", \"Getting to Know You\" and \"A 'No' That Sounds like 'Yes'\"."}, {"text": "== Bibliography ==White published several books. In August 2010, she entered a deal with G.P. Putnam's Sons to produce two more books, the first of which, If You Ask Me (And of Course You Won't), was released in 2011. In February 2012, White received a Grammy Award for Best Spoken Word Recording for the audio recording of the book."}, {"text": "=== Books ===Betty White's Pet-Love: How Pets Take Care of Us. W. Morrow. 1983."}, {"text": "=== Books ===Betty White in Person. Doubleday. 1987."}, {"text": "=== Books ===The Leading Lady: Dinah's Story. Bantam Books. 1991. ISBN 9780385421683. (with Tom Sullivan)"}, {"text": "=== Books ===Here We Go Again: My Life In Television. Scribner. 1995. ISBN 9780684800424."}, {"text": "=== Books ===Together: A Novel of Shared Vision. Center Point Pub. 2008. ISBN 9781602852488. (with Tom Sullivan)"}, {"text": "=== Books ===If You Ask Me (And of Course You Won't). Penguin. 2011. ISBN 9781101514467."}, {"text": "=== Books ===Betty & Friends: My Life at the Zoo. Penguin. 2011. ISBN 9781101558928."}, {"text": "=== Audiobooks ===2004: Here We Go Again (read by the author) ISBN 978-1451613698"}, {"text": "=== Audiobooks ===2011: If You Ask Me: (And of Course You Won't) (read by the author), Penguin Audio, ISBN 978-0-1424-2936-5"}, {"text": "== Further reading ==Tucker, David C. (2007). The Women Who Made Television Funny: Ten Stars of 1950s Sitcoms. Jefferson, NC: McFarland. ISBN 978-0-7864-2900-4"}, {"text": "== Further reading ==Armstrong, Jennifer (2021). When women invented television: the untold story of the female powerhouses who pioneered the way we watch today. New York: Harper, an imprint of HarperCollinsPublishers. ISBN 978-0-06-297330-6. OCLC 1241185819."}, {"text": "== Further reading ==Bernstein, Paula (October 5, 2021). How to Be Golden: Lessons We Can Learn from Betty White. Running Press. ISBN 978-0-7624-7460-8."}, {"text": "== Further reading ==Stoner, Andrew E. (2012). Betty White: The First 90 Years. Blue River Press. ISBN 978-1-935628-23-1."}, {"text": "== External links == "}, {"text": "== External links ==Betty White at IMDb"}, {"text": "== External links ==Betty White at Emmys.com"}, {"text": "== External links ==Betty White at The Interviews: An Oral History of Television"}, {"text": "== External links ==Betty White: Celebrating 60 Years (August 7, 2008)"}]