[{"text": "William  Paxton (May 17, 1955 – February 25, 2017) was an American actor and filmmaker. He starred in films such as Aliens (1986), Near Dark (1987), Tombstone (1993), True Lies (1994), Apollo 13 (1995), Twister (1996), Titanic (1997), Mighty Joe Young (1998), and A Simple Plan (1998). He had supporting roles in Weird Science (1985), Edge of Tomorrow (2014), and Nightcrawler (2014)."}, {"text": "Paxton starred in the HBO drama series Big Love (2006–2011), for which he earned three Golden Globe Award nominations during the show's run. He was nominated for a Primetime Emmy Award and a Screen Actors Guild Award for portraying Randall McCoy in the History channel miniseries Hatfields & McCoys (2012)."}, {"text": "== Early life ==Bill Paxton was born in Fort Worth, Texas, on May 17, 1955, the son of Mary Lou (née Gray; 1926–2016) and John Lane Paxton (1920–2011). His mother was a Roman Catholic who raised him and his siblings in her faith. His father was a businessman, lumber wholesaler, museum executive, and (during his son's career) an occasional actor, notably appearing in Sam Raimi's Spider-Man films as Bernard Houseman and alongside Paxton in A Simple Plan (1998). Paxton was of Austrian, Dutch, English, French, German, Norwegian, Irish,  Scotch-Irish, Scottish, Swiss, and Welsh descent. His great-great-grandfather was Elisha Franklin Paxton (1828–1863), a brigadier general in the Confederate Army during the Civil War who was killed commanding the Stonewall Brigade at the Battle of Chancellorsville."}, {"text": "== Early life ==Paxton is distantly related to actress Sara Paxton and was the great-nephew of Mary Paxton Keeley, a prominent journalist and close friend of Bess Truman. At the age of eight, he was in the crowd when President John F. Kennedy emerged from the Hotel Texas in Fort Worth on the morning of his assassination on November 22, 1963. Photographs of Paxton being lifted above the crowd are on display at the Sixth Floor Museum at Dealey Plaza in Dallas, Texas. He later co-produced the film Parkland about the assassination. He graduated from Arlington Heights High School in Fort Worth in 1973, after which he studied at Richmond College in London, alongside his old high-school friend Danny Martin. There, they met fellow Texas native Tom Huckabee, with whom they made Super 8 short films for which they built their own sets. One of Paxton's first lead roles was in Huckabee's experimental film Taking Tiger Mountain. Paxton subsequently moved to Los Angeles, where he worked in props and art departments and as a parking valet at the Beverly Hills Hotel. After being rejected by film schools in Southern California, he switched his ambitions from directing to acting."}, {"text": "=== Acting and filmmaking ===Among Paxton's earliest roles were as a mortuary assistant in Mortuary (1983), a minor role as a punk in The Terminator (1984), a minor role as a bartender in Streets of Fire, a supporting role as the lead protagonist's bullying older brother Chet Donnelly in John Hughes's Weird Science (1985), and Private William Hudson in Aliens (1986)."}, {"text": "=== Acting and filmmaking ===He directed several short films, including the music video for Barnes & Barnes's novelty song \"Fish Heads\", which aired during Saturday Night Live's low-rated 1980–81 season and was in heavy rotation during the early days of Canadian music channel MuchMusic. He was cast in a music video for the 1982 Pat Benatar song \"Shadows of the Night\" in which he appeared as a Nazi radio officer."}, {"text": "=== Acting and filmmaking ===In 1981, Paxton worked in the movie Stripes as a soldier, in the bar scene with John Candy and Bill Murray."}, {"text": "=== Acting and filmmaking ===He worked alongside Arnold Schwarzenegger in James Cameron's  The Terminator (1984) and in Commando (1985) and True Lies (1994). He reunited with Cameron on Aliens (1986). His performance in the latter film as Private Hudson earned him the Saturn Award for Best Supporting Actor.He also appeared in Weird Science (1985). In 1987, Paxton played the most psychotic of the vampires, Severen, in Kathryn Bigelow's critically acclaimed neo-Western horror film, Near Dark."}, {"text": "=== Acting and filmmaking ===In 1990, Paxton appeared in Predator 2 (1990). He collaborated with James Cameron again on True Lies (1994) and Titanic (1997), the latter of which was the highest-grossing film of all time at its release. In his other roles, Paxton played Morgan Earp in Tombstone (1993), Fred Haise in Apollo 13 (1995), Bill Harding in Twister (1996), and lead roles in dark dramas such as One False Move (1992) and A Simple Plan (1998). In 1990, he co-starred with Charlie Sheen and Michael Biehn in Navy Seals."}, {"text": "=== Acting and filmmaking ===Paxton also appeared in Indian Summer (1993) and Mighty Joe Young (1998). After 2000, he appeared in U-571 (2000), Vertical Limit (2000), Frailty (2001), Broken Lizard's Club Dread (2004), Thunderbirds (2004), Edge of Tomorrow (2014) and Nightcrawler (2014)."}, {"text": "=== Acting and filmmaking ===Paxton directed the feature films Frailty (2001), in which he also starred, and The Greatest Game Ever Played (2005). Four years after appearing in Titanic, he joined Cameron on an expedition to the wreck of the Titanic. A film about this trip, Ghosts of the Abyss was released in 2003. He also appeared in the music video for Limp Bizkit's 2003 song \"Eat You Alive\" as a sheriff. In addition, Paxton also played a character in both Spy Kids 2 and Spy Kids 3-D."}, {"text": "=== Acting and filmmaking ===His highest-profile television performances received much positive attention, including his lead role in HBO's Big Love (2006–2011), for which Paxton received three Golden Globe Award nominations. He also received positive reviews for his performance in the History Channel's miniseries Hatfields & McCoys (2012), for which he was nominated for an Emmy Award alongside co-star, Kevin Costner."}, {"text": "=== Acting and filmmaking ===In 2014, he played the role of the villainous John Garrett in Agents of S.H.I.E.L.D., and a supporting role in Edge of Tomorrow (2014). He starred alongside Jon Bernthal, Rose McGowan and John Malkovich as a playable character in the 2014 video game Call of Duty: Advanced Warfare (downloadable \"Exo Zombies\" mode). Paxton starred as General Sam Houston in the Western miniseries Texas Rising for The History Channel in 2015."}, {"text": "=== Acting and filmmaking ===In February 2016, Paxton was cast as Detective Frank Rourke for Training Day, a crime-thriller television series set 15 years after the events of the eponymous 2001 movie. It premiered a year later. His final film appearance was in The Circle (2017), released two months after his death."}, {"text": "=== Music ===In 1982, Paxton and his friend Andrew Todd Rosenthal formed a new wave musical band called Martini Ranch. The band released its only full-length album, Holy Cow, in 1988 on Sire Records. The album was produced by Devo member Bob Casale, and featured guest appearances by two other members of that band. The music video for the band's single \"Reach\" was directed by James Cameron. In 2018, his performances as Peter \"Coconut Pete\" Wabash in Broken Lizard's Club Dread were released posthumously on the album Take Another Hit: The Best of Coconut Pete."}, {"text": "== Personal life ==Paxton married Kelly Rowan in 1979 and they divorced a year later. He later met Louise Newbury on the Number 37 bus in Twickenham, London, where she was a student, and they were married in 1987. They lived in Ojai, California, and had two children: son James (born 1994), who also became an actor, and daughter Lydia (born 1997)."}, {"text": "== Health problems and death ==In early 2017, Paxton stated in an interview on WTF with Marc Maron that he had a damaged aortic heart valve, resulting from rheumatic fever that he contracted as a child. On February 14, 2017, he underwent open-heart surgery at Cedars-Sinai Medical Center in Los Angeles to repair the damaged valve and correct an aortic aneurysm. A day later, he underwent an emergency second surgery to repair a damaged coronary artery. His condition deteriorated over the following 10 days, and he died of a stroke on February 25 at the age of 61. He was cremated and his ashes were buried at the Forest Lawn Memorial Park of Hollywood Hills.One year after Paxton's death, his family filed a wrongful death lawsuit against Ali Khoynezhad, the surgeon who performed his operation, alleging that Khoynezhad used \"high-risk and unconventional\" methods and that he was not present in the operating room when Paxton developed complications such as ventricular dysfunction, tachycardia, and a compromised right coronary artery, which they claim contributed to the coronary artery damage that necessitated a second surgery and ultimately led to Paxton's death. The case was set for trial in Los Angeles Superior Court in March 2022. In February 2022, Paxton's family reached a partial settlement with General Anesthesia Specialists Partnership for $1 million. In August 2022, the case was settled against Cedars-Sinai and Khoynezhad under undisclosed terms."}, {"text": "=== Public figures ===Many dozens of filmmakers and actors across the entertainment spectrum paid tribute to Paxton in the aftermath of his death.On February 26, 2017, while introducing the annual In Memoriam segment at the 89th Academy Awards the day after Paxton's death, a visibly emotional Jennifer Aniston paid tribute to him. His Big Love co-star Chloë Sevigny remembered him as \"one of the less cynical, jaded people [she'd] ever met in the business\" and said, \"He believed in entertainment being transportive and transformative. He believed in the magic of what we can bring to people. That was really a gift that he gave to me.\" The television show Agents of S.H.I.E.L.D. paid tribute at the end of its season-four episode \"What If...\", and a number of storm chasers paid tribute to his role in Twister by spelling out his initials \"BP\" via the Spotter Network."}, {"text": "=== Films ===The 2017 film Call Me by Your Name was dedicated to Paxton's memory. The film's producer, Peter Spears, explained that his husband Brian Swardstrom, who was also Paxton's best friend and agent, once visited the set with Paxton during filming and befriended the film's director Luca Guadagnino, who ultimately decided to dedicate the film \"in loving memory of Bill Paxton\". Close friend and frequent collaborator James Cameron wrote a tribute in an article for Vanity Fair, detailing their 36-year friendship and expressing regret over the projects they would not be able to make together. The 2019 John Travolta film The Fanatic, which co-starred Paxton's son James, was dedicated to Paxton. James would later play a younger version of Paxton's S.H.I.E.L.D. character in the final season, which served as a tribute to his role in the show. Cameron's 2022 film, Avatar: The Way of Water was dedicated to Paxton's memory, as well as to James Horner's, who previously worked with Cameron on Aliens, Titanic and the first Avatar. Paxton worked with both Cameron and Horner on the former two films. Cameron had hoped to cast Paxton in the Avatar sequels before his death."}, {"text": "== External links ==Bill Paxton at IMDb"}, {"text": "== External links ==Bill Paxton at AllMovie"}, {"text": "== External links ==Bill Paxton and Bill Paxton – Movie Director at The Numbers"}, {"text": "== External links ==Bill Paxton discography at Discogs"}]