[{"text": "Robert Lane Saget (May 17, 1956 – January 9, 2022) was an American stand-up comedian, actor, director, and television host. He portrayed Danny Tanner on the sitcom Full House (1987–1995) and its sequel Fuller House (2016–2020). Saget was the original host of America's Funniest Home Videos (1989–1997), and the voice of narrator Ted Mosby on the sitcom How I Met Your Mother (2005–2014). He was also known for his adult-oriented stand-up comedy, and his 2014 album That's What I'm Talkin' About was nominated for the Grammy Award for Best Comedy Album."}, {"text": "== Early life ==Robert Lane Saget was born into a Jewish family in Philadelphia, Pennsylvania, on May 17, 1956, the son of hospital administrator Rosalyn and supermarket chain executive Benjamin Saget. Early in his life, his family moved to Norfolk, Virginia, where he briefly attended Lake Taylor High School. He would later say that his sense of humor developed while he was a rebellious student at the Conservative synagogue Temple Israel in Norfolk. Due to a lack of family in Norfolk, he returned to Philadelphia for his bar mitzvah. The family later moved from Norfolk to the Encino neighborhood of Los Angeles, California, where Saget met Larry Fine of The Three Stooges and listened to him tell stories. The family then moved back to the Philadelphia area prior to his senior year, and he graduated from Abington Senior High School. Saget originally intended to become a doctor, but his Honors English teacher saw his creative potential and urged him to pursue an acting career."}, {"text": "== Early life ==Saget attended Temple University's film school, where he created Through Adam's Eyes, a black-and-white film about a boy who received reconstructive facial surgery; he received an award of merit in the Student Academy Awards. While attending university, he would take the train to New York City and perform at comedy clubs such as The Improv and Catch a Rising Star; his act included a section where he would play the Beatles song \"While My Guitar Gently Weeps\", using a water bottle to make his guitar appear to actually weep. He graduated from Temple with a BA in 1978. He intended to take graduate courses at the University of Southern California, but quit after only a few days. He later described himself at that time as a \"cocky, overweight 22-year-old\" who \"had a gangrenous appendix taken out, almost died, [and] got over being cocky or overweight\". He further discussed his burst appendix on Anytime with Bob Kushell, revealing that it happened on the Fourth of July at the UCLA Medical Center, and that surgeons put ice on the area for seven hours before taking his appendix out and finding that it had become gangrenous."}, {"text": "== Career ==Following a short stint as a member of CBS' The Morning Program in early 1987, Saget was cast as Danny Tanner in Full House, which became a success with family viewers, and landed in the Nielsen ratings' Top 30 beginning with season three. In 1989, Saget began as the host of America's Funniest Home Videos, a role he held until 1997. During the early 1990s, Saget worked on both Full House and AFV simultaneously. In 2009, he returned to AFV for the 20th-anniversary one-hour special co-hosted with Tom Bergeron."}, {"text": "== Career ==Saget directed the 1996 ABC television movie For Hope, which was inspired by the life story of his sister, Gay Saget, who had died from scleroderma three years earlier. In 1998, he directed his first feature film, Dirty Work, starring Norm Macdonald and Artie Lange. Released one year after he left his role as host of America's Funniest Home Videos, the film received broadly negative reviews from critics and earned low box office returns  However, it has since become a cult favorite, due partially to Artie Lange's later popularity on The Howard Stern Show where the film is sometimes mentioned, often in unflattering terms. In 1998, Saget made a cameo appearance as a cocaine addict in the stoner comedy Half Baked."}, {"text": "== Career ==In 2001, Saget took on another widowed-dad role, starring on Raising Dad on The WB. It co-starred Kat Dennings, Brie Larson, and Jerry Adler and lasted only one season, from October 5, 2001, to May 10, 2002. He served as the voice of the future Ted Mosby, who narrated the CBS sitcom How I Met Your Mother, which ran for nine seasons from September 19, 2005, to March 31, 2014. He was host of the NBC game show 1 vs. 100 from 2006 to 2008. His HBO comedy special, That Ain't Right, came out on DVD on August 28, 2007. It is dedicated to his father, Ben Saget, who died at age 89 on January 30, 2007, due to complications from congestive heart failure. From 2005 to 2010, Saget had a recurring role in four episodes of the HBO TV series Entourage playing a parody version of himself. He would later appear in the 2015 feature film based on the series. 2005 also saw him partake in \"Rollin' with Saget\", a song by Jamie Kennedy and Stuart Stone, about a night out with him that shows off his raunchier behaviors. The video appeared on the MTV series Blowin' Up, and he would come to use it as a pseudo-theme song on his stand-up tours and website."}, {"text": "== Career ==Saget wrote, directed, and starred in Farce of the Penguins, a parody of 2005's March of the Penguins, which was released direct-to-DVD, in January 2007. Saget appeared in the Broadway musical The Drowsy Chaperone for a limited four-month engagement. He played \"Man in Chair\" while Jonathan Crombie, who normally played the character on Broadway, was with the national tour of the musical. On January 4, 2008, Saget's caricature was unveiled at Sardi's Restaurant. In April 2009, he debuted in a new sitcom along with his co-star Cynthia Stevenson on ABC called Surviving Suburbia. The series, which was originally slated to air on The CW, ended after a single abbreviated season. In 2010, Saget starred in the A&E series Strange Days, in which he followed others in different activities and lifestyles, documenting their adventures in unusual ways."}, {"text": "== Career ==In 2014, his book Dirty Daddy was released, in which he writes about his career, comedy influences, and experiences with life and death. He embarked on a small tour in support of the book, including the Pemberton Music Festival, where he introduced Snoop Dogg prior to performing his own set. In the same year, he toured Australia for the first time with a stand-up show called Bob Saget Live: The Dirty Daddy Tour. The show was performed in the major cities of Melbourne, Sydney, Brisbane, and Perth."}, {"text": "== Career ==In 2015 and 2016, he guest-starred in two episodes of Grandfathered, starring and produced by his Full House co-star John Stamos. From 2016 to 2020, Saget reprised his role as Danny Tanner for fifteen episodes of Full House's sequel series, Fuller House, including the series premiere and finale."}, {"text": "== Career ==In 2017, he released another stand-up special, Bob Saget: Zero to Sixty."}, {"text": "== Career ==In 2019, he was announced as host of ABC's Videos After Dark. Saget also hosted the game show Nashville Squares on CMT, and made his first of three appearances as a panelist on To Tell the Truth."}, {"text": "== Career ==In 2020, Saget competed in season four of The Masked Singer as \"Squiggly Monster\". Saget also launched a podcast titled Bob Saget's Here for You with Studio71. Its 130th and final episode, with comedian Dane Cook, was released posthumously on January 31, 2022."}, {"text": "== Career ==He would also make an appearance on Nikki Glaser's E! series Welcome Home Nikki Glaser? in an episode that aired on June 5, 2022."}, {"text": "== Personal life ==Saget married Sherri Kramer in 1982, and they had three daughters before divorcing in 1997. He was later married to television presenter Kelly Rizzo from 2018 until his death in 2022."}, {"text": "== Personal life ==Saget was a board member of the Scleroderma Research Foundation. His efforts benefited celebrities such as actress Regina Hall. In an interview with Ability, he discussed how his sister was diagnosed with scleroderma at 43 and died at 47. She had previously been misdiagnosed numerous times."}, {"text": "== Death ==At about 4 p.m. ET on January 9, 2022, Saget was found dead in his room at a Ritz-Carlton hotel near Williamsburg in Orange County, Florida. At the time of his death, Saget was on a stand-up tour and had performed in Ponte Vedra Beach the previous evening. His funeral took place on January 14, and he was buried at Mount Sinai Memorial Park Cemetery near the graves of his parents and sister."}, {"text": "== Death ==An autopsy report released on February 9 found that Saget had blunt head trauma from an accidental blow to the back of his head, most likely from a fall, and had subsequently died from the resulting injuries (subdural hematoma and subarachnoid hemorrhage) in his sleep. He was infected with COVID-19 at the time, though there were no signs that it played a role in his death. On February 15, Saget's family sued to prevent county officials from releasing additional documents from the investigation of his death, arguing that their graphic content would present privacy violations. On March 14, a permanent injunction was issued against releasing the documents."}, {"text": "=== Tributes ===News of Saget's death broke during a broadcast of America's Funniest Home Videos, of which he was the original host, and the network interrupted the program to announce it. A tribute video was posted on the show's official YouTube channel, and a dedication to Saget was added before the credits of the following episode. Clips of Saget's hosting of the show were run from January 16 to the end of 2021–22 season on America's Funniest Home Videos as tribute as well."}, {"text": "=== Tributes ===Saget had been honored with donations and offers to help the charity Scleroderma Research Foundation (SRF), whose board of directors Saget served on since 2003. According to a statement made by the foundation's executive director on January 13, 2022, the foundation received donations from more than 1,500 donors from all over the world, totaling more than $90,000. Additionally, a donation of $1.5 million was awarded to the charity by one of its board members in the form of a grant, which will match every donation made in memory of Saget."}, {"text": "=== Tributes ===A tribute special was filmed at The Comedy Store by Saget's longtime friend Mike Binder on January 30; titled Dirty Daddy: The Bob Saget Tribute and featuring footage from a private memorial held at Jeff Franklin's home, it was released on Netflix on June 10, 2022."}, {"text": "== Book ==Saget, Bob. Dirty Daddy: The Chronicles of a Family Man Turned Filthy Comedian. 2014: It Books. ISBN 978-0-062-27478-6."}, {"text": "== External links ==Official website"}, {"text": "== External links ==Bob Saget at IMDb"}, {"text": "== External links ==Bob Saget discography at Discogs"}, {"text": "== External links ==\"Regina Hall Interview\". Ability Magazine. \"Regina Hall Issue\", April/May 2010"}, {"text": "== External links ==Bob Saget at the Internet Broadway Database"}, {"text": "== External links ==Bob Saget at Rotten Tomatoes"}, {"text": "== External links ==Bob Saget on Instagram"}, {"text": "== External links ==Bob Saget at Find a Grave"}]