[{"text": "Robert William Barker (December 12, 1923 – August 26, 2023) was an American media personality and animal rights advocate. He hosted CBS's The Price Is Right, the longest-running game show in North American television history, from 1972 to 2007. He also hosted Truth or Consequences from 1956 to 1975."}, {"text": "Born in Darrington, Washington, in modest circumstances, Barker spent most of his youth on the Rosebud Indian Reservation and was a citizen of the Rosebud Sioux Tribe. He joined the United States Navy Reserve during World War II. Barker worked part-time in radio while attending college. In 1950, he moved to California to pursue a broadcasting career. He was given his own radio show, The Bob Barker Show, which ran for six years. He began his game show career in 1956, hosting Truth or Consequences."}, {"text": "Barker began hosting The Price Is Right in 1972. He became an advocate for animal rights and of animal rights activism, supporting groups such as the United Activists for Animal Rights, People for the Ethical Treatment of Animals, and the Sea Shepherd Conservation Society. In 2007, Barker retired from hosting The Price Is Right after celebrating his 50-year career on television. Regarded as a pop culture icon, he continued to make occasional appearances for several years into his retirement until 2015."}, {"text": "== Early life ==Barker was born in Darrington, Washington, and spent most of his youth on the Rosebud Indian Reservation in Mission, South Dakota. The U.S. Indian Census Rolls, 1885–1940, list Barker as a citizen of the Rosebud Sioux Tribe, which the tribe publicly confirmed. His mother, Matilda (\"Tillie\") Valandra (née Matilda Kent Tarleton), was a schoolteacher; his father, Byron John Barker, was the foreman on the electrical high line through the state of Washington. As Barker's father was one-quarter Sioux, and his mother non-Native, Barker was one-eighth Sioux. Barker attended the grade school on the Rosebud Reservation where his mother was a teacher. He once said, \"I've always bragged about being part Indian, because they are a people to be proud of. And the Sioux were the greatest warriors of them all.\""}, {"text": "== Early life ==Barker met his future wife, Dorothy Jo Gideon, at an Ella Fitzgerald concert while he was attending high school in Missouri; they began dating when he was 15. He attended Drury College (now Drury University) in Springfield, Missouri, on a basketball athletic scholarship. He was a member of the Epsilon Beta chapter of Sigma Nu fraternity at Drury. He joined the United States Navy Reserve in 1943 during World War II to train as a fighter pilot, but did not serve in combat. On January 12, 1945, while on leave from the military, he married Dorothy Jo. After the war, he returned to Drury to finish his education, graduating summa cum laude with a degree in economics."}, {"text": "=== Broadcasting ===While attending college in Drury, Barker worked his first media job at KTTS-FM Radio in Springfield. He and his wife left Springfield and moved to Lake Worth Beach, Florida, and he was news editor and announcer at nearby WWPG 1340 AM in Palm Beach (now WPBR in Lantana). In 1950, he moved to California to advance his broadcasting career. He was given his own radio show, The Bob Barker Show, which ran for the next six years from Burbank. He was hosting an audience-participation radio show on KNX (AM) in Los Angeles when game show producer Ralph Edwards, who was looking for a new host to replace Jack Bailey on the daytime-television version of his long-running show, Truth or Consequences, happened to be listening and liked Barker's voice and style."}, {"text": "==== Truth or Consequences (1956–1975) ====Barker started hosting Truth or Consequences on December 31, 1956, and continued with the program until 1975."}, {"text": "==== The Price Is Right (1972–2007) ====In early 1972, Mark Goodson and Bill Todman began shopping a modernized revival of The Price Is Right, with Dennis James as host. NBC bought the Syndicated Nighttime version of the Show first with James at the helm. CBS expressed interest in the series. Due to a contractual obligation and the fact that James was already viewed as the \"NBC\" Host, CBS wanted Bob Barker as the daytime host. After some initial resistance, Barker instead offered to host another upcoming CBS game show, Jack Barry's The Joker's Wild (which had difficulty finding a host and was scheduled to debut the same day as Price) to allow James to host Price, but CBS rejected this proposal.(In December 1974 James stepped in to Host the Daytime version of the Show for 1 week when Barker was ill. This made Dennis James the only person to Host the Daytime CBS version and Nightime NBC version at the same time.)"}, {"text": "==== The Price Is Right (1972–2007) ====On September 4, 1972, Barker began hosting the CBS revival of The Price Is Right."}, {"text": "==== The Price Is Right (1972–2007) ====On October 15, 1987, Barker did what other MCs almost never did then: he stopped using hair dye and let his hair go gray, its natural color by that time."}, {"text": "==== The Price Is Right (1972–2007) ====Barker announced on October 31, 2006, that he would retire from The Price Is Right in June 2007. He taped his final episode on June 6, 2007, with the show airing twice on June 15; once in Daytime and once in Primetime. On October 15, 2007, Drew Carey took over hosting duties on the show."}, {"text": "==== The Price Is Right (1972–2007) ====After his retirement, Barker made three return appearances to The Price is Right. He first appeared on the episode that aired on April 16, 2009, to promote his new autobiography, Priceless Memories. He appeared in the Showcase round at the end of the show. Barker made another guest appearance on the show to celebrate his 90th birthday, which aired on December 12, 2013. He announced a contestant for the first time ever on the show, along with one showcase. Barker's last appearance was a surprise appearance on April 1, 2015, for an April Fools' Day switch where he took Carey's place at the show's intro. He hosted the first bid and pricing game of that day before handing the hosting duties back to Carey and later appeared during the showcase."}, {"text": "== Personal life ==Barker was married to Dorothy Jo Gideon from 1945 until her death from lung cancer at age 57 in 1981. From 1983 until his death, he was in a long-term relationship with Nancy Burnet, an admitted \"radical\" animal rights activist nearly 20 years younger than Barker. By mutual decision, Barker and Burnet were never married and lived in separate residences throughout their relationship. He had no children with either woman, stating that he had seen his friends who had poor relationships with their children and felt that he was too busy to properly raise a child; as of 2007, he stated that he had no regrets about his decision. From the late 2000s onward, Burnet described the relationship as a platonic friendship, even as Barker had become more interested in remarrying; she recalled a 2011 incident where Barker drafted a prenuptial agreement for her lawyer to review and revise as she felt fit, which she refused. Burnet managed Barker's health and diet in retirement."}, {"text": "=== Animal rights ===Barker was a vegetarian. In 1982, Barker began ending The Price Is Right episodes with the phrase: \"This is Bob Barker reminding you to help control the pet population – have your pets spayed or neutered.\" Though Barker had already been dabbling in animal rights before meeting Burnet, his efforts became more aggressive during his relationship with her."}, {"text": "=== Animal rights ===In 1987, Barker requested the removal of fur prizes for the Miss USA pageant and stepped down as host when the producers refused. In 1989, Barker and United Activists for Animal Rights publicly accused several media projects and the American Humane Association of animal mistreatment and condoning animal mistreatment, a tactic which resulted in a $10 million suit against him and the UAAR for libel, slander, and invasion of privacy. The suit was finally settled by the insurer in 1994."}, {"text": "=== Animal rights ===Barker founded DJ&T Foundation in 1994, named after his late wife and mother, which has contributed millions of dollars to animal-neutering programs and funded animal rescue and park facilities all over the United States. In 2004, Barker donated $1 million (equivalent to $1.6 million in 2023) to Columbia Law School to support the study of animal rights."}, {"text": "=== Animal rights ===In 2009, Barker wrote a letter about three businesses in Cherokee, North Carolina, asking them to close their bear exhibits. He threatened to not attend the 2009 Game Show Awards, where he was to receive a lifetime achievement award, because Betty White would be attending. Although he had previously worked with White, he was feuding with her over the treatment of an elephant at the Los Angeles Zoo. White instead did not attend and pre-recorded her comments that she was scheduled to make about another awardee, Mark Goodson. Also that year, Barker donated $1 million (equivalent to $1.4 million in 2021) to the University of Virginia Law School to support the study of animal rights. He made similar donations to Harvard Law School, Stanford Law School, Georgetown University Law Center, Duke University School of Law, Northwestern University Pritzker School of Law, and University of California, Los Angeles."}, {"text": "=== Animal rights ===In 2010, the Sea Shepherd Conservation Society announced that it had purchased and outfitted a ship to interdict Japanese whaling operations in the Southern Ocean using $5 million (equivalent to $7 million in 2023) provided by Barker. The ship was then named the MY Bob Barker, and its existence was first revealed when it helped discover the location of the Japanese whaling fleet."}, {"text": "=== Animal rights ===Barker participated in several PETA public service announcements over the years, including one that claimed that vegan diets prevent Alzheimer's disease. In 2010, he donated $2.5 million (equivalent to $3.5 million in 2023) toward the purchase of office space for the organization in Los Angeles. The Bob Barker Building opened in 2012."}, {"text": "=== Lawsuits ===In the late 1980s, Barker accused the American Humane Society and the United Activists for Animal Rights of condoning animal cruelty on the set of Project X and in several other media projects on the basis of allowing of a cattle prod and a gun on set, and a rumored beating of a chimpanzee on set. American Humane responded by suing Barker for $10 million, citing libel, slander and invasion of privacy. American Humane claimed that there had been a two-year \"vendetta\" against them behind the accusations. In a series of public advertisements along with the lawsuit, American Humane responded to Barker's claims that his allegations were made based on insufficient and misleading information. The suit was eventually settled by Barker's insurance company, which paid American Humane $300,000."}, {"text": "=== Lawsuits ===In 1994, former model Dian Parkinson filed a lawsuit against Barker alleging sexual harassment following a three-year affair while working on The Price Is Right. Parkinson, who alleged that she was extorted by threats of firing, later dropped her lawsuit, claiming the stress from the ordeal was damaging her health."}, {"text": "=== Lawsuits ===In 1995, model Holly Hallstrom left The Price Is Right and later filed suit against Barker, alleging that the reason she was fired was not so much because of her 14-pound (6.4 kg) medication-mediated weight gain (as documented) but because, to Barker's displeasure, she refused to give false information to the media regarding Parkinson's suit, as she alleges Barker had requested she do. Barker countersued for slander, but Hallstrom prevailed, receiving a settlement in 2005."}, {"text": "=== Lawsuits ===In October 2007, Deborah Curling, a CBS employee assigned to The Price Is Right, filed a lawsuit against CBS, Bob Barker, and The Price Is Right producers, claiming that she was forced to quit her job after testifying against Barker in a wrongful-termination lawsuit brought by a previous show producer. Curling claimed that she was demoted to an \"intolerable work environment\" backstage, which caused her to leave the job. Curling, who is black, also alleged that the show's producers, including Barker, created a hostile work environment in which black employees and contestants were discriminated against. A few months later, Barker was removed from the lawsuit, and in September 2009, the lawsuit was dismissed. Curling's attorney stated that he planned to appeal the dismissal of the lawsuit. In January 2012, the California Court of Appeals affirmed the dismissal."}, {"text": "=== Health and death ===On September 16, 1999, Barker was in Washington, D.C., to testify before Congress regarding proposed legislation that would ban captive elephants from traveling shows, such as circuses. While preparing for the presentation, Barker experienced what he called clumsiness in his right hand. He was admitted to George Washington University Hospital and diagnosed with a partially blocked left carotid artery. Barker underwent carotid endarterectomy to remove the blockage. The procedure went well enough that he was able to return to work within the month."}, {"text": "=== Health and death ===Three years later, Barker had two additional health crises after taping the 30th-season finale of The Price is Right. While lying in the sun on May 30, 2002, he experienced a stroke and was hospitalized; six weeks later, on July 11, Barker underwent prostate surgery. Both hospitalizations occurred at George Washington University Hospital in Washington, D.C. Both surgeries were successful."}, {"text": "=== Health and death ===Barker had several mild bouts with skin cancer, a result of his frequent tanning. He consulted a dermatologist regularly to make sure any cancers were caught and removed before they spread; they did not pose a threat to his life. During a televised interview, Barker told viewers, \"I urge anyone who has spent some time in the sun, whether you're doing it now or not, go to a dermatologist once a year.\""}, {"text": "=== Health and death ===On October 20, 2015, two police officers passing Barker's Los Angeles-area home saw him trip and fall on a sidewalk. They called an ambulance which took him to Cedars-Sinai Medical Center, where he received stitches for an injured forehead and was released; he also hurt his left knee."}, {"text": "=== Health and death ===Barker slipped and hit his head at home on June 19, 2017. His maid drove him to the emergency room, where he was checked and released. His representative said it was not as serious as his earlier fall. In October and November 2018, Barker was rushed to the hospital for severe back pain. Barker suffered another fall in January 2019, however he was not hospitalized. "}, {"text": "=== Health and death ===Barker's last public interview was with People in August 2021, in which he discussed The Price Is Right's upcoming 50th season on air. As of 2022, Burnet stated that other than some non-prescription supplements such as collagen and a meal replacement drink to replenish nutrients not found naturally in his vegetarian diet, he took only one prescription medication for hypothyroidism."}, {"text": "=== Health and death ===Barker died at his home in Los Angeles on August 26, 2023, at the age of 99 following several years with Alzheimer's disease, a condition that Burnet and Barker's publicity team had kept hidden from the public. Hypertension, hyperlipidemia and hypothyroidism were listed as secondary causes of death. He was interred alongside his wife at Forest Lawn Memorial Park – Hollywood Hills."}, {"text": "== Film and other TV appearances ==Barker appeared on Bonanza, playing a character named Mort in the 1960 episode \"Denver McKee\"."}, {"text": "== Film and other TV appearances ==Barker was a semi-regular panelist on the game shows Tattletales (1975–1976, with wife Dorothy Jo) and Match Game (1973–1980). Barker sat in Richard Dawson's former place during the first week of Dawson's permanent absence from Match Game."}, {"text": "== Film and other TV appearances ==In the 1970s, he was the host of the annual/biennial Pillsbury Bake-Off (the bake-off occurred every two years starting in 1976). In 1978, he was the first host to have a male category champ."}, {"text": "== Film and other TV appearances ==Barker co-hosted CBS's coverage of the Rose Parade from Pasadena, California, for several years during the 1970s and 1980s."}, {"text": "== Film and other TV appearances ==Barker appeared on various talk shows such as: Dinah!, Larry King Live, The Arsenio Hall Show, Crook & Chase, Donny & Marie, The Rosie O'Donnell Show, The Ellen DeGeneres Show, The Wayne Brady Show, the Late Show with David Letterman, and The Late Late Show with Craig Ferguson."}, {"text": "== Film and other TV appearances ==Barker also made cameo appearances on The Nanny and The Bold and the Beautiful, respectively in 1994 and 2002."}, {"text": "== Film and other TV appearances ==In 1996, Barker played himself in the Adam Sandler comedy Happy Gilmore. In one scene, Barker beats up Gilmore after an altercation arising from their teaming up in a Pro-Am Golf Tournament. In 2007, during a CBS prime-time special commemorating Barker's career, the fight scene from Happy Gilmore was shown, after which Sandler made a surprise appearance on stage to read a poem paying tribute to Barker. In 2015, during Comedy Central's \"Night of Too Many Stars\" benefit show to battle autism, Barker and Sandler reunited for a video featuring the two of them in a follow-up fight at the hospital, which ends with both of them dying and going to heaven."}, {"text": "== Film and other TV appearances ==About one year after his retirement from The Price Is Right, Barker appeared in a public service announcement promoting the transition to digital television in the United States. The advertisement was produced under the first proposed date of February 16, 2009, for the transition."}, {"text": "== Film and other TV appearances ==On September 7, 2009, Barker was a special guest host for WWE Raw (called \"The Price is Raw\") in Rosemont, Illinois. Aired during a period when nearly every episode of the weekly wrestling show featured a celebrity guest host, with mixed results, Barker's appearance has been ranked the best of nearly 80 hosts."}, {"text": "== Film and other TV appearances ==Barker agreed to be a rotating guest co-host on The Huckabee Show, a daily TV talk show hosted by Mike Huckabee. Barker first appeared on the show on July 29, 2010."}, {"text": "== Film and other TV appearances ==Barker appeared in a commercial for State Farm Insurance's \"Magic Jingle\" campaign, where he made \"a new car!\" appear for a woman whose previous car was totaled by a giant concrete cylinder."}, {"text": "== Film and other TV appearances ==Barker filmed a TV advertisement endorsing David Jolly, a candidate for the Republican Party nomination for the 2014 Florida's 13th congressional district special election. Jolly won the nomination and ultimately won the seat."}, {"text": "== Film and other TV appearances ==Barker voiced the character Bob Barnacle, a snail business owner on \"Sanctuary!\", an episode of the Nickelodeon animated series SpongeBob SquarePants."}, {"text": "== Film and other TV appearances ==Barker was honored after his death with an hour-long TV special celebrating his life. It aired on August 31, 2023."}, {"text": "== Film and other TV appearances ==Barker appeared on the show Futurama, acting as himself."}, {"text": "=== Daytime Emmy Awards ===Overall 19-time winner:"}, {"text": "=== Daytime Emmy Awards ===14-time winner of Daytime Emmy Award for Outstanding Game Show Host, as host of The Price Is Right"}, {"text": "=== Daytime Emmy Awards ===4-time winner of Daytime Emmy Award for Outstanding Game Show, as executive producer of The Price Is Right"}, {"text": "=== Daytime Emmy Awards ===Lifetime Achievement Award, presented at the 1999 Daytime Emmy Awards"}, {"text": "=== WWE ===2009 Slammy Award for Best Guest Host."}, {"text": "=== Media ===Bob Barker Studio at CBS Television City named in his honor."}, {"text": "=== Media ===Time magazine's Greatest Game Show Host of All-Time"}, {"text": "=== Media ===GSN Lifetime Achievement Award"}, {"text": "=== Halls of Fame ===Star on the Hollywood Walk of Fame"}, {"text": "=== Halls of Fame ===Television Hall of Fame (class of 2004)."}, {"text": "=== Halls of Fame ===NAB Broadcasting Hall of Fame (class of 2008)."}, {"text": "== Autobiography ==Barker's autobiography, Priceless Memories, written with former Los Angeles Times book review editor Digby Diehl, was published on April 6, 2009."}, {"text": "== See also ==List of animal rights advocates"}, {"text": "== External links ==Bob Barker at IMDb"}, {"text": "== External links ==Bob Barker at The Interviews: An Oral History of Television"}]