[{"text": "Brendan James Fraser ( FRAY-zər; born December 3, 1968) is an American-Canadian actor.  Fraser had his breakthrough in 1992 with the comedy Encino Man and the drama School Ties. He gained further prominence for his starring roles in the comedies With Honors (1994) and George of the Jungle (1997) and emerged as a star playing Rick O'Connell in The Mummy trilogy (1999–2008). He took on dramatic roles in Gods and Monsters (1998), The Quiet American (2002), and Crash (2004), and further fantasy roles in Bedazzled (2000) and Journey to the Center of the Earth (2008)."}, {"text": "Fraser's film work slowed from the late 2000s to mid-2010s due to the poor box office performances, and various health and personal problems, including the fallout from a sexual assault committed against him in 2003 by Philip Berk, the then-president of the Hollywood Foreign Press Association. Fraser branched into television with roles in the Showtime drama The Affair (2016–2017), the FX series Trust (2018), and the Max series Doom Patrol (2019–2023). His film career was revitalized by roles in Steven Soderbergh's No Sudden Move (2021) and Darren Aronofsky's The Whale (2022). Fraser's starring role as an obese gay man in the latter earned him critical acclaim and numerous accolades, including the Academy Award for Best Actor, becoming the first Canadian to win this category."}, {"text": "== Early life and education ==Fraser was born on December 3, 1968, in Indianapolis, Indiana, to Canadian parents Carol Mary (née Généreux; 1937–2016) and Peter Fraser. He is the youngest of their four sons. His mother was a sales counselor, and his father was a former journalist who worked as a Canadian foreign service officer for the Government Office of Tourism. His maternal uncle, George Genereux, was the only Canadian to win a gold medal in the 1952 Summer Olympics, at the Olympic Trap. Fraser's three older brothers are Kevin, Regan, and Sean. They have Irish, Scottish, German, Czech, and French-Canadian ancestry. He holds dual Canadian and American citizenship.Fraser's family moved often during his childhood, living in Eureka, California; Seattle, Washington; Ottawa, Ontario; the Netherlands; and Switzerland. He attended Upper Canada College, a private boarding school in Toronto. While on vacation in London, England, in the 1970s, he attended his first professional theatre show, Oliver!, in the West End, which began his interest in acting.Fraser graduated from Seattle's Cornish College of the Arts in 1990. He began acting at a small acting college in New York City. Fraser planned on studying toward a Master of Fine Arts in Acting from Southern Methodist University, but stopped in Hollywood on the way and decided to remain there to work in film."}, {"text": "=== 1991–1996: Rise to prominence ===In 1991, Fraser made his film debut with a small role as a seaman headed to Vietnam in Dogfight. He got his first leading film role alongside Sean Astin and Pauly Shore in the 1992 comedy film Encino Man, where he played a frozen pre-historic caveman who is thawed out in the present day. The film was a moderate box office success and has gained a cult following. That same year he starred in School Ties with fellow rising actors Matt Damon, Ben Affleck, and Chris O'Donnell as a Jewish star quarterback confronting embedded anti-semitism in private prep school society."}, {"text": "=== 1991–1996: Rise to prominence ===Between 1994 and 1996, he starred in several box office failures such as With Honors (1994) with Joe Pesci, Airheads (1994) with Steve Buscemi & Adam Sandler, The Passion of Darkly Noon (1995), Mrs. Winterbourne (1996) and The Twilight of the Golds (1997). He also had a small part in the 1995 film Now and Then. He made cameo appearances in the Pauly Shore films Son in Law (1993) and In the Army Now (1994), reprising his Encino Man role."}, {"text": "=== 1997–2000: International stardom ===He had his first major box office success with the 1997 comedy film George of the Jungle which was based on the animated series of the same title created by Jay Ward. He received critical acclaim for his dramatic role in 1998's Gods and Monsters, which was based on the life of James Whale (Ian McKellen), who directed Frankenstein. The film was written and directed by Bill Condon, and follows the loss of creativity, ambiguous sexuality and the bond between a heterosexual gardener (played by Fraser) and a homosexual, tortured and ailing filmmaker (played by McKellen)."}, {"text": "=== 1997–2000: International stardom ===He achieved his biggest commercial success when he portrayed the lead adventurer Rick O'Connell in the fantasy adventure film The Mummy (1999) and its sequel The Mummy Returns (2001). In between these successes, he also starred in the box office bombs Dudley Do-Right (1999) (which was based on another Jay Ward animated series) and the stop-motion/live-action fantasy comedy Monkeybone (2001); though he did have moderate success with the romantic comedy Blast from the Past (1999) and the fantasy comedy Bedazzled (2000), a remake of the 1967 British film of the same name. He lent his voice for the unreleased animated film Big Bug Man, with Marlon Brando."}, {"text": "=== 2001–2008: Dramatic and comedic roles ===Fraser starred as \"Brick\" in the West End production of Tennessee Williams's Cat on a Hot Tin Roof in September 2001, directed by Anthony Page. Castmates included Ned Beatty, Frances O'Connor and Gemma Jones. The show closed on January 12, 2002, with Fraser garnering many excellent reviews. In 2002, he starred alongside Michael Caine in the political drama The Quiet American which was well received by critics. The following year, he starred in the live-action/animated film Looney Tunes: Back in Action as its human lead, D.J. Drake (he also voiced the Tasmanian Devil). In 2004, he appeared as part of an ensemble cast in the Academy Award-winning film Crash."}, {"text": "=== 2001–2008: Dramatic and comedic roles ===He has also made guest appearances on the television shows Scrubs, King of the Hill, and The Simpsons. In March 2006, he was inducted into Canada's Walk of Fame, the first American-born actor to receive the honor. However, as of 2022, he does not have a star on the Hollywood Walk of Fame. After a six-year hiatus in the franchise, Fraser returned for the second sequel to The Mummy released in August 2008 and titled The Mummy: Tomb of the Dragon Emperor. Filming started in Montreal on July 27, 2007, and the film also starred Jet Li as Emperor Han. That same year, he starred in the 3D film adaptation of Jules Verne's Journey to the Center of the Earth and the fantasy film Inkheart (chosen personally for the lead role by the novel's author Cornelia Funke)."}, {"text": "=== 2009–2020: Career fluctuations ===In 2010, Fraser returned to Broadway in the production of Elling, but the play closed after one week, due to lackluster reviews. After appearing in the critically panned Furry Vengeance in 2010, Fraser moved from being represented by William Morris Endeavor to the Creative Artists Agency. In 2010, he starred in Whole Lotta Sole directed by Terry George and in 2011, he was set to play William Tell in The Legend of William Tell: 3D, directed by Eric Brevig, with whom Fraser had also worked in Journey to the Center of the Earth. Filming was delayed and late in 2011, Fraser sued the producer Todd Moyer for promised wages. Moyer later countersued for assault, which Fraser dismissed as [Moyer's] desperate attempt to avoid paying his debt. In 2013, he played an Elvis Presley impersonator in the ensemble black comedy Pawn Shop Chronicles.In 2016, Fraser replaced Ray Liotta in the Bollywood thriller Line of Descent. Fraser later joined the recurring cast of the television drama series The Affair during season 3 where he portrayed the misery-minded prison guard Gunther. He portrayed Getty family fixer James Fletcher Chace in the FX anthology series Trust, which premiered on March 25, 2018. Fraser portrayed Clifford \"Cliff\" Steele / Robotman in the Titans TV series, with Jake Michaels physically portraying Robotman. He reprised the role in the spin-off series Doom Patrol, where he voices the character and appears as Steele in flashbacks; Riley Shanahan – replacing Jake Michaels in Titans – physically portrays Robotman. This string of appearances led many publications to label his sudden comeback as the \"Brenaissance\"."}, {"text": "=== 2021–present: Critical acclaim ===In September 2020, Fraser was cast as gangster Doug Jones in Steven Soderbergh's period crime film No Sudden Move, which was released in 2021. In January 2021, Fraser was announced as the lead in Darren Aronofsky's film The Whale. The film premiered at the Venice International Film Festival in September 2022. Fraser spoke on preparing for the role with The New York Times stating, \"The Obesity Action Coalition gave me access to many people, so I could ask them their story on Zoom calls. I talked to maybe eight or 10 people — some bedridden, some perfectly mobile.\" Fraser's performance was highly praised and the film received a six-minute standing ovation at the festival and subsequently won him an Oscar for Best Actor. He became the first Canadian to win the best actor award.In August of the same year, Fraser was announced as part of the cast of Martin Scorsese's film Killers of the Flower Moon, as well as Max Barbakow's upcoming comedy film Brothers. In October 2021, Fraser was cast to portray the villain Firefly in the superhero film Batgirl, set in the DC Extended Universe; the release of the film was canceled in August 2022 after a change in Warner Bros. studio priorities.Fraser lent his voice to the audiodrama The Downloaded, written by Robert J. Sawyer, which was released in Autumn of 2023 as an Audible-exclusive audiobook. In December 2023, Fraser was a guest narrator at Disney's Candlelight Processional at Walt Disney World."}, {"text": "== Personal life ==Shortly after arriving in Los Angeles, Fraser met actress Afton Smith while attending a barbecue at Winona Ryder's house on July 4, 1993. They married on September 27, 1998, and have three sons. In a 2018 interview with GQ, Fraser revealed that his oldest son is on the autism spectrum.After their home in Beverly Hills, California sold in April 2007 for $3 million, Fraser's publicist announced in December 2007 that the couple had decided to divorce. Fraser was ordered to pay a monthly alimony sum of $50,000 for a period of ten years or until remarriage of Smith, whichever occurred first, in addition to the $25,000 monthly payment for child support. In early 2011, Fraser petitioned the courts for a reduction of his alimony payments, asserting that he was unable to meet the annual obligation of $600,000; he did not contest the child support payments. In late 2011, Smith accused Fraser of fraud by hiding financial assets and not disclosing film contracts for Extraordinary Measures and Furry Vengeance. In 2014, the court ruled against Fraser's request for a reduction in alimony and against Smith's allegation of fraud. Both parents were credited for being actively engaged in the lives of their sons."}, {"text": "== Personal life ==Fraser has been in a relationship with makeup artist Jeanne Moore since September 2022. The couple made their red carpet debut at the 2022 Venice Film Festival, and Fraser thanked Moore during his acceptance speech for the Oscar for Best Actor during the 95th Academy Awards.As of February 2018, Fraser lives in Bedford, New York.Fraser speaks French and serves on the board of directors for FilmAid International. He is an accomplished amateur photographer and has used several instant cameras in movies and on TV shows, most notably on his guest roles on Scrubs. In his first appearance, he used a Polaroid pack film, and on his second appearance, he used a Holga with a Polaroid back, a Japanese-only model. The book Collector's Guide to Instant Cameras has a dedication to Fraser. He is also an accomplished amateur archer."}, {"text": "=== Health ===In 2018, Fraser revealed the physical demands of the stunts and maneuvers he performed in his action and comedy roles eventually required him to undergo several surgeries over a period of seven years, including a partial knee replacement, a laminectomy, and vocal cord surgery."}, {"text": "=== Sexual assault allegation against Philip Berk ===In 2018, Fraser said that he had been sexually assaulted by Philip Berk, the then-president of the Hollywood Foreign Press Association (HFPA), the nonprofit organization that votes for the Golden Globe Awards, at a luncheon in 2003. Berk has described Fraser's account as a \"total fabrication\", but in his 2014 memoir, he admitted to having groped Fraser \"in jest\". The alleged assault, his subsequent divorce, and the death of his mother launched Fraser into a depression that, combined with his health problems, led to a break in his career.Several publications and social media users interpreted that Fraser was blacklisted from Hollywood because of his accusation against Berk. In the 2018 GQ piece where Fraser first publicly made the allegation, he said \"The phone does stop ringing in your career, and you start asking yourself why. There's many reasons, but was [this incident] one of them? I think it was.\" In contrast, Fraser also clarified in his 2019 appearance on the radio show Sway in the Morning, \"I don't think the HFPA really wield that much power.\" In 2022, Fraser told GQ that if he received a nomination by the HFPA at that year's Golden Globes for his latest film The Whale, he would \"not participate\" because of the \"history\" he has with the organization."}, {"text": "== Philanthropy ==Since 2018, Fraser has been a celebrity judge on the Dancing Stars of Greenwich annual charity gala which raises money for the non-profit organization Abilis, a local charity which supports more than 800 individuals and their families with disabilities in Fairfield County, Connecticut. His former wife, Afton Smith, also takes part in the dance competition. In 2022, Smith and Fraser received the Heart of Abilis Award for their support and fundraising work for the charity."}, {"text": "== External links ==Brendan Fraser – official site"}, {"text": "== External links ==Brendan Fraser at IMDb"}, {"text": "== External links ==Brendan Fraser at AllMovie"}, {"text": "== External links ==Brendan Fraser best movies – blog (archive)"}]