[{"text": "Brett Lorenzo Favre (  FARV; born October 10, 1969) is an American former football quarterback who played in the National Football League (NFL) for 20 seasons, primarily with the Green Bay Packers. Favre had 321 consecutive starts from 1992 to 2010, including 297 regular season games, the most in league history. He was also the first NFL quarterback to obtain 70,000 yards, 10,000 passes, 6,000 completions, 500 touchdowns, and victories over all 32 teams."}, {"text": "Favre played college football at the University of Southern Mississippi and was selected in the second round of the 1991 NFL draft by the Atlanta Falcons, where he spent one season as a backup. Traded to the Packers, he became their starter early in the 1992 season and revitalized a franchise that had been in a period of decline since the late 1960s. During his 16 seasons with Green Bay, he led the team to 11 playoff appearances, seven division titles, four NFC Championship Games, two consecutive Super Bowl appearances, and one championship title in Super Bowl XXXI, the team's first in nearly three decades. Favre was traded in 2008 to the New York Jets, where he played one year, and spent his final two seasons with the Minnesota Vikings. His 2009 campaign for the Vikings saw him guide them to a division title and NFC Championship Game appearance, while having one of his strongest statistical seasons."}, {"text": "At the time of his retirement, Favre was the NFL leader in passing yards, passing touchdowns, and quarterback wins, and holds the record for interceptions. From 1995 to 1997, he was named Most Valuable Player three times, the most the award was consecutively received. Favre also received 11 Pro Bowl and three first-team All-Pro selections. He was inducted to the Pro Football Hall of Fame in 2016."}, {"text": "In 2022, Favre began to face controversy for the Mississippi welfare funds scandal after investigations determined $8 million intended for welfare programs went to Favre or causes he championed. Favre has denied the allegations and filed a defamation lawsuit against the State Auditor of Mississippi and two media personalities over their coverage of him. "}, {"text": "== Early life ==Brett Favre was born in Gulfport, Mississippi, the son of Bonita Ann (née French) and Irvin Ernest Favre, and raised in the small town of Kiln. Both of his parents were schoolteachers in the Hancock County School District. He is of part French ancestry. One of his ancestors is Simon Favre, a Louisiana Creole and an influential figure in Spanish West Florida in the late 18th and early 19th centuries; Brett descends from Simon's Choctaw Native American mistress, Pistikiokonay, and thus his grandfather was affiliated with the Choctaw."}, {"text": "== Early life ==Brett was the second of four children and attended Hancock North Central High School, where he played baseball and football. Favre started for the Hancock North Central baseball team as an eighth-grader and earned five varsity letters. He played quarterback, lineman, strong safety, placekicker, and punter in a primarily option, run-oriented offense coached by his father, Irvin Favre, who was the head coach of the Hawks football team."}, {"text": "== Early life ==Irvin Favre said he knew his son had a great arm but also knew that the school had good running backs. As a result, in the three years Brett was on the team, his father ran the wishbone, a run-oriented offense. Favre rarely threw more than five passes in a game. Southern Mississippi assistant coach Mark McHale, who was scouting new football recruits for the school, watched Favre play during a Hancock North Central football game after receiving recommendation from many nearby coaches. McHale, observing Favre mostly hand the ball off in running plays in the two games he watched, was set on leaving when he suddenly saw Favre throw the ball in such a captivating way that he later described it by saying the ball \"had smoke and flames coming off it\"."}, {"text": "== College career ==After high school, Southern Mississippi offered Favre a football scholarship at the urging of assistant coach McHale, which was the only one he received. Southern Miss wanted him to play defensive back, but Favre wanted to play quarterback instead. Favre began his freshman year as the seventh-string quarterback and took over the starting position in the second half of the third game of the year against Tulane on September 19, 1987. Favre, despite suffering a hangover from the night before and vomiting during warm-ups, led the Golden Eagles to a come-from-behind victory with two touchdown passes. Favre started ten games during his freshman year and won six of them."}, {"text": "== College career ==In his junior season, Favre led the Golden Eagles to an upset of #6 Florida State on September 2, 1989. Favre capped a six-and-a-half-minute drive with the game-winning touchdown pass with 23 seconds remaining."}, {"text": "== College career ==On July 14, 1990, before the start of Favre's senior year at Southern Miss, he was involved in a nearly fatal car accident. When going around a bend a few tenths of a mile from his parents' house, Favre lost control of his car, which flipped three times and came to rest against a tree. It was only after one of his brothers smashed a car window with a golf club that Favre could be evacuated and rushed to the hospital. In the ambulance, his mother was sitting with him. \"All I kept asking [her] was 'Will I be able to play football again?'\" Favre recalled later. Doctors would later remove 30 inches (76 cm) of Favre's small intestine. Eight weeks after this incident, on September 8, Favre led Southern Miss to a comeback victory over Alabama. Alabama coach Gene Stallings said, \"You can call it a miracle or a legend or whatever you want to. I just know that on that day, Brett Favre was larger than life.\""}, {"text": "== College career ==Favre formerly held several Southern Miss football records until most were surpassed by Austin Davis by the end of the 2011 season. Favre had 15 games over his career where he compiled more than 200 passing yards, making him fourth in school history on the all–time list in that category. Of those 15 games, five were 300-yard games, the most compiled by any of the school's quarterbacks. Additionally, he was the seasonal leader in total passing and total offense in all four of his seasons at Southern Miss."}, {"text": "== College career ==Favre earned a teaching degree with an emphasis in special education from the University of Southern Mississippi."}, {"text": "=== Atlanta Falcons (1991) ===Favre was drafted by the Atlanta Falcons in the second round with the 33rd overall pick in the 1991 NFL draft. On July 19, 1991, Favre agreed to a three-year, US$1.4 million contract with a reported signing bonus of $350,000. Atlanta head coach Jerry Glanville did not approve of the drafting of Favre, saying it would take a plane crash for him to put Favre into the game. Favre's first pass in an NFL regular season game resulted in an interception returned for a touchdown in a Week 11 game against the Washington Redskins. He only attempted four passes in his one season at Atlanta, was intercepted twice, and completed none of them. Favre took one other snap, which resulted in a sack for an eleven-yard loss."}, {"text": "=== Green Bay Packers (1992–2007) ===On February 11, 1992, Green Bay Packers general manager Ron Wolf traded the first-round pick his team had received from the Philadelphia Eagles (17th overall) in a trade the previous year to the Atlanta Falcons in exchange for Favre. Wolf, while an assistant to the general manager of the New York Jets, had intended to take Favre in the 1991 NFL Draft, but Favre was taken by the Falcons on the previous pick."}, {"text": "=== Green Bay Packers (1992–2007) ===According to the Milwaukee Journal-Sentinel and other sources, during the physical after the trade, Favre was diagnosed with avascular necrosis of the hip, the same degenerative condition that ended running back Bo Jackson's football career, and doctors recommended his physical be failed, which would nullify the trade. Wolf overruled them."}, {"text": "=== Green Bay Packers (1992–2007) ===Favre played 16 seasons in Green Bay. During his time with the Packers, Favre was the first and only NFL player to win three consecutive AP MVP awards. He helped the Packers appear in two Super Bowls, winning Super Bowl XXXI and losing Super Bowl XXXII. Favre started every Packers game from September 20, 1992, to January 20, 2008, a streak of 253 games. The record would continue after he left the Packers, reaching 297 games in the regular season. This remains the all-time record for consecutive starts in the NFL."}, {"text": "==== Beginnings (1992–94) ====In the second game of the 1992 season, the Packers played the Tampa Bay Buccaneers. The Buccaneers were leading 17–0 at halftime, when head coach Mike Holmgren benched starting quarterback Don Majkowski and Favre played the second half. On his first regular season play as a Packer, Favre threw a pass that was deflected by Buccaneers player Ray Seals and caught by Favre. Favre was tackled and the completion went for −7 yards. The Packers lost the game 31–3, chalking up only 106 yards passing. The following week, Majkowski injured a ligament in his ankle against the Cincinnati Bengals, an injury severe enough that he would be out for four weeks. Favre replaced Majkowski for the remainder of the game. Favre fumbled four times during the course of the game, a performance poor enough that the crowd chanted for Favre to be removed in favor of another Packers backup quarterback at the time, Ty Detmer. However, down 23–17 with 1:07 left in the game, the Packers started an offensive series on their own 8-yard line. Favre then completed a 42-yard pass to wide receiver Sterling Sharpe. Three plays later, Favre threw the game–winning touchdown pass to wide receiver Kitrick Taylor with 13 seconds remaining.  Favre would go on to keep the starting job for the rest of his tenure in Green Bay. The next week's game against the Pittsburgh Steelers started the longest consecutive starts streak for a quarterback in NFL history. The game ended in a 17–3 victory and Favre finished with a passer rating of 144.6 by going 14-of-19 for 210 yards and two touchdowns. During the season, Favre helped put together a six-game winning streak for the Packers, the longest winning streak for the club since 1965. In the winning streak was a 38–10 victory over the Detroit Lions in Week 14, where Favre was 15-of-19 for 214 yards and three touchdowns to give him a 153.2 passer rating. They ended 9–7 that season, missing the playoffs on their last game, a 27–7 loss to the Minnesota Vikings. Favre finished his first season as a Packer with 3,227 yards and a quarterback rating of 85.3, helping him to his first Pro Bowl."}, {"text": "==== Beginnings (1992–94) ====The following season, Favre helped the Packers to their first playoff berth since 1982 and was named to his second Pro Bowl. Favre had his first career 400-yard passing game in Week 14 against the Chicago Bears in a 30–17 loss. He led the NFC in pass attempts, pass completions, and pass interceptions. Favre also had four game winning drives giving him seven for his career up to that point. In the Wild Card Round against the Detroit Lions, he had 204 passing yards, three touchdowns, and one interception in his playoff debut, a 28–24 win. In the following game in the Divisional Round, Favre had 331 yards, two touchdowns, and two interceptions in the 27–17 loss to the Dallas Cowboys. After the season, Favre became a free agent. General manager Ron Wolf negotiated Favre into a five-year, $19 million contract."}, {"text": "==== Beginnings (1992–94) ====The Packers finished the 1994 season with a 9–7 record, advancing to the playoffs in back to back years, a feat they had not accomplished since the Vince Lombardi era. After a victory over the Detroit Lions in the Wild Card Round, Favre and Packers fell to the Dallas Cowboys in the Divisional Round."}, {"text": "==== MVP (×3) and Super Bowl seasons (1995–97) ====In 1995, Favre won the first of his three AP MVP awards. Favre led the Packers to an 11–5 record, Green Bay's best record in nearly thirty years. Favre passed for a career-high of 4,413 yards, 38 touchdowns, and recorded a quarterback rating of 99.5, which was the highest of his career until he recorded a rating of 107.2 during the 2009 season. Favre also tied an NFL record by passing for at least two touchdowns in twelve consecutive games, a feat he accomplished over the 1994–1995 seasons. The Packers advanced to the NFC Championship Game after upsetting the San Francisco 49ers in the Divisional Round. The Packers lost the NFC Championship to the Dallas Cowboys, marking the third year in a row the Packers season was ended by the Cowboys in the playoffs. Favre helped the Packers advance farther in the playoffs than any other Packer team since 1967, which was the season the Packers last won the championship in Super Bowl II."}, {"text": "==== MVP (×3) and Super Bowl seasons (1995–97) ====While being treated for various injuries, Favre developed an addiction to Vicodin, which became publicly known when he had a seizure following routine ankle surgery in late February. Amid an NFL investigation, he went public to avoid any rumors about his condition. In May 1996, he went into treatment and remained in rehabilitation for 46 days. Had he chosen not to go, the NFL would have imposed a $900,000 fine."}, {"text": "==== MVP (×3) and Super Bowl seasons (1995–97) ====Favre led the Packers to their best season in 30 years in the 1996 season, winning his second consecutive MVP award in the process. The Packers led the NFL in points scored (456) as well as fewest points allowed (210), joining only the 1972 Dolphins as the only two teams to ever accomplish this. The defense also set a then NFL record for the fewest touchdowns allowed in a 16-game season with 19. Favre threw for 3,899 yards, a career-high 39 touchdown passes (third highest ever at the time), only 13 interceptions, and passer rating of 95.8 (the third highest of his career). Green Bay tied the Denver Broncos for the NFL's best regular-season record, 13–3, defeated the San Francisco 49ers (35–14) and Carolina Panthers (30–13) at Lambeau Field in the playoffs. The Packers advanced to Super Bowl XXXI at the Louisiana Superdome, a short drive from Favre's hometown."}, {"text": "==== MVP (×3) and Super Bowl seasons (1995–97) ====In Super Bowl XXXI, Favre completed 14-of-27 passes for 246 yards and two touchdown passes. On the second play of the game, Favre called an audible and threw a 54-yard touchdown pass to wide receiver Andre Rison. In addition, Favre completed an 81-yard touchdown pass to wide receiver Antonio Freeman in the second quarter (then a Super Bowl record for longest touchdown catch). Favre rushed for 12 yards and another touchdown, as the Packers won Super Bowl XXXI over the New England Patriots, 35–21. In their 19 games of the season, the Packers had a turnover differential of plus 24, and outscored their opponents 100–48 in the playoffs."}, {"text": "==== MVP (×3) and Super Bowl seasons (1995–97) ====Favre and the Packers continued their dominance of the NFC during the next season. Favre was named AP co-MVP of the league along with Detroit Lions' running back Barry Sanders, his third straight award. He finished the season with 3,867 passing yards, 35 touchdown passes, 16 interceptions, and a passer rating of 92.6. The Packers finished with a 13–3 record and became the only team to ever defeat six teams that would go on to make the playoffs. Also, Green Bay advanced through the playoffs to the Super Bowl for the second year in a row. After being heavily favored by 11 points, the Packers lost to the Denver Broncos in Super Bowl XXXII by the score of 31–24 at Qualcomm Stadium in San Diego, ending the NFC's 13-year Super Bowl-winning streak. Denver defeating Green Bay was one of the biggest upsets in NFL history. Favre completed 25-of-42 passes for 256 yards and three touchdowns, with one interception and one fumble in the losing effort. Super Bowl XXXII was Favre's last appearance in a Super Bowl in his career, despite playing for another decade."}, {"text": "==== Mid-career (1998–2002) ====The Packers lost to the San Francisco 49ers in the Wild Card Round in 1998. Favre had rallied the team with a touchdown pass to wide receiver Antonio Freeman with 1:56 remaining in the game to put the Packers up 27–23. However, Steve Young responded with a touchdown of his own to wide receiver Terrell Owens with three seconds remaining to end the Packers season. Favre and the Packers failed for the first time since 1994 to at least reach the NFC Championship."}, {"text": "==== Mid-career (1998–2002) ====Favre led the Packers to an NFL record 29 consecutive home wins (25 regular season, 4 post season) until they were defeated by the Minnesota Vikings on Monday Night Football on October 5, 1998. Favre's record for consecutive regular season home wins stood until 2010 when Tom Brady led the New England Patriots to a home victory over the New York Jets on December 6, 2010. Despite Brady and the Patriots surpassing the regular season mark for consecutive home victories, the combined regular season plus post season mark remains an NFL record for Favre since the Patriots had their combined regular and post season streak interrupted by a home playoff loss to the Baltimore Ravens on January 10, 2010."}, {"text": "==== Mid-career (1998–2002) ====During the final game of the 1999 NFL season, Favre and the Packers were involved in what has been described as a bizarre tie-breaking scenario which resulted in four teams that finished with 8–8 records where two of the teams would qualify for the playoffs and the other two would be eliminated. Going into their season finale against the Arizona Cardinals, the Packers needed to win their game, have the Dallas Cowboys lose their game later that afternoon, and also needed the Packers to win the net points scored tie-breaker versus the Carolina Panthers (who were facing the New Orleans Saints). The Packers and Panthers were playing during the noon-time slot and the Packers held a net eighteen-point advantage. As the game progressed, the Panthers were winning their game by a sizable margin to the point that they had overtaken the Packers in net points for a brief time. Since both teams were neck and neck for the tie-break advantage, both teams were frantically trying to score as many points as possible despite leading on the scoreboard by a sizable margin. The Cardinals and Saints also tried to score frantically as the game progressed to stop their opponents from gaining the net points advantage. Ultimately, the Packers prevailed in net points by +11. In the end however, the Cowboys won their afternoon contest against the New York Giants to claim the final playoff spot and thus eliminate the Packers from playoff contention. Over a 26-minute period (from 2:51 pm to 3:17 pm) Favre led the Packers on a 99-yard touchdown drive utilizing a hurry-up offense despite leading their game 35–17 culminating on a 32-yard touchdown pass to Bill Schroeder, and then shortly thereafter threw a 43-yard pass down to the one-yard line to set up another score. The Packers won their game 49–24 and the Panthers won their game 45–13."}, {"text": "==== Mid-career (1998–2002) ====On March 1, 2001, Favre signed a 10-year contract extension worth around $100 million."}, {"text": "==== Mid-career (1998–2002) ====In the regular-season finale of 2001, Favre was the target of minor controversy when, in a game against the New York Giants at Giants Stadium, he was sacked by the Giants defensive end Michael Strahan. It was Strahan's lone sack of the game and gave him the NFL's single–season sack record of 22.5, which topped Mark Gastineau's record of 22 set in 1984. The controversy (Favre fell over unusually easily) has followed Strahan continuously since he set the record. Jim Fassel, Strahan's coach in 2001, said that when a respected athlete like Strahan gets close to an all-time record, sometimes opponents want him to break it."}, {"text": "==== Mid-career (1998–2002) ====By the end of his tenth year in the league as a starter, Favre had thrown 287 touchdown passes, which was more than 100 touchdown passes than the second-ranked quarterback over the same time period (Steve Young, 181 touchdown passes), an NFL record for touchdown pass differential."}, {"text": "==== Mid-career (1998–2002) ====Favre and the Packers continued posting positive results through the next few seasons, making the playoffs in both 2002 and 2003 and finishing with 12–4 and 10–6 records. However, they did suffer their first home playoff loss in 2002 at the hands of the Atlanta Falcons, and a heartbreaking playoff loss to the Eagles in 2003. Through the 2004 season, the Packers had the longest streak of non-losing seasons (13) in the NFL, despite an 8–8 record under head coach Ray Rhodes, a 9–7 season under head coach Mike Sherman, and no playoff berths in either 1999 or 2000. The streak ended in 2005, with the Packers finishing with a 4–12 record."}, {"text": "==== Later career and personal tragedies (2003–2006) ====One day after his father died of a heart attack or stroke, Favre decided to play in a December 22, 2003, Monday Night Football game against the Oakland Raiders. The Packers traveled to Oakland where Favre passed for four touchdowns in the first half and 399 total yards in a 41–7 victory over the Raiders on international television (even receiving applause from \"Raider Nation\"). He completed 73.3% of his passes and finished the game with a passer rating of 154.9, having recorded a perfect 158.3 rating with four touchdowns and over 250 yards passing by halftime. Afterwards, Favre said, \"I knew that my dad would have wanted me to play. I love him so much and I love this game. It's meant a great deal to me, to my dad, to my family, and I didn't expect this kind of performance. But I know he was watching tonight.\" After the game, he went to his father's funeral in Pass Christian, Mississippi. Favre won an ESPY Award for his Monday Night Football performance."}, {"text": "==== Later career and personal tragedies (2003–2006) ====A notable game in the 2004 season in which Favre and the Packers finished 10–6 was against the New York Giants. During the game, Favre suffered a concussion. He did not receive medical clearance to re-enter the game. Despite the concussion, Favre threw a 28-yard touchdown to Javon Walker on a fourth-down play. Afterwards it was reported that Favre did not remember throwing the touchdown pass. Favre also had two significant touchdown streaks of note during the season. He had completed at least one touchdown pass in 36 consecutive games over the 2002–2004 seasons which at the time was the second-longest streak in NFL history. Also, during the 2004 post-season, he broke Dan Marino's record for consecutive games with at least one touchdown pass in the post season. The Packers' postseason run ended in the Wild Card Round with a loss to the Minnesota Vikings."}, {"text": "==== Later career and personal tragedies (2003–2006) ====After the death of his father, a series of events related to Favre's family were reported in the media. In October 2004, ten months after the death of Favre's father, his brother-in-law, Casey Tynes, was killed in an all-terrain vehicle accident on Favre's Mississippi property."}, {"text": "==== Later career and personal tragedies (2003–2006) ====Soon after in 2004, Favre's wife, Deanna Favre, was diagnosed with breast cancer. Following aggressive treatment through 2004, she recovered. She created The Deanna Favre Hope Foundation which supports breast cancer education and women's breast imaging and diagnosis services for all women, including those who are medically underserved."}, {"text": "==== Later career and personal tragedies (2003–2006) ====In late August 2005, Favre's family suffered another setback: Hurricane Katrina blew through Mississippi, destroying his family's home there; however, none of his family members were injured. Brett and Deanna's property in Hattiesburg, Mississippi, was also extensively damaged by the storm. Favre elected to continue to play in the 2005 season."}, {"text": "==== Later career and personal tragedies (2003–2006) ====For the 2005 season, despite throwing for over 3,000 yards for a record 14th consecutive time, Favre had a below-average season with only 20 touchdown passes and a league-leading 29 interceptions. The loss of guards Marco Rivera and Mike Wahle to free agency along with key injuries to Javon Walker, Ahman Green, Bubba Franks, among others, hampered Favre and the team. His passer rating was 70.9, 31st in the NFL and the worst single-season rating of his career. After the disappointing season, many speculated that Favre would retire. However, on April 26, 2006, Favre announced that he would remain with the team for the 2006 season. Despite earlier comments that the 2006 season would be his last, Favre announced in a press conference on May 6, 2006, that he had not ruled out the possibility of returning beyond the 2006 season."}, {"text": "==== Later career and personal tragedies (2003–2006) ====In the 2006 season, Favre suffered his first career shutout against the Chicago Bears in a 26–0 loss in Week 1. Later in the season, the New England Patriots shut out the Packers in a game where he was injured before halftime and could not complete the game. On September 24, he became just the second quarterback in NFL history to record 400 touchdown passes (Dan Marino being the first). He connected with rookie wide receiver Greg Jennings on a 5-yard pass that Jennings turned into a 75-yard touchdown play during a win against the Detroit Lions. He became the first player ever to complete 5,000 passes in his career. On December 31, 2006, the Packers played their last game of the season, winning 26–7 in the second game against the Chicago Bears. It was his 22nd career win versus the Bears, moving him to an all-time record of 22–8. Overall, Favre finished the 2006 season with 3,885 passing yards, 18 touchdowns, and 18 interceptions as the Packers finished with an 8–8 record."}, {"text": "==== Milestone season (2007) ====On February 26, 2007, Favre underwent minor arthroscopic ankle surgery in Green Bay, Wisconsin, to remove a buildup of bone spurs in his left ankle."}, {"text": "==== Milestone season (2007) ====Favre began the 2007 season trailing in a number of career NFL passing records. On September 16, 2007, Favre and the Packers defeated the New York Giants to give Favre his record setting 149th win, passing John Elway. On September 30, Favre threw a 16-yard touchdown pass to wide receiver Greg Jennings in a game against the Vikings. This was his 421st NFL touchdown pass, and set a new all-time record, surpassing Dan Marino's 420."}, {"text": "==== Milestone season (2007) ====On November 4, 2007, after the Packers defeated the Kansas City Chiefs 33–22, Favre became only the third quarterback to have defeated all 31 other current NFL teams. He joined Peyton Manning and Tom Brady as the only quarterbacks in NFL history to do this, just the week after the two of them achieved the accomplishment. On Thanksgiving 2007, Favre led the Packers to a 37–26 win over the Lions, and brought the Packers to a 10–1 record. He won the Galloping Gobbler award, given by the broadcasters at Fox to the game's MVP. Favre threw three touchdown passes for his 63rd career game with at least three touchdowns, surpassing Marino's former record of 62."}, {"text": "==== Milestone season (2007) ====Favre led the Packers to a 13–3 regular season record, the NFC North championship, and the second seed in the NFC playoffs. Prior to the Packers' Divisional Round game against the Seattle Seahawks, Favre stated his desire to continue playing football for another season. In the Divisional Playoffs, Favre threw three touchdowns as the Packers cruised to a 42–20 victory over the Seahawks at a snowy Lambeau Field. The Packers' season ended the following week when they suffered a 23–20 overtime loss in the NFC Championship Game to the New York Giants (who in turn upset the heavily favored and previously undefeated New England Patriots in Super Bowl XLII). Negotiating sub-zero temperatures, Favre amassed 236 passing yards and two touchdowns, but also threw an interception in overtime that set up the Giants' game-winning field goal. Favre's 90-yard touchdown pass to wide receiver Donald Driver in the second quarter was the longest pass in Packers playoff history, and it extended Favre's NFL record for consecutive postseason games with a touchdown pass to 18. Favre stated after the game that he would make a decision more quickly than he has in the past regarding whether he would return for another season."}, {"text": "==== Milestone season (2007) ====Favre's milestone 2007 season culminated with his selection to the 2008 Pro Bowl as the starting quarterback for the NFC, but an ankle injury forced him to withdraw from the game."}, {"text": "==== Retirements and returns (2008) ====Beginning near the end of the 2006 season, word began to surface that Favre was considering retirement. In fact, playing in Soldier Field against the arch-rival Bears in the season finale, Favre was given a standing ovation in the closing seconds of the Packer victory as a show of respect from Chicago fans to their longtime nemesis. Moments later at the postgame interview, he gave a tearful interview with an NBC Sports correspondent, where he admitted his future was still questionable. However, after much debate, he returned for the 2007 season, during which his future was once again in doubt and an oft-discussed topic, with many in the media speculating that if the Packers made the Super Bowl, Favre would indeed retire and hand the reins to the unproven but talented Aaron Rodgers, who was drafted two years earlier as Favre's heir-apparent. Ultimately, the Packers fell in the NFC Championship to the New York Giants."}, {"text": "==== Retirements and returns (2008) ====According to Bob McGinn in the Journal Sentinel, after the conclusion of the 2007 season, \"Just about everyone who counted in the football department reached the conclusion that Favre could never win another championship. His dismal playoff record in the past decade couldn't be overlooked. And the Packers concluded that it would be the mother of all mistakes if Aaron Rodgers got away without being properly evaluated as a starter. Favre had one chance, and one chance only, to salvage his career in Green Bay. He had to commit wholeheartedly for another season by early March. One could argue that the Packers erred by asking Favre for an answer that early. But having been hung out to dry by Favre too often in the past, they were in no mood for drama.\" There was also miscommunication between the Packers and Favre, as admitted by General Manager Ted Thompson, \"when Favre decided in March that he was leaning toward playing, the organization wasn't quick toward embracing him\"."}, {"text": "==== Retirements and returns (2008) ====On March 4, 2008, Favre formally announced his retirement. Although Favre stated that he had been willing to play another year, he felt that another season would only be successful if he led his team to another Super Bowl victory. He added the chances for a Super Bowl win were small, and that he was not up for the challenge. At his press conference, Favre openly wept about leaving the NFL. He stated that his decision, regardless of what was being said in the media, had nothing to do with what the Packers did or didn't do. Seeming to contradict statements made by his agent, Bus Cook, Favre said that his decision to retire was based on the fact that he did not want to play anymore. He said during the conference, \"I know I can play, but I don't think I want to. And that's really what it comes down to.\""}, {"text": "==== Retirements and returns (2008) ====On July 2, 2008, it was reported that Favre was in contact with the Packers about a possible return to the team. On July 11, 2008, Favre sent a letter to the Packers asking for his unconditional release to allow him to play for another NFL team. Packers general manager Ted Thompson announced he would not grant Favre an unconditional release and reaffirmed the organization's commitment to Aaron Rodgers as its new quarterback. Complicating matters was Favre's unique contract giving him the leverage to void any potential trade by not reporting to the camp of the team he might be traded to if the Packers elect to go that route."}, {"text": "==== Retirements and returns (2008) ====Favre spoke publicly for the first time about his potential comeback in a July 14, 2008, interview with Greta Van Susteren on the Fox News Channel's On the Record with Greta Van Susteren. In the interview, Favre said he was \"guilty of retiring early\", that he was \"never fully committed\" to retirement, and that he was pressured by the Packers to make a decision before the NFL draft and the start of the free agent signing period. Favre disputed the notion that he does not want to play for Green Bay and said that while he understands the organization has decided to move on, they should now allow him to do the same. He made clear that he would not return to the Packers as a backup and reiterated his desire to be released rather than traded, which would allow him the freedom to play for a competitive team. Favre also accused the Packers of being dishonest, wishing the team would have been straightforward with him and the public."}, {"text": "==== Retirements and returns (2008) ====In the second part of the interview, which aired on July 15, Favre expressed his frustration with Packers management, spoke of his sympathy for successor Aaron Rodgers's predicament, and affirmed he is 100 percent committed to playing football in 2008."}, {"text": "==== Retirements and returns (2008) ====FOXSports.com's Jay Glazer reported on July 16, 2008, that the Packers filed tampering charges against the Minnesota Vikings with the league office, alleging improper communication between Vikings offensive coordinator Darrell Bevell and Favre, although one source suggested that Favre may have been in contact with Vikings head coach Brad Childress. After an investigation, NFL Commissioner Roger Goodell ruled there had been no violation of tampering rules."}, {"text": "==== Retirements and returns (2008) ====Packers team president Mark Murphy met with Favre on July 30 in Hattiesburg, Miss. with the offer of a $20 million marketing agreement, which was \"viewed nationally as a bribe to get Favre to stay retired\"."}, {"text": "==== Retirements and returns (2008) ====Favre formally filed for reinstatement with the NFL on July 29, 2008, and his petition was granted by Commissioner Goodell, effective August 4, 2008. Favre then flew to Green Bay to report to Packers training camp. After a lengthy meeting with head coach Mike McCarthy and general manager Ted Thompson, however, both sides agreed it was time for Favre and the organization to part ways. McCarthy sensed Favre was not in \"the right mind-set\" to resume playing for the Packers, while Favre felt that his relationship with Packers management had deteriorated to the point that a return to the team would be untenable."}, {"text": "==== Retirements and returns (2008) ====The Packers had announced plans to retire Favre's #4 jersey in the 2008 season opener. Those plans were dropped when he announced plans to return to the NFL. In March 2009, the Packers indicated that the team still intends to retire Favre's number, but due to the circumstances surrounding his departure from the team, no timeline had been set. Favre's #4 jersey was finally retired in 2015."}, {"text": "=== New York Jets (2008) ===After negotiations with both the Tampa Bay Buccaneers and New York Jets, the Packers traded Favre to the Jets on August 7, 2008, in exchange for a conditional fourth-round pick in the 2009 NFL draft with performance escalation."}, {"text": "=== New York Jets (2008) ===In his Jets debut, Favre passed for 194 yards and two touchdowns in a 20–14 victory over the Miami Dolphins. In Week 4, he threw six touchdowns against the Arizona Cardinals, a personal best and one shy of the NFL record for a single game. This performance led to him being selected as the FedEx Air Player of the Week. By Week 12, the Jets had compiled an 8–3 record, including a 34–13 win over the previously undefeated Tennessee Titans. However, the Jets lost four of the last five games of the season, including the final game against the Miami Dolphins, who had acquired quarterback Chad Pennington after he was released from the Jets to make room for Favre. In those five games, Favre threw eight interceptions and only two touchdown passes, bringing his season total to 22 of each. Favre had complained of shoulder pain and had an MRI performed on December 29, 2008, which revealed a torn biceps tendon in his right shoulder. After the 2008 season had ended, in mid January 2009, Favre told Jets General Manager Mike Tannenbaum, \"it may be time to look in a different direction\" regarding the quarterback position. On February 11, 2009, Favre informed the Jets that he was retiring after 18 seasons. He remained part of the Jets organization until April 28, 2009, when the Jets released Favre from his contract, thus allowing him to sign anywhere he wanted. By May 2009, he was officially cut from the Jets Reserve/Retired list. In September 2009, it was revealed that the NFL learned that the Jets were aware that Favre injured his arm in the 11th game of the 2008 season, and fined the Jets $125,000 for not reporting the injury in any of the Jets' five final games."}, {"text": "==== NFC Championship run (2009) ====After an offseason of speculation, Favre officially signed with the Minnesota Vikings on August 18, 2009. He made his Vikings debut in the season opener against the Cleveland Browns. In the 34–20 victory, he passed for 110 yards and one passing touchdown. In Week 4, Favre had his first game against his former team. In the home game against the Green Bay Packers, he had 271 passing yards and three passing touchdowns in the 30–23 victory. With the victory over the Packers, he became the first quarterback in NFL history to defeat every one of the league's 32 franchises since the NFL first expanded to 32 franchises in 2002. Favre helped lead the Vikings to a 6–0 start going into Week 7. The Vikings suffered their first setback against the Pittsburgh Steelers in a 27–17 loss. Week 8 was a significant one for Favre as he faced off against the Packers at Lambeau Field for his first game returning to Green Bay. He passed for 244 yards and four passing touchdowns in the 38–26 victory. In a Week 12 victory over the Chicago Bears, he passed for a season-high 392 yards and three touchdowns in the 36–10 victory. In the regular season finale, he passed for 316 yards and four touchdowns in the 44–7 victory over the New York Giants. Favre finished the 2009 season with 4,202 passing yards, 33 touchdowns, and seven interceptions."}, {"text": "==== NFC Championship run (2009) ====Overall, Favre had a landmark season in which he surpassed former Vikings defensive end Jim Marshall for consecutive starts at one position, with 291, and surpassed Dan Marino's previous record for four-touchdown games, and was named to his 11th Pro Bowl. The Vikings finished with a 12–4 record and earned a first-round bye. In the Divisional Round against the Dallas Cowboys, he recorded 234 passing yards and four passing touchdowns in the 34–3 victory. They advanced to the NFC Championship, ultimately losing in overtime to the eventual Super Bowl XLIV champion New Orleans Saints. He passed for 316 yards, one touchdown, and two interceptions in the 31–28 loss. Despite the loss, Favre set playoff records for pass completions and passing yards previously held by Joe Montana."}, {"text": "==== Final season (2010) ====On August 3, 2010, NBC Sports reported the confirmation of Favre returning to the Vikings but saying that the 2010 season would be his final season. An announcement was given on August 17, 2010, confirming his return to the team. That season, Favre achieved two milestones. He threw for his 500th touchdown and 70,000th yard against the New York Jets. On November 7, 2010, in a game against the Arizona Cardinals, Favre threw for a career-high 446 yards while rallying the Vikings from a 14-point fourth quarter deficit to win in overtime. On December 5, 2010, in a game against the Buffalo Bills, Favre was hit by Bills linebacker Arthur Moats while making a throw, causing him to sustain a sprain of the AC joint in his right shoulder. Favre missed the rest of the game and was replaced by Tarvaris Jackson, who helped lead the Vikings to victory despite throwing three interceptions."}, {"text": "==== Final season (2010) ====On December 13, 2010, due to his sprained shoulder, Favre was marked inactive for the game against the New York Giants ending his consecutive regular-season start streak at 297. Favre started a total of 321 games including post-season appearances. On December 20, 2010, while playing the Chicago Bears outside at TCF Bank Stadium due to the collapse of the roof of the Hubert H. Humphrey Metrodome, Favre sustained a concussion after being sacked by Bears defensive end Corey Wootton. As a rattled Favre was helped to his feet by Vikings' athletic trainer Eric Sugarman, he asked, \"Suge, what are the Bears doing here?\". This would be his final appearance in an NFL game."}, {"text": "==== Final season (2010) ====On January 2, 2011, Favre was unable to play against the Detroit Lions in the final game of the regular NFL season due to his inability to pass NFL-mandated post-concussion tests. In a press conference immediately following the game, Favre announced his intention to retire from professional football. On January 17, 2011, Favre officially filed his retirement papers with the NFL."}, {"text": "=== Post-NFL health issues ===In 2013, Favre was asked to consider returning to the NFL to play for the injury-plagued St. Louis Rams. He turned down the offer, telling WSPZ radio in Washington, D.C., that he has had memory loss and that he feared it was related to the multiple concussions he suffered throughout his career. He was previously asked in a 2009 interview with NBC how many times he had played with a concussion that with the new standards would have resulted in him sitting out. 'A lot', he replied. "}, {"text": "=== Post-NFL health issues ===In 2021, Favre was featured in a public service announcement (PSA) urging parents not to allow their children to play tackle football under age 14. In an interview with Today, Favre stated that while he is in good health, he often questions how healthy he really is due to fears about the long-term effects of his playing career and that he is unsure whether the cognitive lapses he sometimes experiences are a natural effect of his advancing age or a sign that he may have CTE."}, {"text": "=== Post-NFL career analyst work ===Favre was the analyst for his alma mater, Southern Miss, when they played the Rice Owls on October 1, 2011. He later joined the NFL Network for pregame coverage of Super Bowl XLVII. It has also been reported that Favre has turned down repeated offers from the NFL Network to become an on-air analyst."}, {"text": "=== Honors and awards ===Favre has received several awards including:"}, {"text": "=== Honors and awards ===3× Associated Press Most Valuable Player (MVP) (1995, 1996, and 1997; the last shared with Barry Sanders)"}, {"text": "=== Honors and awards ===NFL Offensive Player of the Year (1995)"}, {"text": "=== Honors and awards ===11× Pro Bowl selection (1992, 1993, 1995–1997, 2001–2003, 2007–2009)"}, {"text": "=== Honors and awards ===3× First-team All-Pro selection (1995–1997)"}, {"text": "=== Honors and awards ===3× Second-team All-Pro selection (2001, 2002, 2007)"}, {"text": "=== Honors and awards ===NFL 1990s All-Decade Team"}, {"text": "=== Honors and awards ===NFL 100th Anniversary All-Time Team"}, {"text": "=== Honors and awards ===Pro Football Hall of Fame class of 2016"}, {"text": "=== Honors and awards ===Green Bay Packers Hall of Fame class of 2015"}, {"text": "=== Records and milestones ===Favre owns several NFL records including, but not limited to:"}, {"text": "=== Records and milestones ===Most consecutive games started \"Iron Man\" streak (September 27, 1992 – December 5, 2010): 297 (321 including playoffs)"}, {"text": "=== Records and milestones ===Most pass interceptions: 336"}, {"text": "=== Records and milestones ===Favre owns a number of team records with the Packers, Vikings, and Jets, including having printed his name into almost every passing category in the annals of Green Bay Packers history."}, {"text": "=== Records and milestones ===Favre is the holder of several firsts in NFL history, including the only quarterback to win three consecutive NFL most valuable player awards, first quarterback to defeat all of the league's 32 franchises, and the first quarterback to win a playoff game over age 40."}, {"text": "=== Records and milestones ===In addition, Favre set a number of college records with Southern Mississippi."}, {"text": "=== Cold weather success ===Favre has been known as the most successful cold-weather quarterback of all time, having compiled a record of 44–17 in games when the game-time temperature was below 40 degrees Fahrenheit. He had gained the reputation for success in cold weather when the Packers won with Favre as the starter in his first 35 games at home when the game-time temperature was 34 degrees Fahrenheit or less."}, {"text": "=== NFL rivalry records ===Brett Favre had significant stretches of success against his division rivals having won an NFL record 11 consecutive road games against the Chicago Bears, and a perfect 19–0 won-lost record against the Detroit Lions at home, also an NFL record."}, {"text": "=== Consecutive starts streak ===Since first being named the starter of the Green Bay Packers before playing the Pittsburgh Steelers on September 27, 1992, Favre had never missed a game spanning over 18+1⁄2 consecutive seasons. He holds the record for the most consecutive starts by any player in the NFL with 297 (321 including playoffs), which is one of four quarterback streaks of at least 200 consecutive games in NFL history. Favre has stated that of all the records he set, he is most proud of the consecutive starts accomplishment."}, {"text": "=== Consecutive starts streak ===Favre failed to finish a game due to injury on only eight occasions since taking control of the Packers as quarterback. Significant injuries suffered by Favre during the streak includes a first-degree shoulder separation, deep thigh bruise, severely bruised left hip, severely sprained left ankle, wind knocked out coupled with coughing up blood, sprained right thumb, right elbow tendinitis, left mid-foot sprain, sprained lateral collateral ligament of the left knee, broken left thumb, softball-sized bruise of the left hamstring, mild concussion, sprained right hand, injured ulnar nerve of the right elbow, bone spurs on the left ankle, torn right biceps, pulled groin, stress fracture of the left ankle coupled with an avulsion fracture of calcaneus, and a sprained sternoclavicular joint of the right shoulder."}, {"text": "=== Consecutive starts streak ===During Favre's consecutive starts streak, 238 other quarterbacks have started in the NFL, 17 of them being back-ups to Favre at one point."}, {"text": "=== Consecutive starts streak ===The Pro Football Hall of Fame has as an exhibit displaying the jersey Favre wore during his record-breaking 117th consecutive start as a quarterback, and a section of their website devoted to what the Hall of Fame calls an \"Iron man\"."}, {"text": "=== Consecutive starts streak ===In 2009, Favre surpassed defensive end Jim Marshall for starts at any position with his record-breaking 271st start as a quarterback as the Vikings played the Lions. His streak ended at 297, with the last start in the streak coming on December 5, 2010, against the Buffalo Bills. Favre was unable to start the Vikings' December 13 game against the New York Giants due to a shoulder injury, despite the game being delayed for a day because of the collapse of the Metrodome roof."}, {"text": "== Retirement speculation ==Favre has speculated on retiring, or returning to the NFL many times during his career and following the end of his career in 2011:"}, {"text": "== Retirement speculation ==2002: In September, sportswriter Peter King conducted an interview with Favre during spring training. Favre told him that he missed home and was thinking more and more about retirement. When then–head coach Mike Sherman told the players they could have off on Saturday and Sunday, Favre replied \"I wish I could be on my lawn mower back home.\""}, {"text": "== Retirement speculation ==2003: Favre was constantly asked about retirement throughout the early part of the year. Favre jokingly responded by saying \"I can't even remember how the whole retirement thing started, but whoever started it needs to be shot.\""}, {"text": "== Retirement speculation ==2005: After the Packers got off to a slow start, rumors that Favre might retire started to escalate. Favre responded by saying \"At 0–3, I think most people would say 'Oh, he's gone after this year, or they won't even want him back.'...I don't even think about when that time might come.\""}, {"text": "== Retirement speculation ==2006: In an interview with ESPN in January, after the Packers had finished with a 4–12 record, Favre admitted that if he had to make a decision right away he would not come back. He went on to say \"There's other days, I go, 'What if it's crunch time, two minutes left, do you want the ball?' I don't know if I do.\" In March, Favre hears Phil Simms say on Sirius Radio that as long as Favre can physically play the game, he should. Shortly thereafter, Favre confirms he would return to play. After the Packers defeated the Chicago Bears the last game of the season 26–7, Favre choked up during an interview with Andrea Kremer by saying \"If today's my last game, I want to remember it. It's tough. It's tough. I'll miss these guys. I'll miss this game. I just want every one to know that...I didn't plan on doing this. Way to put me on the spot.\" Asked if he was indeed going to retire, Favre responded \"We'll see. We'll see. I don't want to say anything right now.\" After the game, a Packers teammate said that Favre was just as emotional in a speech after the Seattle Seahawks game in 2005 at Lambeau Field when he was all but certain he was going to retire."}, {"text": "== Retirement speculation ==2007: In February, Favre told the Biloxi Sun Herald that he plans to come back for another season with the Packers."}, {"text": "== Retirement speculation ==2008: In early March, Favre announced that he is retiring from the Green Bay Packers. At a news conference he said \"I know I can play, but I don't think I want to. It's been a great career for me, but it's over. As they say, all good things must come to an end. I look forward to whatever the future may hold for me.\" Later in the month Favre has second thoughts and wants to return. According to the Milwaukee Journal Sentinel, Favre backed out of a meeting with Packers management two days before re-entry talks were to begin. In April, Sam Farmer from the Los Angeles Times reported that Favre's agent Bus Cook was making inquiries to other teams about Favre. Favre responded by saying \"I have no idea where that came from, but it certainly didn't come from me. I'm happy about my decision and I haven't once said 'I wonder if I made the wrong decision.' I know it's the right one. It's kind of funny. Even when I'm retired, they won't let me stay retired.\" Also in April, the Packers placed Favre on the Reserve-Retired list and planned to have Favre's number retired during the season opener against the Minnesota Vikings. In June, Favre said he told head coach Mike McCarthy he wanted to come back to the team. He said \"When he picked up the phone again after he dropped it, he said, 'Oh, God, Brett. You're putting us in a tight spot. He said, 'Brett, playing here is not an option.' Those were his exact, exact words.\" In July, Favre sent a letter requesting his release from the Packers. A couple months earlier Favre contacted Mike McCarthy about coming out of retirement and was \"rebuffed\" according to a Milwaukee Journal Sentinel report. Then a report came in from ESPN that said that Favre had wanted to come out of retirement but the Packers were reluctant to take him back. The Packers refused to give Favre an unconditional release. A few days later, Favre had an interview with Greta Van Susteren of Fox News where he accused general manager Ted Thompson of forcing him to make a decision on his return to the team too quickly. Two days after the interview, the Packers filed tampering charges with the NFL front office charging that the Minnesota Vikings had inappropriate contact with Favre. The Packers then offered Favre a retirement package of $25 million marketing agreement to remain retired. This offer was rejected and Favre was subsequently traded to the New York Jets."}, {"text": "== Retirement speculation ==2009: In February, Favre said he retired although his agent Bus Cook asked for his release from the New York Jets. After the Jets released him in April, Bus Cook e-mailed Jarrett Bell of USA Today that \"He's retired, working on his farm in Mississippi.\" In May, Minnesota Vikings head coach Brad Childress set up a meeting with Favre to discuss him possibly playing with the team. In July, Childress said Favre would not be coming out of retirement. However, in August Favre announced he would come back and play for the Vikings."}, {"text": "== Retirement speculation ==2010: On February 7, Favre appeared in a second quarter Super Bowl XLIV ad for Hyundai parodying his retirement indecisiveness. In the ad, set after the 2020 NFL season, a grayed 50-year-old Favre accepts the season MVP award and ponders retirement, but cannot commit one way or the other. In April, Favre indicated that if it were not for his Vikings teammates and fans, it would be easy to retire. In early August, Favre's ankle (which was injured during the 2009 playoffs) had not responded after surgery and rehabilitation. As a result, he informed the team that he would not be coming back for another season. However, two weeks later he told teammates Jared Allen, Steve Hutchinson and Ryan Longwell he was coming back for another season."}, {"text": "== Retirement speculation ==2011: In January, Favre filed retirement papers with the NFL. In December, a report from ESPN-Chicago indicated that Favre would be open to coming back from retirement if the Chicago Bears were interested. However, head coach Lovie Smith and Favre denied the report. Favre said \"In spite of reports about playing with various teams, I'm enjoying retirement with my family and have no plans to play football.\""}, {"text": "== Retirement speculation ==2013: Favre's agent Bus Cook indicated early in the season that Favre could still play in the NFL. When asked about what his agent said, Favre responded \"I am (in shape), but I am no way considering playing... The stress level was much, much more (when I played)... The demands are, don't get me wrong, I want to win, but it's not a job.\" A few weeks later, in late October, the St. Louis Rams called Favre after their starting quarterback Sam Bradford was lost for the season, but Favre declined their offer to bring him out of retirement."}, {"text": "== Retirement speculation ==2017: Following Aaron Rodgers breaking his collarbone Week 6 against the Vikings, former ESPN reporter Ed Werder asked Favre if he would come back for the rest of the 2017 season. \"Absolutely not,\" Favre said."}, {"text": "=== Family ===Favre married Deanna Tynes on July 14, 1996. Together, they have two daughters, Brittany (born 1989) and Breleigh (born 1999). While Favre was still playing, Brittany gave birth to his first grandchild. The NFL stated that at the time it did not know of any other active players with grandchildren."}, {"text": "=== Family ===Favre's mother, Bonita, helps manage his holdings in agriculture and real estate, handle his endorsements and appearances, and oversee his charity work. Brett and Bonita Favre released a book in 2004 titled Favre (ISBN 978-1-59071-036-4) which discusses their family as well as the Green Bay Packers, including the Monday Night Football game that followed the death of Brett's father Irvin Favre."}, {"text": "=== Family ===Favre's nephew, Dylan, played quarterback for the Cedar Rapids Titans of the Indoor Football League in 2016 after playing in college at Mississippi State, Pearl River Community College, and the University of Tennessee-Martin."}, {"text": "=== High school coaching ===In 2012, Favre became the offensive coordinator for Oak Grove High School. Favre won his first game as part of the Oak Grove coaching staff by a score of 64–6. In December 2013, with Favre still serving as the offensive coordinator, Oak Grove High School won the Class 6A Mississippi high school state championship. In May 2014, it was announced that Favre would continue to help out at Oak Grove, but would no longer be offensive coordinator."}, {"text": "=== Charitable work ===Favre established the Brett Favre Fourward Foundation in 1996. In conjunction with his annual golf tournament, celebrity softball game and fundraising dinners, the foundation has donated more than $2 million to charities in his home state of Mississippi as well as to those in his adopted state of Wisconsin."}, {"text": "=== Charitable work ===Favre is involved with youth who are ill. Favre was awarded the Chris Greicius Celebrity Award from the Make a Wish Foundation. He is also known to respond to requests made to his foundation regarding youth with serious illnesses such as cancer."}, {"text": "=== Business ===In 1999, Favre worked with NASCAR driver Dale Jarrett to operate Jarrett/Favre Motorsports in the Busch Series, which lasted two seasons."}, {"text": "=== Business ===The Favre family once owned and operated the Brett Favre's Steakhouse and later changed names to the \"Hall of Fame Chophouse\", located in Green Bay, Wisconsin, and as of 2018 is closed."}, {"text": "=== Business ===In 2013, Favre joined the Board of Directors of Sqor, a sport social media platform. Favre's role includes product ambassador, sports insights, and advising Sqor on business interests with teams, leagues and sports conferences."}, {"text": "=== Entertainment ===Favre made a cameo appearance in the 1998 romantic comedy film There's Something About Mary as Cameron Diaz's character's former love interest."}, {"text": "=== Endorsements ===In the past, Favre has been a spokesperson for multiple companies, including Nike, Snapper, Remington, Sears, Prilosec, Sensodyne, MasterCard, Wrangler, Bergstrom Automotive, and Hyundai. He has appeared in television advertisements for Copper Fit."}, {"text": "=== Politics ===Prior to the Mississippi runoff election on June 24, 2014, Favre endorsed the incumbent Republican U.S. Senator Thad Cochran in his race against State Senator Chris McDaniel, a \"tea party\" favorite. He has stated he does not identify with a specific political party."}, {"text": "=== Politics ===For the 2020 United States presidential election, Favre endorsed President Donald Trump for re-election. In a 2023 interview with Jason Whitlock, he also said Trump 'had the country in a better place' while questioning President Joe Biden and his leadership."}, {"text": "=== Religion ===Favre is a Roman Catholic and credits his faith for facing adversity throughout his life."}, {"text": "=== Violations of NFL's personal conduct policies ===In 1996, Favre was temporarily banned by the NFL from drinking alcohol, after he admitted he was addicted to Vicodin, and spent 46 days at a drug rehab clinic before the start of the season. His condition was serious enough that he had a potentially deadly seizure."}, {"text": "=== Sexting allegations and investigation ===In 2010, the NFL investigated Favre for allegedly sexting and leaving inappropriate voice messages for Jets \"Gameday host\" Jenn Sterger during the 2008 season. According to the NFL, forensic analysis failed to prove Favre sent the objectionable photographs to Sterger. Favre was found not to be in violation of the NFL's personal conduct policy, but was fined $50,000 for failing to cooperate with the investigation."}, {"text": "=== Mississippi welfare funds scandal ===In 2020, Favre's involvement with the development and promotion of a concussion treatment drug, Prevasol, by the Prevacus corporation, came under scrutiny. The nonprofit Mississippi Community Education Center (MCEC) received $2.5 million in federal grant funds diverted from Mississippi's Temporary Assistance for Needy Families welfare funds (TANF), as well as tens of millions in public funds as an element of the scheme. The Mississippi state auditor has termed the scheme \"the largest public embezzlement case in state history\". A grand jury in Hinds County indicted MCEC founder, Nancy New, and her son Zach in the scheme. Favre had introduced MCEC's founders to top state welfare officials. Former Governor Phil Bryant is also involved in the scandal."}, {"text": "==== No-show speaking fees ====On May 4, 2020, an audit in Favre's home state of Mississippi alleged that the state's Department of Human Services misspent $94 million intended for at-need residents, including $1.1 million paid out to Favre's company for two speaking appearances he did not make. The Mississippi auditor later announced that Favre intended to repay that money. On October 12, 2021, the Mississippi State Auditor notified Favre that he could face a civil lawsuit if he did not pay the state $828,000. Favre paid $600,000 on October 26, 2021. The Mississippi State Auditor said Favre still owed $228,000 in interest and referred the matter to the state attorney general's office. Favre was questioned by the FBI over the misappropriated funds. His lawyer has stated that Favre did not know the money was misappropriated from funds used to assist poor families and has not been charged with a crime in these matter."}, {"text": "==== Diversion of funds for volleyball facility and biotech venture ====A lawsuit filed by the state of Mississippi alleges Favre orchestrated the diversion of federal welfare funds to non-welfare related causes."}, {"text": "==== Diversion of funds for volleyball facility and biotech venture ====On September 13, 2022, Mississippi Today published text messages between Favre and former Mississippi governor Phil Bryant showing Favre's involvement in a plan to divert $5 million of the money toward a cause championed by Favre, a new volleyball facility at the University of Southern Mississippi, his alma mater and where his daughter played volleyball. The text messages had been entered as evidence as part of a civil lawsuit. In one of the texts, Favre asks, \"If you were to pay me is there anyway the media can find out where it came from and how much?\""}, {"text": "==== Diversion of funds for volleyball facility and biotech venture ====Favre helped arrange for $2 million of the funds to be invested in a biotech startup in which he had already invested."}, {"text": "==== Civil lawsuit ====In August 2023, the Mississippi Supreme Court ordered for Favre to stand as a defendant in the welfare funds lawsuit. On December 11, 2023, Favre took part in a deposition, with attorneys for the State of Mississippi interrogating him for more than nine hours."}, {"text": "== External links ==Career statistics and player information from Pro Football Reference"}, {"text": "== External links ==Pro Football Hall of Fame bio"}, {"text": "== External links ==Brett Favre at IMDb"}, {"text": "== External links ==Brett Favre owner statistics at Racing-Reference"}]