[{"text": "Brooke Christa Shields (born May 31, 1965) is an American actress. A child model starting at the age of 11 months, Shields gained widespread notoriety at age 12 for her leading role in Louis Malle's film Pretty Baby (1978), in which she appeared in nude scenes shot when she was 11 years old. She continued to model into her late teenage years and starred in several dramas in the 1980s, including The Blue Lagoon (1980), and Franco Zeffirelli's Endless Love (1981)."}, {"text": "In 1983, Shields suspended her modeling career to attend Princeton University, where she subsequently graduated with a bachelor's degree in Romance languages. In the 1990s, Shields returned to acting and appeared in minor roles in films. She also starred in the NBC sitcoms Suddenly Susan (1996–2000), for which she received two Golden Globe nominations, and Lipstick Jungle (2008–2009). "}, {"text": "In 2017, Shields returned to NBC with a major recurring role in Law & Order: Special Victims Unit in the show's 19th season. Shields voiced Beverly Goodman in the Adult Swim animated series Mr. Pickles (2014–2019) and its spin-off Momma Named Me Sheriff."}, {"text": "== Early life and family background ==Shields was born in Manhattan, New York City, on May 31, 1965, the daughter of actress and model Teri Shields (née Schmon) and businessman Francis Alexander Shields. Her mother was of English, German, Scotch-Irish, and Welsh descent, while her father had English, French, Irish, and Italian ancestry."}, {"text": "== Early life and family background ==According to research by William Addams Reitwiesner, Shields has ancestral links with a number of noble families from Italy, in particular from Genoa and Rome. These are namely (in chronological order of descent from 1355 to 1965) the Gattilusi-Palaiologos-Savoy, Grimaldi, Imperiali, Carafa, Doria, Doria-Pamphili-Landi, Chigi-Albani, and Torlonia dynasties. Her paternal grandmother was Italian noblewoman Marina Torlonia di Civitella-Cesi, who was the daughter of an Italian prince and an American socialite. Her great-uncle was the Italian nobleman Alessandro Torlonia, the husband of Infanta Beatriz of Spain."}, {"text": "== Early life and family background ==When Teri announced that she was pregnant, Francis's family paid her a sum to terminate the pregnancy. Teri took the money, but violated the agreement and gave birth to Brooke. Francis married Teri, but they were divorced when Shields was only five months old. She has two stepbrothers and three half-sisters. When Shields was only five days old, her mother openly stated she wanted her to be active in show business, saying: \"She's the most beautiful child and I'm going to help her with her career.\" Growing up, Shields took piano, ballet, and horse-riding lessons."}, {"text": "== Early life and family background ==Shields was raised in the Roman Catholic faith. For her confirmation at age 10, she took the name Camille, after Camillus de Lellis. While attending high school, she resided in Haworth, New Jersey. Shields has stated that her first encounter with the paparazzi was in the Grand Ballroom of the Waldorf Astoria New York at the age of 12, stating that she \"stood like a statue wondering why they were all hired to photograph me\" and that she \"debuted at the Waldorf.\""}, {"text": "== Early life and family background ==Shields attended the New Lincoln School until eighth grade. She graduated from the Dwight-Englewood School in Englewood, New Jersey, in 1983."}, {"text": "=== 1966–1977: Modeling and career beginnings ===Shields began her career as a model when she was 11 months old in 1966. Her first job was for Ivory Soap, when she was photographed by Francesco Scavullo. She continued as a successful child model with model agent Eileen Ford, who, in her Lifetime biography, stated that she started her children's division just for Shields. Ford said of her: \"She is a professional child and unique. She looks like an adult and thinks like one.\""}, {"text": "=== 1966–1977: Modeling and career beginnings ===After appearing in the 1974 TV adaptation of Arthur Miller's play After the Fall, Shields made her feature film debut in the New Jersey-shot horror film Alice, Sweet Alice (1976), portraying a young girl who is murdered during her first communion. She was cast in the part after director Alfred Sole had seen her in a print advertisement for Vogue magazine. The film was later re-released in 1981, capitalizing on Shields's rising fame at the time. Next, Shields worked with director Woody Allen in his 1977 film Annie Hall, but her role was cut out of the final edit of the film."}, {"text": "=== 1966–1977: Modeling and career beginnings ===Shields and her mother Teri appeared on the cover of the September 26, 1977 issue of New York Magazine, in a cover story about her modeling career. The main headline on the cover read: \"Meet Teri and Brooke Shields\" while the subtitle read: Brooke is twelve. She poses nude. Teri is her mother. She thinks it's swell."}, {"text": "=== 1966–1977: Modeling and career beginnings ===Although the September 26, 1977 issue was listed in a 2008 collection of classic covers on the New York Magazine website for its 40th anniversary, unlike the other listed issues, there is no link to the cover story about Shields' career as a nude model."}, {"text": "=== 1978–1979: Breakthrough film work ===The 11-year-old Shields was cast as the lead in French director Louis Malle's Pretty Baby (1978), in which she played a child named Violet who lived in a brothel, the daughter of a prostitute played by Susan Sarandon. There were numerous nude scenes in the film, including those in which Shields appeared naked. Her appearance in the film spurred significant controversy, as public worry regarding child sexual abuse had begun to rise at the time of its release. Gossip columnist Rona Barrett called the film \"child pornography\", and director Malle was described as a \"combination of Lolita's Humbert Humbert and (by that point) controversial director Roman Polanski\"."}, {"text": "=== 1978–1979: Breakthrough film work ===She graced the cover of the May 29, 1978 issue of People, which bore the headline \"Brooke Shields, 12, stirs furor over child porn in films.\" "}, {"text": "=== 1978–1979: Breakthrough film work ===She or her body double also appeared in a dorsal nude scene in the 1979 release Just You and Me, Kid, which co-starred George Burns. In the movie, Shields also appeared in a scene where she apparently is naked, covered only by a deflated car tire inner tube while lying in the trunk of Burns' vintage automobile. Shields also was portrayed as nude in a third scene where she was being held hostage. For her work in the movie, she was paid a fee of $250,000 (equivalent to approximately $1,167,857 in 2023 dollars), plus six percent of the profits. "}, {"text": "=== 1978–1979: Breakthrough film work ===Just You and Me, Kid received poor reviews. Critic Roger Ebert, in his Chicago Sun-Times newspaper review, gave the film two out of four stars, calling the film \"a charming disappointment.\" On his Sneak Previews TV show with Chicago Tribune film critic Gene Siskel, both Ebert and Siskel gave the film a thumbs down. Siskel said, \"Brooke Shields is not very interesting when she's on the screen,\" and called her a model \"who just can't act.\""}, {"text": "=== 1978–1979: Breakthrough film work ===Other movies Shields appeared in, in the wake of Pretty Baby, were Wanda Nevada and Tilt, both of which were released in 1979."}, {"text": "=== 1980–81: Modeling and more movies ===In 1980, 14-year-old Shields was the youngest fashion model ever to appear on the cover of Vogue. Later that same year, Shields appeared in controversial print and TV ads for Calvin Klein jeans. The TV ad included her saying the famous tagline: \"You want to know what comes between me and my Calvins? Nothing.\" Brooke Shields ads would help catapult Klein's career to super-designer status."}, {"text": "=== 1980–81: Modeling and more movies ===She next appeared as a lead in The Blue Lagoon (1980), which included nude scenes between teenage lovers stranded on a tropical island (Shields later testified before a U.S. Congressional inquiry that older body doubles were used in some of them). The same year, she was the youngest guest star to ever appear on The Muppet Show, in which she and the Muppets put on their own version of Alice's Adventures in Wonderland. She was also the youngest person to host ABC's Fridays, a Saturday Night Live-like sketch comedy show, in 1981."}, {"text": "=== 1980–81: Modeling and more movies ===Her next major film role was in Franco Zeffirelli's drama Endless Love (1981). The MPAA initially rated Endless Love with an X rating. The film was re-edited to earn an R rating. For her performance in the film, she received her first Razzie Award nomination for worst actress. "}, {"text": "=== 1980–81: Modeling and more movies ===She won the People's Choice Award in the category of Favorite Young Performer in four consecutive years from 1981 to 1984. During this same period, she starred in the USPHS PSA sponsored by the American Lung Association as an initiative that VIPs should become examples and advocates of non-smoking."}, {"text": "=== 1980–81: Modeling and more movies ===By the age of 16, Shields had become one of the most recognizable faces in the United States, because of her dual career as a provocative fashion model and child actress. Time magazine reported in its February 9, 1981, cover story that her day rate as a model was $10,000 (equivalent to approximately $33,514 in 2023). In 1983, Shields appeared on the cover of the September issue of Paris Vogue, the October and November issues of American Vogue and the December edition of Italian Vogue. During that period Shields became a regular at New York City's nightclub Studio 54. "}, {"text": "=== 1980–81: Modeling and more movies ===In the mid-1980s, Shields began her support of the USO by touring with Bob Hope."}, {"text": "=== 1981–83: Legal battle over nude photos ===From 1981 to 1983, Shields, her mother, photographer Garry Gross, and Playboy Press were involved in litigation in the New York City Courts over the rights to photographs her mother had signed away to Gross (when dealing with models who are minors, a parent or legal guardian must sign such a release form while other agreements are subject to negotiation). Gross was the photographer of a controversial set of nude images taken in 1975 of a then ten-year-old Brooke Shields with the consent of her mother, Teri Shields, for the Playboy Press publication Sugar 'n' Spice. The images portray Shields nude, standing and sitting in a bathtub, wearing makeup and covered in oil. The courts ruled in favor of the photographer due to a strange twist in New York law. The ruling would have been decided otherwise if Shields had been considered a child \"performer\" rather than a model."}, {"text": "==== Richard Prince \"Spiritual America\" ====In 1983, in the wake of the legal battle over ownership of the photos, artist Richard Prince photographed one of Gross' photos of the 10-year-old Shields standing naked in a bathtub. Prince had found the picture in a copy of Gross' self-published book Little Women onto Ektachrome slide film, then blew it up to 8x10 inch print. Put in a gold fame, a Prince reproduction of the Gross photo was the sole work displayed in his first \"Spiritual America\" exhibition at store-front art gallery on the Lower East Side of Manhattan. "}, {"text": "==== Richard Prince \"Spiritual America\" ====Later, when a Prince print of Shields was included in his 2009 Spiritual America exhibit at the Tate Modern, it created a stir. It was removed from an exhibition after a warning from the police. "}, {"text": "==== Richard Prince \"Spiritual America\" ====Prince created a numbered series of 10 prints (and two artists proofs) measuring 20 inches by 24 inches (50.8 cm. x 60.9 cm.) of his reproduction of the Gross/Shields photo. In May 2014, copy #10 of Prince's reproduction of the Gross photo was auctioned off by Christie's, fetching a price of $3,973,000. The realized price was within Christie's pre-auction estimate of $3.4-4.5 million."}, {"text": "==== Richard Prince \"Spiritual America\" ====In 2005, the 40-year-old Shields let Prince photograph her wearing a bikini in the same pose as the childhood nude photo, in front of a motorcycle."}, {"text": "=== 1983: Sahara & Razzie Award for Worst Supporting Actor ===Shields played a romantic lead in Sahara (1983) for a fee variously reported as $1 million or $1.5 million. Her mother Teri Shields was executive producer of the picture, with a fee of $25,000. The movie was a critical and financial failure, released only in the Western United States after poor previews and grossing $1.2 million against a budget of $15 million film (equivalent to approximately $47,358,621 in 2023). "}, {"text": "=== 1983: Sahara & Razzie Award for Worst Supporting Actor ===For Sahara, Shields earned the distinction of being the only actress ever to win the Golden Raspberry Award for Worst Supporting Actor. At the 1984 Razzies, she was nominated for both the Worst Actress Award and Worst Supporting Actor, as \"Brooke Shields (with a moustache)\"."}, {"text": "=== 1983–87: Hiatus and academic studies ===After making a minor appearance in The Muppets Take Manhattan, Shields took a career hiatus to focus on her academic studies. She enrolled at Princeton University in the fall of 1983 and graduated with a Bachelor of Arts degree in French literature in 1987. She was a member of the Princeton Triangle Club and the Cap and Gown Club. Her autobiography, On Your Own, was published in 1985. Her 1987 senior thesis was titled \"The Initiation: From Innocence to Experience: The Pre-Adolescent/Adolescent Journey in the Films of Louis Malle, Pretty Baby and Lacombe Lucien.\""}, {"text": "=== 1988–1999: Film, stage, and television roles ===Shields played the eponymous lead in the 1989 movie Brenda Starr, which had been shot in 1986 for an intended 1987 release but was held up for years over legal problems due to the rights to the comic strip and demands from Shields' mother that she receive top-billing in the picture, which co-starred Timothy Dalton. When the film was finally released in 1993, it was roasted by critics and bombed at the box office. "}, {"text": "=== 1988–1999: Film, stage, and television roles ===Kevin Thomas in the Los Angeles Times wrote, \"Brenda Starr (citywide) arrives after some five years of legal disputes over distribution rights. It would have been an act of kindness for all concerned, including the paying customer, to have left it on the shelf where it belongs.\" "}, {"text": "=== 1988–1999: Film, stage, and television roles ===Peter Travers, writing for Rolling Stone, gave the film a negative review, writing, \"There's been so much negative insider buzz about Brooke's 'Brenda' that you might be harboring a hope that the damned thing turned out all right. Get over it. Brenda Starr is not as bad as the also-rans that Hollywood traditionally dumps on us before Labor Day... it's a heap worse.\""}, {"text": "=== 1988–1999: Film, stage, and television roles ===Entertainment Weekly would later place the film on its list of \"21 Worst Comic-Book Movies Ever\"."}, {"text": "=== 1988–1999: Film, stage, and television roles ===In 1993, Shields made a guest appearance in a fourth-season episode of The Simpsons, called \"The Front\". The following year, she starred as Rizzo in the 1994 Broadway revival of Grease."}, {"text": "=== 1988–1999: Film, stage, and television roles ===In a 1996 episode of the popular comedy sitcom Friends, Shields played Joey Tribbiani's stalker. This role led directly to her being cast in the title role of the NBC sitcom Suddenly Susan, in which she starred from 1996 until 2000, and which earned a People's Choice Award in the category of Favorite Female Performer in a New Television Series for her, in 1997, and two Golden Globe nominations."}, {"text": "=== 1988–1999: Film, stage, and television roles ===In 1998, she played a lesbian, Lily, in The Misadventures of Margaret."}, {"text": "=== 2000–2010: Further television and film work ===In 2001, Lifetime aired the film What Makes a Family, starring Shields and Cherry Jones in a true story of a lesbian couple who fought the adoption laws of Florida. For four months, beginning July 2001, Shields portrayed Sally Bowles in the long-running Broadway revival of Cabaret."}, {"text": "=== 2000–2010: Further television and film work ===In 2004, Shields made several of recurring guest appearances on That '70s Show playing Pam Burkhart, Jackie's (Mila Kunis) mother, who later was briefly involved with Donna's (Laura Prepon) father (Don Stark). Shields left That '70s Show when her character was written out."}, {"text": "=== 2000–2010: Further television and film work ===In September 2004, she replaced Donna Murphy in the role of Ruth Sherwood in the 2003 revival of Wonderful Town until the show closed four months later. Her performance was widely praised. Ben Brantley of The New York Times praised the \"goofy sweetness\" she brought to her interpretation of the role, but wrote that she fell short of Donna Murphy's \"perfection.\" In April 2005, Shields played Roxie Hart in a long-running production of Chicago at the Adelphi Theatre in London's West End. Later the same year, she reprised the role in the Broadway revival, from September 9 to October 30. This made her the first performer to have starred in Chicago, Cabaret, and Grease on Broadway, three long-running revivals noted for \"stunt casting\" of celebrities not known for musical theatre."}, {"text": "=== 2000–2010: Further television and film work ===Shields recorded the narration for the Sony/BMG recording of The Runaway Bunny, a concerto for violin, orchestra, and reader, by Glen Roven. It was performed by the Royal Philharmonic and Ittai Shapira."}, {"text": "=== 2000–2010: Further television and film work ===In the late 2000s, Shields guest-starred on shows like FX's Nip/Tuck and CBS's Two and a Half Men. In 2005, Shields appeared in a second-season episode of HBO's Entourage, entitled \"Blue Balls Lagoon\". In 2007, she made a guest appearance on Disney's Hannah Montana, playing Susan Stewart, protagonist Miley Stewart's (Miley Cyrus) mother, who died in 2004. In 2008, she returned in the prime time drama Lipstick Jungle. The series ended a year later."}, {"text": "=== 2000–2010: Further television and film work ===Starting in 2010, she made guest appearances on The Middle as the mother of a brood of terror-inducing children and the nemesis of Frankie Heck (Patricia Heaton). She also appeared as a featured celebrity in NBC's genealogy documentary reality series, Who Do You Think You Are?, where it was revealed that, through her father's ancestry, she is the distant cousin (many generations removed) of King Louis XIV of France, and thus a descendant of both Saint Louis and Henry IV of France."}, {"text": "=== 2011–present: Television hosting; documentary ===Shields took over the role of Morticia Addams in the Broadway musical The Addams Family beginning on June 28, 2011."}, {"text": "=== 2011–present: Television hosting; documentary ===Starting in 2013, Shields has been an occasional guest co-host in the 9:00 hour of Today on NBC. She also recurred during Season Nineteen of Law & Order: Special Victims Unit as Sheila Porter, the maternal grandmother of Olivia Benson's (Mariska Hargitay) adopted son, Noah Porter."}, {"text": "=== 2011–present: Television hosting; documentary ===Shields is the subject of the 2023 documentary, Pretty Baby: Brooke Shields, directed by Lana Wilson, who also directed the Taylor Swift documentary, Miss Americana. The two-part series, which aired on Hulu on 3 April 2023, is \"A look at actor, model and icon Brooke Shields as she transforms from a sexualized young girl to a woman discovering her power.\""}, {"text": "== Other media ==In 2006, Shields penned the book Down Came the Rain: My Journey Through Postpartum Depression and in 2015 she published There Was a Little Girl about the relationship she had with her mother, who suffered from alcoholism throughout Shields's life."}, {"text": "== Other media ==In 2022, she launched a podcast called Now What? focusing on how people respond to adversity."}, {"text": "== Personal life ==As a child, Shields lived with her mother on Manhattan's Upper East Side. In 1990, she purchased a ranch near Big Timber, Montana. She also maintained a home in Los Angeles, which she purchased in 1998 and sold in 2022."}, {"text": "== Personal life ==In the 1990s, Shields promoted physical fitness as an extension of femininity, maintaining that femininity and athletics are compatible."}, {"text": "== Personal life ==Despite coming out against the fur industry in 1989, Shields later went on to create her own mink fur coat at Kopenhagen Fur."}, {"text": "== Personal life ==Shields has been married twice. From 1997 to 1999, she was married to tennis player Andre Agassi; the couple had been together since 1993. Following her divorce from Agassi, she married television writer Chris Henchy in 2001, after they had met through common friends in 1999. They have two daughters,: 63  Rowan Francis Henchy, born May 15, 2003, and Grier Hammond Henchy, born April 18, 2006. As of 2012, they were living in Greenwich Village, New York City."}, {"text": "=== Postpartum depression ===Between April and May 2005, Shields spoke to magazines (such as Guideposts) and appeared on The Oprah Winfrey Show to publicize her battle with postpartum depression, an experience that included depression, thoughts of suicide, an inability to respond to her baby's needs and delayed maternal bonding. Her book, Down Came the Rain, discusses her experience, contributing to a greater public awareness of postpartum depression."}, {"text": "=== Postpartum depression ===In May 2005, actor Tom Cruise—a Scientologist whose beliefs frown upon psychiatry—condemned Shields, both personally and professionally, for using and speaking in favor of the antidepressant drug Paxil. As Cruise said, \"Here is a woman and I care about Brooke Shields, because I think she is an incredibly talented woman, you look at [and think], where has her career gone?\" Shields responded that Cruise's remarks on antidepressants were \"irresponsible\" and \"dangerous\". She also argued that he should \"stick to fighting aliens\" (a reference to Cruise's role in War of the Worlds as well as some of the more esoteric aspects of Scientology doctrine and teachings), \"and let mothers decide the best way to treat postpartum depression.\" Shields responded to a further attack by Cruise with an op-ed titled \"War of Words\", published in The New York Times on July 1, 2005, in which she made an individual case for the medication and stated: \"In a strange way, it was comforting to me when my obstetrician told me that my feelings of extreme despair and my suicidal thoughts were directly tied to a biochemical shift in my body. Once we admit that postpartum is a serious medical condition, then the treatment becomes more available and socially acceptable. With a doctor's care, I have since tapered off the medication but, without it, I wouldn't have become the loving parent I am today.\" On August 31, 2006, according to USA Today, Cruise apologized in person to Shields for the incident; she accepted the apology, saying it was \"heartfelt\". That November, she and her husband attended Cruise's wedding to Katie Holmes."}, {"text": "=== Relationship with Michael Jackson ===On July 7, 2009, Shields spoke at the memorial service for Michael Jackson. She stated in that speech that she first met Jackson when she was 13 years old, and the two instantly became friends. Shields said:"}, {"text": "=== Relationship with Michael Jackson ===Thinking back to when we met and the many times that we spent together and whenever we were out together, there would be a caption of some kind, and the caption usually said something like 'an odd couple' or 'an unlikely pair,' but to us it was the most natural and easiest of friendships... Michael always knew he could count on me to support him or be his date and that we would have fun no matter where we were. We had a bond... Both of us needed to be adults very early, but when we were together, we were two little kids having fun."}, {"text": "=== Relationship with Michael Jackson ===In her eulogy, she shared anecdotes, including an occasion in which she was his date for one of Elizabeth Taylor's weddings, and the pair sneaked into Taylor's room to get the first look at her dress, only to discover Taylor asleep in the bed. Shields gave a tearful speech, referring to the many memories she and Jackson shared and briefly joked about his famous sequin glove. She also mentioned Jackson's favorite song, \"Smile\" by Charlie Chaplin, which was later sung in the memorial service by Jermaine Jackson."}, {"text": "=== Relationship with Michael Jackson ===Jackson stated in his 1993 interview with Oprah Winfrey that he was dating Shields at the time. Shields has stated that Jackson asked her to marry him numerous times and to adopt a child together."}, {"text": "=== Relationship with Michael Jackson ===In a conversation with Rabbi Shmuley Boteach in 2001, Jackson said of Shields:"}, {"text": "=== Relationship with Michael Jackson ===That was one of the loves of my life. I think she loved me as much as I loved her, you know? We dated a lot. We, we went out a lot. Her pictures were all over my wall, my mirror, everything. And I went to the Academy Awards with Diana Ross and this girl walks up to me and says 'Hi, I'm Brooke Shields.' Then she goes, 'Are you going to the after-party?' I go, 'Yeah.' 'Good, I'll see you at the party.' I'm going, 'Oh my God, does she know she's all over my room?' So we go to the after-party. She comes up to me she goes, 'Will you dance with me?' I went, 'Yes. I will dance with you.' Man, we exchanged numbers and I was up all night, singing, spinning around my room, just so happy. It was great."}, {"text": "== Relationship with mass media ==Shortly after Shields graduated from Princeton University, her four-year transcript was published in the July 1987 edition of Life magazine. Based on that transcript, The New York Times published a light-hearted op-ed piece intended to tweak the claim that Princeton produced superior, well-rounded graduates. Noting that Shields \"got all As and Bs, and obviously paid attention to her school work\", it claimed she \"got cheated\" because Princeton did not require her to take any classical studies, medieval, modern or American history, or any course in mathematics, philosophy, economics, political science, world literature, or science with laboratory experience. \"[I]f that adds up to a liberal arts education from a place like Princeton, there is no longer any danger that our society will ever suffer from elitism in any form.\""}, {"text": "== Relationship with mass media ==The article was indicative of the intense media scrutiny faced by Shields after the release of Pretty Baby. The daughter of the film's director, Chloe Malle, in a March 2023 Vogue profile of Shields, wrote: "}, {"text": "== Relationship with mass media ==The media loved her, but they also pilloried her. Like Framing Britney Spears, the documentary clarifies—with the benefit of time and perspective—the role of the media as the relentless villain in Shields's story. Reporters' lack of tenderness toward a preteen girl and demands that she answer for the way that she was sexualized onscreen are perhaps the most gasp-inducing parts of the film. \"They're shocking,\" agrees Shields, recalling an interview with Barbara Walters in which the journalist asked Shields to stand up and compare her measurements to Walters's own. \"I felt more objectified and abused by [that],\" says Shields. \"The irony is I didn't have that discomfort or shame in the one nude scene in Pretty Baby.\""}, {"text": "== Published works ==Shields, Brooke (1978). The Brooke Book. Pocket Books. ISBN 978-0-671-79018-9."}, {"text": "== Published works ==Shields, Brooke (1985). On Your Own. Villard. ISBN 978-0-394-54460-1."}, {"text": "== Published works ==Shields, Brooke (2006). Down Came the Rain: My Journey Through Postpartum Depression. Hyperion. ISBN 978-1-61553-007-6."}, {"text": "== Published works ==Shields, Brooke (2009). It's the Best Day Ever, Dad!. Illustrated by Cori Doerrfeld. Middle Grade. ISBN 978-0-06-172445-9."}, {"text": "== Published works ==Shields, Brooke (2014). There Was a Little Girl: The Real Story of My Mother and Me. Dutton Adult. ISBN 978-0-525-95484-2."}, {"text": "== External links ==Brooke Shields at IMDb"}, {"text": "== External links ==Brooke Shields at Turner Classic Movies"}, {"text": "== External links ==Brooke Shields at the Internet Broadway Database "}, {"text": "== External links ==Brooke Shields at the Internet Off-Broadway Database"}, {"text": "== External links ==WebMD article on Brooke Shields and Postpartum Depression"}, {"text": "== External links ==\"Regarding Ardy\": an online short film with Brooke Shields"}, {"text": "== External links ==\"The Runaway Bunny\" violin concerto, by Glen Roven and narrated by Brooke Shields Archived April 22, 2009, at the Wayback Machine"}, {"text": "== External links ==Brooke Shields 2007 Interview on Sidewalks Entertainment"}, {"text": "== External links ==Brooke Shields 2007 short film on Funny or Die"}, {"text": "== External links ==Brooke Shields on Barbara Walters"}]