[{"text": "Cornelius Crane \"Chevy\" Chase (; born October 8, 1943) is an American comedian, actor, and writer. He became the breakout cast member in the first season of Saturday Night Live (1975–1976), where his recurring Weekend Update segment became a staple of the show. As both a performer and a writer on the series, he earned two Primetime Emmy Awards out of four nominations.After leaving Saturday Night Live early in its second season, he established himself as a leading man, starring in some of the most successful comedy films of the 1980s, starting with his Golden Globe–nominated role in the romantic comedy Foul Play (1978). Most famously, he portrayed Ty Webb in Caddyshack (1980), Clark W. Griswold in five National Lampoon's Vacation films, and Irwin \"Fletch\" Fletcher in Fletch (1985). He also starred in Seems Like Old Times (1980), Spies Like Us (1985), Three Amigos! (1986), and Funny Farm (1988)."}, {"text": "He has hosted the Academy Awards twice (1987 and 1988) and briefly had his own late-night talk show, The Chevy Chase Show (1993). Chase had a resurgence with his role as Pierce Hawthorne on the NBC sitcom Community (2009–2014)."}, {"text": "=== Family ===Cornelius Crane Chase was born in Lower Manhattan on October 8, 1943, and grew up in Woodstock, New York. He has an older brother, Ned Jr.His father, Edward Tinsley \"Ned\" Chase (1919–2005), was a Princeton-educated Manhattan book editor and magazine writer. Chase's paternal grandfather was artist and illustrator Edward Leigh Chase, and his great-uncle was painter and teacher Frank Swift Chase. His mother, Cathalene Parker (née Browning; 1923–2005), was a concert pianist and librettist, whose father, Rear Admiral Miles Browning, served as Admiral Raymond A. Spruance's Chief of Staff on the aircraft carrier USS Enterprise (CV-6) at the Battle of Midway in World War II. Cathalene was adopted as a child by her stepfather, Cornelius Vanderbilt Crane, heir to The Crane Company, and took the name Catherine Crane. Her mother, also named Cathalene, was an opera singer who performed several times at Carnegie Hall.Chase was named for his adoptive grandfather, Cornelius, while the nickname \"Chevy\" was bestowed by his grandmother from the medieval English ballad \"The Ballad of Chevy Chase\". As a descendant of the Scottish Clan Douglas, she thought the name appropriate.  Chase is a 14th-generation New Yorker, and was listed in the Social Register at an early age. His mother's ancestors arrived in Manhattan starting in 1624 — among those ancestors are:"}, {"text": "=== Family ===New York City mayors Stephanus Van Cortlandt and John Johnstone"}, {"text": "=== Family ===the Dutch Schuyler family, through his ancestor Gertrude Schuyler, the wife of Stephanus Van Cortlandt"}, {"text": "=== Family ===John Morin Scott, General of the New York Militia during the American Revolution"}, {"text": "=== Family ===Anne Hutchinson, dissident Puritan preacher and healer"}, {"text": "=== Family ===Mayflower passengers and signers of the Mayflower Compact from England, John Howland, and William Brewster, the Pilgrim colonist leader and spiritual elder of the Plymouth ColonyAccording to his step-brother John:"}, {"text": "=== Family ===[Chevy] once told me that people who defined themselves in terms of their ancestry were like potatoes—the best parts of them were underground. He disdained the pretension of his mother's side of the family, as embodied by her mother, Cattie."}, {"text": "=== Early life ===As a child, Chase vacationed at Castle Hill, the Cranes' summer estate in Ipswich, Massachusetts. Chase's parents divorced when he was four; his father remarried into the Folgers coffee family, and his mother remarried twice. He has stated that he grew up in an upper middle class environment and that his adoptive maternal grandfather did not bequeath any assets to Chase's mother when he died. In a 2007 biography, Chase stated that he was physically and psychologically abused as a child by his mother and stepfather, John Cederquist. Both of his parents died in 2005.Chase was educated at Riverdale Country School, an independent day school in the Riverdale neighborhood of The Bronx, New York City, before being expelled. He ultimately graduated as valedictorian in 1962 from the Stockbridge School, an independent boarding school in the town of Stockbridge, Massachusetts. At Stockbridge, he was known as a practical joker with an occasional mean streak. He attended Haverford College during the 1962–1963 term, where he was noted for slapstick comedy and an absurd sense of physical humor, including his signature pratfalls and \"sticking forks into his orifices\". During a 2009 interview on the Today show, he ostensibly verified the oft-publicized urban legend that he was expelled for harboring a cow in his fourth floor room, although his former roommate David Felson asserted in a 2003 interview that Chase left for academic reasons. Chase transferred to Bard College in Annandale-on-Hudson, New York, where he studied a pre-med curriculum and graduated in 1967 with a Bachelor of Arts in English.Chase did not enter medical school, which meant he was subject to the military draft. Chase was not drafted, and when he appeared in January 1989 as the first guest of the just-launched late-night The Pat Sajak Show, he said he had \"convinced\" his draft board he deserved a 4-F classification by \"'falsely' claiming, among other things, that he had homosexual tendencies\".He played drums with the college band The Leather Canary, headed by school friends Walter Becker and Donald Fagen. Chase has called the group \"a bad jazz band\"; Becker and Fagen later founded the successful group Steely Dan. Chase has perfect pitch. He played drums and keyboards for a rock band called Chamaeleon Church, which recorded one album for MGM Records before disbanding in 1969. To give the album a more soft-rock sound, producer Alan Lorber made several alterations in the mixing, including the muting of Chase's bass drum, and Chase was reportedly incensed when he heard the final mix."}, {"text": "=== 1967–1974: Early career ===Chase was a member of an early underground comedy ensemble called Channel One, which he co-founded in 1967. He also wrote a one-page spoof of Mission: Impossible for Mad magazine in 1970 and was a writer for the short-lived Smothers Brothers TV show comeback in the spring of 1975. Chase made the move to comedy as a full-time career by 1973, when he became a writer and cast member of The National Lampoon Radio Hour, a syndicated satirical radio series. The National Lampoon Radio Hour also featured John Belushi, Gilda Radner, Bill Murray, and Brian Doyle-Murray, all of whom later became the \"Not-Ready-For-Prime Time Players\" on NBC Saturday Night (later re-titled NBC's Saturday Night and finally Saturday Night Live). Chase and Belushi also appeared in National Lampoon's off-Broadway revue Lemmings, a sketch and musical send-up of popular youth culture, in which Chase also played the drums and piano during the musical numbers. He appeared in the movie The Groove Tube, which was directed by another co-founder of Channel One, Ken Shapiro, featuring several Channel One sketches."}, {"text": "=== 1975–1976: Saturday Night Live ===Chase was one of the original cast members of Saturday Night Live (SNL), NBC's late-night comedy television show, beginning in October 1975. During the first season, he introduced every show except two, with \"Live from New York, it's Saturday Night!\" The remark was often preceded by a pratfall, known as \"The Fall of the Week\". Chase became known for his skill at physical comedy. In one comedy sketch, he mimicked a real-life incident in which President Gerald Ford accidentally tripped while disembarking from Air Force One in Salzburg, Austria. This portrayal of President Ford as a bumbling klutz became a favorite device of Chase's, and helped form the popular concept of Ford as being a clumsy man. In later years, Chase met and became friendly with President Ford.Chase was the original anchor for the Weekend Update segment of SNL, and his catchphrase introduction, \"I'm Chevy Chase… and you're not\" became well known. His trademark conclusion, \"Good night, and have a pleasant tomorrow\" was later resurrected by Jane Curtin and Tina Fey. Chase also wrote comedy material for Weekend Update. For example, he wrote and performed \"The News for the Hard of Hearing\". In this skit, Chase read the top story of the day, aided by Garrett Morris, who repeated the story by loudly shouting it. Chase claimed that his version of Weekend Update was the inspiration for later news satire shows such as The Daily Show and The Colbert Report. Weekend Update was later revived as a segment on The Chevy Chase Show, a short-lived late-night talk show produced by Chase and broadcast by Fox Broadcasting Company."}, {"text": "=== 1975–1976: Saturday Night Live ===Chase was committed contractually to SNL for only one year as a writer and became a cast member during rehearsals just before the show's premiere. He received two Emmy Awards and a Golden Globe Award for his comedy writing and live comic acting on the show. In Rolling Stone's February 2015 appraisal of all 141 SNL cast members to date, Chase was ranked tenth in overall importance. \"Strange as it sounds, Chase might be the most under-rated SNL player,\" they wrote. \"It took him only one season to define the franchise…without that deadpan arrogance, the whole SNL style of humor would fall flat.\"In a 1975 New York magazine cover story, which called him \"The funniest man in America\", NBC executives referred to Chase as \"The first real potential successor to Johnny Carson\" and claimed he would begin guest-hosting The Tonight Show Starring Johnny Carson within six months of the article. Chase dismissed rumors that he could be the next Carson by telling New York, \"I'd never be tied down for five years interviewing TV personalities.\" Chase did not appear on the program until May 4, 1977, when he was promoting a prime-time special for NBC. Carson later said of Chase: \"He couldn't ad-lib a fart after a baked-bean dinner.\"Chase acknowledged Ernie Kovacs's influence on his work in Saturday Night Live, and he thanked Kovacs during his acceptance speech for his Emmy Award. In addition, Chase spoke of Kovacs's influence on his work in an appearance in the 1982 documentary called Ernie Kovacs: Television's Original Genius."}, {"text": "=== 1976–1989: Film stardom and acclaim ===In late 1976, in the middle of the second season, Chase became the first member of the original cast to leave the show. While he landed starring roles in several films on the strength of his SNL fame, he asserted that the principal reason for his departure was the reluctance of his girlfriend, Jacqueline Carlin, to move to New York. Chase moved to Los Angeles, married Carlin, and was replaced by Bill Murray, although he made a few cameo appearances on the show during the second season."}, {"text": "=== 1976–1989: Film stardom and acclaim ===Chase hosted SNL eight times from 1978 to 1997. In regards to Chase's 1997 appearance as a host, SNL creator and show-runner Lorne Michaels disputed reports that he was shocked by Chase's behavior or had banned him as a result, claims which he calls \"idiotic\". While Chase has not returned to SNL to host since 1997, he appeared on the show's 25th anniversary special in 1999 and was interviewed for a 2005 NBC special on the first five years of SNL. Later appearances included a Caddyshack skit featuring Bill Murray, a 1997 episode with guest host Chris Farley, as the Land Shark in a Weekend Update segment in 2001, another Weekend Update segment in 2007, and in Justin Timberlake's monologue in 2013 as a member of the Five-Timers Club, where he was reunited with his Three Amigos co-stars Steve Martin and Martin Short. He also participated in the 40th anniversary special in February 2015."}, {"text": "=== 1976–1989: Film stardom and acclaim ===Chase's early film roles included Tunnel Vision, the box office hit Foul Play that earned more than $44 million, and Oh! Heavenly Dog. The role of Eric \"Otter\" Stratton in National Lampoon's Animal House was originally written with Chase in mind, but he turned the role down to work on Foul Play. The role went to Tim Matheson instead. Chase said in an interview that he chose to do Foul Play so he could do \"real acting\" for the first time in his career instead of just doing \"schtick\". Chase followed Foul Play with the successful Harold Ramis comedy Caddyshack, in 1980. Caddyshack was a major box office success, pulling in $39 million off a $6 million budget. It has since become a classic, currently sitting at a 73% approval rate on Rotten Tomatoes, with critics saying: \"Though unabashedly crude and juvenile, Caddyshack nevertheless scores with its classic slapstick, unforgettable characters, and endlessly quotable dialogue\". That same year, he also reunited with Foul Play co-star Goldie Hawn for Neil Simon's Seems Like Old Times which was also successful at the box office, earning more than $43 million. After this, he released a self-titled record album, co-produced by Chase and Tom Scott, with novelty and cover versions of songs by Randy Newman, Barry White, Bob Marley, the Beatles, Donna Summer, Tennessee Ernie Ford, The Troggs, and The Sugarhill Gang."}, {"text": "=== 1976–1989: Film stardom and acclaim ===Chase narrowly escaped death by electrocution during the filming of Modern Problems in 1980. During a sequence in which Chase's character wears \"landing lights\" as he dreams that he is an airplane, the lights malfunctioned and an electric current passed through Chase's arm, back, and neck muscles. The near-death experience caused Chase to experience a period of deep depression, as his marriage to Jacqueline had ended just prior to the start of filming. Chase continued his film career in 1983's National Lampoon's Vacation, directed by Ramis and written by John Hughes. This one, grossing $61 million off a $15 million budget, was his most successful movie at the time. He married Jayni Luke in 1982, and in 1985 he starred in Fletch, which grossed over $50 million off an $8 million budget. This was the first of two films based on Gregory Mcdonald's Fletch books. Chase later co-starred with fellow SNL alum Dan Aykroyd in Spies Like Us. Chase joined SNL veterans Steve Martin and Martin Short in the Lorne Michaels–produced comedy Three Amigos in 1986, declaring in an interview that making Three Amigos was the most fun he had making a film. This film was also very successful, grossing $39 million off a $25 million budget with critics saying: \"Three Amigos! stars a trio of gifted comedians and has an agreeably silly sense of humor\". The trio later hosted SNL that year, the only time the show has had three hosts on one show. "}, {"text": "=== 1976–1989: Film stardom and acclaim ===In 1987, his Cornelius Productions company had set up a non-exclusive, albeit first-refusal deal with Warner Bros., in order to develop four feature projects at the studio, and a fifth project set up at Universal Pictures. In 1988, he starred alongside Madolyn Smith in Funny Farm which was a sizeable hit at $25 million and currently has a 65% approval rate on Rotten Tomatoes."}, {"text": "=== 1976–1989: Film stardom and acclaim ===At the height of his career in the late 1980s, Chase earned around US$7 million per film and was a highly visible celebrity. He appeared alongside Paul Simon, one of his best friends, in Simon's 1986 second video for \"You Can Call Me Al\", in which he lip-syncs all of Simon's lyrics. Chase hosted the Academy Awards in 1987 and 1988, opening the telecast in 1988 with the quip, \"Good evening, Hollywood phonies!\" Chase filmed a sequel to Vacation, 1985's National Lampoon's European Vacation, this movie pulling in just shy of $50 million at the box office, and then a third film, National Lampoon's Christmas Vacation in 1989, which pulled in $71 million and, thanks to its holiday theme, has become one of his more durable films."}, {"text": "=== 1990–2009: Career fluctuations ===He played saxophone onstage at Simon's free concert at the Great Lawn in Central Park in the summer of 1991. Later in 1991, he helped record and appeared in the music video \"Voices That Care\" to entertain and support U.S. troops involved in Operation Desert Storm, and supported the International Red Cross. Chase had three consecutive film flops—1991's Razzie Award–nominated Nothing but Trouble, 1992's Memoirs of an Invisible Man, and 1994's Cops & Robbersons. The three releases had a combined gross of $34 million in the United States.   In September 1993, Chase hosted The Chevy Chase Show, a weeknight talk show, for the Fox Broadcasting Company. Although it had high commercial expectations, the show was cancelled by Fox after five weeks. Chase later appeared in a commercial for Doritos, airing during the Super Bowl, in which he made humorous reference to the show's failure.Chase found success with some of his subsequent movies.  1995's Man of the House, co-starring Farrah Fawcett, was relatively successful, grossing $40 million and 1997's Vegas Vacation was a box office success, grossing $36.4 million. 2000's Snow Day, in which Chase appeared, was also successful grossing over $60 million, as well as Orange County in 2002, grossing more than $40 million. Chase was Hasty Pudding's 1993 Man of the Year, and received a star on the Hollywood Walk of Fame in that same year. He also received The Harvard Lampoon's Lifetime Achievement Award in 1996. In 1998, a Golden Palm Star on the Palm Springs, California, Walk of Stars was dedicated to him.He was roasted by the New York Friars Club for a Comedy Central television special in 2002. This roast was noted for being unusually vitriolic, even by the standards of a roast. Some of the more recent films starring Chase (e.g., Vacuums, Rent-a-Husband, Goose!) have not been widely released in the United States. He returned to mainstream movie-making in 2006, co-starring with Tim Allen and Courteney Cox in the comedy Zoom, though it was both a critical and commercial failure. Chase guest-starred as an anti-Semitic murder suspect in \"In Vino Veritas\", the November 3, 2006, episode of Law & Order. He also guest-starred in the ABC drama series Brothers & Sisters in two episodes as a former love interest of Sally Field's character. Chase appeared in a prominent recurring role as villainous software magnate Ted Roark on the NBC spy-comedy Chuck. In 2009, Chase and Dan Aykroyd voiced themselves in the Family Guy episode \"Spies Reminiscent of Us\"."}, {"text": "=== 2009–2012: Return to television ===Starting in 2009, Chase returned to NBC in the sitcom Community, as aging moist-towelette tycoon Pierce Hawthorne. The show was created by Dan Harmon and starred Joel McHale, Alison Brie, Gillian Jacobs, Donald Glover, Danny Pudi, and Yvette Nicole Brown. The series received critical acclaim for its acting and writing, appeared on numerous critics' year-end \"best-of\" lists and developed a cult following. The New York Times critic Alessandra Stanley praised the casting of Chase writing \"Jeff has the kind of sardonic repartee and slapdash nonchalance that the comedian Chevy Chase had when he was the young star of the “Fletch” movies\" and added \"Even that is an inside casting joke: Mr. Chase, who is farcically loopy and delightful in the pilot\".Throughout the filming of Community seasons one through four, Chase became increasingly frustrated and uncomfortable with the direction of his character, Pierce, who is a bigot."}, {"text": "=== 2009–2012: Return to television ===It was reported that in 2012 Chase \"snapped and launched the tirade, airing his frustration and suggesting that the way things with Pierce are going, he may next be asked to call Troy (Glover) or Shirley (Brown) the N-word\". While Chase apologized for his outburst he proceeded to leave the show, due to increasing disagreements with his character and the show's creator Dan Harmon. After a mutual agreement with the network, his character was abruptly written out of the fourth season of Community. Chase later claimed that his exit was due to his personal opinions of the show rather than the outburst, claiming that it \"wasn't funny enough\". His departure was cemented by the writers making the creative decision to kill off Pierce, in the third episode of Community's fifth season."}, {"text": "=== 2010–present ===In 2010, he appeared in the film Hot Tub Time Machine which received some praise, as well as a short online film featuring the Griswold Family, and in the Funny or Die original comedy sketch \"Presidential Reunion\", where he played President Ford alongside other current and former SNL president impersonators. 2019 saw him in the Netflix movie The Last Laugh where he starred alongside Richard Dreyfuss.  In 2015, Chase reprised his role as Clark Griswold in the fifth Vacation installment, titled Vacation. Unlike the previous four films in which Clark is the main protagonist, he only has a brief though pivotal cameo appearance. In spite of largely negative critical reception, the film itself has proven to be a financial success grossing over $107 million worldwide, making it the highest-grossing entry to date."}, {"text": "=== Marriage and family ===Chase has a son named Bryan Perkins with an unidentified woman. Chase married Susan Hewitt in New York City on February 23, 1973. They divorced on February 1, 1976. His second marriage, to Jacqueline Carlin, was formalized on December 4, 1976, and ended in divorce on November 14, 1980; they had no children. He married his third wife, Jayni Luke, in Pacific Palisades on June 19, 1982. He and Luke have three daughters, Caley, Emily, and Cydney. The couple reside in Bedford, New York."}, {"text": "=== Substance abuse ===In 1986, Chase was admitted to the Betty Ford Center for treatment of a prescription painkiller addiction. His use began after he experienced ongoing back pain related to the pratfalls he took during his Saturday Night Live appearances. In 2010, he said that his drug abuse had been \"low level.\" He entered the Hazelden Clinic in September 2016 to receive treatment for alcoholism."}, {"text": "=== Political views ===An active environmentalist and philanthropist, Chase holds liberal political views. He raised money for Bill Clinton in the 1990s, and for John Kerry in the 2004 presidential election. In 2004, he mocked President George W. Bush during a speech at a People for the American Way benefit at the John F. Kennedy Center for the Performing Arts, where he referred to Bush as an \"uneducated, real lying schmuck\" and a \"dumb fuck\", which stunned the organizers and the crowd and which Norman Lear categorized as \"utterly untoward.\""}, {"text": "=== Fight with Bill Murray ===While filming an episode of Saturday Night Live in 1978, Chase got into a fistfight with Bill Murray in John Belushi's dressing room. Murray and Chase's backstage brawl took place when Chase returned to host the show after his exit as a full-time cast member in 1976. Murray had reportedly made a derogatory comment about Chase's troubled marriage to Jacqueline Carlin, leading Chase to criticize Murray's physical appearance. SNL cast members Jane Curtin, Laraine Newman, and Gilda Radner witnessed the incident.In a talk show appearance in 2021, Newman noted of the altercation, \"it was very sad and painful and awful\". She went on to say, \"I think they both knew the one thing that they could say to one another that would hurt the most and that's what I think incited it.\" Chase and Murray would later reconcile to star together in Caddyshack in 1980."}, {"text": "== Awards and nominations ==On September 23, 1993, Chase received a star on the Hollywood Walk of Fame at 7021 Hollywood Blvd."}, {"text": "== Further reading ==I'm Chevy Chase...and You're Not (The Authorized Biography) by Rena Fruchter. Virgin Books, 2007. ISBN 1-85227-346-1."}, {"text": "== Further reading ==Who's Who in Comedy by Ronald L. Smith. Pp. 102–103. New York: Facts on File, 1992. ISBN 0-8160-2338-7."}, {"text": "== Further reading ==Live from New York: An Uncensored History of Saturday Night Live by Tom Shales and James Andrew Miller. Back Bay Books."}, {"text": "== External links ==Chevy Chase at IMDb"}, {"text": "== External links ==Interview with Chevy Chase, Steve Martin, Martin Short about The Three Amigos in 1986 from Texas Archive of the Moving Image"}, {"text": "== External links ==Chevy Chase at the Internet Off-Broadway Database"}]