[{"text": "Christina María Aguilera ( AG-il-AIR-ə, Spanish: [kɾisˈtina maˈɾi.a aɣiˈleɾa]; born December 18, 1980) is an American singer, songwriter, actress, and television personality. Referred to as the \"Voice of a Generation\", she is noted for her four-octave vocal range, musical reinventions, sustaining high notes including use of the whistle register, and a signature use of melisma throughout her music. Recognized as an influential figure in popular music, she also became known for incorporating controversial themes such as feminism, sexuality, LGBT culture and the sex-positive movement into her work. Aguilera was also honoured as a Disney Legend, for her contributions to The Walt Disney Company."}, {"text": "After appearing on The All-New Mickey Mouse Club (1993–1994) as a child, Aguilera recorded \"Reflection\", the theme for the 1998 animated film Mulan and signed a record deal with RCA Records. She rose to fame in 1999 with her self-titled debut album and the US Billboard Hot 100 number-one singles, \"Genie in a Bottle\", \"What a Girl Wants\" and \"Come On Over Baby (All I Want Is You)\". Aguilera also won the Grammy Award for Best New Artist and followed with Mi Reflejo (2000) and My Kind of Christmas (2000); with the former becoming the best-selling Latin pop album of 2000. After gaining more control over her career, Aguilera sought a departure from her teen idol image and released Stripped (2002). Despite an initial mixed response, the album went on to become one of the best-selling albums of the 21st century. Aguilera underwent another reinvention with the release of the critically praised old-school-music inspired Back to Basics (2006). Throughout these periods, she amassed numerous international successes, including the number-one single \"Lady Marmalade\", alongside \"Beautiful\", \"Dirrty\", \"Can't Hold Us Down\", \"Fighter\", \"Ain't No Other Man\" and \"Hurt\"."}, {"text": "Throughout the early 2010s, Aguilera had a moderately successful period with the albums Bionic (2010) and Lotus (2012), with their respective lead singles, \"Not Myself Tonight\" and \"Your Body\", topping the Dance Club Songs chart. She also starred in the 2010 film Burlesque and contributed to its soundtrack, earning a Golden Globe Award nomination. Aguilera returned to the top of the charts with a string of collaborations, including \"Feel This Moment\", \"Say Something\", and \"Moves like Jagger\"; with the latter reaching number-one on the Hot 100, making Aguilera one of the few artists to reach the top spot over three decades. She found critical success with her follow-up albums Liberation (2018) and Aguilera (2022). Her concurrent ventures included a role in the series Nashville (2015), roles in the films The Emoji Movie (2017) and Zoe (2018), becoming an ambassador for the World Food Programme (WFP), performing two concert residencies and serving as a coach on the reality competition show The Voice (2011–2016)."}, {"text": "Aguilera is one of the best-selling music artists of all time, with estimated sales of over 90 million records sold worldwide. Considered a pop culture icon and a triple threat entertainer, she has been named one of the greatest vocalists of all time by publications such as Rolling Stone and Consequence of Sound and has been hailed as one of the most successful artists to come out of the 2000s. In 2009, Billboard named her the twentieth most successful artist of the decade, and was ranked eighth on VH1's list of greatest women in music. Aguilera has since been regarded as one of the most influential Latin artists in the entertainment industry, having helped shape the \"Latin explosion\" in the music industry. Her accolades include five Grammy Awards, two Latin Grammy Awards, six ALMA Awards, two MTV Video Music Awards (VMA), one Billboard Music Award, one Guinness World Record, and a star on the Hollywood Walk of Fame."}, {"text": "== Early life and education ==Christina María Aguilera was born on December 18, 1980, in New York City, to Shelly Loraine (née Fidler) and Fausto Wagner Xavier Aguilera. Her father is an Ecuadorian emigrant from Guayaquil while her mother has German, Irish, Welsh, and Dutch ancestry. Fausto Aguilera was a United States Army sergeant, and Shelly Loraine was a violinist in the American Youth Symphony before becoming a Spanish translator.Due to Fausto's military service, Aguilera's family moved frequently, living in New Jersey and Texas. In 1983, they moved to Japan and lived in Sagamihara for at least two years. During her youth in Pittsburgh metropolitan area, Aguilera attended North Allegheny Intermediate High School before leaving there to be homeschooled to avoid bullying she experienced at school.In 1986, the family returned to the United States, and settled in Pennsylvania, where they welcomed her younger sister, Rachel, in 1986. Aguilera has spoken out about her father's physically and emotionally abusive behavior. She noted that this is what made her turn to music, noting that, \"growing up in an unstable environment and whatnot, music was my only real escape\". In 1987, Shelly filed to divorce Fausto and moved with Aguilera and Rachel to her mother's home in Rochester, a suburb of Pittsburgh. She later married James Kearns with whom she had a son named Michael. In 2012, following decades of estrangement, Aguilera expressed interest in reconciling with her biological father.Aguilera moving to her grandmother's home allowed her to explore her grandmother's records, which featured mostly soul and blues singers and increased her interest in music. She also began to practice singing in public and competing in talent contests. Following numerous contests, she earned reputation in her neighborhood as the \"little girl with a big voice\" and received widespread attention from local television and radio programs.In 1990, she performed the popular song \"A Sunday Kind of Love\" on the reality competition show Star Search, but was eliminated during the semi-final round. Aguilera was eventually invited to sing \"The Star-Spangled Banner\" before Pittsburgh Penguins hockey, Pittsburgh Steelers football, and Pittsburgh Pirates baseball games, and at the 1992 Stanley Cup Finals."}, {"text": "=== 1993–1998: Career beginnings ===In 1991, Aguilera auditioned for a position on The All-New Mickey Mouse Club (MMC), aired on the Disney Channel. She ran against 400 candidates, and while she made the shortlist she was ultimately rejected for not meeting the minimum age requirement. One year later, in 1992, Aguilera received a call from one of the show's producers asking if she was still interested in becoming a \"Mouseketeer\". She once again competed for a spot (this time, against 15,000 candidates) and was selected to join the variety program the following year. Her fellow cast members included Ryan Gosling, Keri Russell, Britney Spears, and Justin Timberlake. During the show recordings—which included Aguilera performing musical numbers and comedy sketches—she moved with her family to Orlando, Florida. In 1994, it was reported the series would not return for a new season.Aiming to begin a music career, Aguilera moved to Japan in 1997. She was selected to record a duet with Japanese singer Keizo Nakanishi, with whom she performed in concert shows around the country. Their song, \"All I Wanna Do\", was released as a single but failed to reach commercial success. In June 1997, Aguilera went on to Romania to represent the United States in a singers contest during the Golden Stag Festival, but she failed to win over the audience.Seeking a recording contract, Aguilera recorded numerous demo tapes directed to record labels, including Walt Disney Records, for which she sent a cover of \"Run to You\" by Whitney Houston. She eventually was chosen to record \"Reflection\", the theme song from the animated film Mulan (1998), which reached number 15 on the Billboard Adult Contemporary chart. Following the attention she received with \"Reflection\", Aguilera caught the ear of Ron Fair, the A&R executive from RCA Records, who consequently signed Aguilera to the label. In late 1998, she began to record her debut studio album into which producers reportedly invested over $1 million worth of writers, producers and vocal lessons."}, {"text": "=== 1999–2001: Breakthrough with debut album ===In May 1999, Aguilera released \"Genie in a Bottle\", the lead single off her long-awaited debut album, which topped the Billboard Hot 100 for five consecutive weeks and became the second best-selling single of 1999. The song became an international success, increasing Aguilera's popularity worldwide, topping the charts in over 20 countries. The single also attracted the attention of conservatives including celebrities such as Debbie Gibson that spoke out against its lyrical content, and was eventually considered \"too provocative\" to be sung by a teen idol. Due to the criticism, Radio Disney replaced the song with a censored version. The song was nominated for a Grammy Award for Best Female Pop Vocal Performance.Aguilera's self-titled debut album, Christina Aguilera, was released on August 24, 1999, to critical praise, debuting at number one on the Billboard 200. It catapulted Aguilera into fame globally and sold over ten million copies in its first year. It was later certified eight times platinum by the Recording Industry Association of America (RIAA), and it has sold over 17 million copies worldwide. Originally, Aguilera's desire was to create material directly inspired by R&B and soul, but the label opted for a more teen pop production due the genre's high financial return in the late 1990s. At the 42nd Annual Grammy Awards, Aguilera won the Best New Artist category for which Time credited the award for \"[helping] certify her credentials as a real singer\"."}, {"text": "=== 1999–2001: Breakthrough with debut album ===After the album's release, \"What a Girl Wants\", topped the Hot 100 and is recognised as the first new number one entry on the chart for the 2000's decade. The song was also nominated for Best Female Pop Vocal Performance at the 43rd Annual Grammy Awards. This was followed with \"I Turn to You\" which reached number three there, and \"Come On Over Baby (All I Want Is You)\" which became Aguilera's third number one song and achieved worldwide success. She also released a cover of \"The Christmas Song\" in November 1999 which peaked at number 18 and became the second highest charting position of the song after the original in 1944.In May 2000, Aguilera embarked on her debut concert tour, Christina Aguilera in Concert, which toured North America, Latin America, Europe, and Japan until February 2001. Her success continued to rise with the release of her second studio album, Mi Reflejo, in September 2000 which topped both the Billboard Top Latin Albums and Latin Pop Albums for nineteen consecutive weeks. The album featured Spanish-language versions of several songs from her debut album along with new songs, and had Latin pop themes. Three singles were release for the album including the Spanish version of \"Come On Over Baby (All I Want Is You)\" titled \"Ven Conmigo (Solamente Tú)\", \"Pero Me Acuerdo de Ti\" and \"Falsas Esperanzas\". The latter two were performed at the 43rd Annual Grammy Awards. The album went on to be the best-selling Latin pop album of 2000 and was later certified six times Latin platinum by the RIAA. Mi Reflejo also reached the platinum stats in Argentina, Mexico, and Spain. At the 2nd Annual Latin Grammy Awards, the album won Best Female Pop Vocal Album.In October 2000, Aguilera also released her third studio album, My Kind of Christmas, her first Christmas album, which reached number one on the US Top Holiday Albums chart. The album received generally polarised reviews at the time but has since gone on to retrospectively receive praise. Aguilera starred in a holiday special, My Reflection, which aired on December 3, 2000, on ABC. Aguilera's commercial success saw her being named the 2000 Top Female Pop Act by Billboard. The same year, she also filed a fiduciary duty against manager Steve Kurtz for \"improper, undue, and inappropriate influence over her professional activities\". She eventually hired Irving Azoff to manage her career, aiming for control of her career and image.On January 16, 2001, Aguilera featured on Ricky Martin's \"Nobody Wants to Be Lonely\", which topped charts internationally and peaked at number 13 on the Hot 100, becoming her fifth top-20 hit in the US. The song was ranked at number 65 on VH1's \"100 Greatest Love Songs\", and was nominated for Best Pop Collaboration with Vocals at the 44th Annual Grammy Awards. In April of that year, Aguilera featured alongside Lil' Kim, Mýa, and Pink on \"Lady Marmalade\" from the soundtrack for the film, Moulin Rouge! (2001). The song received positive reviews and topped the Hot 100 for five consecutive weeks, becoming Aguilera's fourth number one. The song also won the Grammy Award for Best Pop Collaboration with Vocals and the MTV Video Music Award for Video of the Year.In August 2001, Warlock Records released Just Be Free, a demo album recorded by Aguilera between 1994 and 1995 while she was looking for a recording deal following the end of The All-New Mickey Mouse Club (MMC). She filed a suit against the label and the album's producers aiming to stop the release of the album; however, both parties came to a confidential settlement to release the album, in which Aguilera lent out her name, likeness, and image for an unspecified amount of damages."}, {"text": "=== 2002–2004: New image with Stripped ===With a new management, Aguilera started moving away from her teen pop niche and began working on a new project. She cultivated a new image by adopting the alter ego Xtina, dyeing her hair black, and sporting several tattoos and body piercings. Aguilera's new persona was widely criticized by media outlets. In September 2002, she released the controversial song, \"Dirrty\", which garnered mixed reviews and peaked as number 48 on Billboard Hot 100. The song's accompanying music video generated controversy for depicting overtly sexual fetishes, and attracted the attention of conservative organizations and moralists who sought to have the video banned on MTV. The video also sparked protests in Thailand and was eventually banned on the country's local television. Despite the backlash, \"Dirrty\" topped the charts in the UK and Ireland, and has gone on to become a cult classic."}, {"text": "=== 2002–2004: New image with Stripped ===Aguilera's fourth studio album, Stripped, followed with a release on October 22, 2002. She also executive produced and co-wrote the majority of the songs. Upon release, the album received generally mixed reviews but found commercial success and debuted at number two on the Billboard 200, and eventually was certified five times platinum by the RIAA. In the UK, Stripped sold over two million copies and became the second highest-selling album by an American female artists in the 2000s. Since then, it was reported the album sold 12 million copies globally.The album's second single, \"Beautiful\", was released to widespread acclaim for its empowering lyrics about embracing inner beauty, also becoming a LGBT anthem. The song reached number two on the Hot 100 and topped the chart in various international countries, including the UK, Canada, Ireland and New Zealand. It also reached number one on the US Adult Contemporary chart and the US Dance Club Songs chart. At the 46th Annual Grammy Awards, the single won Best Female Pop Vocal Performance. This was followed with the singles — \"Fighter\", \"Can't Hold Us Down\" and \"The Voice Within\".In June 2003, Aguilera co-headlined The Justified & Stripped Tour alongside Justin Timberlake. The joint tour visited North America solely, attracting an audience of 546,483 and grossed over $31.8 million. It ranked sixteenth on Billboard's list of Top 25 Tours of 2003. Later that year, she also embarked on The Stripped Tour in Europe, Asia, and Australia. Her performances at the Wembley Arena were taped, broadcast on WB Network and eventually sold as a video album under the name Stripped Live in the U.K. In early 2004, it was reported that she would return to North America to perform a second leg of her tour but was eventually canceled due to a vocal cord injury.In August 2003, at the 2003 MTV Video Music Awards, Aguilera opened the show singing \"Like a Virgin\" and \"Hollywood\" alongside Britney Spears. Halfway through the performance, she was joined by Madonna whom they both kissed, consequently making the performance highly publicized. Various media outlets retrospectively considered it one of the \"most iconic\" VMAs performances of all time. In 2008, MTV listed the performance as the number-one opening moment in the history of MTV Video Music Awards, while Blender magazine cited it as one of the twenty-five sexiest music moments on television history. In November of that year, Aguilera hosted the 2003 MTV Europe Music Awards. She received widespread media attention for dressing up as a nun and being undressed to reveal her underclothes while performing the slutdrop dance style. She was later was named Top Female Pop Act of 2003 by Billboard.In August 2004, Aguilera recorded a cover of \"Car Wash\" alongside rapper Missy Elliott for the soundtrack of the DreamWorks film Shark Tale. She also voiced a Rastafarian jellyfish in the film. That September, Aguilera contributed vocals to \"Tilt Ya Head Back\" with rapper Nelly. The songs respectively reached number 63 and 58 on the Billboard Hot 100."}, {"text": "=== 2005–2008: Back to Basics ===In early 2005, Aguilera embraced a new image inspired by Old Hollywood figures, debuting burlesque-style curly blonde hair and makeup. Her new persona was eventually adopted to promote her subsequent music project. In March 2006, Aguilera released a duet with Andrea Bocelli, \"Somos Novios (It's Impossible)\", and performed the song together at the Sanremo Music Festival. She also featured on \"A Song for You\" by Herbie Hancock which received a Grammy Award nomination for Best Pop Collaboration with Vocals.In June 2006, Aguilera released \"Ain't No Other Man\" as her then-forthcoming fifth studio album's lead single, which received critical acclaim and was praised by music critics. Critics compared her vocals on the songs to older singers such as Etta James and Aretha Franklin. The song achieved commercial success, peaked at number six on Billboard Hot 100 and has sold 1.7 million digital copies in the U.S. The single eventually earned her the Grammy Award for Best Female Pop Vocal Performance."}, {"text": "=== 2005–2008: Back to Basics ===Aguilera's fifth studio album, Back to Basics, was released as a double album in August 2006. The album was inspired by 1920s–1950s music and was described as a \"throwback with elements of old-school [music] combined with a modern-day twist\". The album debuted at number one on the US Billboard 200 making it Aguilera's first album to top the chart since 1999. It also debuted atop the charts in numerous countries, including Australia, Canada, Germany, Switzerland, and the UK. The album received positive reviews and was nominated a Best Pop Vocal Album at the 49th Annual Grammy Awards. The album was later certified double platinum by the RIAA, and sold over 5 million units worldwide. \"Hurt\" and \"Candyman\" were released as singles following the album's release and became top-ten hits on various international charts, and peaked top-thirty on Hot 100.In November 2006, Aguilera performed \"Steppin' Out with My Baby\" at NBC's Tony Bennett: An American Classic special as a duet alongside Tony Bennett. The duo performed the song on Saturday Night Live and at the 59th Primetime Emmy Awards. Their live performance was nominated a Grammy Award at the 50th Annual Grammy Awards. Their version was officially recorded in 2012 for Bennett's Viva Duets. That same month, Aguilera also featured on rapper Diddy's song \"Tell Me\" which topped the UK R&B Singles chart and number eight in the UK.At the end of November 2006 until October 2008, Aguilera embarked on the Back to Basics Tour which visited North America, Europe, Asia, and Oceania. The tour received positive reviews and was divided into acts inspired by juke joints and the circus. Rolling Stone highlighted its \"numerous sets and costumes changes\" emphasizing Aguilera's \"evolution from bubblegum starlet to dirrty vixen to her current incarnation as retro-styled soul siren\". With earnings around 48.1 million, the tour was the highest-grossing concert tour by a female in 2007. Additionally, the performances at the Adelaide Entertainment Centre were taped, broadcast on VH1 and sold as a video album under the title Back to Basics: Live and Down Under.In February 2007, Aguilera performed \"It's a Man's Man's Man's World\" at the 49th Annual Grammy Awards, which received widespread praise and has been noted as one of the best Grammy performances of all time. Her performance has been voted as the 3rd Most Memorable Grammy Performance of all time, as presented in the 2007 CBS television special My Night at the Grammys. That same month she performed at the halftime show for the 2007 NBA All-Star Game.In April 2008, Aguilera appeared in Martin Scorsese's documentary, Shine a Light (which chronicled a two-day concert by The Rolling Stones at the Beacon Theatre), where she performed \"Live with Me\" with Mick Jagger. In September, she released \"Keeps Gettin' Better\" set to feature on her first then-upcoming greatest hits album of the same name. The song received mixed reviews but found commercial success debuting at number seven on the Billboard Hot 100 making it her highest debut on the chart at the time, and has since sold 1.156 million digital copies in the US. She performed the song live at the 2008 MTV Video Music Awards alongside a medley. Keeps Gettin' Better: A Decade of Hits was released in November 2008 to positive reviews, debuting at number nine on Billboard 200 and was later certified gold by the RIAA. The compilation added two original songs (its title track and \"Dynamite\") and also featured remakes of \"Genie in a Bottle\" and \"Beautiful\". By late 2008, Aguilera stated that she had begun working on a new album."}, {"text": "=== 2009–2011: Bionic, Burlesque and The Voice ===In 2009, at the end of the 2000s, Aguilera was named the twentieth best \"Artist of the Decade\" by Billboard, and was nominated for the MTV Europe Music Award for Best Act Ever. At the end of 2009, Aguilera stated that her then-forthcoming sixth studio album originally titled Light & Darkness would be released in March 2010. However, by February 2010, Aguilera stated that the album would be retitled and would be released in June. In April 2010, Aguilera released the lead single, \"Not Myself Tonight\" which peaked at number 23 on the Billboard Hot 100. She performed the song live on The Oprah Winfrey Show. This was followed by the album's second single, \"Woohoo\" featuring rapper Nicki Minaj. A music video was planned but was eventually scrapped.Aguilera released her sixth studio album, Bionic, on June 6, 2010 which debuted at number three on the Billboard 200, and topped the European and the UK charts. The album was inspired by electronic music, and was described by her as a project \"about the future\" noting that it was inspired her her son who \"[motivated] her to want to play and have fun\". It received generally mixed reviews by critics who called it \"strong, but only in parts\". It was later certified gold by the Recording Industry Association of America (RIAA), and sold approximately over one million copies globally. \"You Lost Me\" and \"I Hate Boys\" were released as singles in the following month of June. A tour was planned for the album but was postponed and later cancelled due to prior commitments.Aguilera landed her first starring role as a waitress turned burlesque performer in the Steven Antin film Burlesque, released in theaters in November 2010. She received her star on the Hollywood Walk of Fame the same week in which the film premiered. While the film received generally mixed reviews from critics, Aguilera's portrayal of the main character garnered positive reviews, and the film grossed US$90 million in the box office. The film also received a nomination for Best Motion Picture – Musical or Comedy at the 68th Golden Globe Awards.In addition to starring in the film, Aguilera recorded eight tracks for the film's ten-track accompanying soundtrack, while Cher performed the remaining two. The soundtrack reached number 18 on the Billboard 200 and was certified gold by the RIAA. Her song \"Bound to You\" received nominations for the Golden Globe Award for Best Original Song at the 68th Golden Globe Awards while the album itself was nominated for the Best Compilation Soundtrack for Visual Media at the 54th Annual Grammy Awards. Aguilera performed \"Express\" on the finale of the seventh series of The X Factor UK which received criticism for its raunchy content.In early 2011, Aguilera omitted a few lines while performing \"The Star-Spangled Banner\" at Super Bowl XLV, which led to extensive media coverage. She apologized for the incident saying, \"I got so caught up in the moment of the song that I lost my place [...] I can only hope that everyone could feel my love for this country and that the true spirit of its anthem still came through\". That same month, Aguilera performed a tribute to Aretha Franklin at the 53rd Annual Grammy Awards. After the performance, Aguilera's heels got caught on her train and she nearly fell.In April 2011, Aguilera became a coach on reality competition show The Voice, which aired on NBC. Aguilera later returned to its second, third, fifth, eighth, and tenth season. For the show's first season, Aguilera's duet of her song \"Beautiful\" with her finalist, Beverly McClellan, debuted at number 74 on the US Billboard Hot 100 with first-week sales of 42,000 downloads on iTunes. A year later, for the second season, Aguilera's duet of \"The Prayer\" with her contestant, Chris Mann, also reached 85 on the chart.In late 2011, she featured on the song \"Moves like Jagger\" by Maroon 5. They first performed the song during their time on The Voice and also performed it at the 2011 American Music Awards. The song received positive reviews and topped the Hot 100 for four non-consecutive weeks making Aguilera the fourth female artist to top the chart over three decades (1990s, 2000s, and 2010s). The song was also nominated for Best Pop Duo/Group Performance at the 54th Annual Grammy Awards. In July 2021, the song was certified diamond by the Recording Industry Association of America (RIAA)."}, {"text": "=== 2012–2015: Lotus and other projects ===During the third season of The Voice in September 2012, Aguilera debuted \"Your Body\" as the lead single from her then-upcoming seventh studio album. The song received critical acclaim and reached reached number one on the US Dance Club Song chart and 34 on the Billboard Hot 100. The album, titled Lotus, followed in November 2012, in which Aguilera described the record as a \"rebirth\" of herself after the personal struggles she overcame. Contemporary reviewers found the album generic and conventional, as opposed to Aguilera's previous experimental ventures. Despite this, Lotus peaked at number 7 on the Billboard 200 and has sold 303,000 copies in the US as of 2019. \"Just a Fool\" with Blake Shelton was released as the album's second single and received positive reviews. The two performed the song live on The Voice and on The Ellen DeGeneres Show.On January 9, 2013, Aguilera performed \"Blank Page\" at the 39th People's Choice Awards. A month later, on February 22, 2013, Aguilera featured on rapper Pitbull's \"Feel This Moment\", which became the first of various international top-ten singles she would achieve that year, peaking at number eight on the Billboard Hot 100 becoming Aguilera's tenth top-ten hit, and was later certified platinum by the RIAA. The song garnered positive reviews and was performed at the 2012 American Music Awards, 2013 Kids' Choice Awards, The Voice and 2013 Billboard Music Awards. In May 2013, Aguilera appeared on Alejandro Fernández's cover of Miguel Gallardo's 1976 \"Hoy Tengo Ganas de Ti\" which received critical acclaim and earned them a diamond certification in Mexico.On November 4, 2013, Aguilera featured on a duet version of \"Say Something\" with A Great Big World. The song became an instant success receiving universal acclaim from critics who praised Aguilera's stripped back vocals. The song became Aguilera's second top-tenth hit on the Billboard Hot 100 peaking at number 4 and also became the second time she achieved multiple top-ten songs in a calendar year since 2000. They performed the song live on the fifth season of The Voice and 2013 American Music Awards. The song earned them various awards and nominations including a six-time platinum certification from the RIAA and won Best Pop Duo/Group Performance at the 57th Annual Grammy Awards. In October of that year, Aguilera also lent her vocals to the soundtrack for The Hunger Games: Catching Fire with the song \"We Remain\". She performed the song live with her contestant Jacquie Lee on The Voice.On January 1, 2014, Aguilera featured on the remix for \"Do What U Want\" by Lady Gaga to replace the original version with R. Kelly after his sexual abuse allegations. The two performed the song on the fifth season of The Voice. In May of that year, she performed a medley of hits at the New Orleans Jazz & Heritage Festival and performed at the 2014 KIIS FM Wango Tango concert. In November, Aguilera performed at the Breakthrough Prize Award ceremony.In February 2015, Aguilera opened the 2015 NBA All-Star Game alongside The Rockettes and Nas with a New York-themed medley. In April, Aguilera starred in the third season of the musical drama series Nashville, which aired on ABC. She also contributed to the series' soundtrack with \"The Real Thing\" and \"Shotgun\" — with the latter reaching number twenty-eight on Hot Country Songs chart. She also performed at the 50th Academy of Country Music Awards alongside the Rascal Flatts."}, {"text": "=== 2016–2021: Liberation and The Xperience ===In May 2016, Aguilera exited The Voice following its tenth season, which she won with her contestant Alisan Porter. On the season finale, she performed \"I Have Nothing\" and \"Dangerous Woman\"; the latter with Ariana Grande. A month later, Aguilera released the song \"Change\", in which she dedicated to the victims of the 2016 Orlando nightclub shooting. The ballad received positive reviews and debuted at number five on Billboard's Bubbling Under Hot 100 chart. In August 2016, Aguilera recorded a disco song titled \"Telepathy\" featuring Nile Rodgers for the soundtrack of a Netflix original series, The Get Down (2016). Her vocals were praised by critics and the song reached number one on the Dance Club Songs chart.In July 2017, Aguilera voiced a video-game dancer in The Emoji Movie (2017). She also lent her vocals to the Served Like a Girl documentary film for a song titled \"America\". In November, Aguilera performed a tribute to Whitney Houston at the 2017 American Music Awards."}, {"text": "=== 2016–2021: Liberation and The Xperience ===In March 2018, Aguilera announced the completion of her then-upcoming eighth studio album alongside a Paper Magazine cover which received media coverage. In April, Aguilera starred in the romantic science fiction Zoe, which premiered at the Tribeca Film festival and was released in July of that year.Aguilera released her eighth studio album Liberation on June 15, 2018, to favorable reviews. The album had been in the works since the summer of 2015 and incorporated R&B and hip-hop elements. Liberation debuted at number six on the Billboard 200 chart, becoming Aguilera's seventh US top-ten album. The album was promoted with multiple singles, including the preceding lead single, \"Accelerate\" featuring Ty Dolla Sign and 2 Chainz, which became Aguilera's tenth number one song on the US Billboard Dance Songs Chart. Two other singles from the album, \"Fall in Line\" (with Demi Lovato) and \"Like I Do\" were nominated at the 61st Annual Grammy Awards for Best Pop Duo/Group Performance and Best Rap/Sung Performance respectively.To further promote Liberation, Aguilera embarked on her first tour in 10 years, The Liberation Tour, which ran from September to November 2018. The tour was set in the US and received positive reviews from critics who praised Aguilera's vocals and stage presence. Billboard named the tour one of the best 2018 live shows, and it was ranked at 132 on Pollstar's 2018 Year-End Top 200 North American Tours chart with a total gross of $8.7 million with an attendance of 77,854. This tour was followed by The X Tour, which served as the international counterpart to its predecessor, running in Europe and Mexico from July to December 2019. In between the tour, Aguilera headlined her first concert residency, Christina Aguilera: The Xperience, a 25-date show at the Zappos Theater at Planet Hollywood Las Vegas, beginning in May 2019 and concluding in March 2020.In October 2019, Aguilera released the song \"Haunted Heart\" from the soundtrack of the computer-animated Addams Family film, and her second collaboration with A Great Big World, \"Fall on Me\", followed a month later. The former received critical acclaim from critics, was nominated for Best Original Song in an Animated Film at the Hollywood Music in Media Awards and topped the US Kid Digital Song Sales chart.In early 2020, Aguilera recorded two songs for Disney's live action remake of Mulan (2020): \"Loyal Brave True\" – released in March 2020 as a promotional single to positive reviews, eventually being shortlisted as one of the fifteen potential nominees for the Academy Award for Best Original Song  – and a re-recording of \"Reflection\", released in August. That year, she appeared on the ABC television special, The Disney Family Singalong and its follow-up, where she performed \"Can You Feel the Love Tonight\" and \"Remember Me\" respectively. In November of that year, Aguilera signed a new management deal with Roc Nation.In July 2021, Aguilera performed two sold-out shows at the Hollywood Bowl with Gustavo Dudamel and the Los Angeles Philharmonic. She also recorded \"The Addams Family Theme\", which was featured on The Addams Family 2 soundtrack. In October, she performed \"Reflection\", \"When You Wish Upon a Star\" and \"Loyal Brave True\" in ABC's Walt Disney World's 50th Anniversary special. On December 7, 2021, Aguilera was honoured with the People's Music Icon honorific award at the 47th People's Choice Awards."}, {"text": "=== 2022–present: Aguilera and Voltaire residency ===Aguilera released her ninth studio album, titled Aguilera, originally as a double album on May 31, 2022. The  album paid tribute to different genres of Latin music, and consisted of three separately released parts: La Fuerza, La Tormenta, and La Luz. The full album was released in its complete form on September 30, 2022. The album was preceded with the singles \"Pa Mis Muchachas\", \"Somos Nada\", \"Santo\" and followed with \"Suéltame\" and \"No Es Que Te Extrañe\". Aguilera received widespread critical acclaim from music critics upon release, and was placed on several year-end lists by publications such as Billboard and the Houston Chronicle. The album was promoted through the EU / UK Summer Series promotional tour, which consisted of five festival shows throughout Europe and three arena concerts in the United Kingdom. The promotional tour received critical praise.Aguilera and its songs received seven nominations at the 23rd Annual Latin Grammy Awards with the album winning for Best Traditional Pop Vocal Album. The album also received another two nominations for Best Latin Pop Album and Best Immersive Audio Album at the 65th Annual Grammy Awards. \"No Es Que Te Extrañe\" was also nominated for Record of the Year at the 24th Annual Latin Grammy Awards.On June 11, 2022, Aguilera headlined the Los Angeles Pride festival with guests Mýa, Kim Petras and Paris Hilton. The use of a strap-on dildo during the set was the subject of polarized reception. In October 2022, Stripped was reissued for its 20-year anniversary, featuring \"I Will Be\" (the b-side to \"Dirrty\") and Benny Benassi's remix of \"Beautiful\". A new music video for \"Beautiful\" was also released. On November 10, 2022, Time Studios announced a partnership with Roc Nation to produce an upcoming documentary about Aguilera.On  September 22, 2023, Aguilera released \"Learning to Fly\" as a part of the soundtrack for PAW Patrol: The Mighty Movie. The same month she performed at the EuroPride concert in Malta. At the end of the month, it was reported that Aguilera would executive produce a stage adaptation of Burlesque. In December, she began her second residency, Christina Aguilera at Voltaire, at The Venetian Las Vegas."}, {"text": "=== Influences ===Aguilera has named Etta James as a \"role model\", and said \"At Last\" made a major impression on her. She later stated, \"I'll still be as raunchy as I wanna be, and I'll have [Etta]'s memory to back me up. She's what I want to be someday\". As a young girl, The Sound of Music (1959) and its lead actress, Julie Andrews, became her early references to sing and perform, in addition to broadening her interest on Broadway. Aguilera's other major influences include Whitney Houston, Mariah Carey, Billie Holiday, and Ella Fitzgerald. She has also cited rock bands as an influence, specifically the Red Hot Chili Peppers, Nirvana, and Radiohead.Aguilera was also influenced by Latin music. She later recalled singing her first songs in Spanish during childhood, saying: \"I grew up hearing [Spanish] being spoken in my household [and] hearing a lot of Julio Iglesias on the record player\". Some of her other inspirations in Latin music include Chavela Vargas, Vicente Fernández, and younger artists such Rosalía. As a performer, Aguilera credits Madonna and Janet Jackson as major inspirations for being \"positive female artists [who] aren't afraid to take chances, be daring, experimental and sexy\". Cher also encouraged her to being a performer and \"a woman who has the guts to do [everything]\".Aguilera's childhood visits to records stores moulded her taste and led to an appreciation for blues and soul music, which she called \"music that really had heart\". Her music has also paid homage to many artists from this genre, including Aretha Franklin, Marvin Gaye, Nina Simone, and Otis Redding. Her album Back to Basics (2006) features inspirations of musicians from the early 20th century. As she later commented: \"I was just so drawn to that [kind of music] ... [It] has so much pain, so much beauty of raw emotion and passion\". Her other influences in the genre was added for Liberation (2018), including Michael Jackson in \"Maria\" and Janis Joplin in \"Sick of Sittin'\".Outside of the music industry, Aguilera was inspired by actresses from the Old Hollywood. She later stated, \"I'm fascinated with the golden age of film. I wanted to capture the authenticity of the glam era\", after which she cited examples such as Marlene Dietrich, Marilyn Monroe, Greta Garbo, Veronica Lake, and the pin-up models. Her \"Tilt Ya Head Back\" music video also recreated Monroe's signature look, while the video for \"Your Body\" includes a directly reference to Lucille Ball. The video for \"Ain't No Other Man\" presented Aguilera under the alter ego Baby Jane, which was inspired by Bette Davis's character in psychological horror film What Ever Happened to Baby Jane? (1962). Her other inspirations mostly came from contemporary art, including works by Andy Warhol, Roy Lichtenstein and Banksy."}, {"text": "=== Voice ===Critics have described Aguilera as a soprano, possessing a four-octave vocal range. She is also able to perform the whistle register. Maura Johnston, a journalist with Slate, called Aguilera's voice \"an instrument that despite its ability to leap octaves has a low-end grounding similar to that possessed by opera singers\". The Boston Globe columnist Joan Anderman highlighted her vocal versatility: \"[She] is a real singer ... blessed with the sort of breathtaking elasticity, golden tones, and sheer power that separate the divas from the dabblers\". In addition to sustain high notes, Aguilera is recognized for making use of the melismatic technique. Jon Pareles from The New York Times emphasized that \"she can aim a note as directly as a missile or turn its trajectory into an aerobatic spiral of leaping, quivering, and scalloping melismas\". Ron Fair—A&R executive from RCA Records—was impressed by her \"perfect intonation\", and concluded: \"She's got the pipes to be the next Barbra Streisand or Céline Dion\".Aguilera's singing technique also yielded comparisons to other singers. Journalist David Browne suggested that, alongside Mariah Carey and Whitney Houston, she \"forms the team of the main proponents\" of the melismatic technique. Richard Harrington from The Washington Post also noticed similarities with both artists: \"She has a genuinely powerful voice that's evoked comparisons [to them], though it for the most part avoids those singers' ornamental mannerisms\". The New Yorker columnist Sasha Frere-Jones also credited the technique by making her become \"a serious singer without needing to reincarnate the Sarah Vaughan\". Songwriter  Steve Kipner praises Aguilera's vocal dexterity, including her ability to \"internalize[d] all the riffs from Chaka Khan\". Los Angeles Times music critic Ann Powers wrote that she possesses a \"voice purely powerful as that of Etta James [...] and she's moving toward the expressiveness of Gladys Knight, if not Aretha Franklin\". Powers also associated her vocal ability with Donna Summer when she performs records influenced by rhythm and blues.Aguilera, however, has also been criticized for the excessive use of melisma, as well for oversinging during her concerts shows. The Huffington Post columnist John Eskow called her as \"the main proponent of oversouling\". Eskow recognizes Aguilera's voice as a \"great instrument\", although she \"[doesn't] seem to know when to stop\" with the use of \"gratuitous and confected melisma\". Lucy Davies, music critic from BBC Music, raved about her \"stunning voice\", but offered that \"she could be more varied, simply by cutting out some of the 'ye-e-eeeh, woah' in her songs\". Writing for Entertainment Weekly, Chris Willman credits Aguilera's tendency to oversinging as an influence of Mariah Carey, noting \"her slightly nasal tone that really only becomes obvious when she's overselling a song\". Alexa Tietjen from VH1 acknowledged that Aguilera \"does tend to take it to the extreme at times [...] but her vocal prowess is what's gotten her so far. Love them or hate them, the riffs are a part of who she is as performer\"."}, {"text": "=== Musical style ===Aguilera's discography is generally categorized as pop, contemporary R&B, soul, and hip-hop. According to critics, she has also experimented with other musical genres in her works. In a 2008 interview, she explained that she is \"always inspired by new things\" in music and enjoys \"experimenting with [her] voice\". Alexis Petridis from The Guardian considered the \"boldness in [continually] reinventing\" her music as \"one of her most impressive facets\" as an artist. Initially established as a bubblegum pop singer, she mixed teen pop and dance-pop on her first records, Christina Aguilera (1999) and Mi Reflejo (2000), with the latter also taking inspiration from numerous genres in Latin music.Moving away from the teen niche, Aguilera's post-2000 material mainly incorporated R&B and hip-hop. Listed as an executive producer on Stripped (2002), she mixed both genres with Latin pop, rock, neo-soul, gospel, among others, while Back to Basics (2006) was described as a \"throwback with elements of old-school genres combined with a modern-day twist [and] hard-hitting beats\". She continued merging R&B with other musical styles on Burlesque (2010), as well on Liberation (2018), which also features hip-hop, soul and blues elements.The show tune \"Lady Marmalade\" is noted as Aguilera's first musical transformation. Referred to as \"too urban\" by RCA Records executives, the song transitioned her music \"from teen pop to a more mature sound\". Despite the renewal in her repertoire, Aguilera continued producing power ballads—which became a signature in her discography—in between her uptempo material. Kelefa Sanneh, music critic from The New York Times, observed the continuous modification in her music, in addition to highlighting her \"decision to snub some of the big-name producers on whom pop stars often rely\". Her notable sonically drastic ventures include the subversive futurepop on Bionic (2010), electropop club on Lotus (2012), and Mexican ranchera numbers on Aguilera (2022)."}, {"text": "=== Lyrical themes ===Aguilera's music has been the subject of analysis. Critics have acknowledged domestic violence experienced during childhood as one of the main topics in her music. Mary Anne Donovan, author of Christina Aguilera: A Biography (2010), noted that she \"channeled her fear and sadness away from the abuse in her family to instead create the music that became her art and her livelihood\". It also influenced Aguilera's transition to adulthood and impacted many of her songs, whose lyrics reference female empowerment. In a 2006 interview, she commented: \"I feel a responsibility to share some of these things that aren’t kind of the brighter sides of my life. People [who] can relate might not feel as alone in the circumstance\".Aguilera has also often defended the sex-positive movement and denounced social double standards in her music. Reviewing Stripped (2002), Sophie Wilkinson from Vice opined that its music \"explores nuanced articulations of sexual desires and fears while highlighting the social double standards\", in addition to giving \"any woman the confidence to take charge of her sexuality and ownership of her body\". Jennifer K. Armstrong, author of Sexy Feminism: A Girl's Guide to Love, Success, and Style (2013), opined that her music has \"reject[ed] the double standards set forth by sexism and patriarchy\".Chin Wai Wong from Hollins University also observed topics such as romance, introspection of vulnerability, gratitude for support, and sexual liberation in Aguilera's music, representing \"multi-dimensional aspects of life [and] different social responsibilities a woman experiences\". While critics noted the feminist message in her works, Aguilera was acknowledged for her \"refusal to sanitize her own sexuality to meet either the norms of mainstream gender politics or mainline Feminism's resistance\". The Guardian journalist Hermione Hoby opined that she \"incites a sisterly spirit of collaboration [and] is not shy of the odd feministic declaration herself\". Other themes addressed in her lyrics include self-respect, body image, and LGBT rights, in addition to \"fighting for creative freedom and gender equality\"."}, {"text": "=== Public image ===Publications have called Aguilera a pop icon, a triple threat entertainer and has often been labeled a diva for her stardom and persona. Bustle writer James Tison noted comparisons to Mariah Carey adding that \"[Aguilera] has mastered being a diva in the best way possible\". Her vocal abilities often also distinguished her from her peers. Her fan-base is named the \"Fighters\" drawing inspiration from her 2003 single \"Fighter\". She is one of the most popular musicians on Twitter with approximately 17 million followers, and was one of the most searched artists in the world in 2002, 2004, and 2010 through Google. She was also one of the most popular searches in 2003 by Yahoo! Search.Aguilera is also recognized as a gay icon; in 2019, she was awarded by the Human Rights Campaign for using her \"platform to share a message of hope and inspiration to those who have been marginalized [...] bringing greater visibility to the LGBTQ community\". Her 2002 song \"Beautiful\" has been called an anthem for the LGBT community, with UK LGBT rights charity Stonewall naming it the most empowering song of the decade for lesbian, gay and bisexual people and for having \"inspired millions of young people around the world\". In 2023, Aguilera was honored for her LGBTQ allyship and for advocating for the queer community at the Stonewall National Monument.Aguilera's style and fashion has attracted significant media attention throughout her career, and she has been named a fashion icon. Jon Caramanica, journalist from The New York Times, concluded that \"Aguilera will be remembered for her glamour and her scandalous take on femme-pop\", while Janelle Okwodu from Vogue noted that she \"has never been afraid to take a fashion risk [and] has filled her videos with jaw-dropping styles and risqué runway looks\". Following her appearance at New York Fashion Week in 2018, Dazed named her one of the most stylish people of the year. Aguilera's influence on fashion has been noted by several publications. Samantha Sutton of InStyle noted Aguilera's influence on the rising fashion trends of 2021. Writing for Vogue in 2022, Christian Allaire said that Aguilera was \"ahead of her time\" when it came to her 2002 image.Since the beginning of her career, Aguilera has attracted criticism for her revealing clothes, and has been called a sex symbol. In an interview with MTV News, Debbie Gibson accused her of \"influencing girls out there wearing less and less\", considering that \"she lives and breathes the sexual image\". In response to negative comments, Aguilera stated: \"Just because I have a certain image, everyone wants me to be this role model. But nobody is perfect, and nobody can live up to that\". VH1, included in the list of the sexiest entertainment artists in 2002 and 2013; in publications from FHM and Complex, she received similar honors in 2004 and 2012, respectively. In 2003, she was chosen as the sexiest woman of the year by Maxim, stamping the cover of the best-selling issue of the magazine's history, and she was named one of the most beautiful people in the world in 2003 and 2007 by People."}, {"text": "=== Reinventions and personas ===Aguilera has been called a \"Queen of Reinvention\" as she is noted for having reinvented her public image numerous times throughout her career. Stereogum writer Tom Breihan noted that she originally \"thought of herself primarily as a [...] young Mariah Carey-type\", but was instead marketed as a bubblegum pop teen idol due to the genre's popularity in the late 1990s, following the success of Britney Spears's debut album. David Browne of Entertainment Weekly felt that Aguilera was \"a good girl pretending to be bad\" when compared to Spears' image. In contrast, Christopher J. Farley of Time considered her a more impressive artist than Spears. Aguilera's vocals set her apart from her bubblegum pop peers.Aguilera departed from the teen idol image with the release of Stripped in 2002, by dyeing her hair black, getting body piercings, and posing nude for several publications. This was attributed to her provocative and extravagant alter ego named Xtina. Serving as the host of the 2003 MTV Europe Music Awards, Aguilera opened the show dressed as a nun, accompanied by a choir singing the lead single from Stripped, \"Dirrty\", before showing off a more revealing outfit. While analyzing her new visual, Vice and Rolling Stone magazines wrote that her new clothes echoed as if she were participating in the Girls Gone Wild franchise. In a review of her persona, author Stephen Thomas Erlewine of AllMusic opined that Aguilera reached \"maturity with transparent sexuality and pounding sounds of nightclubs\". Writing for The Daily Telegraph, Adam White was more positive about her image and recognized that her \"embracing of an overtly sexual image in the wake of adolescent stardom was a tried and tested route to adult success\".For the release of Back to Basics in 2006, Aguilera adopted a new persona named Baby Jane, named after Bette Davis's character in What Ever Happened to Baby Jane? (1962). The image drew inspiration from actresses of the Golden Age of Hollywood, such as Marilyn Monroe, to go with the album's 1920s–1950s musical direction. In 2008, she adopted a futuristic image, which drew comparisons to the image of then-newcomer, Lady Gaga. In 2012, she drew criticism over her weight gain from several publications; the following year, she received favorable media attention after a significant weight loss. In March 2018, Aguilera appeared on the cover of the spring 2018 issue of Paper, titled \"Transformation\". Photographed by Zoey Grossman, the images featured Aguilera with minimal makeup and no photographic manipulation, debuting her freckles. Her appearance in the pictures received significant media attention and widespread praise. This led to other celebrities who had posed similarly receiving attention. Starting in 2021, Aguilera began showing off a red-haired look for the promotion of her ninth studio album, Aguilera (2022)."}, {"text": "=== Legacy ===Various music journalists and authors have noted Aguilera's legacy in the entertainment industry and deemed her as one of the greatest artists in pop music. In 2004, she was listed as one of the most influential people in the music market according to The Independent, and was ranked as the eight greatest woman in the phonographic industry by VH1. Early in her career, Aguilera was labeled as a teen idol, and has been named as one of the artists who revived teen pop in the late 1990s; Time magazine stated that she was a \"pioneer [in] a different type of teen stardom\", crediting her vocal ability as responsible for the phenomenon. Since then, she has been named as one of the greatest singers in contemporary pop music; by MTV, she was ranked as one of the best voices in music since the 1980s, while Rolling Stone and Consequence of Sound included her in their lists of greatest singers of all time. In 2013, Latina honored her as the best vocalist of Latin origin in history. With the recognition of her vocal ability and influence in the music industry, she has been referred in media with the titles of \"Princess of Pop\" and \"Voice of a Generation\"."}, {"text": "=== Legacy ===Upon launching her music career in the late 1990s, Aguilera was named as one of the artists who shaped the \"Latin explosion\", having contributed to the Latin pop boom in American music in early of the century. Considered one of the greatest artists of the 2000s, she has been classified between the main references of the Millennials; writing for Vice magazine, Wanna Thompson analyzed her impact in the turn of the century, stating that alongside Britney Spears, \"Aguilera dominated mainstream pop-related discussions. [Her] perfectly packaged music and looks appealed to tweens and teens who wanted to be like the pretty, chart-topping pop stars plastered everywhere\". The commercial success of her first projects as a bubblegum pop singer caused an effect that influenced record labels to invest in new artists who attracted the same youthful appeal, catapulting names like Jessica Simpson and Mandy Moore.Critics also highlighted the impact of her work in popular culture; while Stripped (2002) was called \"the blueprint for divas making the transition from teen idol to adult pop star\", Aguilera is credited for \"paving the way for a generation of pop singers\". Jeff Benjamin from Billboard stated that the album explored a \"process of self-identification and declaration still influencing today's mainstream scene\", in addition to \"how of today's biggest pop stars have followed a similar path, exploring and incorporating these strategies into their careers\". In 2007, her self-titled debut album was added to the definitive list from Rock and Roll Hall of Fame, being recognized as one of the \"history's most influential and popular albums\". Since then, Aguilera and her work have influenced various recording artists including Ariana Grande, Ava Max, Becky G, Britney Spears, Camila Cabello, Charli XCX, Demi Lovato, Doja Cat, Dua Lipa, Grimes, Halsey, Hayley Williams, Iggy Azalea, Karol G, Kelly Clarkson, K. Michelle, Lady Gaga, Lauren Jauregui, Meghan Trainor, Nicki Nicole, Olivia Rodrigo, Rina Sawayama, Rosalía, Sabrina Carpenter, Sam Smith, Selena Gomez, Tate McRae, Tinashe, and Troye Sivan, and athletes such as figure skater Johnny Weir, ice dancers Zachary Donohue and Madison Hubbell, and swimmer Dana Vollmer.Aguilera has also been praised for emphasizing the importance of feminism in pop music; several journalists agree that her use of sexual imagery has helped catalyze public discourse on the topic. Lamar Dawson, columnist from The Huffington Post, praised her feminist efforts in the music industry and recognized that \"while Christina isn't the first pop star to place feminist rhetoric into pop culture, she led the charge at the beginning of the 21st century of influencing the next generation of impressionable teens who were too young for Janet [Jackson] and Madonna's curriculum\". Gerrick D. Kennedy from Los Angeles Times shared the same point of view and stated that \"for a generation who hit puberty during the great 2000 pop explosion, Aguilera was an essential voice with music that tackled self-empowerment, feminism, sex and domestic violence — subject matter her contemporaries were shying away from\". Rhiannon Lucy Cosslett, co-founder of The Vagenda, opined that the provocative dance routines in Aguilera's music videos were \"empowering\", as she has been referred to as the forerunner of the slutdrop dance style.Aguilera's videography impact was also analysed by music critics. While \"Dirrty\" (2002) has been described as \"one of the most controversial videos in pop music history\", and one of the greatest music videos of all time, Issy Beech from i-D recognized that the audiovisual work \"paved a path for videos like \"Anaconda\" and \"Wrecking Ball\" [...] paved the way for open sexuality from women in pop\". In the video for \"Beautiful\" (2002), the highlight scene of a gay kiss has been considered one of the most important moments for LGBT culture, in addition to start Aguilera's image as a gay icon. Both works was elected as one of the greatest music videos of the 21st century by editors from Billboard, while she was named one of the greatest women of the video era according to VH1. In 2012, her videographic collection and some looks used throughout her career were part of an exhibition by the National Museum of Women in the Arts aimed at illustrating \"the essential roles women have played in moving rock and roll and American culture forward\"."}, {"text": "== Achievements ==Aguilera has accumulated numerous awards and honorary accolades throughout her career. At the age of 19, she won the Grammy Award for Best New Artist, becoming one of the youngest artists to earn such an honor. Aguilera received other four trophies from twenty nominations by The Recording Academy. She is also a recipient of two Latin Grammy Awards, three Billboard Latin Music Awards—including the Spirit of Hope Award—, two MTV Video Music Awards (VMAs), two People's Choice Awards—including the inaugural Music Icon Award—, three World Music Awards, and one Guinness World Record. Among other of her honors, Aguilera received a star on Hollywood Walk of Fame in \"recognition of her achievements in the recording industry\" and was immortalized as a Disney Legend due to \"her remarkable contributions to the Walt Disney Company\". Referred to as one of the most prominent Latin artists in the entertainment industry, she was also elected as one of the 100 most influential people in the world by Time in 2013.With estimated sales around 100 million records, Aguilera is recognized as one of the world's best-selling music artists. In the United States, she has sold 41.9 million albums and singles until 2014, according to Nielsen SoundScan. As of 2022, the Recording Industry Association of America (RIAA) certified over 54.2 million records, of which 17.5 million units came from her albums. While Christina Aguilera (1999) is certified eight times platinum, it was listed as one of the best-selling in the country. In 2013, Aguilera's sales reached 9.4 million records in the United Kingdom, according to the Official Charts Company. Stripped (2002) was also recognized as one of the few to surpass 2 million copies sold, becoming one of the best-selling albums of the 21st century in the country. Her collaboration with Maroon 5, \"Moves Like Jagger\", also was ranked among the best-selling singles in Australia, Canada, South Korea, the United Kingdom, and the United States, as well one of the best-selling digital singles with over 14.4 million units.Elected as top female artist in 2000 and 2003, Aguilera was classified as the twentieth most prosperous artists of the 2000s, according Billboard. She was also listed as one of the most successful singers of the decade on Billboard 200, Hot 100, and Mainstream Top 40 charts—whose she also was ranked among the greatest of all time. With a total of 10 Dance Club Songs chart-toppers, Aguilera became the thirty-fifth most successful artist in the chart history. In 2009, she was recognized as the second best-selling solo artist on Billboard, and she was also the fourth female artist to top the Hot 100 chart over three consecutive decades. Mi Reflejo (2000) also remains as one of the longest albums to chart at number one on Top Latin Albums. Aguilera had earned over US$113.8 million from tickets sales of her concert tours throughout her career. In 2020, she was classified among the top female artists of the 21st century in the concert industry, having sold more than 1.8 million tickets for her performances, according Pollstar. Her largest audience concert was held during Mawazine Festival, in Morocco, attracting 250,000 people which eventually became the record in the event's history."}, {"text": "=== Business ventures ===As a businesswoman, Aguilera has been selling her own products and investing in multiple companies. In 2008, she became co-owner of LAX nightclub at the Luxor Las Vegas alongside DJ AM. In 2015, she founded the MX Productions & Investments in partnership with fiancée Matthew Rutler, for which they was included in the investors' group of Pinterest, DraftKings, Lyft and MasterClass enterprises. Aguilera also joined the ownership group of Angel City FC, a National Women's Soccer League (NWSL) expansion team, and sexual wellness brand Playground. In March 2015, Aguilera and Rutler signed a deal with Lions Gate Entertainment to developed both scripted and unscripted projects which eventually was acquired by ABC Family and Spike TV networks. In 2022, she was named chief culture officer of alcoholic beverage company Fun Wine.In 2007, Aguilera signed a long-term deal with Procter & Gamble (P&G) and created the Christina Aguilera Fragrances, which has been sold in North America, Latin America, Asia and Europe. In addition to scents, the brand manufactures body lotions, body sprays, and deodorants whose products was ranked among the United Kingdom best-sellers in 2007, 2009 and 2010. In January 2016, the line was reported to sold over $80 million. Her fragrances also received numerous accolades, including at the Duftstars Awards and FiFi Awards. During São Paulo Fashion Week in 2011, Aguilera debuted her first clothes line which was mostly sold in Brazilian department stores C&A. In partnership with American Greetings, she featured in customized birthday video cards which was sold online in 2021 and eventually won a Clio Awards.During her career, Aguilera has been involved in marketing initiatives and endorsed numerous brands including Sears, Levi's, Skechers, Mercedes-Benz, Virgin Mobile, Orange UK, Sony Ericsson, Oreo, SweeTarts, Just Eat, Lieferando, Menulog, and Merz Aesthetics. In 2001, she starred in a series of television advertising to Coca-Cola, which was aired in Latin America and the United States. Media outlets reported the deal signed by Aguilera to worth up £50 million. Aguilera also shot a global scale advertising campaign alongside South Korean singer Rain to promote Pepsi during the 2006 FIFA World Cup. Other Aguilera's endorses included a clothing line by Versace in 2003, and a collection of sterling silver pieces designed by Stephen Webster in 2008. On June 28, 2004, she received £200,000 to open the summer sale at the London's department store Harrods. In 2008, Aguilera also was paid $1.5 million to submit pictures of her first child to People, becoming the ninth most expensive celebrity baby photograph ever taken."}, {"text": "=== Philanthropy and activism ===Referred to as a humanitarian, Aguilera has done philanthropic works during her career. In 2003, she visited the Women's Center & Shelter of Greater Pittsburgh and provided a donation over $200,000 in support for victims of domestic violence. In addition to starred in television advertsings on the Lifetime network calling for the end of violence against women in 2007, she partnered with Verizon in a campaign to awareness about violence domestic in 2015. She later destined proceeds from the Christina Aguilera: The Xperience (2019–2020) residency to The Shade Tree, a women and children's center in Las Vegas, Nevada. In October 2019, Aguilera efforts against domestic violence earned her the Bonnie Polley Community Hero Award.In 2009, Aguilera became the global spokesperson for the World Food Program, a branch of the United Nations (UN). She visited countries with high rates of malnutrions, including Ecuador, Guatemala, Haiti and Rwanda. As of 2013, it was reported she helped raise over $148 million to the organization and other hunger relief agencies in 45 countries. Aguilera's efforts eventually earned her the Muhammad Ali Humanitarian Awards and George McGovern Leadership Awards—which she received in the White House from the former Secretary of State, Hillary Clinton. Her other philanthropy initiatives included donations of her wedding gifts to charities in support of families affected by Hurricane Katrina in 2005 and concerts to urges donations to the American Red Cross due Hurricane Sandy in 2012.In 2010, Aguilera auctioned tickets to her concerts through Christie's, earmarking the proceeds to non-profit environmental organizations, including Conservation International and the Natural Resources Defense Council. In response to the 2010 Haiti earthquake, she auctioned off a Chrysler 300 and destined proceeds to support disaster victims and their families. Additionally, Aguilera appeared on the Hope for Haiti Now telethon, whose donations directly benefited Oxfam America, Partners In Health, International Red Cross and Red Crescent Movement, and UNICEF. She also was praised by People for the Ethical Treatment of Animals (PETA) for signed an open letter destined to Government of South Korea appealing to the ban of consumption of dogs and cats, and for using fake fox fur in concerts costumes.As a LGBT rights activist, Aguilera was lauded for calling out myths around HIV/AIDS, in addition to raising awareness about the virus and raising funds for the Mac AIDS Fund and the Elton John AIDS Foundation. In 2008, she advocated for same-sex marriage and spoke out against Proposition 8. During an interview with MTV News, she stated \"Why would you put so much money behind something [aimed at] stopping people from loving each other? I just don't understand it\". In June 2016, Aguilera release single \"Change\", which was aimed to raise proceeds to the victim's families and survivors of the Orlando nightclub shooting. During The X Tour (2019), Aguilera visited Russia and \"blessed\" a gay marriage proposal in the backstage, contrary to the country's laws against \"gay propaganda\"."}, {"text": "== Personal life ==Aguilera met dancer Jorge Santos backstage, while filming one of her music videos in 2000 and dated him until September 2001. She began dating music executive Jordan Bratman in late 2002. Their engagement was announced in February 2005. On November 19, 2005, they married in a private ceremony on an estate in Napa County, California, during a traditional Jewish ceremony. Aguilera wore a flamenco-style wedding dress by Christian Lacroix and they exchanged wedding bands designed by jeweller Stephen Webster. She gave birth to their son in 2008. In September 2010, the couple had separated. She filed for divorce on October 14, 2010."}, {"text": "== Personal life ==In November 2010, Aguilera began dating production assistant Matthew Rutler, whom she met while filming the musical Burlesque. Aguilera was arrested for public intoxication in March 2011, while Rutler was booked for driving under the influence. However, the charges were dropped against Rutler the following month. In 2014, they became engaged on Valentine's Day. Later that year, Aguilera gave birth to their daughter.Aguilera was raised Catholic, although she was learning about Judaism in the mid 2000s. In 2022, she opened up about depression and anxiety, stating \"I experienced a lot of trauma in my childhood [...] I've definitely had struggles in the past with depression and anxiety. It's a constant battle to overcome a mind that is anxious, a mind that is always second-guessing\". Aguilera has also been sharing about insecurity and struggling with body image early in her career.In 2007, Aguilera purchased a Mediterranean-style mansion in Beverly Hills for $11.5 million, which she sold for $13.5 million in March 2013. Shortly afterwards, she acquired a house in the Mulholland Estates' private enclave, at the Santa Monica Mountains, for $10 million and currently resides with her family. In 2000, Aguilera was among the biggest moneymakers in the music business with over £65 million earned with albums sales, merchandising and licensing deals according VH1. In January 2008, she was ranked 19th on Forbes' list of Top-Earning Women in Music of 2007 with earnings of $20 million. The previous year, she was also included on their list of richest women in entertainment industry, with an estimated net worth of $60 million. In August 2022, Aguilera's net worth was reported to be $160 million."}, {"text": "== Discography ==Studio albums"}, {"text": "== Discography ==Christina Aguilera (1999)"}, {"text": "== Discography ==Mi Reflejo (2000)"}, {"text": "== Discography ==My Kind of Christmas (2000)"}, {"text": "== Discography ==Stripped (2002)"}, {"text": "== Discography ==Back to Basics (2006)"}, {"text": "== Discography ==Bionic (2010)"}, {"text": "== Discography ==Lotus (2012)"}, {"text": "== Discography ==Liberation (2018)"}, {"text": "== Discography ==Aguilera (2022)"}, {"text": "== Filmography ==Burlesque (2010)"}, {"text": "== Filmography ==The Emoji Movie (2017)"}, {"text": "== Filmography ==Zoe (2018)"}, {"text": "== Theatre ==Burlesque (2024); producer, co-composer and lyricist"}, {"text": "== See also ==Honorific nicknames in popular music"}, {"text": "== See also ==List of best-selling music artists"}, {"text": "== See also ==List of artists who reached number one in the United States"}, {"text": "== See also ==List of artists who reached number one on the UK Singles Chart"}, {"text": "== See also ==List of highest paid American television stars"}, {"text": "=== Sources ===Dominguez, Pier (2003). Christina Aguilera: A Star is Made: The Unauthorized Biography. Amber Communications Group, Inc. ISBN 978-0-970-222-459."}, {"text": "=== Sources ===Donovan, Mary Anne (2010). Christina Aguilera: A Biography. ABC-Clio. ISBN 978-0-313-38319-9."}, {"text": "=== Sources ===Govan, Chlóe (2013). Christina Aguilera: Unbreakable. Omnibus Press. ISBN 978-0-857-129-949."}, {"text": "=== Sources ===Greenberger, Robert (2008). Contemporary Musicians and Their Music: Christina Aguilera. Rosen Publishing. ISBN 978-1-435-848-641."}, {"text": "=== Sources ===R. Mead, Margaret (2012). Christina Aguilera. Chelsea House. ISBN 978-1-438-14118-3."}, {"text": "=== Sources ===Worth, Richard (2015). Christina Aguilera: Pop Singer. Enslow Publishing. ISBN 978-0-7660-7180-3."}, {"text": "=== Sources ===Davis, Clive (2013). The Soundtrack of My Life. Simon & Schuster. ISBN 978-1-476-71479-0."}, {"text": "=== Sources ===Kimpel, Dan (2006). How They Made It: True Stories of How Music's Biggest Stars Went from Start to Stardom. Hal Leonard LLC. ISBN 978-0-634-076-428."}, {"text": "=== Sources ===Railton, Diane; Watson, Paul (2011). Music Video and the Politics of Representation. Edinburgh University Press. ISBN 978-0-748-633-234."}, {"text": "=== Sources ===Valdivia, Angharad N. (2010). Latino/as in the Media. Polity. ISBN 978-0-745-640-075."}, {"text": "=== Sources ===Folkard, Claire (2005). Guinness World Records 2005. Jim Pattison Group. ISBN 1-892051-22-2."}, {"text": "=== Sources ===K. Armstrong, Jennifer (2013). Sexy Feminism: A Girl's Guide to Love, Success, and Style. Mariner Books. ISBN 978-0-547-73830-7."}, {"text": "=== Further reading ===Scott, Kieran (2001). I Was a Mousketeer!. Disney Press. ISBN 978-0-7868-4470-8."}, {"text": "== External links ==Official website"}, {"text": "== External links ==Christina Aguilera at AllMusic"}, {"text": "== External links ==Christina Aguilera discography at Discogs"}, {"text": "== External links ==Christina Aguilera at IMDb"}]