[{"text": "Carlos Ray \"Chuck\" Norris (born March 10, 1940) is an American martial artist and actor. He is a black belt in Tang Soo Do, Brazilian jiu jitsu and judo. After serving in the United States Air Force, Norris won many martial arts championships and later founded his own discipline, Chun Kuk Do. Shortly after, in Hollywood, Norris trained celebrities in martial arts. Norris went on to appear in a minor role in the spy film The Wrecking Crew (1969). Friend and fellow martial artist Bruce Lee invited him to play one of the main villains in The Way of the Dragon (1972). While Norris continued acting, friend and student Steve McQueen suggested he take it seriously. Norris took the starring role in the action film Breaker! Breaker! (1977), which turned a profit. His second lead, Good Guys Wear Black (1978), became a hit, and he soon became a popular action film star."}, {"text": "Norris went on to star in a streak of bankable independently made action and martial arts films, with A Force of One (1979), The Octagon (1980), and An Eye for an Eye (1981). This made Norris an international celebrity. He went on to make studio films like Silent Rage (1982) with Columbia, Forced Vengeance (1982) with MGM, and Lone Wolf McQuade (1983) with Orion. This led Cannon Films to sign Norris into a multiple film deal, starting with Missing in Action (1984), which proved to be very successful and launched a trilogy. Norris started to work almost exclusively on high-profile action films with Cannon, becoming its leading star during the 1980s. Films with Cannon include Invasion U.S.A (1985), The Delta Force (1986), and Firewalker (1986), among others. Apart from the Cannon films, Norris made Code of Silence (1985), which was received as one of his best films. In the 1990s, he played the title role in the long-running CBS television series Walker, Texas Ranger from 1993 until 2001. Until 2006, Norris continued taking lead roles in action movies, including Delta Force 2 (1990), The Hitman (1991), Sidekicks (1992), Forest Warrior (1996), and The President's Man (2000) and its sequel (2002). His most recent film appearance to date was in The Expendables 2 (2012)."}, {"text": "Throughout his film and TV career, Norris diversified from his regular endeavors. He is a noted writer, having penned books on martial arts, exercise, philosophy, politics, Christianity, Western fiction, and biography. He was twice a New York Times bestselling author, first with his book on his personal philosophy of positive force and the psychology of self-improvement based on personal anecdotes called The Secret of Inner Strength: My Story (1988). His second New York Times bestseller, Black Belt Patriotism: How to Reawaken America (2008), is about his critique of current issues in the United States. Norris also appeared in several commercials endorsing several products, most notably being one of the main spokespersons for the Total Gym infomercials. In 2005, Norris found new fame on the Internet when Chuck Norris facts became an Internet meme documenting humorous, fictional, and often absurd feats of strength and endurance. Although Norris himself did not produce the \"facts\", he was hired to endorse many products that incorporated Chuck Norris facts in advertising. The phenomenon resulted in six books (two of them New York Times bestsellers), two video games, and several appearances on talk shows, such as Late Night with Conan O'Brien, in which he read the facts or participated in sketches."}, {"text": "== Early life ==Norris was born in Ryan, Oklahoma, on March 10, 1940, to Wilma (née Scarberry) and Ray Dee Norris, who was a World War II Army soldier, mechanic, bus driver, and a truck driver. Norris has stated that he has Irish and Cherokee roots. Norris was named after Carlos Berry, his father's minister. He was the oldest of three brothers, the younger two being Wieland and Aaron. Wieland Norris informed his eldest sibling he would not reach his 27th birthday; this prediction came true in 1970 when he was killed in the Vietnam War. When Norris was sixteen, his parents divorced, and he later relocated to Prairie Village, Kansas and then to Torrance, California with his mother and brothers.Norris has described his childhood as downbeat. He was nonathletic, shy, and scholastically mediocre. His father, Ray, worked intermittently as an automobile mechanic, and went on drinking binges that lasted for months at a time. Embarrassed by his father's behavior and the family's financial plight, Norris developed a debilitating introversion that lasted for his entire childhood."}, {"text": "=== 1958 to 1969: United States Air Force and martial arts breakthrough ===Norris joined the United States Air Force as an Air Policeman (AP) in 1958 and was sent to Osan Air Base, South Korea. It was there that Norris acquired the nickname \"Chuck\" and began his training in Tang Soo Do (tangsudo), an interest that led to black belts in that art and the founding of the Chun Kuk Do (\"Universal Way\") form. When he returned to the United States, he continued to serve as an AP at March Air Force Base in California.Norris was discharged from the Air Force in August 1962 with the rank of Airman first class. Following his military service, Norris applied to be a police officer in Torrance, California. While on the waiting list, Norris opened a martial arts studio.Norris started to participate in martial arts competitions. He was defeated in his first two tournaments, dropping decisions to Joe Lewis and Allen Steen. He lost three matches at the International Karate Championships to Tony Tulleners. By 1967, Norris had improved enough that he scored victories over the likes of Vic Moore. On June 3, Norris won the 1967 tournament of karate, Norris defeated seven opponents, until his final fight with Skipper Mullins. On June 24, Norris was declared champion at the S. Henry Cho's All-American Karate Championship at the Madison Square Garden, taking the title from Julio LaSalle and defeating Joe Lewis. During this time, Norris also worked for the Northrop Corporation and opened a chain of karate schools. Norris's official website lists celebrity clients at the schools; among them Steve McQueen, Chad McQueen, Bob Barker, Priscilla Presley, Donny Osmond and Marie Osmond.In early 1968, Norris suffered the tenth and final loss of his career, losing an upset decision to Louis Delgado. On November 24, 1968, he avenged his defeat to Delgado and by doing so won the Professional Middleweight Karate champion title, which he then held for six consecutive years. On April 1, Norris successfully defended his All-American Karate Championship title, in a round robin tournament, at the Karate tournament of champions of North America. Again that year, Norris won for the second time the All-American Karate Championship. It was the last time Norris participated and retired undefeated. While competing, Norris met Bruce Lee, who at the time was known for the TV series The Green Hornet. They developed a friendship, as well as a training and working relationship."}, {"text": "=== 1958 to 1969: United States Air Force and martial arts breakthrough ===In 1969, during the first weekend of August, Norris defended his title as world champion at the International Karate Championship. The competition included champions from most of the fifty states as well as half a dozen from abroad who joined for the preliminaries. Norris retained his title and won Karate's triple crown for the most tournament wins of the year, he also got the Fighter of the Year award by Black Belt magazine. Around this time, Norris made his acting debut in the Dean Martin film The Wrecking Crew."}, {"text": "=== 1970 to 1978: Early roles and breakthrough ===In 1972, Norris acted as Bruce Lee's nemesis in the widely acclaimed martial arts movie Way of the Dragon (titled Return of the Dragon in its US distribution). The film grossed over HK$5.3 million at the Hong Kong box office, beating previous records set by Lee's own films, The Big Boss and Fist of Fury, making it the highest-grossing film of 1972 in Hong Kong. The Way of the Dragon went on to gross an estimated US$130 million worldwide. The film is credited with launching him toward stardom."}, {"text": "=== 1970 to 1978: Early roles and breakthrough ===In 1973, Norris played a role in Jonathan Kaplan's The Student Teachers.In 1974, actor Steve McQueen, who was his martial art student and friend at the time, saw his potential and encouraged him to begin acting classes at MGM. That same year, he played the supporting role of the main antagonist in Lo Wei's Yellow Faced Tiger. Norris plays a powerful drug king in San Francisco, where he dominates the criminal world including the police department. He is eventually challenged by a young police officer who stands up to corruption. The film played theatrically in the US in 1981 as Slaughter in San Francisco. It was noticed that it was an older low-budget film announcing Norris as the lead. The film played as a double-bill to other action and genre film. It was described as a low budget martial arts actioner taking advantage of Norris's fame.In 1975, Norris wrote his first book Winning Tournament Karate on the practical study of competition training for any rank. It covers all phases of executing speedy attacks, conditioning, fighting form drills, and one-step sparring techniques.Norris's first starring role was 1977's Breaker! Breaker! He chose it after turning down offers to do several martial art films. Norris decided that he wanted to do films that had a story and where the action would take place when it is emotionally right. The low budget film turned out to be very successful.In 1978, Norris starred in Good Guys Wear Black. He considers it to be his first significant lead role. No studio wanted to release it, so Norris and his producers four-walled it, renting the theaters and taking whatever money came in. The film did very well; shot on a $1 million budget, it made over $18 million at the box office. Following years of kung fu film imports from Hong Kong action cinema during the 1970s, most notably Bruce Lee films followed by Bruceploitation flicks, Good Guys Wear Black launched Norris as the first successful homegrown American martial arts star, having previously been best known as a villain in Lee's Way of the Dragon. Good Guys Wear Black distinguished itself from earlier martial arts films with its distinctly American setting, characters, themes, and politics, a formula which Norris continued to develop with his later films."}, {"text": "=== 1979 to 1983: Action film star ===In 1979, Norris starred in A Force of One, where he played Matt Logan, a world karate champion who assists the police in their investigation. The film was developed while touring for Good Guys Wear Black. Again no studio wanted to pick it up, but it out-grossed the previous film by making $20 million at the box office.In 1980, he released The Octagon, where his character must stop a group of terrorists trained in the ninja style. Unlike his previous films this time the studios were interested. American Cinema Releasing distributed it and it made almost $19 million at the box office.In 1981, he starred in Steve Carver's An Eye for an Eye.In 1982, he had the lead in the action horror film Silent Rage. It was his first film released by a major studio, Columbia Pictures. Norris plays a sheriff who must stop a psychopath on a rampage. Shortly afterward MGM gave him a three-movie deal and that same year, they released Forced Vengeance (1982). Norris was unhappy with the direction they wanted to take with him, hence the contract was canceled.In 1983, Norris made Lone Wolf McQuade with Orion Pictures and Carver directing. He plays a reckless but brave Texas Ranger who defeats an arms dealer played by David Carradine. The film was a worldwide hit and had a positive reception from movie critics, often being compared to Sergio Leone's stylish Spaghetti Westerns. The film became the inspiration for Norris's future hit TV show Walker, Texas Ranger. Film critic Roger Ebert gave the film a 3.5 star rating, calling the character of J.J. McQuade worthy of a film series and predicting the character would be a future classic, and it would be the first movie where Norris would have his trademark beard. The same year, he also published an exercise called Toughen Up! the Chuck Norris Fitness System. Also in 1983, Xonox produced the video game Chuck Norris Superkicks for the Commodore 64, VIC-20, Atari 2600, and Colecovision. The game combines two types of gameplay: moving through a map, and fighting against enemies. The player takes control of Norris who has to liberate a hostage. It was later sold as Kung Fu Superkicks when the license for the use of the name Chuck Norris expired."}, {"text": "=== 1984 to 1988: Mainstream success ===In 1984, Norris starred in Joseph Zito's Missing in Action. It's the first of a series of POW rescue fantasies, where he plays Colonel James Braddock. Produced by Menahem Golan and Yoram Globus and released under their Cannon Films banner, with which he had signed a multiple movie deal. Norris later dedicated these films to his younger brother Wieland, who was a private in the 101st Airborne Division, and had been killed in June 1970 in Vietnam while on patrol in the defence of Firebase Ripcord. The film was a huge success and Norris became Cannon's most prominent star of the 1980s."}, {"text": "=== 1984 to 1988: Mainstream success ===Missing in Action 2: The Beginning premiered on March 1, 1985. It is a prequel to the first installment, about Braddock being held in a North Vietnamese POW camp. Orion Pictures released Code of Silence on May 3. It received positive reviews and was also a box office success. Code of Silence is a crime drama, and features Norris as a streetwise plainclothes officer who takes down a crime czar. Invasion U.S.A. premiered on September 27, with Zito directing."}, {"text": "=== 1984 to 1988: Mainstream success ===On February 14, 1986, Menahem Golan's The Delta Force premiered. Norris co-stars with Lee Marvin. They play leaders of an elite squad of Special Forces troops who face a group of terrorists. The Delta Force was a box office success. In October, Ruby-Spears' cartoon Karate Kommandos first aired. The animated show lasted six episodes. In it, Norris voices a cartoon version of himself who leads a United States government team of operatives known as the Karate Kommandos. Marvel made a comic book adaptation. On November 21, J. Lee Thompson's Firewalker was released. In it, Norris and Louis Gossett Jr. play adventurers.In 1987, he published the New York Times Best Seller The Secret of Inner Strength: My Story. It is about his self-improvement philosophy.On January 2, 1988, Braddock: Missing in Action III premiered, Norris returned to the title role and his brother Aaron Norris directed. On August 28, Norris starred in Hero and the Terror directed by William Tannen. In it Norris stars as a cop investigating a serial killer."}, {"text": "=== 1989 to 1999: Subsequent success ===By 1990, his films had collectively grossed over $500 million worldwide . By this time, he had drawn comparisons to both Bruce Lee and Clint Eastwood, sometimes called the \"blonde Bruce Lee\" for his martial arts film roles while his \"loner\" persona was compared to the Eastwood character Dirty Harry. That same year, MGM acquired the Cannon Films library. Norris continued making films with Aaron, who directed him in Delta Force 2, The Hitman, Sidekicks (1993), Hellbound (1994), Top Dog (1995), and Forest Warrior (1996).In 1993, he began shooting the action series Walker, Texas Ranger. The television show is centered on Sergeant Cordell Walker (Norris), a member of the Texas Rangers, a state-level bureau of investigation, and is about his adventures fighting criminals with his partner James Trivette. It lasted eight seasons on CBS and continued in syndication on other channels, notably the Hallmark Channel. The show was very successful in the ratings throughout its run, ranking among the Top 30 programs from 1995 until 1999, and ranking in the Top 20 in both the 1995–1996 and 1998–1999 seasons. In 1999, Norris produced and played Walker in a supporting role in the Walker, Texas Ranger spin-off Sons of Thunder. The same year, also playing the role of Walker, Norris acted in a crossover episode of the Sammo Hung's TV show Martial Law. For another crossover, Hung also appeared as his character in Walker, Texas Ranger."}, {"text": "=== 1989 to 1999: Subsequent success ===Separately from Walker, Texas Ranger, on August 25, 1993, the Randy Travis television special Wind in the Wire first aired. Norris was among the guests. At the 1994 edition of the World Wrestling Federation (WWF)'s Survivor Series event, Norris was the special outside enforcer for the Casket Match between The Undertaker and Yokozuna. During the match, Norris delivered a roundhouse kick to an interfering Jeff Jarrett. In 1996, Norris wrote the book The Secret Power Within: Zen Solutions to Real Problems. Since 1997, Norris has appeared with Christie Brinkley in a long-running series of cable TV infomercials promoting Total Gym home fitness equipment. On November 1, 1998, CBS premiered Michael Preece's television film Logan's War: Bound by Honor, starring Norris and Eddie Cibrian. The television film was ranked third among the thirteen most viewed shows of that week."}, {"text": "=== 2000 to 2005: Subsequent films and internet fame ===In the early 2000s, Norris starred as a secret agent in the CBS television films The President's Man (2000) and The President's Man: A Line in the Sand.(2002).In 2003, Norris played a role in the supernatural Christian film Bells of Innocence. That same year, he acted in one episode of the TV show Yes, Dear.In 2004, Rawson Marshall Thurber's comedy film DodgeBall: A True Underdog Story was released. Norris plays himself as a judge during a dodgeball game. Described by critics as \"a raunchy comedy that delivers for many\", it grossed $167.7 million.That same year, he published his autobiography Against All Odds: My Story."}, {"text": "=== 2000 to 2005: Subsequent films and internet fame ===In 2005, Norris founded the World Combat League (WCL), a full-contact, team-based martial arts competition, of which part of the proceeds are given to his Kickstart Kids program.On October 17, 2005, CBS premiered the Sunday Night Movie of the Week Walker, Texas Ranger: Trial by Fire. The production was a continuation of the series, and not scripted to be a reunion movie. Norris reprised his role as Walker for the movie. He has stated that future Walker, Texas Ranger Movie of the Week projects are expected; however, this was severely impaired by CBS's 2006–2007 season decision to no longer regularly schedule Movies of the Week on Sunday night."}, {"text": "=== 2000 to 2005: Subsequent films and internet fame ===Chuck Norris facts originally started appearing on the Internet in early 2005. Created by Ian Spector, they are satirical factoids about Norris. Since then, they have become widespread in popular culture. The \"facts\" are normally absurd hyperbolic claims about Norris's toughness, attitude, virility, sophistication, and masculinity. Norris has written his own response to the parody on his website, stating that he does not feel offended by them and finds some of them funny, claiming that his personal favorite is that they wanted to add his face to Mount Rushmore, but the granite is not hard enough for his beard. At first it was mostly college students exchanging them, but they later became extremely widespread.From that point on, Norris started to tour with the Chuck Norris facts appearing on major talk shows, and even visiting troops in Iraq for morale boosting appearances."}, {"text": "=== 2006–present: Current works ===Norris starred in the film The Cutter in 2006, where he plays a detective on a rescue mission. That year time he published the novel The Justice Riders, co-written with Ken Abraham, Aaron Norris, and Tim Grayem.Gotham Books, the adult division of Penguin USA, released a book penned by Ian Spector entitled The Truth About Chuck Norris: 400 facts about the World's Greatest Human. Norris subsequently filed suit in December against Penguin USA claiming \"trademark infringement, unjust enrichment and privacy rights\". Norris dropped the lawsuit in 2008. The book is a New York Times bestseller. Since then, Spector has published four more books based on Chuck Norris facts, these are Chuck Norris Cannot Be Stopped: 400 All-New Facts About the Man Who Knows Neither Fear Nor Mercy, Chuck Norris: Longer and Harder: The Complete Chronicle of the World's Deadliest, Sexiest, and Beardiest Man, The Last Stand of Chuck Norris: 400 All New Facts About the Most Terrifying Man in the Universe, and Chuck Norris Vs. Mr. T: 400 Facts About the Baddest Dudes in the History of Ever (also a New York Times bestseller). That year Norris with the same team published a sequel to The Justice Riders called A Threat to Justice. Tyndale House Publishers also published a book praising Norris, entitled The Official Chuck Norris Fact Book: 101 of Chuck's Favorite Facts and Stories, which was co-written and officially endorsed by him.In 2008, he published the political non-fiction book Black Belt Patriotism: How to Reawaken America, which reached number 14 on The New York Times best seller list in September 2008. That same year, Gameloft produced the video game Chuck Norris: Bring On the Pain for mobile devices, based on the popularity Norris had developed on the internet with the Chuck Norris facts. The player takes control of Norris in a side-scrolling beat 'em up. The game was well reviewed.Since 2010, Norris has been a nationally syndicated columnist with Creators Syndicate writing on both personal health issues and broader issues of health care in America.Throughout the 2010s, Norris appeared in advertisements for T-Mobile, World of Warcraft, BZ WBK, the French TV show \"Pieds dans le plat\", Hoegaarden, United Healthcare, Hesburger, Cerveza Poker, Toyota, and in the 2020s, QuikTrip.In 2012, Norris played a mercenary in The Expendables 2. The film was a success and grossed over $310 million worldwide.That same year, Norris and his wife Gena founded CForce Bottling Co. after an aquifer was discovered on his ranch.In 2017, Norris became Fiat's ambassador, a \"tough face\" for its commercial vehicles. Flaregames produced Non Stop Chuck Norris, an isometric action-RPG game for mobile device and is the second game to be based on his popularity developed by the Chuck Norris facts. The game was well reviewedIn 2019, Norris hosted the documentary Chuck Norris’ Epic Guide to Military Vehicles on the History Channel. In it Norris explores vehicular creations by the US military.In 2020, Norris acted in the series finale of Hawaii Five-0.In 2021, Norris was obtainable as a tank-commander in World of Tanks during the Holiday Ops event. He gave players extra missions and featured a unique voice-over."}, {"text": "== Martial arts knowledge ==Norris has founded two major martial arts systems: American Tang Soo Do and Chuck Norris System (formerly known as Chun Kuk Do)."}, {"text": "=== American Tang Soo Do ===American Tang Soo Do was formed in 1966 by Norris, which is combination of Moo Duk Kwan-style Tang Soo Do, Judo and Karate (Shito-Ryu and Shotokan). Over the years it has been further developed by former black belts of his and their students."}, {"text": "=== Chuck Norris System ===Norris's present martial art system is the Chuck Norris System, formerly known as Chun Kuk Do.The style was formally founded in 1990 as Chun Kuk Do by Norris, and was originally based on Norris's Tang Soo Do training in Korea while he was in the military."}, {"text": "=== Chuck Norris System ===During his competitive fighting career, Norris began to evolve the style to make it more effective and well-rounded by studying other systems such as Shōtōkan, Gōjū-ryū, Shitō-ryū, American Kenpo, Enshin kaikan, Kyokushin, Judo, Brazilian Jiu-Jitsu, Arnis, Taekwondo, Tang Soo Do and Hapkido. Chun Kuk Do now emphasizes self defense, competition, weapons, grappling, and fitness, among other things. Each summer the United Fighting Arts Federation (UFAF) holds a training conference and the Chun Kuk Do world championship tournament in Las Vegas, Nevada.The art includes a code of honor and rules to live by. These rules are from Norris's personal code. They are:"}, {"text": "=== Chuck Norris System ===I will develop myself to the maximum of my potential in all ways."}, {"text": "=== Chuck Norris System ===I will forget the mistakes of the past and press on to greater achievements."}, {"text": "=== Chuck Norris System ===I will continually work at developing love, happiness and loyalty in my family."}, {"text": "=== Chuck Norris System ===I will look for the good in all people and make them feel worthwhile."}, {"text": "=== Chuck Norris System ===If I have nothing good to say about a person, I will say nothing."}, {"text": "=== Chuck Norris System ===I will always be as enthusiastic about the success of others as I am about my own."}, {"text": "=== Chuck Norris System ===I will maintain an attitude of open-mindedness."}, {"text": "=== Chuck Norris System ===I will maintain respect for those in authority and demonstrate this respect at all times."}, {"text": "=== Chuck Norris System ===I will always remain loyal to my God, my country, family and my friends."}, {"text": "=== Chuck Norris System ===I will remain highly goal-oriented throughout my life because that positive attitude helps my family, my country and myself.Like most traditional martial arts, Chuck Norris System includes the practice of forms (Korean hyung and Japanese kata). The majority of the system's forms are adapted from Korean Tang Soo Do, and Taekwondo, Japanese Shitō-ryū, Shotokan Karate, Goju-ryu Karate, Judo, Brazilian Jiu-jitsu, American Kenpo and Kyokushinkai. It includes two organization-specific introductory forms, two organization-specific empty-hand forms, and one organization-specific weapon form (UFAF Nunchuk form, UFAF Bo form, UFAF Sai forms).The United Fighting Arts Federation has graduated over 3,000 black belts in its history, and currently has nearly 4,000 active members world-wide. There are about 90 member schools in the US, Mexico, Norway, and Paraguay."}, {"text": "== Distinctions, awards, and honors ==While in the military, Norris's rank units were Airman First Class, 15th Air Force, 22d Bombardment Group, and 452d Troop Carrier Wing."}, {"text": "== Distinctions, awards, and honors ==Norris has received many black belts. These include a 10th degree black belt in Chun Kuk Do, a 9th degree black belt in Tang Soo Do, an 8th degree black belt in Taekwondo, a 5th degree black belt in Karate, a 3rd degree black belt in Brazilian jiu-jitsu from the Machado family, and a black belt in Judo."}, {"text": "== Distinctions, awards, and honors ==In 1967, he won the Sparring Grand Champions at the S. Henry Cho's All American Championship, and won it again the following year."}, {"text": "== Distinctions, awards, and honors ==In 1968, he won the Professional Middleweight Karate champion title, which he held for six consecutive years."}, {"text": "== Distinctions, awards, and honors ==In 1969, he won Karate's triple crown for the most tournament wins of the year."}, {"text": "== Distinctions, awards, and honors ==In 1969, he won the Fighter of the Year award by Black Belt magazine."}, {"text": "== Distinctions, awards, and honors ==In 1982, he won Action Star of the Year at the ShoWest Convention."}, {"text": "== Distinctions, awards, and honors ==In 1989, he received his Star on the Hollywood Walk of Fame."}, {"text": "== Distinctions, awards, and honors ==In 1992, he won International Box Office Star of the Year at the ShoWest Convention."}, {"text": "== Distinctions, awards, and honors ==In 1997, he won the Special Award of being a Texas legend at the Lone Star Film & Television Awards."}, {"text": "== Distinctions, awards, and honors ==From 1997 to 1998, he won for three consecutive years the BMI TV Music Award at the BMI Awards."}, {"text": "== Distinctions, awards, and honors ==In 1999, Norris was inducted into the Martial Arts History Museum's Hall of Fame."}, {"text": "== Distinctions, awards, and honors ==In 1999, he was nominated for Favorite Actor in a Drama by the TV Guide Award."}, {"text": "== Distinctions, awards, and honors ==In 1999, he won the Inspirational Acting in Television Award at the Grace Prize Award."}, {"text": "== Distinctions, awards, and honors ==On July 1, 2000, Norris was presented the Golden Lifetime Achievement Award by the World Karate Union Hall of Fame."}, {"text": "== Distinctions, awards, and honors ==In 2001, he received the Veteran of the Year at the American Veteran Awards."}, {"text": "== Distinctions, awards, and honors ==In 2001, he won the Golden Boot at the Golden Boot Awards."}, {"text": "== Distinctions, awards, and honors ==On March 28, 2007, Commandant Gen. James T. Conway made Norris an honorary United States Marine during a dinner at the commandant's residence in Washington, D.C."}, {"text": "== Distinctions, awards, and honors ==On December 2, 2010, he (along with brother Aaron) was given the title honorary Texas Ranger by Texas Governor Rick Perry."}, {"text": "== Distinctions, awards, and honors ==In 2010, he won the Lifetime Achievement Award at the ActionFest."}, {"text": "== Distinctions, awards, and honors ==In 2017, he was honored as an \"Honorary Texan\" because for many years he has lived at his Texas ranch near Navasota and he starred as Texas Ranger in his movie Lone Wolf McQuade and starred as ranger Cordell Walker in the TV series Walker, Texas Ranger."}, {"text": "== Distinctions, awards, and honors ==In 2020, two editions of a book honoring Norris were published titled Martial Arts Masters & Pioneers Biography: Chuck Norris – Giving Back For A Lifetime by Jessie Bowen of the American Martial Arts Alliance."}, {"text": "=== Family ===Norris married his classmate Dianne Kay Holechek (born 1941) in December 1958 when he was 18 and Dianne was 17 years of age. They had met in 1956 at high school in Torrance, California. In 1962, their first child, Mike, was born. He also had a daughter in 1963 out of an extramarital affair. Later, he had a second son, Eric, with his wife in 1964. After 30 years of marriage, Norris and Holechek were divorced in 1989, after separating in 1988 during the filming of The Delta Force 2."}, {"text": "=== Family ===On November 28, 1998, he married former model Gena O'Kelley, 23 years Norris's junior. O'Kelley had two children from a previous marriage. She delivered twins on August 30, 2001.On September 22, 2004, Norris told Entertainment Tonight's Mary Hart that he did not meet his illegitimate daughter from a past relationship until she was 26, although she learned that he was her father when she was 16. He met her after she sent a letter informing him of their relationship in 1990, one year after Norris's divorce from his first wife, Dianne Holechek.Norris had thirteen grandchildren as of 2017."}, {"text": "=== Christianity ===An outspoken Christian, Norris is the author of several Christian-themed books. On April 22, 2008, Norris expressed his support for the intelligent design movement when he reviewed Ben Stein's Expelled for Townhall.com.He is Baptist and a member of the Prestonwood Baptist Church (Southern Baptist Convention) in Dallas."}, {"text": "=== Political views ===Norris is a Republican and outspoken conservative. Norris is a columnist for the far-right WorldNetDaily.In an interview following the release of the 1984 film Missing in Action, Norris stated that \"I am a conservative, a real flag waver, a big Ronald Reagan fan. I'm not so much a Republican or Democrat; I go more for the man himself. Ronald Reagan says what he thinks, he's not afraid to speak his mind, even if he may be unpopular. I want a strong leader and he is a strong leader. And ever since he has been in office there has been a more positive, patriotic feeling in this country.\"Around the time of the filming of the 1986 film The Delta Force, Norris said – in response to the hijacking of TWA flight 847 – that United States is becoming a \"paper tiger\" in the Middle East. \"What we're facing here is the fact that our passive approach to terrorism is going to instigate much more terrorism throughout the world.\" \"I've been all over the world, and seeing the devastation that terrorism has done in Europe and the Middle East, I know eventually it's going to come here,\" added Norris. \"It's just a matter of time. They're doing all this devastation in Europe now, and the next stepping stone is America and Canada. Being a free country, with the freedom of movement that we have, it's an open door policy for terrorism. It's like Khadafy [sic] said a few weeks ago. 'If Reagan doesn't back off, I'm going to release my killer squads in America.' And there's no doubt in my mind that he has them.\"In 2007, Norris took a trip to Iraq to visit U.S. troops.On November 18, 2008, Norris became one of the first members of show business to express support for the California Proposition 8 ban on same-sex marriage, and he criticized activists for not accepting the democratic process and the apparent double standard he perceived in criticizing the Church of Jesus Christ of Latter-day Saints without criticizing African Americans, most of whom who had voted for the measure.In 2009, Norris had expressed support for the Barack Obama \"birther\" conspiracy. In his letter, released at WorldNetDaily, Norris deemed then-President Obama's refusal to disclose his birth certificate suspicious and implored him to put an end to the conspiracy theories.On April 11, 2011 Norris had written a five-part investigation regarding the \"infiltration of Sharia law into United States culture\" for WorldNetDaily.On June 26, 2012, Norris published an article on Ammoland.com, in which he accused the Obama administration of paying Jim Turley, one of the national board members of the Boy Scouts of America at the time, to reverse the organization's policy that excluded gay youths from joining.During the 2012 presidential election, Norris first recommended Ron Paul, and then later formally endorsed Newt Gingrich as the Republican presidential candidate. After Gingrich suspended his campaign in May 2012, Norris endorsed Republican presumptive nominee Mitt Romney, despite Norris having previously accused Romney of flip-flopping and of trying to buy the nomination for the Republican Party candidacy for 2012. On the eve of the election, he and his wife Gena made a video warning that if evangelicals did not show up at the polls and vote out President Obama, \"...our country as we know it may be lost forever...\".Norris has visited Israel, and he voiced support for former Israeli Prime Minister Benjamin Netanyahu in the 2013 and 2015 elections. Norris endorsed Huckabee again in the 2016 Republican primaries before he dropped out. In March 2016, it was reported that Norris endorsed Republican Texas Senator Ted Cruz and that he would be attending a Cruz rally, but two days later, Norris stated he would only endorse the GOP nominee once that nominee has been nominated by the party. Norris endorsed former Alabama Chief Justice Roy Moore in the 2017 United States Senate special election in Alabama.In 2019, Norris signed an endorsement deal with gun manufacturer Glock. The deal was met with criticism from some members of the public and some of his fans, who felt it was in bad timing due to the increase in school shootings in the United States.In 2021, Norris announced his support of the 2021 gubernatorial election to recall incumbent Governor Gavin Newsom and endorsed radio talk show host Larry Elder to replace him."}, {"text": "== Philanthropy ==In 1990, Norris established the United Fighting Arts Federation and Kickstart Kids. As a significant part of his philanthropic contributions, the organization was formed to develop self-esteem and focus in at-risk children as a tactic to keep them away from drug-related pressure by training them in martial arts. Norris hopes that by shifting middle school and high school children's focus towards this positive and strengthening endeavor, these children will have the opportunity to build a better future for themselves. Norris has a ranch in Navasota, Texas, where they bottle water; a portion of the sales support environmental funds and Kickstart Kids."}, {"text": "== Philanthropy ==He is known for his contributions towards organizations such as Funds for Kids, Veteran's Administration National Salute to Hospitalized Veterans, the United Way, and the Make-A-Wish Foundation in the form of donations as well as fund-raising activities.His time with the U.S. Veterans Administration as a spokesperson was inspired by his experience serving the United States Air Force in Korea. His objective has been to popularize the issues that concern hospitalized war veterans such as pensions and health care. Due to his significant contributions, and continued support, he received the Veteran of the Year award in 2001 at the American Veteran Awards.In India, Norris supports the Vijay Amritraj Foundation, which aims to help victims of disease, tragedy and circumstance. Through his donations, he has helped the foundation support Paediatric HIV/AIDS homes in Delhi, a blind school in Karnataka, and a mission that cares for HIV/AIDS-infected adults, as well as mentally ill patients in Cochin."}, {"text": "== Bibliography ==Winning Tournament Karate (1975)"}, {"text": "== Bibliography ==Toughen Up! The Chuck Norris Fitness System (1983)"}, {"text": "== Bibliography ==The Secret of Inner Strength: My Story (1987)"}, {"text": "== Bibliography ==The Secret Power Within: Zen Solutions to Real Problems (1996)"}, {"text": "== Bibliography ==Against All Odds: My Story (2004)"}, {"text": "== Bibliography ==The Justice Riders (2006)"}, {"text": "== Bibliography ==A Threat to Justice (2007)"}, {"text": "== Bibliography ==Black Belt Patriotism: How to Reawaken America (2008). Regnery Publishing. ISBN 978-1-59698-558-2."}, {"text": "== Bibliography ==The Official Chuck Norris Fact Book: 101 of Chuck's Favorite Facts and Stories (2009)"}, {"text": "== External links ==Official website"}, {"text": "== External links ==Chuck Norris at the British Film Institute"}, {"text": "== External links ==Chuck Norris at IMDb"}, {"text": "== External links ==Chuck Norris Archived October 20, 2012, at the Wayback Machine at martialinfo.com Archived August 26, 2019, at the Wayback Machine"}, {"text": "== External links ==Official Chun Kuk Do Website"}, {"text": "== External links ==Appearances on C-SPAN"}]