[{"text": "Hannah Dakota Fanning (born February 23, 1994) is an American actress. She rose to prominence at the age of seven for playing the daughter of an intellectually challenged man in the drama film I Am Sam (2001), for which she received a Screen Actors Guild Award nomination, making her the youngest nominee in SAG history. Fanning had further roles as a child actress in Uptown Girls (2003), Man on Fire (2004), War of the Worlds (2005), Charlotte's Web (2006) and The Secret Life of Bees (2008), in addition to a voice role in Coraline (2009)."}, {"text": "As an adult, Fanning went on to star in independent films, such as The Runaways (2010), Now Is Good (2012) and Effie Gray (2014), and played Jane Volturi in The Twilight Saga (2009–2012). In 2018, she appeared in the heist comedy Ocean's 8 and had a starring role in the period drama series The Alienist. She has since portrayed Squeaky Fromme in Quentin Tarantino's film Once Upon a Time in Hollywood (2019), Susan Ford in the drama series The First Lady (2022), and a CIA agent in The Equalizer 3 (2023). In 2024, she starred in the thriller series Ripley (2024)."}, {"text": "== Early life ==Fanning was born in Conyers, Georgia. She attended a Montessori School in Covington. Her mother, Heather Joy (née Arrington), played tennis professionally, and her father, Steven J. Fanning, played minor league baseball and later worked as an electronics salesman in Los Angeles, California. Her maternal grandfather was former American football player Rick Arrington, and her aunt is former ESPN reporter Jill Arrington. Her ancestors include William Farrar. Fanning is the elder sister of actress Elle Fanning; both of them use their middle names as their given names due to family tradition and were brought up as Southern Baptists."}, {"text": "=== 1999–2003 ===When Fanning was a small child, she was an actress at the Towne Lake Arts Center in Woodstock, Georgia, starring in small plays. In 1999, at the age of five, she began her professional acting career, appearing in a Tide television commercial. Her first significant acting job was a guest role in the NBC prime-time drama ER, which remains one of her favorite roles:"}, {"text": "=== 1999–2003 ===I played a car accident victim who has leukemia. I got to wear a neck brace and nose tubes for the two days I worked."}, {"text": "=== 1999–2003 ===Fanning subsequently had several guest roles on television series, including CSI: Crime Scene Investigation, The Practice, and Spin City. She also portrayed the title characters of Ally McBeal and The Ellen Show as young girls."}, {"text": "=== 1999–2003 ===In 2001, Fanning was chosen to star opposite Sean Penn, Michelle Pfeiffer and her younger sister Elle Fanning in the film I Am Sam, as the daughter of a mentally challenged man who fights for custody of her. Her role in the film made Fanning the youngest person ever to be nominated for a Screen Actors Guild Award, being seven years of age at the time. She also won the Best Young Actor/Actress award from the Broadcast Film Critics Association for her performance. Fanning's performance would later be incorporated into the music video for Rufus Wainwright's cover of the Beatles' \"Across the Universe\"; the song itself was included in I Am Sam.In 2002, director Steven Spielberg cast Fanning in the lead child role of Allison \"Allie\" Clarke/Keys in the science fiction miniseries Taken. By this time, she had received positive notices from several film critics, including Tom Shales of The Washington Post, who wrote that Fanning \"has the perfect sort of otherworldly look about her, an enchanting young actress called upon ... to carry a great weight.\"In the same year, Fanning appeared in three films: as a kidnapping victim who proves to be more than her abductors bargained for in Trapped, as the young version of Reese Witherspoon's character in Sweet Home Alabama, and as Katie in the film Hansel and Gretel."}, {"text": "=== 1999–2003 ===A year later, she starred in two prominent films: playing the uptight child to an immature nanny played by Brittany Murphy in Uptown Girls, and as Sally in The Cat in the Hat. In addition, Fanning did voice-over work for four animated projects during this period, including voicing Satsuki in Disney's English language release of My Neighbor Totoro, starring alongside her younger sister Elle Fanning, who voiced Mei; a little girl in the Fox series Family Guy; and a young Wonder Woman in the episode \"Kids Stuff\" from Cartoon Network's Justice League Unlimited."}, {"text": "=== 2004–2007 ===In 2004, Fanning appeared in Man on Fire as Pita, a nine-year-old who wins over the heart of a retired mercenary (Denzel Washington) hired to protect her from kidnappers. Roger Ebert wrote that Fanning \"is a pro at only ten years old, and creates a heart-winning character.\" In 2004, she made an appearance on season ten of the television series Friends, playing the role of Mackenzie, a young girl who is moving out of the house Monica and Chandler are buying."}, {"text": "=== 2004–2007 ===Hide and Seek was her first release in 2005, opposite Robert De Niro. The film was generally panned, but critic Chuck Wilson called it \"a fascinating meeting of equals – if the child star [Fanning] challenged the master [De Niro] to a game of stare-down, the legend might very well blink first.\"Fanning voiced Lilo Pelekai (taking over for Daveigh Chase) in the direct-to-video film Lilo & Stitch 2: Stitch Has a Glitch. She also had a small part in the Rodrigo García film Nine Lives (released in October 2005), in which she shared an unbroken nine-minute scene with actress Glenn Close, who had her own praise for Fanning: \"She's definitely an old soul. She's one of those gifted people that come along every now and then.\" Fanning also recorded her lead role in Coraline during this time.Fanning completed filming on Dreamer: Inspired by a True Story (opposite Kurt Russell) in late October 2004."}, {"text": "=== 2004–2007 ===Kris Kristofferson, who plays her character's grandfather in the film, said that she is like Bette Davis reincarnated. While promoting her role in Dreamer, Fanning became a registered member of Girl Scouts of the USA at a special ceremony, which was followed by a screening of the film for members of the Girl Scouts of the San Fernando Valley Council."}, {"text": "=== 2004–2007 ===Fanning then went on to star in War of the Worlds, starring alongside Tom Cruise. Released in reverse order (War in June 2005 and Dreamer in the following October), both films were a critical success. War director Steven Spielberg praised \"how quickly she understands the situation in a sequence, how quickly she sizes it up, measures it up and how she would really react in a real situation.\"Fanning moved straight to another film without a break: Charlotte's Web, which she finished filming in May 2005 in Australia, and premiered on December 15, 2006."}, {"text": "=== 2004–2007 ===During the summer of 2006, Fanning worked on the film Hounddog, described in press reports as a \"dark story of abuse, violence, and Elvis Presley adulation in the rural South.\" Fanning's parents have been criticized for allowing her to film a scene in which her character is raped. However, Fanning defended the film by saying to Reuters, \"It's not really happening. It's a movie, and it's called acting.\"Although the film was a failure both at the box office and with critics, Roger Ebert praised Fanning's performance, comparing her to Jodie Foster in Taxi Driver.In the same year, at the age of twelve, she was invited to join the Academy of Motion Picture Arts and Sciences, becoming the youngest member in the academy's history. Later that year, she was ranked 4th in Forbes list of \"Top-Earning Stars Aged Under 21\", having earned an estimated $4 million in 2006.In the spring of 2007, she filmed Fragments – Winged Creatures alongside Kate Beckinsale, Guy Pearce, Josh Hutcherson, and Academy Award winners Forest Whitaker and Jennifer Hudson. She plays Anne Hagen, a girl who witnesses her father's murder and who turns to religion in the aftermath. In July, Fanning appeared on a short film titled Cutlass, one of Glamour's \"Reel Moments\" based on readers' personal essays. Cutlass was directed by Kate Hudson."}, {"text": "=== 2004–2007 ===From September to the end of the year, Fanning filmed Push, which centers on a group of young American expatriates with telekinetic and clairvoyant abilities who hide from the Division (a U.S. government agency) in Hong Kong and band together to try to escape the control of the division. Fanning played Cassie Holmes, a 13-year-old psychic."}, {"text": "=== 2008–2011 ===In January 2008, Fanning began filming the film adaptation of The Secret Life of Bees, a novel by Sue Monk Kidd. Set in South Carolina in 1964, the story centers on Lily Owens (Fanning), who escapes her lonely life and troubled relationship with her father by running away with her caregiver and only friend (played by Jennifer Hudson) to a South Carolina town where they are taken in by an eccentric trio of beekeeping sisters (played by Queen Latifah, Sophie Okonedo, and Alicia Keys)."}, {"text": "=== 2008–2011 ===Her films, horror animation Coraline and science fiction thriller Push, were released on the same day, February 6, 2009."}, {"text": "=== 2008–2011 ===In March 2008, upon the original creation of the film adaptation Dakota and Elle Fanning were cast to play Kate and Anna respectively in the film My Sister's Keeper. However, when Dakota heard that she would be required to shave her head for the role, she dropped out of the film as then did Elle. The two sisters were replaced; Abigail Breslin took on the lead role as Anna Fitzgerald, and Sofia Vassilieva was cast as Kate Fitzgerald.Fanning played Jane, a member of the Volturi Guard, in New Moon and reprised the role in Eclipse, based on novels by Stephenie Meyer. New Moon was released on November 20, 2009, and Eclipse was released on the following June. On in March 2009, she was ranked number three on the list of Forbes' Most Valuable Young Stars after having earned an estimated $14 million."}, {"text": "=== 2008–2011 ===In 2010, she starred in the film The Runaways, alongside Kristen Stewart, Stella Maeve, and Scout Taylor-Compton, where she played Cherie Currie, the lead singer of the band. Then from the end of the year until early 2011, Fanning filmed Breaking Dawn, reprising the role of Jane.Fanning's voice was heard in Rise, a documentary film commissioned by U.S. Figure Skating to mark the fiftieth anniversary of the crash of Sabena Flight 548 which resulted in the loss of the entire American team and subsequent cancellation of the 1961 World Figure Skating Championships. She read a poem written by U.S. national champion Laurence Owen (who died in the crash) that was said to be an eerie premonition of the afterlife.During the summer of 2011, she played Tessa in Now Is Good. Fanning also became the face of Marc Jacobs' Oh, Lola! perfume campaign, but the ad was banned in the UK as the Advertising Standards Authority judged that \"the ad could be seen to sexualize a child.\"In 2011, she played Annie James in The Motel Life, which was released on November 8, 2013. In the fall of 2011, Fanning played the starring role in Effie Gray, directed by Richard Laxton, written and co-starred by Emma Thompson, with Greg Wise, Tom Sturridge, Robbie Coltrane, Julie Walters, Derek Jacobi and Claudia Cardinale."}, {"text": "=== 2012–2015 ===In August 2012, she played the lead role of a wealthy financial eco-terrorist Dena Brauer, in a thriller film Night Moves opposite actors Jesse Eisenberg and Peter Sarsgaard. The film was directed by Kelly Reichardt. Night Moves tells the story of three eco-terrorists who work at an organic farm and collaborate on a plot to blow up a hydroelectric dam.In January 2013, she was cast as Beverly Aadland in the Errol Flynn biopic The Last of Robin Hood. Later that year in September, Fanning was cast as Olivia in Franny. In November, she was cast in Viena and the Fantomes as Viena; about a roadie traveling across America with a punk rock band in the 1980s. The film was originally set to be released in 2015, but later released digitally on June 30, 2020.In February 2014, she recorded a voice role for the animated film Yellowbird.In May 2015, Every Secret Thing, based on the 2004 novel by Laura Lippman, co-starring Diane Lane, Elizabeth Banks, Danielle Macdonald, Colin Donnell and Nate Parker was released in the U.S."}, {"text": "=== 2012–2015 ===Also in 2015, Martin Koolhoven confirmed that Jack Roth joined the cast of the film Brimstone. In June 2015, The Hollywood Reporter confirmed that Fanning and Kit Harington had replaced Mia Wasikowska and Robert Pattinson in the film, respectively. The set of primary recording began June 15 and will be held in Romania, Spain, and Germany."}, {"text": "=== 2016–present ===In July 2016, it was announced Fanning was cast in a film adaptation of The Bell Jar as Esther Greenwood.In 2017, Fanning starred in Neill Blomkamp's Zygote as part of Blomkamp's series of experimental short films released through Oats Studios.Fanning had a cameo role in the heist comedy Ocean's 8, which was released in 2018. The same year starred as Sara Howard in the TNT historical television series The Alienist based on novel of the same name. In August 2018, TNT ordered a sequel series based upon the follow-up novel The Angel of Darkness, with Fanning set to return to reprise the role of Sara Howard. In 2019, Fanning played Lynette \"Squeaky\" Fromme in Quentin Tarantino's comedy-drama Once Upon a Time in Hollywood, for which she and the cast of the film were nominated for the SAG Award for Outstanding Performance by a Cast in a Motion Picture.In December 2019, it was announced that Fanning and her sister Elle Fanning would star together in an adaption of Kristin Hannah's 2015 novel, The Nightingale, which is set to be directed by Mélanie Laurent. In March 2021, the sisters announced the formation of a production company, Lewellen Pictures. Their company has a first-look deal with MRC Television/Civic Center Media. In March 2023, Fanning was cast to star in the Netflix miniseries The Perfect Couple. Fanning starred in The Equalizer 3, reuniting with Denzel Washington."}, {"text": "== Personal life ==In June 2011, Fanning graduated from Campbell Hall School in Studio City, California, where she participated on the varsity spirit cheerleading squad and was twice voted homecoming queen. From 2011 to 2014, she attended the Gallatin School of Individualized Study at New York University, where she majored in women's studies, with a focus on the portrayal of women in film and culture."}, {"text": "=== Video games ===Coraline (2009), as Coraline Jones"}, {"text": "== External links ==Dakota Fanning at IMDb"}, {"text": "== External links ==Dakota Fanning at AllMovie"}, {"text": "== External links ==Dakota Fanning at the TCM Movie Database"}]