[{"text": "Danny Trejo ( Spanish: [ˈtɾexo]; born May 16, 1944) is an American actor. Born in Los Angeles, Trejo's film career began in 1985, when he landed a role in Runaway Train (1985). The first film in which he was given a proper credited role was as Art Sanella in Death Wish 4: The Crackdown (1987). He went on to star in a multitude of other films, many of which were small parts as inmates, gangsters, or other criminals, appearing in Desperado, Heat (both in 1995), From Dusk till Dawn (1996), Con Air (1997), The Replacement Killers (1998), Reindeer Games (2000), and Once Upon a Time in Mexico (2003), among others."}, {"text": "From 2001 to 2003, Trejo appeared in the Robert Rodriguez-directed Spy Kids franchise as Isador \"Machete\" Cortez. Subsequently, in 2010, Trejo reprised his role as Machete in the spin-off exploitation action film Machete as the protagonist. In 2011, Trejo reprised his role as Machete in Spy Kids: All the Time in the World. With the success of Machete (2010), Trejo once again reprised his role in a direct sequel, Machete Kills (2013)."}, {"text": "=== Childhood ===Trejo was born on May 16, 1944, on Temple Street in the Echo Park neighborhood of Los Angeles, California, to Mexican-American parents. He is the son of Delores Rivera King and Dionisio \"Dan\" Trejo (1922–1981), a construction worker. Trejo was the result of an extramarital affair; Delores's husband was away fighting in World War II. His parents met at a dance hall in Highland Park, Los Angeles in 1943. He had a maternal half-sister, Dyhan, but saw neither her nor Delores from 1949 until 1965; his father banned his mother from seeing him after Trejo sprained his arm in her care.Trejo was often abused by his father. Shortly after his birth, Trejo and his family briefly lived in San Antonio, Texas; they fled Los Angeles because Dionisio was wanted by police for stabbing another man. After a year, they returned to Los Angeles and Trejo's father turned himself in. By 1949, Trejo shared a room with his cousins at their grandmother's house. His stepmother was Alice Mendias, \"his only source of comfort\" when he lived with his father.Trejo was using marijuana, heroin, and cocaine by ages 8, 12, and 18, respectively."}, {"text": "=== Childhood === Trejo's uncle Gilbert introduced him to all three and was responsible for Trejo overdosing on his first heroin fix. When he was 13, he moved to the diverse neighborhood of Pacoima, Los Angeles, where he said he did not experience racism growing up. Years later, he purchased his childhood home and often lived in it."}, {"text": "=== Life of crime and incarceration ===At age seven, Trejo participated in his first drug deal. He was first arrested at the age of 10, but experienced his first incarceration at Eastlake Juvenile Hall in 1956.Throughout the 1960s, Trejo's life consisted predominantly of intermittent jail stints in the California prison system.  The accounts of his prison chronology, though, are notably conflicting; by one account, his final term in custody is said to have ended in 1972. However, Trejo did time in various juvenile offenders' camps, including three years at Camp Glenn Rockey, San Dimas, for maiming a sailor (stabbing him in the face with broken glass), followed by numerous California prisons between 1959 and 1969; \"I was in San Quentin, Folsom, Soledad, Vacaville, Susanville, Sierra\".While doing a stint in Los Angeles County jail in 1961, he met Charles Manson, whom he described as a \"dirty, greasy, scrawny white boy\" who was allegedly a talented hypnotist.Trejo arrived at San Quentin State Prison in 1966, and his heroin use was exacerbated shortly thereafter.  He was a debt collector and drug dealer, often participating in or witnessing acts of serious violence, including murder. Simultaneously while  imprisoned, Trejo focused on boxing and became a champion in San Quentin's lightweight and welterweight divisions.Regarding himself, Trejo has suggested his physical appearance contributed to his constantly getting into trouble. In 1968, a prison riot broke out during Cinco De Mayo at Soledad. From that fracas, Trejo ended up in solitary confinement, facing capital charges and, potentially, the death penalty, after hitting a guard with a rock.  While in solitary, Trejo found faith and became a member of a 12-step program, having first attended one \"by accident\" aged 15.  He successfully overcame his drug addictions, recalling in 2011 that he had been sober for the previous 42 years. Also while incarcerated, he earned his high-school diploma.In July 1969, Trejo was released from custody for the final time and returned to Pacoima, Los Angeles, having served five years of a 10-year prison sentence.Prior to his film career, Trejo worked as a labor foreman for developer Saul Pick, and contributed toward the construction of the Cinerama Dome. He was also a gardener, salesperson, part owner of a lawn care company, and became a substance abuse counselor since 1973."}, {"text": "==== 1980s: Acting debut ====Trejo worked with Western Pacific Med Corp in the 1980s, assisting them with the establishing and operating of sober living houses within the San Fernando Valley. He met a \"good looking tattooed kid\" during a meeting in one such house, who explained that he worked as a film extra and was paid $50 per day to stand there. Intrigued, Trejo considered becoming a film extra, initially due to the easy money and publicity it could afford his work with Western Pacific Med Corp. Trejo signed with an agent and would hand out his details while working on film sets, in the hopes of finding more opportunities to help those in need. Late one night, Trejo received a call from a teenaged patient, asking for his assistance in dealing with cocaine problems on the set of Runaway Train (1985).While there, Trejo was offered a job as an extra in the film's prison scenes. Edward Bunker, a former convict turned published crime author who was writing the screenplay for the film, recognized Trejo from their time together at San Quentin. Remembering Trejo's boxing skills, Bunker played a pivotal role in securing Trejo as Eric Roberts' personal trainer and boxing advisor. Trejo was paid between $320 and $350 per day. Trejo recalled: \"When I got my first paycheck, I thought they made a mistake!\" Bunker also convinced director Andrei Konchalovsky to offer Trejo a small acting role, asserting that Trejo's personal experiences of incarceration would provide authenticity to the prison drama. Following his acting debut, Trejo was oblivious to being typecast as a prisoner in similar roles for years to follow; \"I [did not] know I was being stereotyped. I just knew I was working.\"Penitentiary III was his first billed role. While filming he met Anthony Gambino of the Gambino Crime Family; Gambino allegedly had financial interests invested and was there to meet the leading man, Leon Isaac Kennedy. Trejo was paid $120 cash each day, but the project often went into overtime; \"We were stacked with cash.\" On a good month, Trejo was taking home as much as $700 by 1989 from being an extra alone; yet, people often assumed he was far wealthier after a few appearances on television. Trejo says this worked to his advantage as a drug counselor, though, because clients would recognize him as an actor, therefore appreciating his presence and the humility of his work all the more."}, {"text": "==== 1990s: Blood In, Blood Out and career progression ====Trejo had made a dozen films by 1990, including Death Wish 4: The Crackdown, and Marked for Death. He enjoyed the making of Guns, yet alleges Erik Estrada took issue with the cast and crew being more familiar with Trejo than himself. Trejo says Estrada's ego got the better of him; he believes Estrada arranged for Trejo and a number of others to fly coach instead of first class on the way to Hawaii for filming.In 1991, Edward James Olmos originally offered him the role of Pedro Santana in American Me. Trejo was unimpressed by the script and his initial meeting with Olmos. Trejo claims rumors began circulating within the Mexican Mafia that the script was taking narrative liberties. Before Trejo had the chance to attend a second meeting with Olmos, he received a call from Joe 'Peg Leg' Morgan, the then-living don of the Mexican Mafia; Morgan approved of his choosing a role in Blood In, Blood Out instead of American Me. In 2021, Trejo stated that he believes Olmos has yet to accept him as a serious actor.Of his experiences of Blood In, Blood Out, Trejo recalls feeling uncomfortable around many of the other actors during rehearsals, as they were more established. During production at San Quentin, Trejo often had flashbacks to his time there; filming scenes in C550, his former cell, merely exacerbated such feelings. Though his previous works brought him opportunities, Trejo credits Blood In, Blood Out as having brought him \"legitimate, worldwide fame.\"Trejo found a new talent agent with the help of Raymond Cruz. He was first cast in an episode of Baywatch, followed by a part in 1993's Last Light, Kiefer Sutherland's directorial debut.Heat went through two script revisions whilst Trejo read for the part. He ultimately secured the role, which reunited him with Michael Mann, who directed him in the television miniseries Drug Wars: The Camarena Story a few years prior. Mann initially mistook Trejo for his uncle Gilbert; he found the resemblance uncanny, having met Gilbert whilst shooting The Jericho Mile at Folsom in the late 1970s; production required the co-operation of the inmates, and Gilbert happened to be one of the shot-callers. Trejo's character in the film was initially called 'Vince' but renamed 'Trejo' in honor of Gilbert.  Filming could be upward of 17 hours per day, but Trejo said he was grateful for how much he learned; \"watching De Niro, Kilmer, and Voight, I learned a lot about how they saved [their performances] for when it mattered.\" He recalls being mentored by Robert De Niro, who was a patient and instructive scene partner. Trejo and De Niro improvised the former's death scene.In 1996, Trejo was cast in the French production Le Jaguar (which was French for The Jaguar) and reunited with Voight for Anaconda, both of which were filmed in Manaus, Brazil. When production for Anaconda moved to Venezuela, Trejo would go out socializing on his days off. The producers were worried given a possible coup d'état had made parts of the country unsafe to travel; a group of teenagers brandished AK47's on one occasion, demanding Trejo's combat boots. Because of this, Trejo says he negotiated a higher salary to remain within the confines of his hotel.Trejo described 1997's Con Air as a \"macho fest from the start\" and the cast were often pulling pranks on one another. He remembers Nicolas Cage as being \"cool as hell\" and John Cusack as a \"kickboxing badass\". Trejo met many of his longtime friends on set, including: John Malkovich, Ving Rhames, Steve Buscemi, and Dave Chappelle."}, {"text": "==== 2000s: Health scare, Spy Kids and the establishing of Isador \"Machete\" Cortez ====After concluding Animal Factory in 1999, he contracted Hepatitis C and \"had to drag [his] ass\" from Canada to Austin, Texas, to begin filming of Spy Kids in 2000. Spy Kids marked Trejo's debut as the fictional character Isador \"Machete\" Cortez. Having already made Desperado and From Dusk Till Dawn together, the opportunity to collaborate with Robert Rodriguez, Antonio Banderas, and Cheech Marin once again \"felt like [a] family reunion.\" Spy Kids provided Trejo with worldwide recognition and for the first time he was \"instantly recognizable\" amongst children around the globe.By the time of Bubble Boy in 2001, his illness had progressed to the point that much of the cast had noticed his weight loss; Trejo states that his past drug use had caught up with him. He described himself as having been pale and weak throughout production, and pre-occupied with keeping his diagnosis a secret within Hollywood for fear of reprisal. Trejo was \"out of it\" and struggling to remember his lines due to prescription medication. By the time Spy Kids premiered in September 2002, Trejo had fully recovered.Throughout the 2000s Trejo appeared in productions including: XXX; Once Upon a Time in Mexico; Anchorman: The Legend of Ron Burgundy; The Devil's Rejects; Snoop Dogg's Hood of Horror; Delta Farce; Grindhouse; Rob Zombie's Halloween; Urban Justice (alongside Steven Seagal); and Valley of Angels. He also made a number of television appearances, including: Monk, Desperate Housewives, Stargate: Atlantis, and Breaking Bad. Trejo also voiced the characters Enrique and Octavio on King of the Hill. His life is documented in the independent biographical film, Champion, featuring some of Trejo's close friends: Dennis Hopper, Val Kilmer, Steve Buscemi, and Robert Rodriguez. Trejo also shared his tumultuous journey from convict to film star with KTTV in Los Angeles, 2013, in a segment filmed in Trejo's home."}, {"text": "==== 2010s: Becoming a lead actor ====Regarding his continued growth as a professional actor, Trejo has remarked, \"I'm so blessed. I'm still scared that somebody's going to wake me up and say, 'Hey, we're still in prison. Let's go to chow’\". Trejo also played 'Machete' in a trailer made for Rodriguez's film collaboration with Quentin Tarantino, Grindhouse. In 2010, he starred as a voice actor in the game Call of Duty: Black Ops for the downloadable content, Call of The Dead. He also starred in a full theatrical release of the film Machete, in 2010, based on the character Isador \"Machete\" Cortez and again in 2013 for the sequel film, Machete Kills. "}, {"text": "==== 2010s: Becoming a lead actor ====In 2011, he appeared in the action film Recoil as Drayke Selgado, with WWE wrestler and actor Steve Austin and played the role of the Ripper in Cross."}, {"text": "==== 2010s: Becoming a lead actor ====In 2012, Trejo starred alongside Ron Perlman and Charles S. Dutton in the Craig Moss action film Bad Ass. He played the main character of Vietnam veteran Frank Vega, based on 67-year-old \"Epic Beard Man\" Thomas Bruso. That same year, Trejo appeared again with Ron Perlman, in a supporting role as Romero 'Romeo' Parada on season four of the FX television drama Sons of Anarchy."}, {"text": "==== 2010s: Becoming a lead actor ====In 2014, Trejo produced his first film, titled Ambition, and produced his second film, the action film Bad Asses."}, {"text": "==== 2010s: Becoming a lead actor ====In 2015, Trejo appeared in a television commercial for Snickers that aired during Super Bowl XLIX, in which he portrayed Marcia Brady prior to eating the Snickers candy bar. In 2016 and 2017, he appeared as himself in transparent disguises in TV ads for Sling TV."}, {"text": "==== 2010s: Becoming a lead actor ====In 2017, Trejo played the role of 'Muerte' in Cross Wars and the 2019 film Cross: Rise of the Villains respectively."}, {"text": "==== 2010s: Becoming a lead actor ====Trejo appeared on Hell's Kitchen as a guest diner in Season 16's final dinner service and as a guest judge in the 21st season Hell's Kitchen: Battle of the Ages."}, {"text": "==== 2010s: Becoming a lead actor ====On August 6, 2017, Trejo made a guest appearance on season three of the Rick and Morty animated TV show, on the episode \"Pickle Rick\", in which he voiced the part of Mr. Jaguar. Together with Sasha Grey, he was a lead actor in Snapshot (2017), directed by Frankie Latina. That same year, he also appeared in Brooklyn Nine Nine as Detective Rosa Diaz's father in an episode centered around Diaz's struggle to come out to her family.In the TV show The Flash, he appeared in the episode Elongated Journey Into Night as the father of Cisco's love interest, Gypsy. His character works as a breacher (an interdimensional bounty hunter) who can manipulate the space-time fabric and travel to parallel worlds."}, {"text": "==== 2010s: Becoming a lead actor ====Since 2018 he has voiced the role of Vasquez the bodyguard on the Disney show Big City Greens."}, {"text": "==== 2010s: Becoming a lead actor ====In 2019, Trejo played the roles of Jose in Wish Man, Eduardo Hernandez in Grand-Daddy Day Care, Miguel in The Short History of the Long Road, Carlos in The Outsider, himself in Madness in the Method, Grave-digger in Bullets of Justice, Rondo in 3 From Hell and himself in Slayer: The Repent less Killogy."}, {"text": "==== 2010s: Becoming a lead actor ====Also in 2019, Trejo had a supporting role in the film Acceleration, as Santos. Trejo also voiced the role of Clint Beltran in the Family Guy episode \"Shanksgiving\"."}, {"text": "==== 2020s: Present ====In 2021, Trejo competed in season five of The Masked Singer as \"Raccoon\" and was eliminated in his second appearance. Trejo later mentioned in the interview that he \"couldn't stop laughing\" after the panel had thought that \"Raccoon\" was originally portrayed by Danny DeVito.That same year, he appeared in season six of Running Wild with Bear Grylls on the episode \"Danny Trejo in the Moab Desert\" and portrayed one of the many forms of Mr. World in the first two episodes of the third and final season of American Gods. In 2021, Trejo portrayed the Ghost of Huet in the Disney+ puppet comedy Halloween special Muppets Haunted Mansion.In 2022, Trejo made his official Star Wars debut in the Disney+ space Western television series The Book of Boba Fett as a Rancor keeper on the episode \"Chapter 3: The Streets of Mos Espa\"."}, {"text": "=== Games ===In 2004, Trejo made an appearance in the videogame Def Jam: Fight for NY, playing one of the villains, an enforcer for Snoop Dogg's character. Trejo's character is named after him and uses the street fighting style and was a Featured fighter and a Playable character."}, {"text": "=== Games ===In 2006, Trejo reprised the role in the PSP videogame which was entitled Def Jam Fight for NY: The Takeover."}, {"text": "=== Games ===Trejo lent his voice to Grand Theft Auto: Vice City and Grand Theft Auto: Vice City Stories for the character Umberto Robina, who also resembles Trejo. He also voiced Raul Alfonso Tejada, a Ghoul, in Fallout: New Vegas."}, {"text": "=== Games ===Trejo appeared in the PlayStation Move game The Fight: Lights Out as Duke the instructor for the player's character. He appeared as himself in the second map pack installation for Call of Duty: Black Ops (2010), the \"Escalation\" map pack, on the zombie map \"Call of the Dead\"."}, {"text": "=== Games ===His voice and appearance is in the game Guns of Boom. He can only be seen in the introduction of the game Greg Hastings Tournament Paintball MAX'D (\"Play for Real\", B-Real & DJ Lethal). In 2019, he was added as a playable character to the battle royale mode of Call of Duty: Black Ops 4."}, {"text": "=== Games ===In 2019, he participated in promotions for Magic: The Gathering Arena, along with Sean Plott.In 2021, Trejo made a guest appearance in the DLC expansion game Far Cry 6: Danny and Dani vs. Everybody.In 2022, Trejo also made a guest appearance in the 2D-platforming skateboarding game Olli Olli World, appearing in the fictional Radlandia."}, {"text": "=== Games ===He also appears as Machete in the 3rd DLC for the game Scum.In 2023, Trejo was revealed as a celebrity star in Like a Dragon: Infinite Wealth where he voices the Hawaiian mob boss Dwight Méndez."}, {"text": "=== Music videos ===Trejo has made a number of cameo appearances in various music videos throughout his career; these include Kid Frost - “La Familia”, Sepultura - “Attitude”, Jay Chou's short film-music video “Double Blade”, Mobb Deep - “Got It Twisted”, Rehab - “Bartender Song (Sittin’ at a Bar)”, Enrique Inglesias - “Loco”, Tyga - “MAMACITA ft. YG, Sanata”, YG - “I Dance ft. Duki, Cuco” and ROSALÍA - “LA FAMA ft. The Weeknd”."}, {"text": "=== Music videos ===He also appeared in adult entertainer Lupe Fuentes's music video \"We Are the Party\" with her band, The Ex-Girlfriends. In 2014, he featured as the character Machete in the official music video for Train's \"Angel In Blue Jeans\". In 2015, Trejo appeared in the music videos \"Repentless\" and \"Pride in Prejudice\" from Slayer's album Repentless.Plastilina Mosh, a Mexican alternative rock band, paid tribute to him with their song \"Danny Trejo\", featured in their album All U Need Is Mosh."}, {"text": "=== Literature ===Trejo is mentioned in Charlie Higson's novel, The Fear.Trejo was a contributor to the book Prison Ramen: Recipes and Stories from Behind Bars. He's also mentioned in Edward Bunker's prison autobiography Education of a Felon (titled Mr. Blue in England), calling him the Rona Barrett of San Quentin because Danny knew all the gossip."}, {"text": "=== Literature ===In 2020, he published a cookbook titled Trejo's Tacos: Recipes and Stories from L.A., sharing recipes and stories from his life.In 2021, Trejo published his memoir Trejo: My Life of Crime, Redemption, and Hollywood, co-written with his longtime friend Donal Logue. The book debuted at number four on The New York Times nonfiction best-seller list for the week ending July 10, 2021."}, {"text": "=== Restaurants ===Over the years, Trejo has opened a series of successful Los Angeles restaurants. In January 2016, these included a taco restaurant on La Brea Avenue in Los Angeles; his own brands of beer, coffee, and various merchandise; with ice cream sandwiches under development. His first was Trejo's Tacos, followed by Trejo's Cantina and Trejo's Coffee and Donuts. Trejo's Donuts is located on the northeast corner of Santa Monica Blvd and Highland Avenue. As of 2020, he is the owner of eight restaurants.In 2017, the rainbow cauliflower tacos made the Los Angeles Times's list of 10 most favorite recipes of 2017. The restaurants are overseen by executive chef Mason Royal. As of 2018, their most recent venture would be an expansion of a donut food truck in Las Vegas, Nevada."}, {"text": "=== Martial arts ===In 2019, Trejo became ring announcer for the full contact karate league Karate Combat in the season Karate Combat: Hollywood. Following this he received a karate lesson from Karate Combat sensei and former UFC champion Georges St-Pierre."}, {"text": "== Personal life ==Trejo has been married and divorced four times and has three children.In 1962, following his release from Youth Training School, reputedly one of California's most notorious juvenile prisons, he met his first wife, Laura. Her parents did not approve of their relationship, and they were married in the backyard of Trejo's family home. Trejo believes his drug use and criminal lifestyle contributed to their marriage's demise; Laura filed for divorce during his second confinement at Youth Training School.He was married to Debbie from 1971 to 1975, and to Joanne from 1975 to 1978.Trejo has three children: Danny (b. 1981), actor and director Gilbert (b. 1988), and actress Danielle (b. 1990). His eldest child, nicknamed \"Danny Boy\", is from a relationship with Diana Walton; they were together from 1978 to 1983. His latter two children are from a relationship with Maeve Crommie. They were together from 1986 to 1997, and he has also helped her raise her two sons from a subsequent relationship."}, {"text": "== Personal life ==In 1997, he married Debbie Shreve; they separated in 2005 and he filed for divorce in 2009.Trejo is a Democrat. His second cousin is filmmaker Robert Rodriguez, though the two were unaware they were related until the filming of Desperado.Trejo battled liver cancer in 2010. In 2011, he moved to the San Fernando Valley to be closer to his mother after she sustained a knee injury; she died in 2013. Prior to this, he lived in Venice, a neighborhood of Los Angeles, California. In August 2019, he witnessed a car colliding with an SUV at an intersection and helped extract a five-year-old trapped in a child safety seat inside the overturned SUV. In reference to the incident, he was quoted saying: \"Everything good that has happened to me has happened as a direct result of helping someone else. Everything.\"Trejo is characterized in his acting roles by his distinctive appearance; in addition to his heavily lined face, scarred from cystic acne and boxing brawls, and the long hair often in a ponytail and full mustache that he usually sports, he also displays, for many roles, a large tattoo on his chest (depicting a woman – a Charra wearing a sombrero).Trejo is a passionate fan of the Los Angeles Rams dating back well into their original tenure in Los Angeles. Trejo claims that as a child he used to sneak through the security fences at the LA Coliseum to watch Rams games. He frequently attends games and the team's training camps.During the filming of Blood In, Blood Out at San Quentin, Trejo met Mario Castillo, a prisoner in the midst of drug addiction. Trejo helped him overcome his addiction, and they became good friends upon Castillo's release from prison. They have since spoken together at both juvenile detention centers and recovery centers across California."}, {"text": "== See also ==Danny Trejo filmography"}, {"text": "== See also ==History of Mexican Americans in Los Angeles"}, {"text": "== Further reading ==Trejo, Danny. (2020) Trejo's Tacos: Recipes and Stories from L.A.. United States: Crown Publishing Group. ISBN 9781984826855."}, {"text": "== Further reading ==Trejo, Danny and Logue, Donal. (2021) Trejo: My Life of Crime, Redemption, and Hollywood. United Kingdom: John Blake Publishing. ISBN 9781789465426."}, {"text": "== External links ==Danny Trejo at IMDb"}]