[{"text": "David Van Cortlandt Crosby (August 14, 1941 – January 18, 2023) was an American singer, songwriter, and guitarist. He first found fame as a member of the Byrds, with whom he helped pioneer the genres of folk rock and psychedelia in the mid-1960s, and later as part of the supergroup Crosby, Stills & Nash, who helped popularize the California sound of the 1970s. In addition to his music, Crosby was known for his outspoken personality, politics, and personal troubles; he was sometimes depicted as emblematic of the counterculture of the 1960s.After a short time performing in the folk music scene, Crosby co-founded the Byrds in 1964. They scored their first number-one hit in 1965 with a cover of Bob Dylan's \"Mr. Tambourine Man\". Crosby appeared on the Byrds' first five albums and the original lineup's 1973 reunion album. In 1968, he formed Crosby, Stills & Nash (CSN) with Stephen Stills and Graham Nash. After the release of their debut album, CSN won the Grammy Award for Best New Artist of 1969. The group later occasionally included Neil Young. The core trio of CSN remained active from 1976 until 2016, and the duo of Crosby & Nash also recorded three gold albums in the 1970s. Crosby, Stills, Nash & Young (CSNY) reunions were held in each decade from the 1970s through the 2000s."}, {"text": "Crosby released eight solo albums, albeit sporadically, over the course of his career. His solo debut was 1971's If I Could Only Remember My Name. The last five of his solo albums, beginning with Croz (2014), came in the last decade of his life. Additionally, he formed a jazz-influenced trio with his son James Raymond and guitarist Jeff Pevar in CPR. He also appeared frequently on recordings by other artists, including Joni Mitchell, Jefferson Airplane, Jackson Browne, James Taylor, Elton John and David Gilmour."}, {"text": "Crosby's combined work with the Byrds and CSNY has sold over 35 million albums. He was inducted into the Rock and Roll Hall of Fame twice: once for his work in the Byrds and again for his work with CSN. Five albums to which he contributed are included in Rolling Stone's list of \"The 500 Greatest Albums of All Time\", three with the Byrds and two with CSN(Y)."}, {"text": "He was also an occasional actor, appearing as a member of Captain Hook's pirate crew in Hook (1991)."}, {"text": "== Early years ==David Van Cortlandt Crosby was born on August 14, 1941, in Los Angeles, California, the second son of Academy Award-winning cinematographer Floyd Crosby, who formerly worked on Wall Street, and Aliph Van Cortlandt Whitehead, a salesperson at Macy's department store. His father was a relative of the Van Rensselaer family, and his mother—granddaughter of Bishop of Pittsburgh Cortlandt Whitehead—descended from the prominent Van Cortlandt family; they \"regularly inhabited the New York society pages before their wedding\".Crosby’s older brother was musician Ethan Crosby. His brother inspired his early love of jazz, particularly John Coltrane and Miles Davis; the latter would later recommend that Columbia Records sign the Byrds, and then cover the Crosby composition \"Guinnevere.\" Their parents divorced in 1960, and his father then married Betty Cormack Andrews.Growing up in California, he attended several schools, including the University Elementary School in Los Angeles, the Crane Country Day School in Montecito, and Laguna Blanca School in Santa Barbara for the rest of his elementary school and junior high years. At Crane, he starred in H.M.S. Pinafore and other musicals but he flunked out. Crosby finished high school via correspondence courses from the Cate School in Carpinteria. He briefly attended Carpinteria Union High School in 1958. Ethan ('Chip') had been at CUHS before David. At CUHS David was given the lead in the Junior Class Play."}, {"text": "=== The Byrds ===Crosby briefly studied drama at Santa Barbara City College before dropping out to pursue a career in music. He performed with singer Terry Callier in Chicago and Greenwich Village, but the duo failed to obtain a recording contract. He also performed with Les Baxter's Balladeers in 1964/1965 and published four singles in 1965, including a cover of the Beatles's song, Michelle. With the help of producer Jim Dickson, Crosby recorded his first solo session in 1963, with a cover of a song by Ray Charles. Miriam Makeba was on tour and in Chicago at the time with her band, which included Jim McGuinn, a multi-instrumentalist who later dropped his first name and began to go by his middle name, Roger McGuinn. Callier introduced Crosby to McGuinn  and Gene Clark, who were then performing by the name the Jet Set. Crosby joined them, and they were augmented by drummer Michael Clarke, at which point Crosby attempted, unsuccessfully, to play bass. Late in 1964, Chris Hillman joined the band as bassist, and Crosby relieved Gene Clark of rhythm guitar duties."}, {"text": "=== The Byrds ===Through connections that Jim Dickson (The Byrds' manager) had with Bob Dylan's music publisher, the band obtained a demo acetate disc of Dylan's \"Mr. Tambourine Man\" and recorded a version of the song, featuring McGuinn's twelve-string guitar as well as McGuinn, Crosby, and Clark's vocal harmonies. The song was a massive hit, reaching No. 1 in the charts in the United States and the United Kingdom during 1965. While McGuinn originated the Byrds' trademark 12-string guitar sound, Crosby was responsible for the soaring harmonies and often unusual phrasing of their songs. While he did not sing lead vocals on either of the first two albums, he sang lead on the bridge in their second single \"All I Really Want to Do\".In 1966, Clark, who then was the band's primary songwriter, left the group because of stress and this placed all the group's songwriting responsibilities in the hands of McGuinn, Crosby, and Hillman. Crosby took the opportunity to hone his craft and soon became a relatively prolific songwriter, collaborating with McGuinn on the up-tempo \"I See You\" (covered by Yes on their 1969 debut) and penning the ruminative \"What's Happening\". His early Byrds efforts also included the 1966 hit \"Eight Miles High\" (to which he contributed one line, according to Clark, while Clark and McGuinn wrote the rest), and its flip side \"Why\", co-written with McGuinn.Because Crosby felt responsible for and was widely credited with popularizing the song \"Hey Joe\", he persuaded the other members of the Byrds to record it on Fifth Dimension.  By Younger Than Yesterday, the Byrds' 1967 album, Crosby began to find his trademark style on songs such as \"Renaissance Fair\" (co-written with McGuinn), \"Mind Gardens\", and \"It Happens Each Day\"; however, the latter song was omitted from the final album and ultimately restored as a bonus track on the 1996 remastered edition. The album also contained a rerecording of \"Why\" and \"Everybody's Been Burned\", a jazzy torch song from Crosby's pre-Byrds repertoire that was initially demoed in 1963.Friction between Crosby and the other Byrds came to a head in early to mid-1967. Tensions were high after the Monterey International Pop Festival in June when Crosby's onstage political diatribes and support of various John F. Kennedy assassination conspiracy theories between songs outraged McGuinn. He further annoyed his bandmates when, at the invitation of Stephen Stills, he sat in with Buffalo Springfield's set the following night, after Young had quit the band and was replaced by guitarist Doug Hastings. The internal conflict boiled over during the initial recording sessions for The Notorious Byrd Brothers (1968) that summer, where differences over song selections led to intra-band arguments. In particular, Crosby was adamant that the band should record only original material despite the recent commercial failure of \"Lady Friend\", a Crosby-penned single that stalled at No. 82 on the American charts following its release. McGuinn and Hillman dismissed Crosby in October after he refused to countenance the recording of a cover of Goffin and King's \"Goin' Back\". While Crosby contributed to three compositions and five recordings on the final album, his controversial ménage à trois ode \"Triad\" was omitted. Jefferson Airplane released a Grace Slick-sung cover on Crown of Creation (1968), and three years later, Crosby released a solo acoustic version on Crosby, Stills, Nash & Young's double live album 4 Way Street (1971). The Byrds' version appeared decades later on the 1987 Never Before release and later on the 1997 re-release of The Notorious Byrd Brothers.In 1973, Crosby reunited with the original Byrds for the album Byrds, with Crosby acting as the album's producer. The album charted well (at No. 20, their best album showing since their second album) but was generally not perceived to be a critical success. It marked the final artistic collaboration of the original band."}, {"text": "=== Crosby, Stills, Nash & Young ===Around the time of Crosby's departure from the Byrds in 1968, he met Stephen Stills at Laurel Canyon in California through Cass Elliot (of the Mamas & the Papas), and the two started meeting informally and jamming together. They were soon joined by Graham Nash, who would leave his commercially successful group the Hollies to play with Crosby and Stills. Their appearance at the Woodstock Music and Art Fair in August 1969 constituted only their second live performance.Their first album, Crosby, Stills & Nash (1969), was an immediate hit, spawning two Top 40 hit singles and receiving key airplay on the new FM radio format, in its early days populated by unfettered disc jockeys who then had the option of playing entire albums at once.The songs Crosby wrote while in CSN include \"Guinnevere\", \"Almost Cut My Hair\", \"Long Time Gone\", and \"Delta\". He also co-wrote \"Wooden Ships\" with Paul Kantner of Jefferson Airplane and Stills."}, {"text": "=== Crosby, Stills, Nash & Young ===In 1969, Neil Young joined the group, and with him, they recorded the album Déjà Vu, which peaked at No. 1 on the Billboard 200 and the ARIA Charts. On September 30, 1969, Crosby's longtime girlfriend Christine Hinton was killed in a car accident only days after Hinton, Crosby, and Debbie Donovan moved from Los Angeles to the San Francisco Bay Area. Crosby was devastated, and he began abusing drugs more severely than he had before. Nevertheless, he still managed to contribute \"Almost Cut My Hair\" and the album's title track. After the release of the double live album 4 Way Street, the group went on a four-year hiatus to focus on their respective solo careers.In December 1969, Crosby appeared with CSNY at the Altamont Free Concert, increasing his visibility after also having performed at the Monterey International Pop Festival and Woodstock. At the beginning of 1970, he briefly joined with Jerry Garcia, Phil Lesh, and Mickey Hart from Grateful Dead, billed as \"David and the Dorks\", and making a live recording at The Matrix on December 15, 1970."}, {"text": "=== Crosby, Stills, Nash & Young ===CSNY reunited in the summer of 1973 for unsuccessful recording sessions in Maui and Los Angeles. Despite lingering acrimony, they reconvened at a Stills concert at the Winterland Ballroom in San Francisco in October. This served as a prelude to their highly successful stadium tour in the summer of 1974. Following the tour, the foursome attempted once again to record a new album, provisionally entitled Human Highway. The recording sessions, which took place at the Record Plant in Sausalito, were very unpleasant, marked by constant bickering. The acrimonious atmosphere was too much for Neil Young, who deserted the sessions and the album was never completed.In rehearsals for the 1974 tour, CSNY recorded a then-unreleased Crosby song, \"Little Blind Fish\". A different version of the song would appear on the second CPR album more than two decades later. The 1974 tour was also affected by bickering, though they managed to finish it without interruption. A greatest hits compilation entitled So Far was released in 1974 to capitalize on the foursome's reunion tour.In 1976, as separate duos, Crosby & Nash and Stills & Young were both working on respective albums and contemplated retooling their work to produce a CSNY album. This attempt ended bitterly as Stills and Young deleted Crosby and Nash's vocals from their album Long May You Run.CSNY did not perform together again as a foursome until Live Aid in Philadelphia in 1985, and then performed only sporadically in the 1980s and 1990s (mainly at the annual Bridge School Benefit organized by Young's wife Pegi). Without Young, however, Crosby, Stills & Nash performed much more consistently after its reformation in 1977. The trio toured in support of their 1977 and 1982 albums CSN and Daylight Again and then, starting in the late 1980s, toured regularly year after year. The group continued to perform live, and since 1982 released four albums of new material: American Dream (1988, with Young), Live It Up (1990), After the Storm (1994), and Looking Forward (1999, with Young). In addition, Crosby & Nash released the self-titled album Crosby & Nash in 2004."}, {"text": "=== Crosby, Stills, Nash & Young ===Full-scale CSNY tours took place in 2000, 2002, and 2006."}, {"text": "=== Crosby, Stills, Nash & Young ===Crosby, Stills, and Nash appeared together on a 2008 episode of The Colbert Report, with Colbert filling in for Young in the fourth harmony part on \"Teach Your Children\".Following a November 2015 interview in which he stated he still hoped the band had a future, Nash announced on March 6, 2016, that Crosby, Stills & Nash would never perform again because of his poor relationship with Crosby."}, {"text": "=== 1971–2022: Solo career and Crosby & Nash ===In 1971, Crosby released his first solo album, If I Could Only Remember My Name, featuring contributions by Nash, Young, Joni Mitchell, and members of Jefferson Airplane, the Grateful Dead, and Santana. Panned on release by Rolling Stone magazine, it has been reappraised amid the emergence of the freak folk and New Weird America movements and remains in print. In a 2010 list of the Best Albums published by the Vatican City newspaper, L'Osservatore Romano, If I Could Only Remember My Name came in second to the Beatles' Revolver."}, {"text": "=== 1971–2022: Solo career and Crosby & Nash ===As a duo, Crosby & Nash (C&N) released four studio albums and two live albums, including Another Stoney Evening, which features the duo in a 1971 acoustic performance with no supporting band. Crosby songs recorded by C&N in the 1970s include \"Whole Cloth\", \"Where Will I Be?\", \"Page 43\", \"Games\", \"The Wall Song\", \"Carry Me\", \"Bittersweet\", \"Naked in the Rain\" (co-written with Nash), \"Low Down Payment\", \"Homeward Through the Haze\", \"Time After Time\", \"Dancer\", \"Taken at All\" (also co-written with Nash), and \"Foolish Man\". During the mid-1970s, Crosby and Nash enjoyed  careers as session musicians, contributing harmonies and background vocals to albums by Joni Mitchell, Jackson Browne (whom Crosby had initially championed as an emerging songwriter), Dave Mason, Rick Roberts, James Taylor (most notably \"Lighthouse\" and \"Mexico\"), Art Garfunkel, Carole King, Elton John, J.D. Souther, and Gary Wright."}, {"text": "=== 1971–2022: Solo career and Crosby & Nash ===Renewing his ties to the San Francisco milieu that had abetted so well on his solo album, Crosby sang backup vocals on several Paul Kantner and Grace Slick albums from 1971 through 1974 and the Hot Tuna album Burgers in 1972. He also participated in composer Ned Lagin's proto-ambient project Seastones along with members of the Grateful Dead and of Jefferson Starship.Crosby worked with Phil Collins occasionally from the late 1980s to the early 1990s. He sang backup to Collins in \"That's Just the Way It Is\" and \"Another Day in Paradise\", and, on his own 1993 song, \"Hero\", from his album Thousand Roads, Collins sang backup. In 1992, Crosby sang backup on the album Rites of Passage with the Indigo Girls on the tracks Galileo and Let it Be Me. In 1999, he appeared on Return of the Grievous Angel: A Tribute to Gram Parsons, singing a duet of the title track with Lucinda Williams.In 2006, Crosby and Nash worked with David Gilmour as backing vocalists on the latter's third solo album, On an Island. The album was released in March 2006 and reached No. 1 on the UK charts. They also performed live with Gilmour in his concert at the Royal Albert Hall in London in May 2006 and toured together in the United States, as can be seen on Gilmour's 2007 DVD Remember That Night. They also sang backup on the title track of John Mayer's 2012 album Born and Raised.In January 2014, Crosby released his first solo album in 20 years, Croz, recorded in close collaboration with his son James Raymond (of the CPR band) at the latter's home studio.On July 14, 2016, Crosby announced a new solo album named Lighthouse, which was released on October 21, 2016, and shared a new track from it titled \"Things We Do for Love\". The album was produced by Michael League of the big band Snarky Puppy, whom he met on Twitter, and also featured contributions by future collaborators Becca Stevens and Michelle Willis. On August 26, 2016, Crosby announced a U.S. tour, an 18-date trek to launch on November 18, 2016, in Atlanta, Georgia, and to conclude on December 16, 2016, in Ithaca, New York. He also spoke out against Donald Trump during the latter's presidential campaign."}, {"text": "=== 1971–2022: Solo career and Crosby & Nash ===In September 2017, Crosby announced a solo album (his third one of original material in four years and his sixth in total) entitled Sky Trails, again with Raymond, to be released on September 29, 2017, on BMG.In April 2018, Crosby appeared on NPR's Live from Here, playing duets with host Chris Thile.On October 26, 2018, Crosby released Here If You Listen on BMG, his first collaborative album with League, Stevens, and Willis, all members of the Lighthouse band. The band also toured from November to December of that same year.Crosby was the subject of the documentary film David Crosby: Remember My Name which premiered at the 2019 Sundance Film Festival. Crosby mentioned that Cameron Crowe, who asked the interview questions for the film, knew \"where the bones are buried.\" Following the premiere of the film, Crosby toured as David Crosby & Friends from May to September 2019.In July 2021, Crosby released what would become his final studio album, For Free. This was followed by the release of the 50th-anniversary expanded version of If I Could Only Remember My Name on October 15. It contains remastered songs as well as demos from the original recording sessions. During promotion for the rerelease, Crosby said that his second collaborative album with League, Stevens, and Willis was in the works. The result, Crosby's final release, was a live album recorded during the band's tour, Live at the Capitol Theatre, released October 4, 2022."}, {"text": "=== 1996–2004: CPR ===In 1996, Crosby formed CPR or Crosby, Pevar & Raymond with session guitarist Jeff Pevar, and pianist James Raymond, Crosby's son. The group released two studio albums and two live albums before disbanding in 2004.The first song that Crosby and Raymond co-wrote, \"Morrison\", was performed live for the first time in January 1997. The song recalled Crosby's feelings about the portrayal of Jim Morrison in the movie The Doors. The success of the 1997 tour spawned a record project, Live at Cuesta College, released in March 1998. There is a second CPR studio record, Just Like Gravity, and another live recording, Live at the Wiltern, recorded at the Wiltern Theatre in Los Angeles, which also features Phil Collins and Graham Nash.After the group split, Raymond continued to perform with Crosby as part of the touring bands for C&N and CSN, as well as on solo Crosby projects, including 2014's Croz and the subsequent tour. Pevar has toured with many artists over his productive career, including CSN, Ray Charles, Rickie Lee Jones, and Marc Cohn. Pevar has a solo record, From the Core, which was improvised and recorded in the Oregon Caves and features the vocalist from Yes, Jon Anderson."}, {"text": "=== 1996–2004: CPR ===Crosby reunited with the other two members of CPR in 2018 as David Crosby & Friends, performing a series of shows in support of Crosby's new album Skytrails. During the global pandemic, Crosby also hosted a podcast for the Osiris music network with his friend, journalist Steve Silberman."}, {"text": "=== Family ===Crosby and Celia Crawford Ferguson had a son, James Raymond, in 1962. James was placed for adoption and later reunited with Crosby as an adult. Beginning in 1997, Raymond performed with Crosby on stage and in the studio, as a member of CPR, and as part of the touring bands Crosby & Nash and Crosby, plus Stills & Nash. Crosby had three other children: daughter Erika, with Jackie Guthrie, daughter Donovan Crosby, with former girlfriend Debbie Donovan, and son Django Crosby, conceived with wife Jan Dance after extensive fertility treatments while Crosby's liver was failing."}, {"text": "=== Family ===Crosby, then 45, married Jan Dance, then 35, in May 1987 at the Hollywood Church of Religious Science in Los Angeles. His bandmate Stephen Stills gave away the bride.Crosby's brother Ethan, who taught him to play guitar and started his musical career with him, killed himself in late 1997 or early 1998; the date is unknown because Ethan left a note not to search for his body but to let him return to the earth. His body was found months later in May 1998."}, {"text": "=== Family ===In January 2000, Melissa Etheridge announced that Crosby was the biological father of two children with her partner Julie Cypher by means of artificial insemination. On May 13, 2020, Etheridge announced on her Twitter account that her and Cypher's son Beckett had died of causes related to opioid addiction at the age of 21."}, {"text": "=== Cannabis brand ===Crosby, in partnership with longtime friend and entrepreneur Steven Sponder, developed a craft cannabis brand called \"MIGHTY CROZ\". Crosby, a 50-plus-year cannabis advocate and connoisseur, credited cannabis with contributing to his creative process of songwriting stating, \"All those hit songs, every one of them, I wrote them all on cannabis.\" Crosby also credited cannabis and cannabidiol (CBD) with alleviating his chronic shoulder pain, allowing him to continue touring and making new music well into his seventies. Crosby and Sponder intended to work with licensed cultivators throughout the U.S. and beyond and to also extend the brand to include CBD and hemp products. In 2018, Crosby was invited to join the National Organization for the Reform of Marijuana Laws (NORML) advisory board."}, {"text": "=== Sailing ===Having had a transformative sailing experience when he was eleven, in 1967 Crosby purchased a 59-foot, John Alden–designed schooner named Mayan with his Byrds settlement. On Twitter in 2019, Crosby said that the late Peter Tork of the Monkees loaned him the money to buy the Mayan. In the decades before he sold the boat in 2014, Crosby sailed it thousands of miles in the Pacific and Caribbean. He credited the Mayan as being a songwriting muse; he wrote some of his best-known songs aboard the boat, including \"Wooden Ships,\" \"The Lee Shore,\" \"Page 43,\" and \"Carry Me.\""}, {"text": "=== Politics ===Crosby was politically active throughout his professional career. He publicly questioned the report of the Warren Commission covering the assassination of John F. Kennedy onstage during the Byrds's appearance at the Monterey Festival in 1967, to the anger of his bandmates. He identified as a pacifist and was a well-known opponent of U.S. participation in the Vietnam War, although he defended the right to own guns.Crosby strongly criticized the presidency of Donald Trump, declaring him to be \"a dangerous guy who's got a big ego\". For the 2020 presidential election, he said in an interview that Mayor Pete Buttigieg was his favorite candidate for president and was smarter than all the others combined; however, he eventually voted for Bernie Sanders.Although Crosby was against Joe Biden's candidacy during the 2020 presidential primaries, he voiced a more positive assessment following Biden's general election victory in November. Describing him as a \"decent guy\", Crosby noted that the personal tragedies Biden experienced with the deaths of his first wife and daughter in 1972 and his oldest son, Beau, in 2015, made him a better human being. \"He has humanity and he has compassion for other human beings because he's seen a lot of rough stuff himself. I don't generally trust most politicians but I trust [Biden] to be who he is and I think he's going to do a good job.\" In May 2022, Crosby wrote in response to a pro-union tweet from Biden that \"most Unions are useless and totally dishonest.\""}, {"text": "=== Acting career ===During the early 1990s, Crosby appeared as a guest star in several episodes of The John Larroquette Show, where he played the part of Larroquette's Alcoholics Anonymous (AA) sponsor. He appeared on a TV episode of Roseanne as the singer–husband of one of Roseanne's co-workers, who was played by Bonnie Bramlett. He sang the Danny Sheridan composition \"Roll On Down\" on that episode. He was on an episode of Ellen called \"Ellen Unplugged\", in which he was helping out at the Rock and Roll Fantasy Camp. He also appeared as a pirate in the 1991 film Hook, as a 1970s hippie in the 1991 film Backdraft, and as a bartender in the 1992 film Thunderheart. Crosby also voiced himself on two episodes of The Simpsons, \"Marge in Chains\" and \"Homer's Barbershop Quartet\"."}, {"text": "=== Drug, alcohol, and arrests ===Crosby spent nine months in a Texas state prison after being convicted of several drugs and weapons offenses in 1985. The drug charges were related to possession of heroin and cocaine.Later in 1985, Crosby was arrested in California for drunken driving, a hit-and-run driving accident, and possession of a concealed pistol and drug paraphernalia. He was arrested after driving into a fence in a Marin County suburb, where officers found a .45-caliber pistol and cocaine in his car.On March 7, 2004, Crosby was charged with criminal possession of a weapon in the third degree, illegal possession of a hunting knife, illegal possession of ammunition, and illegal possession of about one ounce of marijuana. He left the items behind in his New York City hotel room. Authorities said a \"hotel employee searched the suitcase for identification and found about an ounce of marijuana, rolling papers, two knives, and a .45-caliber pistol. Mr. Crosby was arrested when he returned to the hotel to pick up his bag.\" After spending 12 hours in jail, he was released on $3,500 bail. Crosby pleaded guilty in New York State Supreme Court to attempted criminal possession of a weapon on July 4, 2004; he was fined $5,000 and received no jail time. Prosecutors did not seek a more severe penalty on the weapons charge because the pistol was registered in California and was stowed safely in his luggage when it was found. A charge of unlawful possession of marijuana was dismissed. Crosby was discharged by the court on condition that he pay his fine and not get arrested again."}, {"text": "=== Health issues and death ===Crosby was the recipient of a highly publicized liver"}, {"text": "=== Health issues and death === transplant, paid for by Phil Collins, in 1994. News of his transplant led to public discussions because of his celebrity status and his previous problems with alcoholism and drug use. Crosby's liver problems stemmed from a long run with hepatitis C.Crosby suffered from type 2 diabetes. During an October 2008 concert, Crosby, looking much thinner than in previous years, announced to the audience that he had recently shed 55 pounds (25 kilograms) as a result of his struggles with the disease.In February 2014, at the urging of his doctor, Crosby postponed the final dates of his solo tour to undergo a cardiac catheterization and angiogram, based on the results of a routine cardiac stress test.Crosby died in Santa Ynez, California, on January 18, 2023, at the age of 81. Believing he was \"probably going to die fairly soon\", Crosby had planned his funeral at least three years prior to his death, to be held at his horse ranch in Santa Ynez, in hopes that he would be reconciled with his former Byrds and CSN bandmates so that they would attend. A statement from his family said that he died \"after a long illness\". However, friends and colleagues described his death as \"sudden\", saying that Crosby had remained active until the day of his death, working on plans for a tour and a new album. Rumors circulated that his death was due to complications of COVID-19."}, {"text": "=== Health issues and death ===On January 23, Stephen Stills’s ex-wife Véronique Sanson appeared on French television and stated that Crosby had died in his sleep from complications of COVID-19. \"He was on his fifth day, went to take a nap, and never woke up again.\" Her son Chris Stills was due to undertake a tour with Crosby in February."}, {"text": "== Discography ==See also discographies for Crosby Stills Nash & Young, the Byrds, Crosby & Nash, and CPR."}, {"text": "=== Les Baxter's Balladeers ===Singles1965 : Go Tell It On The Mountains/How Shall I Send Thee/Carol Of The Bells/Joy To The World – maxi single, four songs"}, {"text": "=== Les Baxter's Balladeers ===1965 : Linin' Track / Baiion"}, {"text": "=== Les Baxter's Balladeers ===1965 : Sail Away Ladies / Que Bonita Bandera"}, {"text": "=== Les Baxter's Balladeers ===1965 : Michelle / Little Girl Lonely"}, {"text": "=== Other appearances ===Joni Mitchell: Song to a Seagull - Production (1968), Court and Spark - Backing vocals (1974), The Hissing of Summer Lawns  - Vocals (1975)"}, {"text": "=== Other appearances ===Jefferson Airplane: Crown of Creation (1968), Volunteers (1969), Blows Against the Empire (1970)"}, {"text": "=== Other appearances ===Neil Young: Harvest (1972), Time Fades Away (1973),On the Beach (1974),  Tonight's the Night (1975)"}, {"text": "=== Other appearances ===Stephen Stills: Stephen Stills (1970), Stephen Stills 2 (1971), Stills (1975), Still Stills: The Best of Stephen Stills (1976), Carry On (2013)"}, {"text": "=== Other appearances ===Graham Nash: Songs for Beginners (1971), Wild Tales (1974), Earth & Sky (1980), Songs for Survivors (2002), Reflections (2009), Over the Years (2018)"}, {"text": "=== Other appearances ===Judee Sill: Judee Sill (1971)"}, {"text": "=== Other appearances ===Paul Kantner/Grace Slick: Sunfighter (1971), Baron von Tollbooth & the Chrome Nun (1973)"}, {"text": "=== Other appearances ===Hot Tuna: Burgers - vocals on Highway Song (1972), Flight Log - vocals, guitar (1977)"}, {"text": "=== Other appearances ===Rick Roberts: Windmills - backing vocals (1972)"}, {"text": "=== Other appearances ===Jackson Browne: Jackson Browne (1972), For Everyman (1973), Late for the Sky  (1974), The Pretender (1976), World in Motion (1989), I'm Alive (1991) , Looking East (1996)"}, {"text": "=== Other appearances ===Grace Slick: Manhole (1974)"}, {"text": "=== Other appearances ===Ned Lagin: Seastones - David 12-string electric guitar, vocals (1975)"}, {"text": "=== Other appearances ===Dave Mason: Split Coconut - Vocals, backing vocals (1975)"}, {"text": "=== Other appearances ===James Taylor: Gorilla (1975), In the Pocket (1976), The Best of James Taylor (2003)"}, {"text": "=== Other appearances ===Art Garfunkel: Breakaway (1975), Watermark (1977)"}, {"text": "=== Other appearances ===J. D. Souther: Black Rose - Vocals, backing vocals (1976)"}, {"text": "=== Other appearances ===Carole King: Thoroughbred (1976), In Concert (1994)"}, {"text": "=== Other appearances ===Phil Collins: …But Seriously (1989)"}, {"text": "=== Other appearances ===Elton John: Blue Moves (1976)"}, {"text": "=== Other appearances ===Gary Wright: Headin' Home (1979)"}, {"text": "=== Other appearances ===Bonnie Raitt: Nick of Time (1989), Longing in Their Hearts (1994)"}, {"text": "=== Other appearances ===Bob Dylan: Under the Red Sky (1990)"}, {"text": "=== Other appearances ===Dan Fogelberg: The Wild Places (1990)"}, {"text": "=== Other appearances ===Indigo Girls: Rites of Passage (1992)"}, {"text": "=== Other appearances ===Marc Cohn: The Rainy Season (1993)"}, {"text": "=== Other appearances ===Willie Nelson: Across the Borderline (1993)"}, {"text": "=== Other appearances ===Hootie & the Blowfish: Cracked Rear View (1994)"}, {"text": "=== Other appearances ===Kenny Loggins: Return to Pooh Corner (1994)"}, {"text": "=== Other appearances ===Stevie Nicks: Street Angel (1994)"}, {"text": "=== Other appearances ===Various artists: Return of the Grievous Angel: A Tribute to Gram Parsons (1999)"}, {"text": "=== Other appearances ===David Gilmour: On an Island (2006), Remember That Night (2007), Live in Gdańsk DVD (2008) Rattle That Lock (2015)"}, {"text": "=== Other appearances ===Don Felder: Road to Forever (2012)"}, {"text": "=== Other appearances ===John Mayer: Born and Raised (2012)"}, {"text": "=== Other appearances ===Joe Walsh: Analog Man (2012)"}, {"text": "=== Other appearances ===Shawn Colvin: Uncovered (2015)"}, {"text": "=== Other appearances ===Snarky Puppy: Family Dinner – Volume 2 (2016)"}, {"text": "=== Other appearances ===Chris Hillman: Bidin' My Time (2017)"}, {"text": "=== Other appearances ===Jason Isbell: Reunions (2020)"}, {"text": "== Publications ==Crosby, David; David Bender (2000). Stand and Be Counted: A Revealing History of Our Times Through the Eyes of the Artists Who Helped Change Our World. HarperOne."}, {"text": "== Publications ==Crosby, David; Carl Gottlieb (2005). Long Time Gone: The Autobiography of David Crosby. Da Capo Press. ISBN 0-306-81406-4."}, {"text": "== Publications ==Crosby, David; Carl Gottlieb (2007). Since Then: How I Survived Everything and Lived to Tell About It. Berkeley."}, {"text": "== Filmography ==1991 : Hook : A pirate"}, {"text": "== Filmography ==2019 : David Crosby: Remember My Name : Himself"}, {"text": "== See also ==List of celebrities who own cannabis businesses"}, {"text": "== External links ==Official website "}, {"text": "== External links ==David Crosby discography at Discogs "}, {"text": "== External links ==David Crosby at IMDb"}, {"text": "== External links ==Crosby-Nash Archived April 19, 2015, at the Wayback Machine"}, {"text": "== External links ==CSN official site Archived November 11, 2018, at the Wayback Machine"}, {"text": "== External links ==CSNY official site"}, {"text": "== External links ==Appearances on C-SPAN"}, {"text": "== External links ==Hattenstone, Simon (September 2, 2021). \"Interview. David Crosby on love, music and rancour: 'Neil Young is probably the most selfish person I know'\". The Guardian."}]