[{"text": "Donald McNichol Sutherland  (born 17 July 1935) is a Canadian actor whose film career spans over seven decades. He has received numerous accolades, including a Primetime Emmy Award, two Golden Globe Awards, and a Critics Choice Award. He has been cited as one of the best actors never to have received an Academy Award nomination. In 2017, he received an Academy Honorary Award.Sutherland rose to fame after starring in films such as The Dirty Dozen (1967), M*A*S*H (1970), and Kelly's Heroes (1970). He subsequently starred in many films both in leading and supporting roles, including Klute (1971), Don't Look Now (1973), The Day of the Locust (1975), Fellini's Casanova (1976), 1900 (1976), Animal House (1978), Invasion of the Body Snatchers (1978), Ordinary People (1980), Eye of the Needle (1981), A Dry White Season (1989), Backdraft (1991), JFK (1991), Six Degrees of Separation (1993), Without Limits (1998), The Italian Job (2003), and Pride & Prejudice (2005). More recently, Sutherland portrayed President Snow in The Hunger Games franchise."}, {"text": "Sutherland has also received accolades for his television roles. For his portrayal of Colonel Mikhail Fetisov\tin Citizen X (1995) he received the Primetime Emmy Award for Outstanding Supporting Actor in a Limited Series or Movie. He played Adam Czerniaków in Uprising (2001), and Clark Clifford in Path to War (2002) earning the Golden Globe Award for Best Supporting Actor – Series, Miniseries or Television Film."}, {"text": "Sutherland has received various honours including inductions into the Canadian Walk of Fame in 2000 and Hollywood Walk of Fame 2011. He was made an Officer of the Order of Canada (OC) in 1978, a Commandeur of the Ordre des Arts et des Lettres in 2012 and received the Companion of the Order of Canada (CC) in 2019. He is the father of actors Kiefer Sutherland, Rossif Sutherland, and Angus Sutherland. In October 2023, Canada Post issued a stamp in his honour, commemorating his career as one of Canada's most respected and versatile actors."}, {"text": "== Early life and education ==Sutherland was born 17 July 1935 at the Saint John General Hospital in Saint John, New Brunswick, the son of Dorothy Isobel (née McNichol; 1892–1956) and Frederick McLea Sutherland (1894–1983), who worked in sales and ran the local gas, electricity and bus company. He is of Scottish, German and English ancestry. As a child, he had rheumatic fever, hepatitis, and poliomyelitis. Sutherland and his family lived in a farmhouse in Lakeside, New Brunswick, before moving to Bridgewater, Nova Scotia at the age of 12, where he spent his teenage years. He obtained his first part-time job, at the age of 14, as a news correspondent for local radio station CKBW."}, {"text": "== Early life and education ==Sutherland graduated from Bridgewater High School. He then studied at Victoria University, an affiliated college of the University of Toronto, where he met his first wife Lois May Hardwick (not to be confused with the child star Lois Ann Hardwick), and graduated with a double major in engineering and drama. He had at one point been a member of the \"UC Follies\" comedy troupe in Toronto. He changed his mind about becoming an engineer, and left Canada for Britain in 1957, studying at the London Academy of Music and Dramatic Art."}, {"text": "== Career ==After departing the London Academy of Music and Dramatic Art (LAMDA), Sutherland spent a year and a half at the Perth Repertory Theatre in Scotland. In the early-to-mid-1960s, Sutherland began to gain small roles in British films and TV (such as a hotel receptionist in The Sentimental Agent episode \"A Very Desirable Plot\" (1963)). He was featured alongside Christopher Lee in horror films such as Castle of the Living Dead (1964) and Dr. Terror's House of Horrors (1965). He also had a supporting role in the Hammer Films production Die! Die! My Darling! (1965), with Tallulah Bankhead and Stefanie Powers. In the same year, he appeared in the Cold War classic The Bedford Incident and in the TV series Gideon's Way, in the 1966 episode \"The Millionaire's Daughter\". In 1966, Sutherland appeared in the BBC TV play Lee Oswald-Assassin, playing a friend of Lee Harvey Oswald, Charles Givens (even though Givens himself was an African American). He also appeared in the TV series The Saint, in the 1965 episode \"The Happy Suicide\"."}, {"text": "== Career ==In 1967, he appeared in \"The Superlative Seven\", an episode of The Avengers. In 1966 he also made a second, and more substantial appearance in The Saint (S5,E14). The episode, \"Escape Route\", which was directed by the show's star, Roger Moore, who later recalled Sutherland \"asked me if he could show it to some producers as he was up for an important role... they came to view a rough cut and he got The Dirty Dozen.\" The film, which starred Lee Marvin, Charles Bronson, and a number of other popular actors, was the 5th highest-grossing film of 1967 and MGM's highest-grossing movie of the year. In 1968, after the breakthrough in the UK-filmed The Dirty Dozen, Sutherland left London for Hollywood."}, {"text": "== Career == He then appeared in two war films, playing the lead role as \"Hawkeye\" Pierce in Robert Altman's MASH in 1970; and, again in 1970, as hippie tank commander \"Oddball\" in Kelly's Heroes; his health was threatened by spinal meningitis contracted during its filming. Sutherland starred with Gene Wilder in the 1970 comedy Start the Revolution Without Me. During the filming of the Academy Award-winning detective thriller Klute (1971), Sutherland had an intimate relationship with co-star Jane Fonda. Sutherland and Fonda went on to co-produce and star together in the anti–Vietnam War documentary F.T.A. (1972), consisting of a series of sketches performed outside army bases in the Pacific Rim and interviews with American troops who were then on active service. As a follow-up to their appearance in Klute, Sutherland and Fonda performed together in Steelyard Blues (1973), a \"freewheeling, Age-of-Aquarius, romp-and-roll caper\" from the writer David S. Ward.Sutherland found himself as a leading man throughout the 1970s in films such as the Venice-based psychological horror film Don't Look Now (1973), co-starring Julie Christie, a role which saw him nominated for the BAFTA Award for Best Actor, the war film The Eagle Has Landed (1976), Federico Fellini's Casanova (1976) and the thriller Eye of the Needle (which was filmed on location on the Isle of Mull, West Scotland) and as the health inspector in the science fiction/horror film Invasion of the Body Snatchers (1978) alongside Brooke Adams and Jeff Goldblum. He helped launch the internationally popular Canadian television series Witness to Yesterday, with a performance as the Montreal doctor Norman Bethune, a physician and humanitarian, largely talking of Bethune's experiences in revolutionary China. Sutherland also had a role as pot-smoking Professor Dave Jennings in National Lampoon's Animal House in 1978, making himself known to younger fans as a result of the movie's popularity. When cast, he was offered either $40,000 up front or two percent of the movie's gross earnings. Thinking the movie would certainly not be a big success, he chose the upfront payment.  The movie eventually grossed $141.6 million. Also, in 1978 starred in the heist comedy film The First Great Train Robbery, alongside Sean Connery, being a great reception and financial success."}, {"text": "== Career ==He won acclaim for his performance in the Italian director Bernardo Bertolucci's 1976 epic film 1900 and as the conflicted father in the Academy Award-winning family drama Ordinary People (1980), alongside Mary Tyler Moore and Timothy Hutton. In 1981, he narrated A War Story, an Anne Wheeler film. He played the role of physician-hero Norman Bethune in Bethune (1977) and Bethune: The Making of a Hero (1990). In 1983, he co-starred with Teri Garr and Tuesday Weld in an adaptation of John Steinbeck's The Winter of Our Discontent. Some of Sutherland's better known roles in the 1980s and 1990s were in the apartheid drama A Dry White Season (1989), alongside Marlon Brando and Susan Sarandon; as a sadistic warden in Lock Up (1989) with Sylvester Stallone; as an incarcerated pyromaniac in the firefighter thriller Backdraft (1991) alongside Kurt Russell and Robert De Niro, as the humanitarian doctor-activist Norman Bethune in 1990's Bethune: The Making of a Hero, and as a snobbish New York City art dealer in Six Degrees of Separation (1993), with Stockard Channing and Will Smith. "}, {"text": "== Career ==In the 1991 Oliver Stone film JFK, he played a mysterious Washington intelligence officer, reputed to have been L. Fletcher Prouty, who spoke of links to the military–industrial complex in the assassination of US President John F. Kennedy. He played psychiatrist and visionary Wilhelm Reich in the video for Kate Bush's 1985 single, \"Cloudbusting\". In 1992, he played the role of Merrick in the movie Buffy the Vampire Slayer, with Kristy Swanson. In 1994, he played the head of a government agency hunting for aliens who take over people's bodies (a premise similar to Invasion of the Body Snatchers) in the movie of Robert A. Heinlein's 1951 book The Puppet Masters. In 1994, Sutherland played a software company's scheming CEO in Barry Levinson's drama Disclosure opposite Michael Douglas and Demi Moore, in 1994 he played a KGB officer in the video game Conspiracy, and in 1995 was cast as Maj. Gen. Donald McClintock in Wolfgang Petersen's Outbreak. He was later cast in 1996 (for only the second time) with his son Kiefer in Joel Schumacher's A Time to Kill. Sutherland played famous American Civil War General P.G.T. Beauregard in the 1999 film The Hunley."}, {"text": "== Career ==He played an astronaut in Space Cowboys (2000), with co-stars Clint Eastwood, Tommy Lee Jones and James Garner. Sutherland was a model for Chris Claremont and John Byrne to create Donald Pierce, the Marvel Comics character whose last name comes from Sutherland's character in the 1970 film M*A*S*H, Hawkeye Pierce. In more recent years, Sutherland was known for his role as Reverend Monroe in the Civil War drama Cold Mountain (2003), in the drama thriller Baltic Storm (2003), in the remake of The Italian Job (2003), in the TV series Commander in Chief (2005–2006), in the movie Fierce People (2005) with Diane Lane and Anton Yelchin, and as Mr. Bennet in Pride & Prejudice (2005), starring alongside Keira Knightley. He also played a minor role in Mike Binder's Reign Over Me (2007). Sutherland starred as Tripp Darling in the prime time drama series Dirty Sexy Money for ABC. He played multi-millionaire Nigel Honeycut in the 2008 film Fool's Gold. His distinctive voice has also been used in many radio and television commercials, including those for Delta Air Lines, Volvo automobiles, and Simply Orange orange juice."}, {"text": "== Career ==Sutherland provided voice-overs and narration during the intro of the first semifinal of Eurovision Song Contest 2009, and the Opening Ceremony of the 2010 Winter Olympics in Vancouver, and was also one of the Olympic flag bearers. He was also narrator of CTV's \"I Believe\" television ads in the lead up to the Games. During the games, Sutherland attended some of the events. In 2010, he starred alongside an ensemble cast in a TV adaptation of Ken Follett's novel The Pillars of the Earth (2010). "}, {"text": "== Career ==Beginning in 2012, Sutherland portrayed President Snow, the main antagonist of The Hunger Games film franchise, in The Hunger Games (2012), The Hunger Games: Catching Fire (2013), The Hunger Games: Mockingjay – Part 1 (2014), and Part 2 (2015). His role was well received by fans and critics. On 26 March 2012, he was a guest on the Opie and Anthony radio show where he mentioned he had been offered the lead roles in Deliverance and Straw Dogs, although turned down both offers because he did not want to appear in violent films at the time. The role in Deliverance went to Jon Voight and the role in Straw Dogs to Dustin Hoffman, and both films enjoyed critical and box office success. After declining these violent roles, he quipped: \"and then I played a fascist in 1900 by Bernardo Bertolucci.\" The television program Crossing Lines premiered on 23 June 2013, on the US NBC network. Sutherland, who played the Chief Prosecutor for the International Criminal Court named Michel Dorn, was one of only two actors to appear in all episodes across three seasons.In 2016, he was a member of the main competition jury of the 2016 Cannes Film Festival. On 6 September 2017, it was announced Sutherland, along with 3 other recipients, would receive an Honorary Oscar, from the Academy of Motion Picture Arts and Sciences, \"for a lifetime of indelible characters, rendered with unwavering truthfulness.\" This was Sutherland's first Academy Award in six decades. In 2018, Sutherland portrayed oil tycoon J. Paul Getty in the FX historical drama series Trust. In 2020, he appeared in the HBO limited series The Undoing (2020) alongside Hugh Grant and Nicole Kidman. Sutherland plays the role of Mr. Harrigan in the 2022 Netflix film Mr. Harrigan's Phone written and directed by John Lee Hancock, based on the novella of the same name from the book If It Bleeds by Stephen King."}, {"text": "== Personal life ==Sutherland was made an Officer of the Order of Canada on 18 December 1978 and promoted to Companion of the Order of Canada in 2019. He was inducted into Canada's Walk of Fame in 2000. He maintains a home in Georgeville, Quebec.Sutherland has been married three times. His first marriage, to Lois May Hardwick, lasted from 1959 to 1966. His second marriage, which lasted from 1966 to 1970, was to Shirley Douglas, daughter of Canadian social democratic politician and the \"father\" of Canada's universal healthcare system, Tommy Douglas. Sutherland and Douglas have two children, twins Kiefer and Rachel. From 1970 to 1972, he had an affair with married Klute co-star Jane Fonda.Sutherland married French Canadian actress Francine Racette in 1972, after meeting her on the set of the Canadian pioneer drama Alien Thunder. They have three sons – Rossif Sutherland, Angus Redford Sutherland, and Roeg Sutherland – all of whom were named after directors Sutherland has worked with. Kiefer is named after American-born director and writer Warren Kiefer, who, under the assumed name of Lorenzo Sabatini, directed Sutherland in his first feature film, the Italian low-budget horror film Il castello dei morti vivi (Castle of the Living Dead); Roeg is named after director Nicolas Roeg; Rossif is named after French director Frédéric Rossif; and Angus Redford has his middle name after Robert Redford.Sutherland became a blogger for the American news website The Huffington Post during the 2008 United States presidential election campaign. In his blogs, he stated his support for Barack Obama.Documents declassified in 2017 show that Sutherland was on the National Security Agency watchlist between 1971 and 1973 at the request of the Central Intelligence Agency because of his anti-war activities."}, {"text": "=== Film ===Selected credits"}, {"text": "=== Television ===Selected credits"}, {"text": "== Honours ==1978: Officer of the Order of Canada (OC)"}, {"text": "== Honours ==1983: 4th Genie Awards, winner, Best Actor, Threshold"}, {"text": "== Honours ==2000: Canada's Walk of Fame"}, {"text": "== Honours ==2000: Governor General's Performing Arts Award for Lifetime Artistic Achievement"}, {"text": "== Honours ==2005: Honorary Doctor of Arts (Hon DArt) from Middlebury College (Middlebury, Vermont, US)"}, {"text": "== Honours ==2011: Star on the Hollywood Walk of Fame (7024 Hollywood Boulevard, next to his son Kiefer)."}, {"text": "== Honours ==2019: Companion of the Order of Canada (CC)"}, {"text": "== Honours ==2023 (19 Oct): Canada Post commemorative postage stamp"}, {"text": "== External links ==Donald Sutherland at IMDb"}, {"text": "== External links ==Donald Sutherland at Turner Classic Movies"}, {"text": "== External links ==Donald Sutherland at the Internet Broadway Database "}, {"text": "== External links ==Donald Sutherland discography at Discogs"}, {"text": "== External links ==On the Money (Carole Cadwalladr interview), The Guardian, 30 March 2008."}]