[{"text": "Drew Blythe Barrymore (born February 22, 1975) is an American actress, producer, talk show host and author. A member of the Barrymore family of actors, she has received several awards and nominations, including a Golden Globe Award and a Screen Actors Guild Award, in addition to nominations for nine Emmy Awards and a British Academy Film Award. She received a star on the Hollywood Walk of Fame in 2004. She is also the Chief Gifting Officer for Etsy as of January 2024.Barrymore achieved fame as a child actress with her breakout role in E.T. the Extra-Terrestrial. Following a highly publicized childhood marked by drug and alcohol abuse, she released an autobiography Little Girl Lost, which became a New York Times bestseller. She starred in a string of successful films during the 1990s and 2000s, including Charlie's Angels, Poison Ivy, Boys on the Side, Mad Love, Batman Forever, Scream, and Ever After. Barrymore starred with Adam Sandler in the films The Wedding Singer, 50 First Dates, and Blended. Her other films include Firestarter, Donnie Darko, Riding in Cars with Boys, Confessions of a Dangerous Mind, Charlie's Angels: Full Throttle, Fever Pitch, Music and Lyrics, Going the Distance, Big Miracle, and Miss You Already. She also starred in her directorial debut film Whip It. She won a Screen Actors Guild Award and a Golden Globe Award for her role in Grey Gardens. She starred in the Netflix series Santa Clarita Diet and currently hosts her syndicated talk show The Drew Barrymore Show. In September 2023, she announced she would return to the show without writers during the ongoing WGA strike, but after backlash, she reversed the decision the same month.Barrymore is the founder of the production company Flower Films. It produced several projects in which she has starred. She launched a range of cosmetics under the Flower banner in 2013, which has grown to include lines in perfume, hair products and eyewear. Her other business ventures include a range of wines, homeware and clothing. In 2014, Barrymore released the New York Times bestselling photobook Find It in Everything of photographs she had taken over the span of a decade of everyday situations in the shape of a heart, including a discarded straw wrapper, a hole in a T-shirt, and a scallion in a bowl of miso soup. E. P. Dutton published a collection of Barrymore's autobiographical essays in her New York Times bestselling book Wildflower in 2015, for which she also narrated the audiobook version."}, {"text": "=== Ancestry ===Drew Blythe Barrymore was born on February 22, 1975, in Culver City, California, to actor John Drew Barrymore and aspiring actress Jaid Barrymore (born Ildikó Jaid Makó), who was born in a displaced persons camp in Brannenburg, West Germany, to Hungarian World War II refugees. Through her father, Barrymore has three older half-siblings, including actor John Blyth Barrymore. Her parents divorced in 1984.In 2023, Barrymore displayed an AncestryDNA test onscreen on her talk show, which showed that her genetic ancestry is primarily European, with 6% Northern Indian.Barrymore was born into an acting family. All of her paternal great-grandparents, Maurice and Georgie Drew Barrymore, Maurice and Mae Costello (née Altschuk), and her paternal grandparents, John Barrymore and Dolores Costello, were actors, with John being arguably the most acclaimed actor of his generation. Barrymore is a niece of Diana Barrymore, a grandniece of Lionel Barrymore, Ethel Barrymore and Helene Costello, and a great-great-granddaughter of Irish-born John and English-born Louisa Lane Drew, all of whom were also actors. She is a great grandniece of Broadway idol John Drew Jr. and silent film actor, writer and director Sidney Drew.Barrymore's godmothers are actress Sophia Loren and Lee Strasberg's widow, Anna Strasberg; Barrymore described her relationship with the latter as one that \"would become so important to me as a kid because she was so kind and nurturing.\" Her godfather is filmmaker Steven Spielberg.Barrymore's first name, Drew, was the maiden name of her paternal great-grandmother Georgie Drew, and her middle name, Blythe, was derived from the birth surname (Blyth) of her great-grandfather who later took the stage name of Maurice Barrymore. In her 1991 autobiography Little Girl Lost, Barrymore recounted early memories of her abusive father, who left the family when she was six months old. She and her father never had a significant relationship and seldom spoke."}, {"text": "=== Childhood ===Barrymore grew up on Poinsettia Place in West Hollywood, until she moved to Sherman Oaks at the age of seven. In her 2015 memoir Wildflower, she says she spoke \"like a valley girl\" because she grew up in Sherman Oaks. She moved back to West Hollywood on becoming emancipated at age 14. She attended elementary school at Fountain Day School in West Hollywood and Country School. In the wake of her sudden stardom, Barrymore endured a notoriously troubled childhood. She was a regular at Studio 54 as a young girl, and her nightlife and constant partying became a popular subject with the media. She was placed in rehab at 13, and spent 18 months in an institution for the mentally ill. A suicide attempt at 14 put her back in rehab, followed by a three-month stay with singer David Crosby and his wife. The stay was precipitated, Crosby said, because she \"needed to be around some people that were committed to sobriety.\" Barrymore described this period of her life for Little Girl Lost. After a successful juvenile court petition for emancipation, she moved into her own apartment at the age of 15."}, {"text": "=== 1970s–1980s ===Barrymore's career began when she was eleven months old, when she appeared in a dog food commercial. After her film debut with a small role in Altered States, she played Gertie in E.T. the Extra-Terrestrial. Director Steven Spielberg felt she had the right imagination for the role after she impressed him with a story that she led a punk rock band. E.T. was the highest-grossing film of the 1980s, and made Barrymore one of the most famous child actors of the time. She won the Young Artist Award for Best Young Supporting Actress and was nominated for the Rising Star Award at the British Academy Film Awards. In the eighth season of Saturday Night Live, she became the youngest person to guest-host the series.In the 1984 film adaptation for Stephen King's 1980 novel Firestarter, Barrymore played a girl with pyrokinesis, and the target of a secret government agency known as The Shop. That year, she also played a young girl divorcing her famous parents in Irreconcilable Differences, and was nominated for her first Golden Globe Award for Best Supporting Actress. In his review in the Chicago Sun-Times, Roger Ebert wrote: \"Barrymore is the right actress for this role precisely because she approaches it with such grave calm.\""}, {"text": "=== 1970s–1980s ===Barrymore endured a troubled youth and continued acting during the decade. She starred in the anthology horror film Cat's Eye, also written by King. It received positive reviews and Barrymore was nominated for a Young Artist Award for Best Leading Young Actress. For Dangerous Liaisons, Barrymore declined the role of Cecile, which went to Uma Thurman. Barrymore starred in the romance film See You in the Morning. Vincent Canby of The New York Times criticized the \"fashionable phoniness\" of the film, but positively singled out Barrymore. In Far from Home, she played a teenager who gets stranded with her father in a small, remote desert town. The film went largely unnoticed by audiences and received negative reviews from critics, who dismissed the sexual portrayal of her role."}, {"text": "=== 1990s ===Barrymore's rebelliousness played itself out on screen and in print. She played a poor teenage girl in Poison Ivy, which was a box-office bomb, but was popular on video and cable. Her character \"Ivy\" was ranked at #6 on the list of the top 26 \"bad girls\" of all time by Entertainment Weekly. Barrymore was seventeen when she posed nude with her then-fiancé, actor Jamie Walters, for the cover of the July issue of Interview magazine; she also appeared nude in pictures inside the issue.In Guncrazy, Barrymore played a teenager who kills her abusive stepfather. Variety remarked that she \"pulls off impressively\" her character, and Barrymore was nominated for the Golden Globe Award for Best Actress in a Miniseries or Television Film. Barrymore played the younger sister of a murdered ballerina in No Place to Hide and a writer followed by what is apparently her evil twin in Doppelganger. Both films were panned by critics and failed to find an audience. She appeared in the western film Bad Girls, which follows four former prostitutes on the run following a justifiable homicide and prison escape. Roger Ebert, in his review for the film, wrote for Chicago Sun-Times: \"What a good idea, to make a Western about four tough women. And what a sad movie.\"Barrymore posed nude for the January 1995 issue of Playboy. Soon after, her godfather Steven Spielberg gave her a quilt for her 20th birthday with a note that read, \"Cover yourself up.\" Enclosed in the quilt were copies of her Playboy pictures which had been altered by Spielberg's art department so that she appeared fully clothed. Barrymore later said that she would not let her own child make the same choice she did.While appearing on the Late Show with David Letterman, Barrymore climbed onto the desk, flashed her breasts to David Letterman and gave him a kiss on the cheek as a birthday gift. She modeled in a series of Guess? jeans ads during this time.In the late 1990s, Barrymore re-established her image and continued to be a highly bankable star."}, {"text": "=== 1990s ===In Boys on the Side, Barrymore played a pregnant girl attempting to escape from her abusive boyfriend. It was a box office success and was positively received by critics. In the superhero film Batman Forever, she played one of the two female assistants for Two-Face (Tommy Lee Jones).Barrymore made a brief but notable appearance in Wes Craven's 1996 slasher film Scream. She read the film's script and was interested in being involved, approaching the production team herself to request a role. The producers were quick to take advantage of her unexpected interest and signed her to play the lead role of Sidney Prescott. However, after unexpected commitments, Barrymore played Casey Becker in a minor role, and Neve Campbell took the leading one. Scream was released to critical acclaim and made $173 million worldwide.In The Wedding Singer (1998), Barrymore played a waitress in love with the titular character, played by Adam Sandler. Variety found the film to be a \"spirited, funny and warm saga\" that serves them up \"in a new way that enhances their most winning qualities\". Budgeted at $18 million, the film grossed $123.3 million internationally. In Home Fries (1998), Barrymore played a pregnant woman unknowingly falling for the stepson of the late father of her baby. She starred in the historical drama film Ever After (1998), which made $98 million and was inspired by the fairy tale Cinderella. Roger Ebert said about Barrymore and the film: \"she can hold the screen and involve us in her characters\".Barrymore voiced the titular anthropomorphic Jack Russell terrier in the Christmas television film Olive, the Other Reindeer and was nominated for a Primetime Emmy Award. After establishing Flower Films, Barrymore and Nancy Juvonen produced the company's first film, Never Been Kissed, in which Barrymore played an insecure copy editor for the Chicago Sun-Times and a high school student. While reviews from critics were mixed, CNN noted: \"There are two words which describe why this film works: Drew Barrymore. Her comedic timing and willingness to go all out in her quest for a laugh combine to make Never Been Kissed a gratifying movie-going experience\". The film was a commercial success, grossing $84.5 million."}, {"text": "=== 2000s ===In Charlie's Angels, Barrymore, Cameron Diaz and Lucy Liu played the trio of investigators in Los Angeles. The film was a major box office success and helped solidify Barrymore's standing in her production company as one of the film's producers. Barrymore starred in Riding in Cars with Boys, as a teenage mother in a failed marriage with the drug-addicted father (based on Beverly Donofrio's real-life story). When the production of Donnie Darko was threatened, Barrymore stepped forward with financing from the company, and played the title character's English teacher. Although the film was less than successful at the box office in the wake of 9/11, it reached cult status after the DVD release, inspiring numerous websites devoted to unraveling the plot twists and meanings.Barrymore starred in George Clooney's directorial debut Confessions of a Dangerous Mind, based on the autobiography of television producer Chuck Barris. Barrymore reprised her role in Charlie's Angels: Full Throttle and starred with Ben Stiller in Duplex. Flower Films and Happy Madison Productions produced the film 50 First Dates, in which Barrymore played an amnesiac woman and Sandler played a marine veterinarian. Summing up Barrymore's appeal, Roger Ebert, in his review for the film, remarked that Barrymore displayed a \"smiling, coy sincerity\", in what he described as an \"ingratiating and lovable\" film. 50 First Dates was a commercial success; it made US$120.9 million in North America and US$196.4 million worldwide.In the 2005 American remake adaptation of the 1997 British film Fever Pitch, Barrymore played the love interest of an immature schoolteacher (Jimmy Fallon). The film grossed a modest US$50 million worldwide and had generally favorable reviews by critics who felt it \"has enough charm and on-screen chemistry between [Fallon and Barrymore] to make it a solid hit\". Barrymore starred in the 2006 animated film Curious George, based on the book series of the same name. She and Hugh Grant starred in Music and Lyrics, which focuses on the relationship that evolves between a former pop music idol and an aspiring writer as they struggle to compose a song for a reigning pop diva. The romantic comedy, released in February 2007, received largely positive reviews, with The Washington Post finding the two to be \"great together\" in it. The film was a commercial success, grossing US$145 million globally."}, {"text": "=== 2000s ===In Curtis Hanson's poker film Lucky You, Barrymore played an aspiring singer and the subject of the affections of a talented player. In Raja Gosnell's film Beverly Hills Chihuahua, Barrymore voiced the titular character, a richly pampered pet who gets dognapped in Mexico and has to escape from an evil Doberman."}, {"text": "=== 2000s ===Barrymore starred in the ensemble comedy He's Just Not That Into You, which received mixed reviews, partly due to her limited time on screen, while it grossed US$178 million worldwide. She played Edith Bouvier Beale, the daughter of Edith Ewing Bouvier Beale (Jessica Lange) in the HBO film Grey Gardens, which is based on the 1975 documentary film. The television film was a huge success, winning five Primetime Emmy Awards and two Golden Globe Awards. Rolling Stone writer Peter Travers found Barrymore to be a \"revelation\" in her role. Barrymore was nominated for the Emmy Award for Outstanding Lead Actress in a Miniseries or a Movie, and won the Golden Globe Award for Best Actress – Miniseries or Television Film and the Screen Actors Guild for Outstanding Performance by a Female Actor in a Television Movie or Miniseries."}, {"text": "=== 2000s ===Barrymore starred in her directorial debut film Whip It. It follows a high-schooler (Elliot Page) ditching the teen beauty pageant scene and participating in an Austin roller derby league. Barrymore worked with screenwriter Shauna Cross for months on script revisions, with Barrymore pushing her to \"avoid her story's tidier prospects, to make things 'more raw and open ended.'\" While the film found limited box office receipts, it was favorably received; according to review aggregation website Rotten Tomatoes, critics agreed that her \"directorial debut has enough charm, energy, and good-natured humor to transcend its many cliches\". For her venture, Barrymore garnered nominations for a Bronze Horse at the Stockholm Film Festival and for the EDA Female Focus Award at the 2009 Alliance of Women Film Journalists. In Everybody's Fine, Barrymore played the daughter of a recently widowed retiree (Robert De Niro). The drama flopped at the box office, but Stephen Holden for The New York Times considered Barrymore \"as ingenuous as ever\" in what he described as a \"small role.\""}, {"text": "=== 2010s ===Barrymore starred with Justin Long in Nanette Burstein's film Going the Distance. It follows a couple dealing the ups and downs of a long-distance relationship, while commuting between New York City and San Francisco. It garnered generally mixed reviews by critics, who summed it as \"timelier and a little more honest than most romantic comedies\", and budgeted at US$32 million, the film made US$40 million at the worldwide box office.On August 2, 2011, Barrymore directed the music video for the song \"Our Deal,\" for the band Best Coast, which features Chloë Grace Moretz, Miranda Cosgrove, Tyler Posey, Donald Glover, Shailene Woodley and Alia Shawkat. Barrymore starred in the biopic film Big Miracle, which covers Operation Breakthrough, the 1988 international effort to rescue gray whales from being trapped in ice near Point Barrow, Alaska. Her character, Rachel Kramer, is based on Greenpeace activist Cindy Lowry. Despite a positive critical reception, the film flopped at the box office.In Blended, Barrymore played a recently divorced woman ending up on a family resort with a widower (Sandler). Film critic James Berardinelli dismissed the \"hit-and-miss humor\" of the story and wrote that \"as [Sandler and Barrymore] are concerned, the third time is definitely not the charm\", as part of an overall lukewarm critical response. The film ultimately grossed US$128 million worldwide. She and Toni Collette starred in Miss You Already (2015), as two long-time friends whose relationship is put to the test when one starts a family and the other becomes ill. Reviewers embraced the film, while it received a limited theatrical release.In the Netflix original television series Santa Clarita Diet, Barrymore played a real estate agent who, after experiencing a physical transformation into a zombie, starts craving human flesh. Along with co-star Timothy Olyphant, Barrymore served as an executive producer on the single-camera series, which was favorably received upon its premiere; Rolling Stone felt that \"much of [the series' laughs] comes down to the uncrushable Drew Barrymore charm\" and furthermore remarked: \"The show is a welcome comeback for Barrymore, the eternally beloved grunge-era wild thing—it's not just her big move into TV, but her first high-profile performance anywhere in years. In a way, it circles back to the roles she was doing in the early [90s], playing deadly vixens in flicks like Guncrazy or Doppelganger\"."}, {"text": "=== 2020s ===Barrymore starred in Jamie Babbit's film The Stand In. It was set to premiere at the Tribeca Film Festival in April 2020, but was cancelled due to the COVID-19 pandemic. On September 14, 2020, Barrymore launched a syndicated daytime talk show, The Drew Barrymore Show, which is also available on Spotify in a podcast format. On December 4, 2020, she appeared as a guest star on Martha Knows Best. On March 11, 2021, Barrymore said she was taking an indefinite hiatus from acting. She wrote a cookbook with chef Pilar Valdes entitled Rebel Homemaker, which was a New York Times bestseller. In June 2021, she launched Drew Magazine, a quarterly released lifestyle magazine by publisher Bauer Media USA. Barrymore was named one of the 100 most influential people in the world by Time magazine in 2023.In September 2023, Barrymore crossed a WGA picket line to continue her syndicated TV talk show, writing “I own this choice” when explaining her reasoning via social media. While SAG had stated that as the host of the show she was not under any obligation to strike, her show continued without unionized writing staff. Audience members showing support for the Writer's Guild were kicked out of the studio, and had any WGA pins confiscated. Due to these events, the National Book Foundation removed Barrymore from being the host of the then upcoming 74th National Book Awards. Barrymore apologized for her actions later that week in a video on Instagram, claiming that, \"I believe there’s nothing I can do or say in this moment to make it OK.\" Barrymore deleted the apology video from her account following criticism. On the 17th, Barrymore announced on her Instagram account that she would be postponing production of her talk show until the strike ends due to the backlash, writing \"I have listened to everyone, and I am making the decision to pause the show’s premiere until the strike is over”. She also adds “I have no words to express my deepest apologies to anyone I have hurt, and, of course, to our incredible team who works on the show and has made it what it is today”. A spokesperson for CBS Media Ventures said, \"We support Drew’s decision to pause the show’s return and understand how complex and difficult this process has been for her.\""}, {"text": "== Image and fashion ==Barrymore became a CoverGirl Cosmetics' model and spokeswoman in 2007. In February 2015, she became one of the faces of CoverGirl, alongside Queen Latifah and Taylor Swift. The company partnered with her because \"she emulates the iconic image of CoverGirl with her fresh, natural beauty and energetic yet authentic spirit,\" said Esi Eggleston Bracey, vice president and general manager of CoverGirl Cosmetics North America. She brought not only her personality into this endorsement but also her creative side, as she also helped create the ads. She was No. 1 on People's annual 100 Most Beautiful People list in 2007. She was named the new face for the Gucci jewelry line. Barrymore signed a contract with IMG Models New York City. She is a spokeswoman for Crocs."}, {"text": "== Image and fashion ==In May 2007, Barrymore was named Ambassador Against Hunger for the United Nations World Food Programme and later donated $1 million to the cause. As a guest photographer for a magazine series called \"They Shoot New York\", she appeared on the cover holding a Pentax K1000 film camera. She expressed hopes of exposing her work in a gallery one day, as she had documented the most recent decade of her life with a Pentax camera.Barrymore launched a women's fashion line in fall 2017 in conjunction with Amazon.com called Dear Drew, which featured a pop-up shop in New York City that opened in November."}, {"text": "== Personal life ==In 1991, Barrymore was engaged to Leland Hayward's grandson, Leland III. The engagement was called off a few months later. She was engaged to Jamie Walters from 1992 to 1993.Barrymore married Welsh-born Los Angeles bar owner Jeremy Thomas on March 20, 1994. She filed for divorce from him less than two months later.In late 1994, Barrymore began dating Hole guitarist Eric Erlandson. Barrymore began dating with MTV host and comedian Tom Green in 1999. They were engaged in July 2000 and married a year later. Together, they starred in Charlie's Angels and Green's directorial film debut, Freddy Got Fingered. Green filed for divorce in December 2001, which was finalized on October 15, 2002.In 2002, Barrymore began dating The Strokes drummer Fabrizio Moretti shortly after they met at a concert. Their relationship ended in January 2007. She began dating Justin Long, but they broke up in July 2008.In early 2011, Barrymore began dating art consultant Will Kopelman, the son of former Chanel COO Arie L. Kopelman. The couple announced their engagement in January 2012, and married on June 2, 2012, in Montecito, California. Four days later, the couple's wedding image appeared on the cover of People magazine. They have two daughters, born in 2012 and 2014. On April 2, 2016, Barrymore and Kopelman released a statement about their separation. On July 15, 2016, Barrymore officially filed for divorce, which was finalized on August 3, 2016.In an interview with Contactmusic.com in 2003, Barrymore said: \"Do I like women sexually? Yeah, I do. Totally. I have always considered myself bisexual. I love a woman's body. I think a woman and a woman together are beautiful, just as a man and a woman together are beautiful. Being with a woman is like exploring your own body, but through someone else\".Barrymore is the godmother of Frances Bean Cobain, the daughter of Kurt Cobain and Courtney Love.Barrymore eats a plant-based diet, and reportedly convinced Cardi B to try veganism. Since 2023, she resides in Manhattan."}, {"text": "== Awards, honors, and nominations ==In 1999, Barrymore was honored by the Young Artist Foundation with its Former Child Star \"Lifetime Achievement\" Award commemorating her outstanding achievements within the film industry as a child actress. For her contributions to the film industry, Barrymore received a motion pictures star on the Hollywood Walk of Fame in 2004. It is located at 6925 Hollywood Boulevard.Her films compiled a worldwide box office gross that stood at over US$2.3 billion. According to The Hollywood Reporter's annual Star Salary Top 10, she was tied for eighth place on the top ten list of actresses' salaries, commanding 10 to 12 million dollars per film in 2006. Barrymore became the youngest person to host Saturday Night Live, having hosted on November 20, 1982 at seven years of age, a record that remains unbroken as of 2023. On February 3, 2007, Barrymore hosted SNL for the fifth time, becoming the second female host (after Candice Bergen) in the show's history to do so. She hosted again on October 10, 2009, becoming the first woman to host six times."}, {"text": "== Bibliography ==Barrymore, Drew. Little Girl Lost. Pocket Books, 1990. ISBN 0-671-68923-1"}, {"text": "== Bibliography ==Barrymore, Drew. Find It in Everything. Little, Brown and Company, 2014. ISBN 0316259063"}, {"text": "== Bibliography ==Barrymore, Drew. Wildflower. Dutton, 2015. ISBN 1101983817"}, {"text": "== Bibliography ==Barrymore, Drew and Valdes, Pilar. Rebel Homemaker: Food, Family, Life. Dutton, 2021. ISBN 0593184106"}, {"text": "== See also ==List of celebrities who own wineries and vineyards"}, {"text": "== Further reading ==Aronson, Virginia. Drew Barrymore. Chelsea House, 1999. ISBN 0-7910-5306-7"}, {"text": "== Further reading ==Bankston, John. Drew Barrymore. Chelsea House Publishers, 2002. ISBN 0-7910-6772-6"}, {"text": "== Further reading ==Dye, David. Child and Youth Actors: Filmography of Their Entire Careers, 1914–1985. Jefferson, NC: McFarland & Co., 1988, p. 11."}, {"text": "== Further reading ==Ellis, Lucy. Drew Barrymore: The Biography. Aurum Press, 2004. ISBN 1-84513-032-4"}, {"text": "== Further reading ==Hill, Anne E. Drew Barrymore. Lucent Books, 2001. ISBN 1-56006-831-0"}, {"text": "== External links ==Drew Barrymore at AllMovie "}, {"text": "== External links ==Drew Barrymore at the TCM Movie Database"}]