[{"text": "Dwayne Douglas Johnson (born May 2, 1972), also known by his ring name The Rock, is an American actor, businessman, and professional wrestler. As a wrestler, he is signed to WWE, where he performs on a part-time basis and is a member of The Bloodline. Widely regarded as one of the greatest professional wrestlers of all time, he was integral to the development and success of the World Wrestling Federation (WWF, now WWE) during the Attitude Era, an industry boom period in the late 1990s and early 2000s. Johnson wrestled for the WWF for eight years before pursuing an acting career. His films have grossed over $3.5 billion in North America and over $10.5 billion worldwide, making him one of the world's highest-grossing and highest-paid actors. He is a co-owner of the United Football League (UFL), a professional American football league. He is also a member of the board of directors of TKO Group Holdings, the parent company of UFC and WWE. In 2012, he co-founded the entertainment production company Seven Bucks Productions. He is the founder of Teremana Tequila, which is approximately valued at $3.5 billion."}, {"text": "After accepting an athletic scholarship to play football at the University of Miami, he was a member of the 1991 national championship team but was largely a backup player. Despite aspirations to professional football, he went undrafted in the 1995 NFL draft, and briefly signed with the Calgary Stampeders before being cut in his first season. In 1996, Johnson's father Rocky assisted in helping him secure a contract with the WWF. Johnson quickly rose to global prominence, aided by a gimmick he employed as a charismatic trash talker. Johnson left the WWE in 2004 and returned in 2011 as a part-time performer until 2013, making sporadic appearances from thereon until 2019 where he quietly retired until 2023, where he returned once again on a part-time basis. A 10-time world champion, including the promotion's first of African-American descent, he is also a two-time Intercontinental Champion, a five-time Tag Team Champion, the 2000 Royal Rumble winner, and WWE's sixth Triple Crown champion. Johnson headlined multiple pay-per-view events, including WWE's flagship event WrestleMania a record ten times (15, 16, 17, 18, 19, 20, 27, 28, 29 and 40) which includes the most-bought professional wrestling pay-per-view (WrestleMania 28) and main evented the most watched episodes of WWE's flagship television series (Raw and SmackDown)."}, {"text": "Johnson's first film role was in The Mummy Returns (2001). The next year, he played his first leading role in the action fantasy film The Scorpion King. He has since starred in family films The Game Plan (2007), Race to Witch Mountain (2009), Tooth Fairy (2010), Jumanji: Welcome to the Jungle (2017), Jumanji: The Next Level (2019), and Jungle Cruise (2021), and the action films Journey 2: The Mysterious Island (2012), G.I. Joe: Retaliation (2013), Hercules (2014), Skyscraper (2018), San Andreas (2015) and Rampage (2018). He also starred in the action comedy films Get Smart (2008), Central Intelligence (2016), Baywatch (2017), and Red Notice (2021). His role as Luke Hobbs in the Fast & Furious films, beginning with Fast Five (2011), helped the franchise become one of the highest-grossing in film. He joined the DC Extended Universe playing the title role in Black Adam (2022). He is also known for voicing Maui in the Disney animated film Moana (2016) and is set to reprise the role in the upcoming live action remake."}, {"text": "Johnson produced and starred in the HBO comedy-drama series Ballers (2015–2019) and the autobiographical sitcom Young Rock (2021). His autobiography, The Rock Says, was released in 2000 and was a New York Times bestseller.  In 2016 and 2019, Time named Johnson as one of the world's most influential people."}, {"text": "== Early life == "}, {"text": "== Early life ==Johnson was born in Hayward, California, on May 2, 1972, the son of Mataniufeagaimaleata \"Ata\" Fitisemanu (née Maivia) and former professional wrestler Rocky Johnson (born Wayde Douglas Bowles). Growing up, he briefly lived in Grey Lynn in Auckland, New Zealand, with his mother's family, where he played rugby and attended Richmond Road Primary School before returning to the U.S."}, {"text": "== Early life ==Johnson's father was a Black Nova Scotian with a small amount of Irish ancestry. His mother is Samoan. His father and Tony Atlas were the first black tag team champions in WWE history, in 1983. His mother is the adopted daughter of Peter Maivia, who was also a professional wrestler. Johnson's maternal grandmother Lia was one of the first female pro wrestling promoters, taking over Polynesian Pacific Pro Wrestling after her husband's death in 1982 and managing it until 1988. Through his maternal grandfather Maivia, Johnson is a non-blood relative of the Anoaʻi wrestling family. In 2008, he inducted his father and grandfather into the WWE Hall of Fame."}, {"text": "== Early life ==Johnson attended Montclaire Elementary School in Charlotte, North Carolina, and then moved to Hamden, Connecticut, where he attended Shepherd Glen Elementary School and then Hamden Middle School. He attended President William McKinley High School in Honolulu and then Glencliff High School and McGavock High School, both in Nashville, Tennessee, and then Freedom High School in Bethlehem Township, Pennsylvania, in the Lehigh Valley region of the state, where he graduated in 1990."}, {"text": "== Early life ==At Freedom High School, Johnson initially struggled and was drawn into a culture of conflict and petty crime. By age 17, he had been arrested several times for fighting, theft, and check fraud, and was suspended two weeks for fighting. An article in the local newspaper labeled him \"a troubled teenager with a history of run-ins with police.\" But Freedom High School football coach Jody Cwik saw athletic potential in Johnson, and recruited him to join the school's football team, where he played defensive tackle, an experience that proved to be a significant personal transformation for Johnson. \"My thought process started to change. That's when I started thinking about goals and what I wanted to accomplish\", he has since said about his high school football experience. In addition to playing football, Johnson also was a member of Freedom High School's track and field and wrestling teams."}, {"text": "== Early life ==By his senior year at Freedom High School, Johnson had played only two years of football, but was offered a full athletic scholarship offer from the University of Miami, whose football program was beginning to emerge as one of the nation's top-level NCAA Division 1 teams."}, {"text": "=== College career ===As he did in high school, Johnson continued to play defensive tackle at the University of Miami, where he was a member of the Miami Hurricanes 1991 team, which won that year's national championship. Despite playing four years there, however, Johnson found himself behind elite players on the depth chart, including future NFL star and Pro Football Hall of Fame inductee Warren Sapp, and appeared mostly in backup roles. In his time at Miami, Johnson played in 39 games with one start. He recorded 4.5 sacks and 77 tackles."}, {"text": "=== College career ===In 1995, Johnson graduated with a Bachelor of General Studies and a dual major in criminology and physiology. He was also one of the university's most prolific student speakers in the Miami-area community, frequently delivering positive messages about his own struggles and encouraging students to remain in school and avoid the dangers of drug use."}, {"text": "=== Canadian Football League ===After graduating, Johnson was signed by the Calgary Stampeders of the Canadian Football League. Calgary moved him from defensive tackle to linebacker. He was assigned to Calgary's practice roster, but was cut two months into Calgary's 1995 season."}, {"text": "=== Early career (1996) ===After being cut by Calgary, Johnson began his professional wrestling career the next year, in 1996. Veteran wrestler Pat Patterson secured several tryout matches for Johnson with the World Wrestling Federation (WWF) in 1996. Wrestling at first under his real name, Johnson defeated The Brooklyn Brawler at a house show on March 10 and lost matches to Chris Candido and Owen Hart. After wrestling at Jerry Lawler's United States Wrestling Association under the name Flex Kavana and winning the USWA tag team championship twice with his partner Bart Sawyer in the summer of 1996, Johnson was signed to a WWF contract. He received additional training from Tom Prichard, alongside Achim Albrecht and Mark Henry."}, {"text": "==== Intercontinental Champion (1996–1997) ====Johnson made his WWF debut as Rocky Maivia, a combination of his father and grandfather's ring names, although announcers acknowledged his real name. He was initially reluctant to take this ring name but was persuaded by Vince McMahon and Jim Ross. He was given the nickname \"The Blue Chipper\", and to play up his lineage, he was hyped as the WWF's first third-generation wrestler. A clean-cut face character, Maivia was pushed heavily from the start despite his wrestling inexperience. He debuted on Monday Night Raw as a member of Marc Mero's entourage on November 4, 1996. His first match came at Survivor Series on November 17, 1996, in an eight-man elimination tag match; he was the sole survivor and eliminated the final two members of the opposing team, Crush and Goldust. On February 13, 1997, he won the Intercontinental Championship from Hunter Hearst Helmsley on Monday Night Raw. Maivia then successfully defended the title against Helmsley at In Your House 13: Final Four."}, {"text": "==== Intercontinental Champion (1996–1997) ====Johnson's first WrestleMania match came at WrestleMania 13 on March 23, 1997, where he was victorious in his Intercontinental Championship defense against The Sultan. WWF fans started to reject his character and push from the company. He defeated Bret Hart by disqualification in a title defense on the March 31 episode of Raw is War. Behind the scenes, Hart mentored Johnson for his first year in WWF and refused to be booked to take the title from him. On April 20, at In Your House 14: Revenge of the 'Taker, he lost to Savio Vega by countout but retained the title. Audiences became increasingly hostile toward Maivia, with chants of \"die, Rocky, die\" and \"Rocky sucks\" being heard during his matches."}, {"text": "==== Intercontinental Champion (1996–1997) ====After losing the Intercontinental Championship to Owen Hart on the April 28, 1997, episode of Raw Is War, Maivia suffered a legitimate knee injury in a match against Mankind in June 1997 and spent several months recovering."}, {"text": "==== Nation of Domination (1997–1998) ====Upon returning in August 1997, Maivia turned heel for the first time in his career by lashing out at fans who had been booing him and joining Faarooq, D'Lo Brown and Kama in the stable called the Nation of Domination. He then refused to acknowledge the Rocky Maivia name, instead referring to himself in the third person as the Rock, though he would still be billed as \"The Rock\" Rocky Maivia until 1998. The Rock would then regularly insult the audience, WWF performers, and interviewers in his promos."}, {"text": "==== Nation of Domination (1997–1998) ====At D-Generation X: In Your House on December 7, 1997, Stone Cold Steve Austin defeated the Rock in under six minutes to retain the Intercontinental Championship. The next night on Raw Is War, Austin was ordered by Mr. McMahon to defend the title in a rematch, but forfeited it to the Rock instead, handing him the title belt before hitting him with the Stone Cold Stunner. The Rock feuded with Austin and Ken Shamrock through the end of 1997 and beginning of 1998. On January 19, 1998, at the Royal Rumble, the Rock defeated Shamrock by disqualification to retain the Intercontinental title. Later that night, he entered the Royal Rumble match and lasted until the final two before he was eliminated by Stone Cold Steve Austin. On March 29, at WrestleMania XIV, he defeated Shamrock by disqualification once again to retain the title. The next night, on Raw is War, the Rock debuted a new Intercontinental Championship design and would later overthrow Faarooq as leader of the Nation of Domination to spark a feud between the two. He then successfully defended the Intercontinental title against Faarooq at Over the Edge: In Your House on May 31. The stable would then refer to themselves as simply \"The Nation\"."}, {"text": "==== Nation of Domination (1997–1998) ====The Rock and the Nation then feuded with Triple H and D-Generation X, with the two stable leaders first meeting in the quarter-final of the 1998 King of the Ring tournament, which the Rock won. At King of the Ring, the Rock defeated Dan Severn in the semi-final match and lost to rival Ken Shamrock in the final. The Rock then resumed his feud with Triple H, as the two had a two out of three falls match at Fully Loaded: In Your House for the Intercontinental title, which the Rock retained in controversial fashion. This led to a ladder match at SummerSlam on August 30, 1998, where the Rock lost the title."}, {"text": "==== Nation of Domination (1997–1998) ====In the latter half of 1998, The Rock saw a big uptick in fan support. He also started consolidating his famous persona during this time, which would last until 2000. His popularity caused him to be booked in a feud with fellow Nation members Mark Henry and D'Lo Brown, turning babyface in the process. Henry defeated him at Judgment Day: In Your House on October 18, 1998, after interference from Brown, effectively breaking up the stable."}, {"text": "==== WWF Champion and rise to superstardom (1998–2000) ====The Rock was then entered into the \"Deadly Game\" tournament for the vacant WWF Championship. The finals occurred at Survivor Series on November 15, 1998, where the Rock defeated Vince McMahon's associate, Mankind, to win his first WWF Championship. A \"double turn\" then occurred as the Rock turned heel again after allying with Vince and Shane McMahon as the crown jewel of their stable, The Corporation, after the McMahons betrayed Mankind. On December 13, 1998, at the pay-per-view named after him, Rock Bottom: In Your House, the Rock had a rematch with Mankind for the WWF Championship. Mankind appeared to win the match when the Rock passed out to the Mandible Claw submission move, but Vince McMahon ruled that since the Rock did not tap out, he retained his title."}, {"text": "==== WWF Champion and rise to superstardom (1998–2000) ====In the main event of the January 4, 1999, episode of Raw Is War, Mankind defeated the Rock for the championship after interference from Stone Cold Steve Austin. Then at the Royal Rumble on January 24, 1999, the Rock regained the title in an \"I Quit\" match, a type of submission match that only ends if one of the combatants says \"I quit\" on a microphone. Intended to show a vicious streak in the Rock's character, the Rock hit Mankind in the head with a steel chair 11 times instead of the scripted five, five shots already being risky (most wrestling matches in the Attitude Era involving steel chairs had at most 2 or 3 shots to the head). After the fifth shot, Mankind was still ringside instead of two-thirds up the entrance ramp where he was supposed to be, and after the eleventh shot, which knocked Mankind out, a recording of Mankind saying \"I Quit\" from an earlier interview was played over the public address system. On January 31, during an episode of Sunday Night Heat, the Rock and Mankind participated in an Empty Arena match, a match that took place in an arena with 22,000 empty seats where any part of the facility could be used to contest the match. After 20 minutes of chaotic brawling in the ring, the stands, a kitchen, the catering area, an office, the arena corridors and finally a basement loading area, Mankind pinned the Rock using a forklift truck to win the WWF title. The two faced off again, at St. Valentine's Day Massacre: In Your House on February 14, 1999, in a Last Man Standing match which ended in a draw, meaning Mankind retained the title. Their feud ended on the February 15 Raw Is War, when the Rock won his third WWF Championship in a Ladder Match after a debuting Big Show interfered on his behalf. The Rock then lost the WWF Championship to Stone Cold Steve Austin at WrestleMania XV on March 28, 1999."}, {"text": "==== WWF Champion and rise to superstardom (1998–2000) ====The Rock's popularity continued to grow and audiences still cheered for him even though he was a heel. He then lost the title rematch against Stone Cold Steve Austin at Backlash: In Your House on April 25, 1999. The next night on Raw is War he was fired from the Corporation after he was betrayed by Shane McMahon, turning him face again and starting a feud with Triple H, The Undertaker and The Corporate Ministry. On April 29, 1999, WWF aired the pilot episode of SmackDown!, a term derived from one of the Rock's catchphrases. In the episode, the Rock continued his feud with The Corporate Ministry. This led to a match with Triple H, at Over the Edge on May 23, 1999, which the Rock won, and a match for the WWF Championship against The Undertaker, at King of the Ring, which the Rock lost. The Rock then lost a number one contender's match to Triple H, at Fully Loaded, after interference from \"Mr. Ass\" Billy Gunn. The Rock then defeated Gunn in a Kiss My Ass match at SummerSlam on August 22, 1999. The Rock was also given the privilege of having his own signature match, like The Undertaker with the Buried Alive match, Kane with the Inferno Match and Mankind with the Boiler Room Brawl: the Brahma Bullrope match, a variant of a strap match was a normal singles match where the components are tied together with a rope used for cattle farming, and the rope and its attached cowbell could both be used as weapons. The Rock contested this match twice, both times in Texas (vs Triple H in Dallas, and vs Al Snow in Houston)."}, {"text": "==== WWF Champion and rise to superstardom (1998–2000) ====Shortly after SummerSlam, the Rock began teaming with former opponent Mankind and the two became known as the Rock 'n' Sock Connection. They became WWF Tag Team Champions for the first time after defeating The Undertaker and Big Show for the titles on the August 30, 1999, episode of Raw is War. The two performed a number of critically acclaimed comedic skits together, including one called \"This Is Your Life\", which saw Mankind bring parody versions of people from the Rock's past on television, such as his high school girlfriend and his high school football coach, only to have the Rock insult them. The segment earned an 8.4 Nielsen rating, one of the highest ratings ever for a Raw segment. The two lost the titles back to Undertaker and Big Show on the September 9 episode of SmackDown! and won them back from them on the September 20 episode of Raw is War. Rock and Mankind then lost the titles to The New Age Outlaws on the very next episode of SmackDown!. Rock and Mankind would win the tag titles for the third and final time after beating the New Age Outlaws on the October 14 episode of SmackDown! before losing the titles to The Holly Cousins on the October 18 episode of Raw is War."}, {"text": "==== WWF Champion and rise to superstardom (1998–2000) ====At the Royal Rumble, on January 23, 2000, the Rock entered the Royal Rumble match and was one of the final two remaining, along with Big Show. In an attempt at a \"false finish\", Big Show intended to throw the Rock over the top rope in a running powerslam-like position, before the Rock countered the move on the ring apron, sending Big Show to the floor before reentering the ring as the winner. But the Rock's feet accidentally hit the floor during the reversal attempt, though those watching the event on television did not see that. This was played up in the storyline as Big Show provided additional video footage showing it and claimed to be the rightful winner. The Rock's number one contendership for the WWF Championship was then put on the line against Big Show at No Way Out on February 27, 2000, which Big Show won after Shane McMahon interfered. The Rock then defeated Big Show on the March 13 episode of Raw Is War, to regain the right to face the WWF Champion, Triple H, at WrestleMania 2000 on April 2, in a Fatal Four-way elimination match, also including Big Show and Mick Foley. Each wrestler had a McMahon in his corner: Triple H had his wife Stephanie, Foley had Linda, the Rock had Vince and Big Show had Shane. The Rock lasted until the final two but was eliminated by Triple H after Vince betrayed him by hitting him with a chair."}, {"text": "==== WWF Champion and rise to superstardom (1998–2000) ====Due to his image at the time, a Magic: The Gathering deck archetype was named after him."}, {"text": "==== Record-breaking world champion (2000–2002) ====In the following weeks, the Rock continued his feud with Triple H and eventually won his fourth WWF Championship, which he won on April 30, at Backlash, after Stone Cold Steve Austin intervened on his behalf. The following night on Raw, he successfully defended his title against Shane McMahon in a Steel Cage match. On May 21, at Judgment Day, the Rock faced Triple H in an Iron Man match with Shawn Michaels as the special guest referee. With the score tied at five falls each, and with seconds left on the time limit, the Rock was disqualified when The Undertaker attacked Triple H, thus giving Triple H the 6–5 win and the title. The Rock won the WWF Championship for a fifth time at King of the Ring on June 25 by scoring the winning pin in a six-man tag team match, teaming with Kane and The Undertaker against Shane McMahon, Triple H and Vince McMahon, whom he pinned. The Rock successfully defended the championship against Chris Benoit, on July 23, at Fully Loaded. The next month, he successfully defended his title against Kurt Angle and Triple H at SummerSlam. The Rock had another successful title defense against Benoit, Kane and The Undertaker, on September 24, at Unforgiven."}, {"text": "==== Record-breaking world champion (2000–2002) ====The Rock then lost the WWF Championship to Kurt Angle, at No Mercy, on October 22, 2000. The next month, the Rock feuded with Rikishi and defeated him at Survivor Series. The Rock wrestled a six-man Hell in a Cell match for the WWF Championship, at Armageddon, which Angle won to retain the title. On the December 18 episode of Raw, the Rock won the WWF Tag Team Championship with The Undertaker, defeating Edge and Christian, before losing it back to them the next night at a SmackDown! taping. In 2001, the Rock continued to feud with Angle over the WWF Championship, culminating at No Way Out on February 25, 2001, where he pinned Angle to win the WWF Championship for a sixth time. The Rock then feuded with the Royal Rumble winner, Stone Cold Steve Austin, whom he lost the title to at WrestleMania X-Seven after Austin allied with Vince McMahon, who interfered on his behalf. On the next night's Raw Is War, during a steel cage title rematch, Triple H attacked the Rock, allying with McMahon and Austin and helping Austin retain the championship. Austin and Triple H then formed a tag team called The Power Trip, while the Rock was indefinitely suspended in storyline. Johnson used this time off to act in The Scorpion King."}, {"text": "==== Record-breaking world champion (2000–2002) ====The Rock returned in late July 2001 when the WWF was feuding with rival promotions World Championship Wrestling (WCW) and Extreme Championship Wrestling (ECW) during what is known as The Invasion storyline. In reality, WCW was purchased by Vince McMahon and the WWF, and ECW had gone out of business in early 2001. Many former WCW and ECW wrestlers were then brought onto WWF television and formed The Alliance to compete with WWF in storyline. The Alliance and Vince McMahon then both attempted to persuade the Rock to join their team. The Rock then aligned with McMahon and the WWF. The next month, the Rock defeated Booker T, at SummerSlam, to win the WCW Championship for the first time. He later lost the title to Chris Jericho at No Mercy on October 21, 2001. The next night on Raw, he teamed with Jericho to win the WWF Tag Team Championship from The Dudley Boyz. The two then lost the tag titles to Booker T and Test on the November 1, 2001, episode of SmackDown!. The Rock defeated Jericho on the November 5 episode of Raw for his second WCW Championship."}, {"text": "==== Record-breaking world champion (2000–2002) ====As part of the WWF's battle against The Alliance, the Rock wrestled in a \"winner takes all\" five-on-five elimination tag team match at Survivor Series where the losing team's company would be dissolved in storyline. He was a member of Team WWF along with Chris Jericho, The Undertaker, Kane, and Big Show. The Alliance's team consisted of Stone Cold Steve Austin, Kurt Angle, Booker T, Rob Van Dam, and Shane McMahon. In the end, it came down to a one-on-one between the Rock and Stone Cold Steve Austin. The Rock seemed to have the upper hand, until his teammate Jericho entered the ring and attacked the Rock. Austin tried to capitalize on this by pinning the Rock, but Kurt Angle revealed his true allegiance by attacking Austin. The Rock then pinned Austin, giving Team WWF the victory and forcing The Alliance to disband. The Rock's WCW Championship was renamed the unbranded \"World Championship\" following the Alliance's loss. At the next pay-per-view, Vengeance on December 9, 2001, the Rock lost the World Championship to Jericho, who would then unify the WWF and World titles later that night. The Rock then unsuccessfully challenged Jericho for the now Undisputed WWF Championship at Royal Rumble on January 20, 2002."}, {"text": "==== Record-breaking world champion (2000–2002) ====At the next pay-per-view, No Way Out on February 17, 2002, the Rock defeated The Undertaker in a singles match. The event also saw the WWF debut of the famed WCW faction New World Order, which at the time consisted of \"Hollywood\" Hulk Hogan, Kevin Nash, and Scott Hall. This later led to a match between the Rock and Hogan at WrestleMania X8 on March 17, 2002. The match was billed as \"icon versus icon\", with both men representing the top tier of two generations of wrestling; ultimately the Rock pinned Hogan at WrestleMania X8 to win the match. Despite the Rock portraying a heroic character and Hogan a villain, a portion of the crowd attending the SkyDome was rooting heavily for Hogan. In an interview in 2013, Hogan said he and the Rock changed the style of the match on the fly based on the crowd's response. After the introduction of the first-ever brand extension, the WWF held a \"draft lottery\" on the March 25, 2002, episode of Raw. The Rock was the number one overall pick, going to the SmackDown! brand before taking a sabbatical from wrestling."}, {"text": "==== Record-breaking world champion (2000–2002) ====The Rock made a surprise return on a June episode of Raw before going to his assigned brand of SmackDown!. There, he was named the number one contender for the WWE Undisputed Championship, which he won for a record-setting seventh time at Vengeance, on July 21, by defeating Kurt Angle and then-champion The Undertaker in a Triple Threat match. The Rock successfully defended the title at the Global Warning event against Triple H and Brock Lesnar after pinning Triple H. On August 25, at SummerSlam, after interference from Lesnar's manager Paul Heyman, the Rock lost the WWE Undisputed Championship to Lesnar along with the record for the youngest WWE Champion, which he had set in 1998. In 2018, writing for ESPN.com, Sean Coyle noted in a retrospective review of the event, that following his victory over Hulk Hogan at WrestleMania X8, the Rock \"started to see a dip in fan support\" and \"that dip turned into a plunge\" by the time Rock had his match with Lesnar at SummerSlam because fans knew he was leaving WWE to pursue an acting career, as evidenced by the negative crowd response during his match with Lesnar. After SummerSlam ended, the Rock was visibly angry at the crowd reaction. When he tried to do a post-show speech for the crowd, the fans booed him. The Rock then took time off to kickstart his acting career."}, {"text": "==== Hollywood Rock (2003) ====The Rock returned on the January 30, 2003, episode of SmackDown! to set up another match with Hulk Hogan at No Way Out. Because of negative fan reaction during previous matches as a result of his budding acting career, The Rock turned heel for the first time since 1999. He also started a new persona that has been called Hollywood Rock, with a new look and a shaved head. The Rock defeated Hogan at No Way Out before moving to the Raw brand. There, he had various small feuds, including one with The Hurricane. He also began performing \"Rock Concerts\", segments in which he played the guitar and mocked WWE performers and fans in song."}, {"text": "==== Hollywood Rock (2003) ====After failing to win a number one contendership for the World Heavyweight Championship, The Rock went into another program with Stone Cold Steve Austin. This led to a match at WrestleMania XIX on March 30, 2003, which called back to their previous two WrestleMania encounters, both of which Austin had won. The Rock won after delivering three consecutive Rock Bottoms, ending their long-running rivalry in what turned out to be Austin's final match, until WrestleMania 38. The next night, Raw was billed as \"The Rock Appreciation Night\", in honor of his victory over Austin. That night, he was attacked by a debuting Goldberg. At Backlash on April 27, 2003, Goldberg defeated The Rock, who then briefly left WWE to film Walking Tall."}, {"text": "==== Final feuds and departure (2003–2004) ====On the June 2 episode of Raw, The Rock turned face after joining the Highlight Reel and attacking Christian and Chris Jericho with Booker T. He would later return on the December 8 episode of Raw to help Mick Foley against La Résistance. In 2004, The Rock aided Mick Foley in his feud against Evolution, leading to a reunion of the Rock 'n' Sock Connection. They lost against Ric Flair, Randy Orton, and Batista in a handicap match at WrestleMania XX on March 14, 2004, when Orton pinned Foley after an RKO. This was Johnson's final wrestling match until November 2011. The Rock appeared in WWE sporadically following WrestleMania XX. He made returns to provide support for Eugene against Jonathan Coachman and made a cameo in his hometown of Miami, where he confronted Randy Orton. On the August 23 episode of Raw, he hosted a pie-eating contest, as part of the WWE Diva Search, and ended the segment by giving Coachman a People's Elbow. The Rock's contract with WWE then ended and he started his full-time acting career."}, {"text": "==== Non-wrestling appearances (2007–2009) ====On March 12, 2007, the Rock appeared on a WWE show after nearly three years, via a pre-taped promo shown during Raw. He correctly predicted that Bobby Lashley would defeat Umaga at WrestleMania 23 in Donald Trump's and Vince McMahon's \"Battle of the Billionaires\" Hair vs. Hair match. On March 29, 2008, Johnson inducted his father Rocky Johnson and grandfather Peter Maivia into the WWE Hall of Fame. His next appearance was through a pre-taped promo on October 2, 2009, during the Decade of SmackDown."}, {"text": "=== Independent circuit (2009) ===On September 30, 2009, the Rock appeared at a World Xtreme Wrestling (WXW) show to support the professional wrestling debut of Sarona Snuka, the daughter of his longtime friend and mentor Jimmy Snuka."}, {"text": "==== Feud with John Cena (2011–2013) ====On February 14, 2011, the Rock was announced as the host of WrestleMania XXVII on April 3, 2011, appearing live on Raw for the first time in almost seven years. During a lengthy promo, he addressed the fans and started a feud with John Cena. After numerous appearances via satellite, the Rock appeared live on the Raw before WrestleMania XXVII to confront Cena. After he and Cena exchanged insults, The Miz and Alex Riley appeared and attacked the Rock; he fended off Miz and Riley, only for Cena to blindside him with an Attitude Adjustment."}, {"text": "==== Feud with John Cena (2011–2013) ====On April 3, at WrestleMania XXVII, the Rock opened the show by cutting a promo. After appearing in numerous backstage segments, the Rock came to ringside to restart the main event between Cena and The Miz as a No Disqualification match, after it had ended in a draw. As revenge for the Attitude Adjustment Cena had given him on Raw, Rock hit Cena with the Rock Bottom, allowing The Miz to pin him and retain the WWE Championship. After the match, Rock attacked Miz and hit him with the People's Elbow. The next night on Raw, the Rock and Cena agreed to a match at WrestleMania XXVIII the next year. They then worked together to fend off an attack by The Corre, which at the time consisted of Wade Barrett, Heath Slater, Justin Gabriel, and Ezekiel Jackson."}, {"text": "==== Feud with John Cena (2011–2013) ====The Rock appeared live on Raw in his hometown of Miami to celebrate his 39th birthday. On September 16, WWE announced the Rock would wrestle in a traditional 5-on-5 Survivor Series tag team match, teaming with Cena at Survivor Series in November. But on the October 24 episode of Raw, Cena instead suggested the Rock be his partner in a standard tag team match against The Miz and R-Truth, a team called Awesome Truth, which Rock agreed to the next week. On November 14, during the special Raw Gets Rocked, the Rock appeared live, delivering Rock Bottoms to Mick Foley, who had been hosting a \"This Is Your Life\"-style segment for Cena, and later both members of Awesome Truth. The Rock and Cena defeated Awesome Truth on November 20 at Survivor Series, when the Rock pinned The Miz. After the match, the Rock gave Cena a Rock Bottom."}, {"text": "==== Feud with John Cena (2011–2013) ====Leading up to WrestleMania, the Rock and Cena had several verbal confrontations on Raw. On the March 12, 2012, episode of Raw, the Rock hosted his first \"Rock Concert\" segment since 2004, mocking Cena in his songs. On April 1, at WrestleMania XXVIII, the Rock defeated Cena in the main event after countering Cena's attempt at a People's Elbow into a Rock Bottom and pinning Cena. This event broke the record for biggest professional wrestling pay-per-view buyrate. The following night on Raw, the Rock praised Cena, calling their match \"an honor\". He then vowed to once again become WWE Champion."}, {"text": "==== Feud with John Cena (2011–2013) ====On July 23, at Raw 1000, the Rock announced he would wrestle for the WWE Championship at the Royal Rumble pay-per-view. During the show, he encountered then-reigning WWE Champion CM Punk, Daniel Bryan, and John Cena, all of whom expressed a desire to face him. The Rock later saved Cena from an assault by Big Show, only to be laid out by CM Punk. On the January 7, 2013, episode of Raw, the Rock returned to confront his Royal Rumble opponent CM Punk. On January 11, he made his first SmackDown appearance in ten years, getting into an altercation with Team Rhodes Scholars, resulting in him delivering a Rock Bottom to Damien Sandow and a People's Elbow to Cody Rhodes. The Rock closed out the 20th-anniversary episode of Raw, on January 14, with one of his \"Rock Concerts\", leading to a brawl with CM Punk. The following week on Raw, the Rock was attacked by The Shield. Vince McMahon then asserted that if The Shield attacked the Rock in his title match with CM Punk, Punk would be stripped of the WWE Championship."}, {"text": "==== Feud with John Cena (2011–2013) ====On January 27, at the Royal Rumble, CM Punk would seemingly defeat the Rock after the arena lights went out and someone attacked the Rock. Vince McMahon then came out and was about to strip Punk of the championship, however, at the Rock's request, he instead restarted the match. This culminated in the Rock defeating Punk to win his eighth WWE Championship. Punk received a title rematch with the Rock, at Elimination Chamber on February 17, 2013, with the added stipulation that if the Rock was disqualified or counted out, he would still lose the WWE Championship. The Rock would pin Punk to defeat him and retain the championship. The following night on Raw, the Rock unveiled a new WWE Championship design, with a different center plate and removable customizable side-plates which had his \"Brahma Bull\" logo. The Rock then resumed his rivalry with John Cena, who won that year's Royal Rumble to set up a rematch of the previous WrestleMania match between the two at WrestleMania 29, only this time with the WWE Championship on the line."}, {"text": "==== Feud with John Cena (2011–2013) ====On April 7, at WrestleMania 29, Rock lost the WWE Championship to Cena, ending his reign at 70 days. Despite being advertised for Raw after WrestleMania, where it was stated that the Rock was still entitled a rematch for the WWE Championship, The Rock did not appear because of a real injury sustained during his match with Cena, in which his abdominal and adductor tendons tore from his pelvis. Johnson underwent surgery on April 23 to reattach the torn tendons. Post surgery, it made his abdomen look far less muscular than the rest of his body, notably his arms."}, {"text": "==== Part-time appearances (2014–2024) ====In April 2014, the Rock appeared in the opening segment of WrestleMania XXX along with Stone Cold Steve Austin and Hulk Hogan. On the October 6 episode of Raw, the Rock made a surprise appearance to confront Rusev and Lana; this resulted in the Rock clearing Rusev from the ring."}, {"text": "==== Part-time appearances (2014–2024) ====The Rock appeared at the 2015 Royal Rumble event on January 25, 2015, during the main event match, where he helped his relative Roman Reigns fend off Big Show and Kane after Reigns eliminated them from the match. Reigns then won the match and the Rock endorsed him in the ring. The Rock appeared at WrestleMania 31 on March 29, 2015, alongside Ronda Rousey, getting into an in-ring altercation with Triple H and Stephanie McMahon. Rock and Rousey prevailed after he attacked Triple H and she overpowered McMahon. On June 27, the Rock appeared at a live event in Boston, where he confronted Bo Dallas and gave him a Rock Bottom."}, {"text": "==== Part-time appearances (2014–2024) ====On the January 25, 2016, episode of Raw, the Rock was in a segment that saw him converse with The Miz, Big Show, Lana and Rusev before he and his relatives, The Usos, got into an altercation with then-WWE Tag Team Champions, The New Day. The Rock appeared at WrestleMania 32 on April 3, 2016, where he announced that WWE had broken the all-time WrestleMania attendance record before being interrupted by The Wyatt Family. The Rock got into a verbal back-and-forth with Bray Wyatt before having an impromptu match with Wyatt Family member Erick Rowan. The Rock won after giving Rowan a Rock Bottom and pinning him in six seconds, which set the record for the fastest win in WrestleMania history. The Rock was then aided by a returning John Cena to fend off Wyatt, Rowan and Braun Strowman."}, {"text": "==== Part-time appearances (2014–2024) ====On the February 20, 2017, episode of Raw, the Rock made an untelevised appearance after the broadcast had gone off the air, where he promoted and filmed a scene for his then-upcoming film Fighting with My Family. On August 3, 2019, the Rock officially announced his retirement from professional wrestling. On September 30, 2019, after weeks of speculation, the Rock announced that he would appear on SmackDown's 20th Anniversary on October 4, 2019, marking his first appearance on SmackDown since October 2014 and his first televised appearance since April 2016. At the event, he cut a promo with Becky Lynch before they were interrupted by King Corbin. After attacking Corbin, the Rock and Lynch celebrated in the ring."}, {"text": "==== Part-time appearances (2014–2024) ====On September 15, 2023, the Rock made a surprise return to SmackDown, in a segment with Pat McAfee and Austin Theory, who Rock took out within the segment. This marked his first televised appearance in WWE since October 4, 2019."}, {"text": "==== The Final Boss (2024–present) ====It was teased that a former WWE Champion would be appearing on the Day 1 edition of Raw on January 1, 2024; the unidentified champion was at first revealed to be Jinder Mahal, who insulted the crowd before being interrupted by The Rock in his first live appearance on Raw since 2016. The two brawled and The Rock emerged victorious, after which he asked the crowd if he should sit at \"the head of the table\" in a direct reference to Undisputed WWE Universal Champion Roman Reigns, his relative whose nickname is \"The Head of the Table\". The Rock also appeared on the February 2 episode of SmackDown, where he confronted Reigns after Royal Rumble winner Cody Rhodes decided against choosing Reigns as his WrestleMania 40 opponent to allow The Rock to face Reigns. This was met by intense backlash from fans who wanted Rhodes to face Reigns; the WrestleMania XL media event on February 8 thus saw The Rock align himself with Reigns, chastise Rhodes for reversing his decision not to choose Reigns as his WrestleMania opponent, and slap Rhodes for speaking out against the Anoaʻi family (of which The Rock and Reigns are both members), thus turning heel for the first time since 2003. As WWE's chief creative officer Triple H was being interviewed backstage over what had just transpired, The Rock and Reigns walked by and told him to \"fix it\" or they would, though Triple H would later appear on SmackDown to stand by Rhodes' decision."}, {"text": "==== The Final Boss (2024–present) ====On the February 16 episode of SmackDown, The Rock officially joined Reigns' faction The Bloodline, debuting a new character similar to past iterations of him, including “Hollywood Rock”. He then appeared on the March 1 episode of SmackDown, where he gave himself the new nickname of \"The Final Boss\" and issued a challenge to Rhodes and Seth Rollins; if they beat him and Reigns in a tag team match at WrestleMania Night 1, Rhodes' championship match against Reigns on Night 2 will be free of interference from The Bloodline, but if Rhodes and Rollins lose, the championship match will be contested under Bloodline Rules. During the 2024 WWE Hall of Fame, The Rock received a \"People's Championship\" from Lonnie Ali.  In the Night 1 main event of WrestleMania XL, The Rock and Reigns went on to defeat Rhodes and Rollins in a tag team match. The Rock appeared during the Night 2 main event of WrestleMania XL between Roman Reigns and Cody Rhodes where he performed a Rock Bottom on John Cena. Afterwards, The Undertaker appeared and took out The Rock with a chokeslam. The following night, on the Raw after WrestleMania in Philadelphia, The Rock interrupted Rhodes's celebration stating that even though he has to leave for a bit, once he returns he plans on coming for him."}, {"text": "== Mainstream crossover ==The Rock appeared on Wyclef Jean's 2000 single \"It Doesn't Matter\" and in its music video. He also recorded \"Pie\" with Slick Rick for WWF The Music, Vol. 5. In 1999, Johnson appeared on That '70s Show as his father Rocky Johnson. The next year, he was on Star Trek: Voyager as an alien wrestler who used the Rock's moves. In 2000, he hosted Saturday Night Live (SNL) for the first time. Fellow wrestlers Triple H, Big Show, and Mick Foley also appeared on the show. Johnson has said the success of that episode is the reason he began receiving offers from Hollywood studios. He has since hosted SNL four more times."}, {"text": "== Mainstream crossover ==In 1999, the Rock was listed No. 1 on Entertainment Weekly's Top 12 Entertainers of the Year. In 2000, Access Hollywood ranked him No. 1 in their list of the Top 10 Celebrities of 2000. That year, Rock was also listed in the Forbes Celebrity 100 and People Magazine's 25 Most Intriguing People. The Rock was listed on Entertainment Weekly's 101 Most Influential People in both 2000 and 2001. In 2001, he was also listed on E!'s 20 Top Entertainers. In 2002, the Rock was listed on E!'s 25 Toughest Stars. In 2003, he was listed in VH1's 200 Greatest Pop Culture Icons and was No. 7 in People Magazine's 50 Favorite TV Stars."}, {"text": "== Mainstream crossover ==The Rock made a surprise appearance at the official Xbox unveiling during Bill Gates's keynote speech at the ongoing Computer Electronics Show in 2001. Johnson's motion picture debut was as The Scorpion King in The Mummy Returns (2001). The movie broke a two-year record for the highest-grossing single day in film history by earning $28,594,667. The movie's financial success led to Johnson's first leading role in the spin-off The Scorpion King (2002). He received $5.5 million for the role and Guinness World Records named him the record-holder for highest-paid actor in their first leading role."}, {"text": "== Mainstream crossover ==The Rock has appeared on the covers of many magazines, including Rolling Stone, Entertainment Weekly, and TV Guide. He has also appeared in, and been the cover athlete for, several video games. As of November 2021, his Instagram account is the fourth most-followed in the world, with over 280 million followers."}, {"text": "== Legacy in professional wrestling ==The Rock has been listed as one of the all-time greatest professional wrestlers, as well as one of the top draws in wrestling history. Many have placed the Rock on their \"Mount Rushmore of Pro Wrestling\", including Hulk Hogan, Ric Flair, and John Cena. In Cable Visions: Television Beyond Broadcasting, the Rock was described as \"for a long time, the WWE's biggest star and probably held the greatest international appeal\". R. D. Reynolds stated in his book The WrestleCrap Book of Lists that the Rock was \"the biggest star for WWE from 1999 until 2004\". The Rock's \"I quit\" match with Mankind at the 1999 Royal Rumble event is infamous for its brutality and one of the most popular \"I quit\" match of all times."}, {"text": "== Legacy in professional wrestling ==The Rock main-evented the most bought pay-per-view worldwide in WWE history (WrestleMania XXVIII), the most bought pay-per-view domestically in WWE history (WrestleMania X-Seven), the highest rated Raw in history, the highest rated SmackDown in history, and was part of the highest rated cable segment in WWE history with Mankind entitled \"This is Your Life\", in which Mankind would honor The Rock with various gifts and reunions. His return in 2001 had a 7.1 rating, the highest-rated segment of the year. The Rock was also part of the highest-rated match of the 21st century when his WWF Championship defense against Shane McMahon, on May 1, 2000, got an 8.3 rating, making it the highest-rated segment of all time, behind \"This Is Your Life\". In 2011, the Rock's return to an episode of Raw generated an average of 4.7 million viewers in the United States, with 7.4 million tuning in during his promo. Raw 1000 was the highest rated Raw episode of 2012 and his segment with CM Punk and Daniel Bryan was the highest rated segment of the show. In 2013, the night after the Rock won the WWE Championship for the first time in over a decade, at Royal Rumble, Raw got its highest rating of that year."}, {"text": "== Legacy in professional wrestling ==Derived from one of his catchphrases \"lay the smackdown\", WWE introduced in 1999 its second flagship program, WWE SmackDown, which became television's second longest-running weekly episodic program in history. The term \"smackdown\" was included in Merriam-Webster dictionaries in 2007. He is also known for popularizing the term \"jabroni\", derived from \"jobber\", although it was originally introduced by The Iron Sheik. The Rock holds the record for most Raw shows main-evented in one year (38 in 2000), most SmackDown shows main-evented in one year (36 in 2000), and is tied with Stone Cold Steve Austin (in 2001) for most PPV shows main evented in one year (12 in 2000)."}, {"text": "== Legacy in professional wrestling ==At the 2021 Survivor Series, WWE held a 25-man Battle Royal to celebrate the 25th Anniversary of the Rock's WWE debut.  The match was won by Omos."}, {"text": "=== Career beginnings (1999–2010) ===Johnson entered Hollywood and the film industry, becoming a star initially through his wrestling popularity and noted work ethic. Over his acting career, he became one of the highest-paid and most successful actors in Hollywood. He began his acting career on television while wrestling. In his first television acting job, in 1999, he played his father in an episode of That '70s Show called \"That Wrestling Show\". Nearly a year later, he appeared in the Star Trek: Voyager episode \"Tsunkatse\" as an alien wrestler who fought popular character Seven of Nine. While Johnson was away from WWE, the company continued to sell \"The Rock\" merchandise, and he continued to be featured prominently in the opening montages of their television shows."}, {"text": "=== Career beginnings (1999–2010) ===Johnson began his film career in earnest with roles in The Mummy Returns (2001), The Scorpion King (2002), The Rundown (2003), and Walking Tall (2004). He had a supporting role in Be Cool (2005) as a bodyguard hoping to become an actor, and was the primary antagonist in Doom (2005). He also had roles in Gridiron Gang (2006), Reno 911!: Miami (2007), and Southland Tales (2006). He played a cocky famous American football player in The Game Plan (2007), Agent 23 in Get Smart (2008), a cab driver in Race to Witch Mountain (2009), the title character in Tooth Fairy (2010) and a police officer in The Other Guys (2010). He presented the Academy Award for Best Visual Effects at the 80th Academy Awards."}, {"text": "=== Commercial success (2011–2020) ===Johnson's first big box-office success came in 2011, portraying Luke Hobbs in Fast Five (2011); the film became the seventh highest-grossing film of 2011. He also starred in the box office hit Journey 2: The Mysterious Island in 2012. He became known for reinvigorating film franchises after portraying Marvin F. Hinton / Roadblock in G.I. Joe: Retaliation and reprising his role as Luke Hobbs in Fast & Furious 6 (2013), while also starring in true-story films Pain & Gain (2013) and Empire State (2013). That same year, he hosted and produced the TNT reality competition series The Hero, and won the Favorite Male Buttkicker Award at the 2013 Nickelodeon Kid's Choice Awards. In May 2013, it was announced that he would executive produce and star in Ballers, an HBO comedy-drama series about NFL players living in Miami. By December of that year, Forbes named him the top-grossing actor of 2013, with his films bringing in $1.3 billion worldwide for the year. Forbes credited the success of Fast & Furious 6, which grossed $789 million globally, and his frequent acting work as primary reasons for topping the list."}, {"text": "=== Commercial success (2011–2020) ===Johnson starred as the title character in Hercules in 2014 and hosted another reality series for TNT that same year, entitled Wake Up Call, which saw him \"lending a helping hand to everyday people who were facing enormous challenges in their lives\" alongside guest experts such as Rocco DiSpirito, Jillian Michaels, and Josh Shipp. In 2015, Johnson reprised his role as Luke Hobbs in Furious 7 and starred in the disaster film San Andreas. In 2016, he co-starred with Kevin Hart in the action-comedy Central Intelligence and had a lead voice role in the Disney animated film Moana, in which he voiced the Polynesian demigod Maui. He reprised his role as Luke Hobbs in The Fate of the Furious, which was released in 2017. Johnson starred in two other blockbuster movies that year, Baywatch and Jumanji: Welcome to the Jungle as Mitchell \"Mitch\" Buchannon and Dr. Smolder Bravestone, respectively. In 2018, he starred in the action films Rampage and Skyscraper."}, {"text": "=== Commercial success (2011–2020) ===Johnson's role within the Fast & Furious franchise continued with Fast & Furious Presents: Hobbs & Shaw, starring alongside co-star Jason Statham. David Leitch directed the project from a script co-written by franchise-writer Chris Morgan and Drew Pearce. The film began principal photography in September 2018, and was released on July 26, 2019. Johnson will reprise his role in Hobbs & Shaw 2 after not appearing in F9 and also not returning in Fast X or Fast & Furious 11. In May 2023, it was reported that he would make a cameo appearance during a post-credits scene of Fast X. Johnson reprised his role as Bravestone, in Jumanji: The Next Level. With the critical and financial success of Welcome to the Jungle, production of the movie began in early 2019, and it was released on December 13, 2019."}, {"text": "=== Streaming ventures (2021–present) ===In 2021, Johnson co-starred with Emily Blunt in Disney's Jungle Cruise as Frank Wolff. The film is based on the theme-park ride of the same name. Jaume Collet-Serra directed, with a script by Michael Green from a previous one by J. D. Payne and Patrick McKay. In addition to his work on the film, Johnson assisted with re-designing the titular ride for all Disney theme parks. Jungle Cruise was released on July 30, 2021. Also in 2021, Johnson starred in Netflix's film Red Notice, written and directed by Rawson Marshall Thurber. It is the third time that the two collaborated, after Central Intelligence and Skyscraper. It co-stars Gal Gadot and Ryan Reynolds."}, {"text": "=== Streaming ventures (2021–present) ===Johnson is noted for his busy schedule and developing multiple projects at once. A sequel to the box-office hit San Andreas was announced to be in the pre-production stage with the director of the first film, Brad Peyton, returning as director along with the main cast (marking the fourth collaboration between the two following Journey 2, San Andreas, and Rampage). On November 14, 2019, he announced a December 2021 release date for the standalone Black Adam film. Production on Black Adam began filming in April 2021 and was released on October 21, 2022. He earned $22.5 million to star in the film and received millions more for producing and promoting it on social media."}, {"text": "=== Streaming ventures (2021–present) ===Johnson has been a member of the Academy of Motion Picture Arts and Sciences in the Actor's Branch since 2017. In 2024, he presented an award alongside Bad Bunny. On March 16, 2021, he appeared for the first time as The Foundation in Fortnite Battle Royale. Johnson was initially uncredited in his role, yet teased his involvement in a cryptic Instagram post shared on the day of the event. Following another Instagram video for Johnson's ZOA Energy drink, in which The Foundation's helmet and sidearm were subtly featured in the background, his involvement was finally confirmed during the Chapter 2 End Event on December 4, 2021, with The Foundation removing his helmet to reveal that he shared Johnson's voice and likeness. In May 2023, Johnson reprised his role as Luke Hobbs in a cameo appearance during the mid-credits scene of Fast X."}, {"text": "== Producer ==In 2012, Johnson founded his production company Seven Bucks Productions. Though originally attached as producer and star, Johnson will now serve solely as the former on a film adaptation of The Janson Directive. John Cena will fill the leading role, with Akiva Goldsman attached as screenwriter. Additionally, he will produce and star in a Netflix exclusive film titled John Henry & The Statesmen, as the titular folklore hero. The film will be directed by Jake Kasdan, from a script by Kasdan and Tom Wheeler. With the first official teaser trailer released in October 2018, the project marks Kasdan's and Johnson's third collaboration, after Jumanji: Welcome to the Jungle and Jumanji: The Next Level."}, {"text": "== Producer ==In 2019, Johnson produced and appeared as himself in Fighting with My Family, a comedy drama about Paige and her family, who are also professional wrestlers. Johnson will co-produce and star in The King, a film about king Kamehameha Kūnuiākea, founder and first ruler of the Kingdom of Hawaiʻi. The project will be directed by Robert Zemeckis from a script by Randall Wallace. The movie will be comparable to Braveheart in tone, given Wallace's work on both films, and will depict the king's role in resolving the wars among the islands of Hawaiʻi. The King was scheduled to begin production in 2020, but was halted by the COVID-19 pandemic. Johnson is also attached to produce/star in a sequel to Big Trouble in Little China, as well as project under development with Shane Black focusing on a new interpretation of Doc Savage."}, {"text": "== Producer ==In 2021, his biographical comedy-drama series Young Rock began airing on NBC. A film centered around Teth-Adam/Black Adam, a part of the DC Extended Universe, was announced to be in development in January 2017. Originally cast in the role as early as September 2014 as the antagonist, in a film centered around the superhero Billy Batson/Shazam, his villainous role for Shazam! was reworked into two separate films. Johnson did not appear in Shazam!, but he served as a producer and his likeness was used through special effects in flashback scenes."}, {"text": "== Business career ==In March 2020, Johnson launched Teremana Tequila, which sold 600,000 nine-litre cases in its first year."}, {"text": "== Business career ==In August 2020, Johnson along with several partners and investors—including RedBird Capital Partners—purchased the XFL for $15 million. Within months, Johnson announced plans for the relaunch of the league in spring 2022. While the launch was delayed a year, the first games of 2023 kicked off on time. After a successful 2023 season, the XFL and United States Football League announced their intent to merge into a single league. On December 31, 2023, it was announced that the new merged league would be called the United Football League (UFL). The league would feature 8 teams and start on March 30, 2024. Johnson, along with Dany Garcia, and RedBird Capital Partners own 50% of the UFL together under XFL Properties LLC."}, {"text": "== Business career ==On January 23, 2024, Johnson joined the TKO Group Holdings board of directors. In the process, he obtained full ownership over his trademarked name \"The Rock\", which was owned by WWE. As part of the settlement, Johnson signed a new services and merchandising agreement with WWE."}, {"text": "== Other work ==In 2000, Johnson published his autobiography, The Rock Says..., co-written with Joe Layden. It debuted at No. 1 on The New York Times Best Seller list and remained on the list for several weeks. In 2013, Johnson hosted and produced the TNT reality competition series The Hero. In 2014, he hosted another TNT reality series, Wake Up Call. In 2019, Johnson started hosting the NBC competition series The Titan Games."}, {"text": "== Other work ==In March 2016, Johnson partnered with American fitness apparel manufacturer Under Armour to release \"Project Rock\". The first item in his partnership with Under Armour, a gym bag, sold out in a couple of days. His second item, a black T-shirt sporting his signature \"Brahma bull\", sold out after being worn at WrestleMania 32. Johnson also released an alarm clock app as part of \"Project Rock\" that received more than one million downloads in its first week of release. Since then, they have released sneakers, headphones, and other apparel."}, {"text": "== Other work ==In 2016, Johnson started his YouTube channel. His first video, The YouTube Factory, featured online personality Lilly Singh and several other internet stars. In 2019, Johnson announced he would launch a competitive bodybuilding show, \"Athleticon\", with his business partner and ex-wife Dany Garcia. It is set to rival other long-standing bodybuilding shows such as The Arnold Classic and Joe Weider's Mr. Olympia. The show was set to debut in October 2020 in Atlanta, Georgia, but plans were disrupted by the COVID-19 pandemic."}, {"text": "== Other work ==A fan of the rapper Tech N9ne, Johnson is featured on the song \"Face Off\" from the rapper's 2021 album Asin9ne."}, {"text": "== Activism and philanthropy ==Johnson attended the 2000 Democratic National Convention, which was part of WWE's non-partisan \"Smackdown Your Vote\" campaign aiming to influence young people to vote. He also had a speaking role at the 2000 Republican National Convention."}, {"text": "== Activism and philanthropy ==Johnson voted for Barack Obama in the 2008 and 2012 presidential elections. He did not vote in the 2016 presidential election, and is an independent voter as of 2017. He endorsed Joe Biden in the 2020 presidential election, though later stated that he regretted the decision, due to it causing \"division\", and refused to endorse anyone for the approaching 2024 presidential election. Johnson has expressed interest in running for president himself, telling USA Today in February 2021, \"I would consider a presidential run in the future if that's what the people wanted.\" Following an online public opinion poll that found that 46% of Americans would consider voting for Johnson in a presidential election, he said in an April 12, 2021, interview on Today, \"I do have that goal to unite our country and I also feel that if this is what the people want, then I will do that.\""}, {"text": "== Activism and philanthropy ==In 2006, Johnson founded the Dwayne Johnson Rock Foundation, a charity working with at-risk and terminally ill children. On October 2, 2007, he and his then wife, Dany Garcia, donated $1 million to the University of Miami to support the renovation of its football facilities. The university renamed the Hurricanes' locker room in Johnson's honor. In 2015, Johnson donated $1,500 to a GoFundMe to pay for an abandoned dog's surgery. In 2017, he donated $25,000 to Hurricane Harvey relief efforts. In 2018, Johnson donated a gym to a military base in Oahu, Hawaii. After the 2018 Hawaii floods, he worked with Malama Kauai, a nonprofit organization, to help repair flood damage. Johnson has also worked with Make-A-Wish Foundation on a number of occasions."}, {"text": "== Activism and philanthropy ==In July 2023, Johnson made a seven-figure donation to the SAG-AFTRA Foundation during the 2023 SAG-AFTRA strike, which foundation president Courtney B. Vance cited to be \"the largest single donation that (the foundation) has ever received from one individual at one time\"."}, {"text": "== Personal life ==Johnson first met Dany Garcia when they were both University of Miami students in the early 1990s. They married on May 3, 1997. She is a businesswoman, International Fitness and Bodybuilding Federation professional bodybuilder, and producer. They have one child, Simone, a daughter, who was born August 14, 2001, in Davie, Florida."}, {"text": "== Personal life ==In 2003, Johnson got a partial Samoan Peʻa tattoo on his left side. In August 2004, in recognition of his service to the Samoan people, and because he is a descendant of Samoan chiefs, Johnson was given the noble title Seiuli, meaning the son of Malietoa [Alo o Malietoa], by Malietoa Tanumafili II during his visit there."}, {"text": "== Personal life ==On June 1, 2007, Johnson and Garcia announced they were separating amicably."}, {"text": "== Personal life ==In 2007, Johnson began dating Lauren Hashian, the daughter of Boston drummer Sib Hashian. They met in 2006 while Johnson was filming The Game Plan."}, {"text": "== Personal life ==In May 2008, his divorce to Garcia was finalized."}, {"text": "== Personal life ==In 2009, Johnson obtained Canadian citizenship through his father's birth and citizenship there. In 2017, he had the small \"Brahma bull\" tattoo on his right arm covered with a larger half-sleeve tattoo of a bull's skull."}, {"text": "== Personal life ==On August 18, 2019, Johnson and Hashian married in Hawaii. They have two daughters, Jasmine and Tiana, and live in Los Angeles. They also maintain a farm in Virginia and a home in Southwest Ranches, Florida."}, {"text": "== Personal life ==In February 2020, WWE announced that Johnson's daughter Simone had started training at the WWE Performance Center, making her the first fourth-generation WWE wrestler. On May 16, Johnson announced she had signed a contract with WWE, and in May 2022 announced that her ring name would be Ava Raine. She has since been appearing on the NXT brand."}, {"text": "== Personal life ==Johnson is a supporter of the Samoa national rugby league team, and publicly pledged his support to the team during the 2021 Rugby League World Cup when the team made the finals for the first time."}, {"text": "== Championships and accomplishments ==Pro Wrestling Illustrated"}, {"text": "== Championships and accomplishments ==Match of the Year (1999) vs. Mankind in an \"I Quit\" match at Royal Rumble"}, {"text": "== Championships and accomplishments ==Match of the Year (2002) vs. Hollywood Hulk Hogan at WrestleMania X8"}, {"text": "== Championships and accomplishments ==Most Popular Wrestler of the Year (1999, 2000)"}, {"text": "== Championships and accomplishments ==Wrestler of the Year (2000)"}, {"text": "== Championships and accomplishments ==Ranked No. 2 of the top 500 singles wrestlers in the PWI 500 in 2000"}, {"text": "== Championships and accomplishments ==United States Wrestling Association"}, {"text": "== Championships and accomplishments ==USWA World Tag Team Championship (2 times) – with Bart Sawyer"}, {"text": "== Championships and accomplishments ==Wrestling Observer Newsletter"}, {"text": "== Championships and accomplishments ==Best Box Office Draw (2000, 2011, 2012)"}, {"text": "== Championships and accomplishments ==Best Gimmick (1999)"}, {"text": "== Championships and accomplishments ==Best on Interviews (1999, 2000)"}, {"text": "== Championships and accomplishments ==Most Charismatic (1999–2002, 2011, 2012)"}, {"text": "== Championships and accomplishments ==Most Improved (1998)"}, {"text": "== Championships and accomplishments ==Wrestling Observer Newsletter Hall of Fame (Class of 2007)"}, {"text": "== Championships and accomplishments ==WWE/World Wrestling Entertainment/Federation"}, {"text": "== Championships and accomplishments ==WWE Championship (8 times)"}, {"text": "== Championships and accomplishments ==WCW Championship (2 times)"}, {"text": "== Championships and accomplishments ==WWF Intercontinental Championship (2 times)"}, {"text": "== Championships and accomplishments ==WWF Tag Team Championship (5 times) – with Mankind (3), The Undertaker (1), and Chris Jericho (1)"}, {"text": "== Championships and accomplishments ==Royal Rumble (2000)"}, {"text": "== Championships and accomplishments ==Sixth Triple Crown Champion"}, {"text": "== Championships and accomplishments ==Deadly Games WWF Championship Tournament (1998)"}, {"text": "== Championships and accomplishments ==Slammy Award (10 times)"}, {"text": "== Championships and accomplishments ==Best Actor (2014)"}, {"text": "== Championships and accomplishments ==Game Changer of the Year (2011) – with John Cena"}, {"text": "== Championships and accomplishments ==Guess Who's Back or: Return of the Year (2011)"}, {"text": "== Championships and accomplishments ==LOL! Moment of the Year (2012, 2013) – insulting John Cena using the history of Boston, Massachusetts, Rock Concert on the 20th anniversary episode of Raw"}, {"text": "== Championships and accomplishments ==Match of the Year (2013) – vs. John Cena for the WWE Championship at WrestleMania 29"}, {"text": "== Championships and accomplishments ==New Sensation (1997)"}, {"text": "== Championships and accomplishments ==\"Tell Me You Didn't Just Say That\" Insult of the Year (2014) – insulting Rusev and Lana"}, {"text": "== Championships and accomplishments ==\"This is Awesome\" Moment of the Year (2015) – with Ronda Rousey"}, {"text": "== Championships and accomplishments ==Trash Talker of the Year (2024)"}, {"text": "== External links ==Dwayne Johnson at IMDb"}, {"text": "== External links ==The Rock at Twitter"}, {"text": "== External links ==The Rock on WWE.com"}, {"text": "== External links ==Dwayne Johnson's profile at Cagematch.net , Wrestlingdata.com , Internet Wrestling Database "}, {"text": "== External links ==Dwayne Johnson profile at Miami Hurricanes football"}]