[{"text": "Elizabeth Jane Hurley (born 10 June 1965) is a British actress and model."}, {"text": "As an actress, Hurley's best-known film roles have been as Vanessa Kensington in Austin Powers: International Man of Mystery (1997) and as the Devil in Bedazzled (2000). Hurley's television roles include the E! original series The Royals (2015–2018) and portraying Morgan le Fay in Runaways (2019), based on the Marvel Comics series of the same name. She portrayed Diana Payne on the fifth season of The CW's original series Gossip Girl (2011). "}, {"text": "Hurley's first role in a big budget film was in Passenger 57 (1992). In 1994, Hurley accompanied Hugh Grant to the London premiere of his film Four Weddings and a Funeral, in a plunging black Versace dress held together with gold safety pins, which gained her instant media attention.Hurley has been associated with the cosmetics company Estée Lauder since the company gave Hurley her first modelling job at the age of 29. They have featured her as a representative and model for their products, especially perfumes such as Sensuous, Intuition, and Pleasures, since 1995. Hurley owns a beachwear line."}, {"text": "== Early life ==Elizabeth Hurley was born on 10 June 1965 in Basingstoke, Hampshire, as the younger daughter of Angela Mary (née Titt) and Roy Leonard Hurley. Her father was a major in the Royal Army Educational Corps; her mother was a teacher at Kempshott Junior School. She has an older sister, Kate, and a younger brother, Michael.Hurley attended Harriet Costello School, a mixed secondary in Basingstoke, and, while in her teens, she became involved with punk fashion, dyeing her hair pink and piercing her nose. \"When I was 16 – this was about 1981, 1982 – the thing to be in Basingstoke, the suburb I grew up in, was punk,\" she explained. She reportedly associated with New Age travellers in her youth. Aspiring to be a dancer as a young girl, she enrolled in ballet classes. Hurley continued in the sixth form and took A-levels in English, Sociology and Psychology in 1983 before spending three years studying dance and theatre at the London Studio Centre. She was expelled from the school in 1986."}, {"text": "=== Film ===Hurley made her first film appearance in Aria (1987). She subsequently appeared in the movies Passenger 57, EDtv, Bedazzled,  Serving Sara and Dangerous Ground. In 1997, she co-starred with Mike Myers in the spy spoof Austin Powers: International Man of Mystery.When Hugh Grant founded and became the director of Simian Films in 1994, Hurley was credited as one of the producers for the company's two Grant vehicles, Extreme Measures (1996) and Mickey Blue Eyes (1999). In 2000, she was publicly criticised for breaking a five-month acting strike to film an Estée Lauder advertisement, for which she was fined $100,000 (£70,000 in 2000) by the Screen Actors Guild and labelled \"Elizabeth Scably\" by protestors."}, {"text": "=== Television ===In 1988, Hurley appeared briefly in a speaking part as a schoolgirl in \"Last Seen Wearing\", an episode of the detective series Inspector Morse, which was partly filmed at Reading Blue Coat School, Sonning, Berkshire. In the same year she played Rosie Japhet in an episode of  Rumpole of the Bailey (\"Rumpole and the Barrow Boy\"). In late 1988, Hurley portrayed the title character in a four-part television drama, Christabel. After appearing in John Cleese's The Human Face (2001), she hosted the inaugural series of the British reality show Project Catwalk on Sky 1 in 2006. Hurley was criticised as a presenter by Marcelle D'Argy Smith, a former editor of Cosmopolitan magazine, who said: \"Liz Hurley has no fashion experience whatsoever. She wore a dress and has appeared at premieres.\" GQ's Dylan Jones defended her as someone \"immersed in the fashion world as a celebrity.\" She was dropped after one series because her bosses reportedly believed she was too wooden.In 2011, Hurley filmed a guest star role in the series pilot of NBC's Wonder Woman as the villain Veronica Cale. The network decided not to pick up the series. In July 2011, it was announced that Hurley would join the fifth season of Gossip Girl for a multi-episode arc. Her character, Diana Payne, was described by the series' executive producers as \"a sexy, smart, self-made media mogul and all-around force to be reckoned with\", whose \"entrance on the Upper East Side will change the lives of all our characters—including, and especially, Gossip Girl herself.\" In September 2013, she was cast in one of E!'s first two scripted pilots, The Royals, which was picked up in March 2014 and aired in 2015. The drama series, revolving around a fictional British Royal Family and set in modern London, stars Hurley as the matriarch Queen Helena. Hurley played Marvel Comics villain Morgan le Fay in the final season of the Hulu show Runaways, released in 2019. In January 2021, Hurley appeared as a guest judge in the first episode of the second series of RuPaul's Drag Race UK."}, {"text": "=== Fashion ===In 1995, Hurley was introduced as an Estée Lauder spokesmodel. She later recounted, \"I was far from an ingénue, having had my first modelling job at 29.\" Hurley has featured in ads for Lauder's 'Pleasures', 'Beautiful', 'Dazzling', 'Tuscany per Donna', and 'Sensuous' fragrances as well as participated in campaigns for the company's other cosmetics. She was replaced as the face of Estée Lauder by Carolyn Murphy in 2001. She continues to work with the company non-exclusively, signing a contract for the 16th year with Lauder in 2010. In 2005, she modelled for Saloni, Liverpool Department Stores of Mexico, and Lancel. She was part of the seasonal advertising campaigns for Jordache, Shiatzy Chen, Got Milk?, Patrick Cox, MQ Clothiers of Sweden, and Lancel in 2006 and Monsoon in 2007. In 2008, Hurley was unveiled as the seasonal campaign face for Blackglama mink. Hurley has appeared three times on the cover of British Vogue. She is signed to TESS Management in London.In April 2005, Elizabeth Hurley Beach, her beachwear line that she models every summer, was launched at Harrods in the UK. It debuted later that year in select Saks Fifth Avenue stores in the United States and other European countries. In May 2008, Hurley designed and modelled a capsule collection of 12 swimsuits for the Spanish clothing brand Mango."}, {"text": "== Charity ==Hurley has been active in Estée Lauder's breast cancer awareness campaign, as part of which the company created an \"Elizabeth Pink\" lipstick whose sales benefit the Breast Cancer Research Foundation. Hurley's grandmother died of breast cancer.Hurley supported The Prince's Trust by co-presenting the 2003 Fashion Rocks event in its aid and helping launch the Get Into Cooking youth initiative in 2004. She has helped raise funds for End Hunger Network, ARK children's charity, and the Shaukat Khanum Memorial Cancer Hospital & Research Centre.She is a patron of the Elton John AIDS Foundation. She is a patron of the City Veterans Network, a charity based in the City of London that links former members of the Armed Forces to opportunities for rehabilitation and employment."}, {"text": "== Politics ==In June 2016, Hurley expressed her support for the United Kingdom leaving the European Union and urged the public to vote in the 2016 European Union membership referendum."}, {"text": "== Personal life ==Hurley was a relatively unknown actress when she met Hugh Grant in 1987 while working on a Spanish production called Remando Al Viento. In the 1990s, Hurley became known mostly as Grant's girlfriend.In 1994, as Grant became the focus of international media attention due to the success of his film Four Weddings and a Funeral, Hurley accompanied him to the film's London premiere in a black Versace dress, which gained her instant media attention.While dating Hurley, Grant gained notoriety for soliciting the services of a sex worker in 1995. Hurley stood by Grant and accompanied him to the premiere of his film Nine Months. After thirteen years together, Hurley and Grant announced an \"amicable\" split in May 2000.On 4 April 2002, Hurley gave birth to a son, Damian Charles Hurley. The baby's father, American businessman Steve Bing, denied paternity by claiming that he and Hurley had a brief, non-exclusive relationship in 2001. A DNA test established Bing as Damian's father. Grant is one of Damian's godfathers.  Hurley is godmother to Patsy Kensit's and Liam Gallagher's son Lennon and two of David and Victoria Beckham's sons Brooklyn and Romeo.In late 2002, Hurley began dating Indian businessperson Arun Nayar. They married in 2007. Hurley lived on a 400-acre (1.6 km2) organic farm in Barnsley, Gloucestershire, with her son and husband.In December 2010, Hurley announced that she and Nayar had separated several months earlier. Hurley filed for divorce on 2 April 2011, citing Nayar's \"unreasonable behaviour\" as the cause, grounds for divorce under English law. The divorce was granted on 15 June 2011."}, {"text": "== Personal life ==In late 2011, three months after her divorce, Hurley became engaged to Shane Warne, a former Australian cricketer. In 2012, Hurley and Warne bought the Grade II–listed mansion Donnington Hall, near Ledbury, Herefordshire, as their main home. In December 2013, Hello magazine reported that the couple had decided to split. Warne died on 4 March 2022. Hurley paid tribute to her ex-fiancé.In March 2018, her nephew Miles Hurley was stabbed repeatedly in the back by a group of men in Wandsworth, south London."}, {"text": "=== Theatre ===The Cherry Orchard – A Jubilee (Russian & Soviet Arts Festival)"}, {"text": "=== Theatre ===The Man Most Likely To (Middle East tour)"}, {"text": "== External links ==Elizabeth Hurley at IMDb"}, {"text": "== External links ==Elizabeth Hurley at Fashion Model Directory "}, {"text": "== External links ==Elizabeth Hurley on Instagram"}, {"text": "== External links ==Elizabeth Hurley on Twitter"}]