[{"text": "Robert Craig Knievel (October 17, 1938 – November 30, 2007), known professionally as Evel Knievel (), was an American stunt performer and entertainer. Throughout his career, he attempted more than 75 ramp-to-ramp motorcycle jumps. Knievel was inducted into the Motorcycle Hall of Fame in 1999. He died of pulmonary disease in Clearwater, Florida, in 2007, aged 69."}, {"text": "Evel Knievel was born in Butte, Montana. Raised by his paternal grandparents, Knievel was inspired to become a motorcycle daredevil after attending a Joie Chitwood auto daredevil show. He left high school early to work in the copper mines but was later fired for causing a city-wide power outage. After adopting the nickname \"Evel Knievel\", he participated in rodeos and ski jumping events, and served in the U.S. Army before marrying Linda Joan Bork and starting a semi-pro hockey team. To support his family, Knievel started the Sur-Kill Guide Service and later worked as an insurance salesman. Eventually, he opened a Honda motorcycle dealership in Washington, but faced difficulties promoting Japanese imports. After the dealership closed, Knievel worked at a motorcycle shop where he learned motocross stunts that would later contribute to his daredevil career."}, {"text": "Knievel's most famous stunt was an attempt to jump the fountains at Caesars Palace, which resulted in severe injuries. Despite never successfully jumping the Grand Canyon, Knievel became a legendary figure, breaking numerous records and suffering hundreds of bone fractures throughout his career."}, {"text": "On September 8, 1974, Knievel attempted to jump across the Snake River Canyon in Idaho using a rocket-powered cycle called the Skycycle X-2. The jump failed due to a parachute malfunction, but Knievel survived with minor injuries."}, {"text": "Knievel sought to profit from his image through endorsements and marketing deals. American Eagle Motorcycles signed him, and his popularity grew with young boys. From 1972 to 1977, Ideal Toy Company sold over $125 million worth of Knievel toys. Knievel's fame led to TV appearances and partnerships with companies like AMF and Harley-Davidson. However, after an assault conviction and jail time, he lost endorsements and declared bankruptcy. Despite a decline in his daredevil career, Knievel made a marketing comeback in the 1990s and continued to be involved in various ventures."}, {"text": "Knievel died on November 30, 2007, at the age of 69 due to diabetes and idiopathic pulmonary fibrosis. He was buried in his hometown of Butte, Montana. Posthumously, Knievel has been honored through various exhibits, a museum, and tribute jumps. His legacy also lives on in television commercials featuring his iconic stunts."}, {"text": "== Early life ==Knievel was born on October 17, 1938, in Butte, Montana, the first of two children of Robert E. and Ann Marie Keough Knievel. His surname is of German origin; his paternal great-great-grandparents emigrated to the United States from Germany.  His mother was of Irish ancestry. Robert and Ann divorced in 1940, after the 1939 birth of their second child, Nicolas, known as Nic. Both parents decided to leave Butte."}, {"text": "== Early life ==Knievel and his brother were raised in Butte by their paternal grandparents, Ignatius and Emma Knievel. At the age of eight, Knievel attended a Joie Chitwood auto daredevil show, which he credited for his later career choice as a motorcycle daredevil. "}, {"text": "== Early life ==Knievel was a cousin of Democratic U.S. Representative from Montana, Pat Williams (b. 1937).: 38 "}, {"text": "== Early life ==Knievel left Butte High School after his sophomore year and got a job in the copper mines as a diamond drill operator with the Anaconda Mining Company, but he preferred motorbiking to what he called \"unimportant stuff\". He was promoted to surface duty, where he drove a large earth mover. Knievel was fired when he made the earth mover do a motorcycle-type wheelie and accidentally drove it into Butte's main power line, leaving the city without electricity for several hours."}, {"text": "== Early life ==Knievel's website says that he chose his nickname after spending a night in jail in 1956 after being arrested for reckless driving. In the same jail that night was a man named William Knofel, who had the nickname “Awful Knofel”; this led to Knievel being referred to as “Evel Knievel”."}, {"text": "== Early life ==Seeking new thrills and challenges, Knievel participated in local professional rodeos and ski jumping events, including winning the Northern Rocky Mountain Ski Association Class A Men's ski jumping championship in 1959. During the late 1950s, Knievel joined the United States Army. His athletic ability allowed him to join the track team, where he was a pole vaulter. After his army stint, Knievel returned to Butte, where he met and married his first wife, Linda Joan Bork. Shortly after getting married, Knievel started the Butte Bombers, a semi-pro hockey team.: 21 "}, {"text": "== Early life ==To help promote his team and earn some money, he convinced the Czechoslovakian Olympic ice hockey team to play the Butte Bombers in a warm-up game to the 1960 Winter Olympics (to be held in California). Knievel was ejected from the game minutes into the third period and left the stadium. When the Czechoslovakian officials went to the box office to collect the expense money that the team was promised, workers discovered the game receipts had been stolen. The United States Olympic Committee ended up paying the Czechoslovakian team's expenses to avoid an international incident.: 21–22  Knievel tried out with the Charlotte Clippers of the Eastern Hockey League in 1959, but decided that a traveling team was not for him."}, {"text": "== Early life ==After the birth of his first son, Kelly, Knievel realized that he needed to come up with a new way to support his family financially. Using the hunting and fishing skills taught to him by his grandfather, Knievel started the Sur-Kill Guide Service. He guaranteed that if a hunter employed his service and paid his fee, he would get the big game animal desired or Knievel would refund his fee."}, {"text": "== Early life ==Knievel, after learning about the culling of elk in Yellowstone, decided to hitchhike from Butte to Washington, D.C., in December 1961 to raise awareness and to have the elk relocated to areas where hunting was permitted. After this conspicuous trek (he hitchhiked with a 54-inch-wide (1.4-meter) rack of elk antlers and a petition with 3,000 signatures), he presented his case to Representative Arnold Olsen, Senator Mike Mansfield, and Interior Secretary Stewart Udall. Culling was stopped in the late 1960s."}, {"text": "== Early life ==After returning home to the west from Washington, D.C., he joined the motocross circuit and had moderate success, but he still could not make enough money to support his family. In 1962, Knievel broke his collarbone and shoulder in a motocross accident. The doctors said he could not race for at least six months. Still needing to help support his family, he again switched careers and sold insurance for the Combined Insurance Company of America, working for W. Clement Stone. Stone suggested that Knievel read Success Through a Positive Mental Attitude, a book that Stone wrote with Napoleon Hill. Knievel credited much of his later success to Stone and his book."}, {"text": "== Early life ==Knievel was successful as an insurance salesman, but felt that his efforts were being unrecognized. When the company refused to promote him to vice president after he had been a few months on the job, he quit. Wanting a new start away from Butte, Knievel moved his family to Moses Lake, Washington. There, he opened a Honda motorcycle dealership and promoted motocross racing. During the early 1960s, he and other dealers had difficulty promoting and selling Japanese imports because of the steep competition of their auto industry, and the Moses Lake Honda dealership eventually closed. After the closure, Knievel went to work for Don Pomeroy at his motorcycle shop in Sunnyside, Washington. Pomeroy's son, Jim Pomeroy, who went on to compete in the Motocross World Championship, taught Knievel how to do a wheelie and ride while standing on the seat of the bike."}, {"text": "=== Stunt performance ===As a boy, Knievel had seen the Joie Chitwood show. He decided that he could do something similar using a motorcycle. Promoting the show himself, Knievel rented the venue, wrote the press releases, set up the show, sold the tickets, and served as his own master of ceremonies. After enticing the small crowd with a few wheelies, he proceeded to jump a 20-foot-long (6.1-meter) box of rattlesnakes and two mountain lions. Despite landing short and his back wheel hitting the box containing the rattlesnakes, Knievel managed to land safely."}, {"text": "=== Stunt performance ===Knievel realized that to make a more substantial amount of money he would need to hire more performers, stunt coordinators, and other personnel so that he could concentrate on the jumps. With little money, he went looking for a sponsor and found one in Bob Blair, owner of ZDS Motors, Inc., the West Coast distributor for Berliner Motor Corporation, a distributor for Norton Motorcycles. Blair offered to provide the needed motorcycles, but he wanted the name changed from Bobby Knievel and His Motorcycle Daredevils Thrill Show to Evil Knievel and His Motorcycle Daredevils. Knievel did not want his image to be that of a Hells Angels rider, so he convinced Blair to at least allow him to use the spelling Evel instead of Evil."}, {"text": "=== Stunt performance ===Knievel and his daredevils debuted on January 3, 1966, at the National Date Festival in Indio, California. The second booking was in Hemet, California, but was canceled due to rain. The next performance was on February 10, in Barstow, California. During the performance, Knievel attempted a new stunt in which he would jump, spread-eagled, over a speeding motorcycle. Knievel jumped too late and the motorcycle hit him in the groin, tossing him 15 feet (4.6 m) into the air. He was hospitalized as a result of his injuries. When released, he returned to Barstow to finish the performance he had started almost a month earlier."}, {"text": "=== Stunt performance ===Knievel's daredevil show broke up after the Barstow performance because injuries prevented him from performing. After recovering, Knievel started traveling from small town to small town as a solo act. To get ahead of other motorcycle stunt people who were jumping animals or pools of water, Knievel started jumping cars. He began adding more and more cars to his jumps when he would return to the same venue to get people to come out and see him again. Knievel had not had a serious injury since the Barstow performance, but on June 19 in Missoula, Montana, he attempted to jump twelve cars and a cargo van. The distance he had for takeoff did not allow him to get up enough speed. His back wheel hit the top of the van while his front wheel hit the top of the landing ramp. Knievel ended up with a severely broken arm and several broken ribs. The crash and subsequent stay in the hospital were a publicity windfall."}, {"text": "=== Stunt performance ===With each successful jump, the public wanted him to jump one more car. On March 25, 1967, Knievel cleared 15 cars at Ascot Park in Gardena, California. Then he attempted the same jump on July 28, 1967, in Graham, Washington, where he had his next serious crash. Landing his cycle on the last vehicle, a panel truck, Knievel was thrown from his bike. This time he suffered a serious concussion. After a month, he recovered and returned to Graham on August 18 to finish the show; but the result was the same, only this time the injuries were more serious. Again coming up short, Knievel crashed, breaking his left wrist, right knee, and two ribs."}, {"text": "=== Stunt performance ===Knievel first received national exposure on March 18, 1968, when comedian and late-night talk show host Joey Bishop had him on as a guest of ABC's The Joey Bishop Show."}, {"text": "==== Caesars Palace ====While in Las Vegas to watch Dick Tiger successfully defend his World Boxing Association (WBA) and World Boxing Council (WBC) light heavyweight titles at the Convention Center on November 17, 1967, Knievel first saw the fountains at Caesars Palace and decided to jump them."}, {"text": "==== Caesars Palace ====To get an audience with casino CEO Jay Sarno, Knievel created a fictitious corporation called Evel Knievel Enterprises and three fictitious lawyers to make phone calls to Sarno. Knievel also placed phone calls to Sarno claiming to be from American Broadcasting Company (ABC) and Sports Illustrated inquiring about the jump. Sarno finally agreed to meet Knievel and arranged for Knievel to jump the fountains on December 31, 1967. After the deal was set, Knievel tried to get ABC to air the event live on their popular Wide World of Sports. ABC declined but said that if Knievel had the jump filmed and it was as spectacular as he said it would be, they would consider using it later."}, {"text": "==== Caesars Palace ====Knievel, at the age of 29, used his own money to have actor/director John Derek produce a film of the Caesars jump. To keep costs low, Derek employed his then-wife Linda Evans as one of the camera operators. It was Evans who filmed the famous landing. On the morning of the jump, Knievel stopped in the casino and placed his last $100 on the blackjack table (which he lost), stopped by the bar, and had a shot of Wild Turkey, and then headed outside where he was joined by several members of the Caesars staff, as well as two showgirls."}, {"text": "==== Caesars Palace ====After doing his normal pre-jump show and a few warm-up approaches, Knievel began his real approach. When he hit the takeoff ramp, he said later, he felt the motorcycle unexpectedly decelerate. The sudden loss of power on the takeoff caused Knievel to come up short and land on the safety ramp which was supported by a van. This caused the handlebars to be ripped out of his hands as he tumbled over them onto the pavement where he skidded into the Dunes hotel parking lot."}, {"text": "==== Caesars Palace ====As a result of the crash, Knievel suffered a crushed pelvis and femur, fractures to his hip, wrist, and both ankles, and a concussion that kept him in the hospital. Rumors circulated that he was in a coma for 29 days in the hospital, but this was refuted by his wife and others in the documentary film Being Evel."}, {"text": "==== Caesars Palace ====The Caesars Palace crash was Knievel's longest attempted motorcycle jump at 141 feet (43 m). After his crash and recovery, Knievel was more famous than ever. ABC declined to air the event live on Wide World of Sports. The Caesars Palace historical jump video is now owned by K and K Promotions, Inc which is the successor in interest and owner of all Evel Knievel trademarks, film footage, and copyrights."}, {"text": "==== Insurance ====In a 1971 interview with Dick Cavett, Knievel stated that he was uninsurable following the Caesars' crash, stating, \"I have trouble getting life insurance, accident insurance, hospitalization and even insurance for my automobile ... Lloyd's of London has rejected me 37 times so if you hear the rumor that they insure anybody, don't pay too much attention to it.\"  Four years later, a clause in Knievel's contract to jump 14 buses at Kings Island required a one-day $1 million liability insurance to the amusement park. Lloyd's of London offered liability insurance for $17,500. Knievel eventually paid $2,500 to a U.S.-based insurance company."}, {"text": "==== Jumps and records ====To keep his name in the news, Knievel proposed his biggest stunt ever, a motorcycle jump across the Grand Canyon. Just five months after his near-fatal crash in Las Vegas, Knievel performed another jump. On May 25, 1968, in Scottsdale, Arizona, Knievel crashed while attempting to jump 15 Ford Mustangs. Knievel ended up breaking his right leg and foot as a result of the crash."}, {"text": "==== Jumps and records ====On August 3, 1968, Knievel returned to jumping, making more money than ever before. He was earning approximately $25,000 per performance, and he was making successful jumps almost weekly until October 13, in Carson City, Nevada. While trying to stick the landing, he lost control of the bike and crashed, breaking his hip again."}, {"text": "==== Jumps and records ====By 1971, Knievel realized that the U.S. government would never allow him to jump the Grand Canyon. To keep his fans interested, Knievel considered several other stunts that might match the publicity that would have been generated by jumping the canyon. Ideas included jumping across the Mississippi River, jumping from one skyscraper to another in New York City, and jumping over 13 cars inside the Houston Astrodome. While flying back to Butte from a performance tour, he looked out the window of his airplane and saw the Snake River Canyon. After finding a location just east of Twin Falls, Idaho, that was wide enough, deep enough, and on private property, he leased 300 acres (1.2 square kilometers) for $35,000 to stage his jump. He set the date for Labor Day (September 4), 1972."}, {"text": "==== Jumps and records ====On January 7–8, 1971, Knievel set a sales record at the Houston Astrodome by selling over 100,000 tickets to back-to-back performances there. On February 28, he set a new world record by jumping 19 cars with his Harley-Davidson XR-750 at the Ontario Motor Speedway in Ontario, California. The 19-car jump was shot for the biopic Evel Knievel. Knievel held the record for 27 years until Bubba Blackwell jumped 20 cars in 1998 with an XR-750. In 2015, Doug Danger surpassed that number with 22 cars, accomplishing this feat on Evel Knievel's actual vintage 1972 Harley-Davidson XR-750."}, {"text": "==== Jumps and records ====On May 10, 1970, Knievel crashed while attempting to jump 13 Pepsi delivery trucks in Yakima, WA. His approach was complicated by the fact that he had to start on pavement, cut across grass, and then return to pavement. His lack of speed caused the motorcycle to come down on its front wheel first. He managed to hold on until the cycle hit the base of the ramp. After being thrown off, he skidded for 50 feet (15 m). He broke his collarbone, suffered a compound fracture of his right arm, and broke both legs."}, {"text": "==== Jumps and records ====On March 3, 1972, at the Cow Palace in Daly City, California, after making a successful jump, he tried to come to a quick stop because of a short landing area. He reportedly suffered a broken back and a concussion after getting thrown off and run over by his motorcycle, a Harley-Davidson. Knievel returned to jumping in November 1973, when he successfully jumped over 50 stacked cars at the Los Angeles Memorial Coliseum. For 35 years, Knievel held the record for jumping the most stacked cars on a Harley-Davidson XR-750 (the record was broken in October 2008). His historic XR-750 is now part of the collection of the Smithsonian's National Museum of American History. Made of steel, aluminum, and fiberglass, the customized motorcycle weighs about 140 kilograms (300 pounds)."}, {"text": "==== Jumps and records ====During his career, Knievel may have suffered more than 433 bone fractures, earning an entry in the Guinness Book of World Records as the survivor of \"most bones broken in a lifetime\". However, this number could be exaggerated: his son Robbie told a reporter in June 2014 that his father had broken 40 to 50 bones; Knievel himself claimed he broke 35."}, {"text": "==== The Grand Canyon jump ====Although Knievel never attempted to jump the Grand Canyon, rumors of the Canyon jump were started by Knievel himself in 1968, following the Caesars Palace crash. During a 1968 interview, Knievel stated, \"I don't care if they say, 'Look, kid, you're going to drive that thing off the edge of the Canyon and die,' I'm going to do it. I want to be the first. If they'd let me go to the moon, I'd crawl all the way to Cape Kennedy just to do it. I'd like to go to the moon, but I don't want to be the second man to go there.\" For the next several years, Knievel negotiated with the federal government to secure a jumping site and develop various concept bikes to make the jump, but the Interior Department denied him airspace over the northern Arizona canyon. Knievel switched his attention in 1971 to the Snake River Canyon in southern Idaho."}, {"text": "==== The Grand Canyon jump ====In the 1971 film Evel Knievel, George Hamilton (as Knievel) alludes to the canyon jump in the final scene of the movie. One of the common movie posters for the film depicts Knievel jumping his motorcycle off a (likely) Grand Canyon cliff. In 1999, his son Robbie jumped a portion of the Grand Canyon owned by the Hualapai Indian Reservation."}, {"text": "==== Snake River Canyon jump ====ABC's Wide World of Sports was unwilling to pay the price Knievel wanted for the Snake River Canyon jump, so he hired boxing promoter Bob Arum's company, Top Rank Productions, to put the event on closed-circuit television and broadcast to movie theaters. Investors in the event took a substantial loss, including promoter Don E. Branker, as well as Vince McMahon of what was then called the World Wide Wrestling Federation. Arum partnered with Invest West Sports, Shelly Saltman's company, to secure from Invest West Sports two things: first, the necessary financing for the jump, and second, the services of Saltman, long recognized as one of America's premier public relations and promotion men, to do publicity so that Knievel could concentrate on his jumps. Knievel hired aeronautical engineer Doug Malewicki to build him a rocket-powered cycle to jump across the Snake River, and called it the Skycycle X-1. Malewicki's creation was powered by a steam engine built by former Aerojet engineer Robert Truax. On April 15, 1972, the X-1 was launched to test the feasibility of the launching ramp. The decision was then made to have Truax build two Skycycle X-2s, one to test and one for the actual jump. Both the X-1 and the X-2 test vehicles went into the river."}, {"text": "==== Snake River Canyon jump ====The launch took place at the south rim of the Snake River Canyon, west of Shoshone Falls, on September 8, 1974, at 3:36 p.m. MDT. The steam that powered the engine was superheated to a temperature of 500 degrees Fahrenheit (260 degrees Celsius). The drogue parachute prematurely deployed as the Skycycle left the launching rail and induced significant drag. Even though the craft made it across the canyon to the north rim, the prevailing northwest winds caused it to drift back into the canyon. By the time it hit the bottom of the canyon, it landed only a few feet from the water on the same side of the canyon from which it had been launched. If he had landed in the water, Knievel said that he would have drowned, due to a harness malfunction that kept him strapped in the vehicle. He survived the failed jump with only minor physical injuries."}, {"text": "==== Snake River Canyon jump ====Since the 1974 launch, seven daredevils have expressed interest in recreating the jump, including Knievel's two sons, Robbie and Kelly. In 2010, Robbie announced he would recreate the jump. Stuntman Eddie Braun announced he was working with Kelly and Robert Truax's son to recreate the jump using a replica of the Skycycle X-2. Braun's jump took place on September 16, 2016, and was completed successfully."}, {"text": "==== Wembley jump ====After the Snake River jump, Knievel returned to motorcycle jumping with ABC's Wide World of Sports televising several jumps. On May 26, 1975, in front of 90,000 people at Wembley Stadium in London, Knievel crashed while trying to land a jump over 13 redundant single-deck AEC Merlin buses (the term \"London Buses\" used in earlier publicity had led to the belief that the attempt was to be made over the higher and more traditional AEC Routemaster double-decker type)."}, {"text": "==== Wembley jump ====After the crash, despite breaking his pelvis, Knievel addressed the audience and announced his retirement by stating, \"Ladies and gentlemen of this wonderful country, I've got to tell you that you are the last people in the world who will ever see me jump. Because I will never, ever, ever jump again. I'm through.\" Near shock and ignoring Frank Gifford's (of ABC's Wide World of Sports) plea to use a stretcher, Knievel walked off the Wembley pitch stating, \"I came in walking, I went out walking!\""}, {"text": "==== Kings Island jump ====After recuperating, Knievel decided that he had spoken too soon and that he would continue jumping. On October 25, 1975, Knievel jumped 14 Greyhound buses at Kings Island near Cincinnati, Ohio. Although Knievel landed on the safety deck above the 14th bus, his landing was successful and he held the record for jumping the most buses on a Harley-Davidson for 24 years (until broken by Bubba Blackwell in late 1999 with 15 at 157 feet (48 m)). The Kings Island event scored the highest viewer ratings in the history of ABC's Wide World of Sports and would serve as Knievel's longest successful jump at 133 feet (41 m) (although the Caesars Palace jump was longer, it ended in a crash). In the end, Knievel was featured in seven of the ten highest-rated episodes of ABC's Wide World of Sports. After the Kings Island jump, Knievel again announced his retirement."}, {"text": "==== Kings Island jump ====His retirement was once again short-lived, and Knievel continued to jump. However, after the lengthy Kings Island jump, Knievel limited the remainder of his career jumps to shorter and more attainable lengths. Knievel jumped on October 31, 1976, at the Seattle Kingdome. He jumped only seven Greyhound buses but it was a success. Despite the crowd's pleasure, Knievel felt that it was not his best jump, and apologized to the crowd."}, {"text": "==== Shark jump ====On January 31, 1977, Knievel was scheduled for a major jump in Chicago, Illinois. The jump was inspired by the 1975 film Jaws. Knievel was scheduled to jump a tank full of live sharks which would be televised live nationally. However, during his rehearsal, Knievel lost control of the motorcycle and crashed into a cameraman. Although Knievel broke his arms, he was more distraught over what he claimed was a permanent eye injury to cameraman Thomas Geren. The cameraman was admitted to the hospital and received treatment for an injury near his eye, but received no permanent injury. The footage of this crash was so upsetting to Knievel that he did not show the clip for 19 years until the documentary Absolute Evel: The Evel Knievel Story."}, {"text": "==== Shark jump ====Later that year on the sitcom Happy Days, motorcycle-riding character Fonzie (Henry Winkler) performed a similar trick, albeit on waterskis, inspiring the creation of the phrase \"jump the shark.\""}, {"text": "==== Shark jump ====Afterward, Knievel retired from major performances and limited his appearances to smaller venues to help launch Robbie's career. His last stunt show, not including a jump, took place in March 1980 in Puerto Rico. However, Knievel would officially finish his career as a daredevil as a touring \"companion\" of Robbie's, limiting his performance to speaking only, rather than stunt riding. His final tour appearance with Robbie was in March 1981 in Hollywood, Florida."}, {"text": "=== Feature movies: Evel Knievel and Viva Knievel! ===A 1971 biopic film, Evel Knievel, fictionalized Knievel's life and exploits. Knievel, portrayed by George Hamilton, calls himself \"the last gladiator in the new Rome\" in a nod to a January 1970 Esquire magazine article about the stunt rider, whose author, David Lyle, declared, \"Evel Knievel [...] may be the last great gladiator.\" (Later, Knievel titled his 1988 self-produced documentary Last of the Gladiators.) A higher end B-movie, Evel Knievel was a minor hit, taking in $4 million in rentals (equivalent to approximately $30,093,673 in 2023) against a $450,000 budget. "}, {"text": "=== Feature movies: Evel Knievel and Viva Knievel! ===Knievel played himself in the 1977 American action film Viva Knievel, directed by Gordon Douglas and co-starring Gene Kelly and Lauren Hutton, with an ensemble supporting cast including Red Buttons, Leslie Nielsen, Cameron Mitchell, Frank Gifford, Dabney Coleman and Marjoe Gortner. The film premiered in June 1977, three months before Knievel and his associates attacked promoter Shelly Saltman with an aluminum baseball bat on September 21, 1977. "}, {"text": "=== Feature movies: Evel Knievel and Viva Knievel! ===With Knievel losing most of his sponsorship and marketing deals as a result of the bad publicity, Viva Knievel became much less commercially attractive, only opening in four further international markets after Knievel's conviction. In addition, the wholesome image of Knievel the movie promoted and the plot point concerning Knievel's promoter being corrupt seemed ill-judged in the light of the events that saw Knievel imprisoned."}, {"text": "=== Motorcycles ===Knievel briefly used a Honda 250cc motorcycle to jump a crate of rattlesnakes and two mountain lions, his first known jump. Knievel then used a Norton Motorcycle Company 750cc for only one year, 1966. Between 1967 and 1968, Knievel jumped using the Triumph Bonneville T120 (with a 650cc engine). Knievel used the Triumph at the Caesars Palace crash on New Year's Eve 1967. When Knievel returned to jumping after the crash, he used Triumph for the remainder of 1968."}, {"text": "=== Motorcycles ===Attempting his jumps on motorcycles whose suspensions were designed primarily for street riding or flat track racing was a major factor in Knievel's many disastrous landings. The terrific forces these machines passed on to his body are well illustrated in the super slow-motion footage of his Caesars' landing."}, {"text": "=== Motorcycles ===Between December 1969 and April 1970, Knievel used the Laverda American Eagle 750cc motorcycle. On December 12, 1970, Knievel would switch to the Harley-Davidson XR-750, the motorcycle with which he is best known for jumping. Knievel would use the XR-750 in association with Harley-Davidson until 1977. However, after his 1977 conviction for the assault of Shelly Saltman, Harley-Davidson withdrew its sponsorship of Knievel."}, {"text": "=== Motorcycles ===On September 8, 1974, Knievel attempted to jump the Snake River Canyon on a rocket-propelled motorcycle designed by former NASA engineer Robert Truax, dubbed the Skycycle X-2. The State of Idaho registered the X-2 as an airplane rather than a motorcycle."}, {"text": "=== Motorcycles ===At the tail end of his career, while helping launch the career of his son, Robbie, Knievel returned to the Triumph T120. However, he used the bike only for wheelies and did not jump after retiring from the XR-750."}, {"text": "=== Motorcycles ===In 1997, Knievel signed with the California Motorcycle Company to release a limited Evel Knievel Motorcycle. The motorcycle was not built to jump but was rather a V-twin cruiser motorcycle intended to compete with Harley-Davidson street bikes. Knievel promoted the motorcycle at his various public appearances. After the company closed in 2003, Knievel returned to riding modern street Harley-Davidson motorcycles at his public appearances."}, {"text": "=== Motorcycles ===Robbie sold limited-edition motorcycles from his company, Knievel Motorcycles Manufacturing Inc. Although two of the motorcycles refer to Evel (the Legend Series Evel Commemorative and the Snake River Canyon motorcycle), Evel did not ride Robbie's bikes."}, {"text": "=== Leather jumpsuits ===Throughout his daredevil career, Knievel was known for his leather jumpsuits that were compared to the jumpsuits worn by Elvis Presley. When Knievel began jumping, he used a black and yellow jumpsuit. When he switched to the Triumph motorcycle, his jumpsuit changed to a white suit with stripes down the legs and sleeves. In interviews, he said the reason for the switch was because he saw how Liberace had become not just a performer, but the epitome of what a showman should be, and Knievel sought to create his variation of that showmanship in his jumps. Two variations of the white suit appeared (one with three stars across the chest and one with the three stars on his right chest). The latter was worn at the Caesars Palace jump."}, {"text": "=== Leather jumpsuits ===When Knievel switched to the Laverda motorcycle in 1969, he switched his leathers to an All American Themed red-white-and-blue jumpsuit with an \"X\" across the chest. Later, Knievel adjusted the blue stripes to a V-shape (the first version of the V-shape was also used in the 1971 film's final jump). For the remainder of his career, variants of the V-shaped white-starred jumpsuit would be a constant, including a special nylon/canvas flight suit that matched his white leathers for the X-2 jump. Each variant would become more elaborate, including the addition of the red-white-blue cape and the Elvis-styled belt buckle with his initials, \"EK\". In 1975, Knievel premiered the blue leathers with red stars on the white stripes for the Wembley jump."}, {"text": "=== Core values ===Evel Knievel took great pride in his core values. Throughout his career and later life he would repeatedly talk about the importance of \"keeping his word\". He stated that although he knew he may not successfully make a jump or even survive the canyon jump, he followed through with each stunt because he gave his word that he would. Before the canyon jump, Knievel stated, \"If someone says to you, 'that guy should have never jumped the canyon. You knew if he did, that he'd lose his life and that he was crazy.' Do me a favor. Tell him that you saw me here and regardless of what I was, that you knew me, and that I kept my word.\""}, {"text": "=== Core values ===In Last of the Gladiators, Knievel discussed the crash of a 1970 Pepsi-Cola sponsored jump in Yakima, Washington. Knievel knew the jump was very questionable, but stated, \"I went ahead and did it anyway. When you give your word to somebody that you're going to do something, you've gotta do it.\" In the 1971 biopic, George Hamilton (as Knievel) emphasizes in the opening monologue that a man does not go back on his word."}, {"text": "==== Anti-drug campaign ====Knievel would regularly share his anti-drug message, one of his core values. Knievel would preach an anti-drug message to children and adults before each of his stunts."}, {"text": "==== Anti-drug campaign ====Knievel regularly spoke out against the Hells Angels due to their alleged involvement in the drug trade. A near-riot erupted during Knievel's show at the Cow Palace on March 3, 1971, when a Hells Angels member threw a metal object (either a tire iron or a Coca-Cola can, according to different witnesses) at Knievel. Knievel and a majority of the spectators fought back, injuring three of the fifteen Hells Angels members in attendance to the point that they required hospitalization."}, {"text": "==== Anti-drug campaign ====In the film Viva Knievel!, Knievel plays a fictionalized version of himself who foils a drug lord's attempt to smuggle narcotics into the United States."}, {"text": "==== Motorcycle helmet safety ====Knievel was a proponent of motorcycle helmet safety. He constantly encouraged his fans to wear motorcycle helmets. The Bell Star helmet he used in the Caesars Palace jump is credited for having saved Knievel's life after he fell off the motorcycle and struck his head on the ground. (Following the Caesars Palace crash, each of Knievel's full-face helmets bore the slogan, \"Color Me Lucky.\") As an ardent supporter of helmet use, Knievel once offered a cash reward for anyone who witnessed him stunting on a motorcycle without a helmet."}, {"text": "==== Motorcycle helmet safety ====In 1987, Knievel supported a mandatory helmet bill in the State of California. During the Assembly Transportation Committee meeting, Knievel was introduced as \"the best walking commercial for a helmet law.\" Evel claimed the main reason he was still alive and walking was that he wore a helmet."}, {"text": "=== Marketing image ===Knievel sought to make more money from his image. He was no longer satisfied with just receiving free motorcycles to jump with. Knievel wanted to be paid to use and promote a company's brand of motorcycles. After Triumph, the British motorcycle brand he had been jumping with, refused to meet his demands (it was part of the bankrupt BSA group that was merged with Norton in 1972), Knievel started to propose the idea to other manufacturers. American Eagle Motorcycles, the brand under which Italian Laverda machines were sold in the US, was the first company to sign Knievel to an endorsement deal. Knievel then used the new lightweight racing motorcycle Harley-Davidson XR-750 from December 1970 until his final jump in January 1977."}, {"text": "=== Marketing image ===At approximately the same time, Fanfare Films started production on the George Hamilton biopic (Evel Knievel (1971 film)). Two other films about Knievel, a television pilot made in 1974 starring Sam Elliott, and a made-for-TV film in 2004 starring George Eads, were produced in later years. In 1974, Knievel and Amherst Records released at the Sound City Studios the self-titled album Evel Knievel, which included a press conference, an anti-drug talk for his young fans, and four other tracks."}, {"text": "=== Marketing image ===In 1972, Knievel appeared in the motorcycle safety film 'Not So Easy', together with Easy Rider Peter Fonda."}, {"text": "=== Marketing image ===Knievel kept up his pursuit of the United States government to allow him to jump the Grand Canyon. To push his case, he hired famed San Francisco defense attorney Melvin Belli to fight the legal battle for obtaining government permission. ABC's Wide World of Sports started showing Knievel's jumps on television regularly. His popularity, especially with young boys, was ever-increasing. He became a hero to a generation of young boys. A. J. Foyt made Knievel part of his pit crew for the Indianapolis 500 in 1970. Evel Knievel's huge fame caused him to start traveling with bodyguards, who became life-long friends."}, {"text": "==== Ideal Toys ====Between 1972 and 1977, Ideal Toy Company released a series of Evel Knievel-related merchandise, designed initially by Joseph M. Burck of Marvin Glass and Associates. During the six years the toys were manufactured, Ideal claimed to have sold more than $125 million worth of Knievel toys. The toys included the original 1972 figures, which offered various outfits and accessories. In 1973, Ideal released the Evel Knievel Stunt Cycle. After the release of the Stunt Cycle, the Knievel toys were the best-selling item for Ideal."}, {"text": "==== Ideal Toys ====During the next four years, Ideal Toys released various models relating to Knievel's touring stunt show. The models included a Robbie Knievel doll, the Scramble Van, The Canyon Sky Cycle, a Dragster, a Stunt Car, and the Evel Knievel The Stunt World. Additionally, Ideal released non-Knievel-touring toys, including a Chopper Motorcycle, a Trail Bike, and a female counterpart, Derry Daring.  The last item marketed by Ideal Toys before it discontinued the distribution of Knievel toys was the Strato-Cycle, based on the film Viva Knievel!"}, {"text": "==== Ideal Toys ====In 1977, Bally marketed its Knievel pinball machine as the \"first fully electronic commercial game\"; it has elsewhere been described as one of the \"last of the classic pre-digital games.\"  (Both electromechanical and solid-state versions were produced. The electromechanical version is extremely rare, with only 155 made.)"}, {"text": "==== Other television appearances ====In the 1970s, Knievel partnered with AMF to release a series of bicycles, marketed with TV ads."}, {"text": "==== Other television appearances ====Though Knievel had no involvement, a 30-minute ABC Saturday morning animated series Devlin produced by Hanna-Barbera aired in the fall of 1974. The series, inspired by his popularity, featured stunt motorcyclists."}, {"text": "==== Other television appearances ====Knievel made several television appearances, including frequently as a guest on talk shows such as Dinah! and Johnny Carson's Tonight Show. In 1977, he made a guest spot on The Bionic Woman, where he played himself, getting inadvertently caught up in East German espionage while appearing in West Germany. Actual footage from Evel's L.A. Coliseum jump over crushed cars was used at the beginning of the episode, and an indoor jump over eleven cars and one van was used at the end of the show. Also in 1977, Warner Bros. released Viva Knievel! This movie starred Knievel as himself and co-starred Gene Kelly, Lauren Hutton, and Red Buttons. Similar to The Bionic Woman, actual Wembley footage was used in the film. In addition, the 1999 children's TV series Hilltop Hospital featured a character based on Knievel called Weasel Kneasel, who was the focus of an episode of the same name. In Disney/Pixar's Toy Story 4, a character named Duke Caboom (voiced by Keanu Reeves) was partially based on the Evel Knievel toy. On September 23, 2020, Knievel's son, Kelly and K&K Promotions filed a lawsuit against Disney and Pixar, claiming Duke was created illegally using Knievel's likeness."}, {"text": "==== Assault conviction, jail, and bankruptcy ====While Knievel was healing from injuries sustained from the Chicago jump, the book Evel Knievel on Tour was released. Written by Knievel's promoter for the Snake River Canyon jump, Shelly Saltman, the book painted an unflattering picture of Knievel's character, alleging that he abused his wife and children and used drugs."}, {"text": "==== Assault conviction, jail, and bankruptcy ====Knievel, with both arms still in casts, flew to California to confront Saltman, by then a vice president at 20th Century Fox. Outside the studio commissary, one of Knievel's friends grabbed Saltman and held him, while Knievel attacked him with an aluminum baseball bat, declaring \"I'm going to kill you!\" According to a witness to the attack, Knievel struck repeated blows at Saltman's head, with Saltman blocking the blows with his left arm. Saltman's arm and wrist were shattered in several places before he fell to the ground unconscious. It took numerous surgeries and permanent metal plates in his arm for Saltman to regain the use of his arm. "}, {"text": "==== Assault conviction, jail, and bankruptcy ====Saltman's book was withdrawn by the publisher after Knievel threatened to sue. Saltman later produced documents in both criminal and civil court that proved that, although Knievel claimed to have been insulted by statements in Saltman's book, he and his lawyers had been given editorial access to the book and had approved and signed off on every word before its publication. On October 14, 1977, Knievel pleaded guilty to battery and was sentenced to three years probation and six months in county jail. "}, {"text": "==== Assault conviction, jail, and bankruptcy ====After the Saltman assault and subsequent jail time, Knievel lost his marketing endorsements and deals, including Harley-Davidson and Ideal Toys. With no income from jumping or sponsorships, Knievel eventually declared bankruptcy. In 1981, Saltman was awarded a $13 million judgment against Knievel in a civil trial, but he never received any money from either Knievel or Knievel's estate. "}, {"text": "=== Marriages and children ===Knievel was married twice. He and his wife Linda were married for 38 years. During their marriage, the couple had four children, two boys, Kelly and Robbie, and two girls, Tracey and Alicia. Throughout Kelly's and Robbie's adolescence, they performed at Knievel's stunt shows. Robbie continued into adulthood to perform as a professional motorcycle daredevil. After Evel's death, Kelly has overseen the Knievel legacy, including developing Knievel-related products and assisting Harley-Davidson to develop a museum exhibit.  Knievel's courtship and marriage to Linda was the theme of the biopic 1971 film Evel Knievel. Linda and Evel separated in the early 1990s and were divorced in 1997 in San Jose, California. "}, {"text": "=== Marriages and children ===A municipal judge ordered Evel to stand trial for a weapons possession charge in 1994. Knievel was arrested in October at a Sunnyvale go-go bar on suspicion of battering his girlfriend, 25-year-old Krystal Kennedy of Florida. Sunnyvale police later discovered two handguns and some ammunition in the trunk of his car. The battering charge was dropped when Kennedy declined to cooperate."}, {"text": "=== Marriages and children ===In 1999, Knievel married his girlfriend, Krystal Kennedy of Clearwater, Florida, whom he began dating in 1992. The wedding was held on November 19, 1999, on a special platform built on the fountains at Caesars Palace on the Las Vegas Strip (site of Evel's jump New Year's Eve 1967). Long-time friend Engelbert Humperdinck sent a recorded tribute to the couple. "}, {"text": "=== Marriages and children ===The couple was married for two years, divorcing in 2001. Following the divorce, Krystal Knievel was granted a restraining order against him.  However, Krystal and Evel would work out their differences, living together until Knievel's death. According to the investment magazine, Registered Rep., Knievel left his entire estate to Krystal."}, {"text": "=== Post-daredevil years ===During the 1980s, Knievel drove around the country in a recreational vehicle, selling works of art allegedly painted by him. After several years of obscurity, Knievel made a significant marketing comeback in the 1990s, representing Maxim Casino, Little Caesars, Harley-Davidson and other firms."}, {"text": "=== Post-daredevil years ===In 1999, Knievel celebrated the 25th anniversary of the Snake River Canyon jump at the Twin Falls mall. His memorabilia was then stored at Kent Knigge's farm in Filer, Idaho, seven miles west of Twin Falls. During the same year, Knievel was inducted into the Motorcycle Hall of Fame."}, {"text": "=== Post-daredevil years ===Knievel once dreamed of housing all of his career memorabilia in an Evel Knievel Museum to be located in his home state of Montana. Those dreams were unfulfilled, and his artifacts are spread throughout transportation museums and private collections around the world. Knievel's original blueprints and handwritten notes about his desired museum are currently displayed at the Route 66 Vintage Iron Motorcycle Museum in downtown Miami, Oklahoma. The Route 66 site also houses Evel's Snake River Canyon Jump Mission Control Super Van. While Knievel's original dream of having all his significant memorabilia being centralized would go unfulfilled, a few public museums were opened in his honor, including the Evel Knievel Museum in Topeka, Kansas, which has the official approval of the Knievel estate."}, {"text": "=== Post-daredevil years ===On October 9, 2005, Knievel promoted his last public \"motorcycle ride\" at the Milwaukee Harley-Davidson dealership. The ride was to benefit victims of Hurricane Katrina. Although he was originally scheduled to lead a benefit ride through Milwaukee, Knievel never rode the motorcycle because he suffered a mild (non-debilitating) stroke before the appearance and limited his visit to a signing session."}, {"text": "==== Evel Knievel: The Rock Opera ====In 2003, Knievel signed over exclusive rights to Los Angeles composer Jef Bek, authorizing the production of a rock opera based on Knievel's life. Directed by Bat Boy co-creator Keythe Farley, the production opened in Los Angeles in September 2007 to some positive reviews."}, {"text": "==== Six Flags Evel Knievel roller coaster ====Knievel had partnered with Six Flags St. Louis to name a new wooden coaster after \"America's Legendary Daredevil\". The amusement park in Eureka, Missouri, outside of St. Louis, Missouri, opened the ride on June 20, 2008. The Evel Knievel Roller Coaster operated for three seasons before being renamed American Thunder in 2011."}, {"text": "==== Declining health ====In the late 1990s, Knievel required a life-saving liver transplant as a result of suffering the long-term effects of Hepatitis C. He contracted the disease after one of the numerous blood transfusions he received before 1992. In February 1999, Knievel was given only a few days to live and he requested to leave the hospital and die at his home. En route to his home, Knievel received a phone call from the hospital stating a young man had died in a motorcycle accident and could be a donor. Days later, Knievel received the transplant."}, {"text": "==== Declining health ====In 2005, he was diagnosed with idiopathic pulmonary fibrosis, an incurable and terminal lung disease that required him to be on supplemental oxygen 24 hours a day. In 2006, he had an internal morphine pain pump surgically implanted to help him with the excruciating pain in his deteriorated lower back, one of the costs of incurring so many traumas throughout his career as a daredevil. He also had two strokes after 2005, but neither left him with severe debilitation."}, {"text": "==== Declining health ====On July 27, 2006, he appeared on The Adam Carolla Show and discussed his health problems. The following day, he appeared on stage with Robbie at Evel Knievel Days in Butte, marking the last performance in which the two appeared together. Robbie jumped 196 feet (60 m) in a tribute to his father on a much lighter motorcycle with far superior suspension."}, {"text": "==== Declining health ====Shortly before his death, Evel Knievel was featured in a BBC Two Christmas special presented by Richard Hammond. The 60-minute program Richard Hammond Meets Evel Knievel aired on December 23, 2007, less than a month after Knievel's death. The documentary was filmed in July 2007 at the annual \"Evel Knievel Days\" festival in his old hometown of Butte."}, {"text": "==== Christian conversion ====On April 1, 2007, Knievel appeared on Robert H. Schuller's television program Hour of Power and announced that he \"believed in Jesus Christ\" for the first time. At his request, he was baptized at a televised congregation at the Crystal Cathedral by Schuller. Knievel's televised testimony triggered mass baptisms at the Crystal Cathedral."}, {"text": "== Death ==Knievel died in Clearwater, Florida, on November 30, 2007, aged 69. He had been suffering from diabetes and idiopathic pulmonary fibrosis for many years. A longtime friend reported that Knievel had trouble breathing while at his residence in Clearwater and died on the way to hospital. The friend said, \"It's been coming for years but you just don't expect it. Superman just doesn't die, right?\""}, {"text": "== Death ==In one of his last interviews, Knievel told Maxim magazine:"}, {"text": "== Death ==You can't ask a guy like me why I performed. I really wanted to fly through the air. I was a daredevil, a performer. I loved the thrill, the money, the whole macho thing. All those things made me Evel Knievel. Sure, I was scared. You gotta be an ass not to be scared. But I beat the hell out of death. [...] You're in the air for four seconds, you're part of the machine and then if you make a mistake midair, you say to yourself, \"Oh, boy. I'm gonna crash\" and there's nothing you can do to stop it, not at all."}, {"text": "== Death ==Knievel was buried at Mountain View Cemetery in his hometown of Butte, Montana on December 10, 2007, following a funeral at the 7,500-seat Butte Civic Center presided over by Robert H. Schuller with actor Matthew McConaughey giving the eulogy. Before the Monday service, fireworks exploded in the Butte night sky as pallbearers carried Knievel's casket into the center."}, {"text": "== Posthumous recognition ==On July 10, 2010, a special temporary exhibit entitled True Evel: The Amazing Story of Evel Knievel was opened at the Harley-Davidson Museum in Milwaukee, Wisconsin. The exhibit was opened in collaboration with Harley-Davidson Motorcycles and Evel's oldest son, Kelly. Among the various artifacts from Knievel's life, the exhibit included his \"Shark Jump\" Harley-Davidson XR-750, the Skycycle X-2, a blue jumpsuit from late in his career without any sponsor patches, and his trademark red-white-and-blue jumpsuit complete with his helmet and walking stick. Evel Knievel merchandising, personal artifacts, and X-rays from his injuries were also exhibited. In December 2010, a traveling version of the exhibit began a one-year tour of the United Kingdom and Europe."}, {"text": "== Posthumous recognition ==On September 16, 2016, professional stuntman Eddie Braun successfully jumped the Snake River Canyon in a replica of Knievel's Snake River rocket. Braun cited Knievel as an inspiration and wanted to show that Knievel's jump would have been successful had the parachute not been deployed too early. Braun stated that he was \"finishing out [the] dream\" of his hero, Knievel."}, {"text": "== Posthumous recognition ==In 2017, the Evel Knievel Museum, a 13,000 square foot (1,200 square meters) museum honoring Knievel was opened in Topeka, Kansas, by co-founders Lathan Mckay and Mike Patterson. The museum features his motorcycles, leathers, helmets, wardrobe, and jewelry along with various displays and a virtual reality motorcycle jump."}, {"text": "== Posthumous recognition ==On July 8, 2018, Travis Pastrana from Nitro Circus paid tribute to Evel on History Channel live event, \"Evel Live\", with 3 of Evel's most famous record-breaking Las Vegas jumps in one night. He was riding a Roland Sands Design–prepared 450-pound Indian Scout FTR750, and dressed in a full Evel Knievel getup, down to wearing vintage-style-appearing dress boots from Bates, the manufacturer that had made Evel's."}, {"text": "== Posthumous recognition ==On November 16, 2023, the New York Times crossword, created by Paolo Pascal, paid homage to Knievel with a themed crossword which included clues such as \"Description of this puzzle's subject\" (DAREDEVIL) and \"Acting dangerously, like this puzzle's subject\" (LIVING ON THE EDGE). Upon completion of the puzzle through the NYT Games app or website, solvers were rewarded with a short animation of a person on a motorcycle leaping through the squares of the crossword over three buses."}, {"text": "=== Television commercials ===In November 2010, General Motors premiered a television commercial featuring footage of Knievel's Wembley Stadium crash in 1975, followed by Knievel getting onto his feet. The ad focused on GM's restructuring and emphasized the belief that \"we all fall down\"."}, {"text": "=== Television commercials ===On July 18, 2012, Audi of America recreated Knievel's Snake River jump in a promotional commercial for the Audi RS5. The commercial depicts the RS5 being driven by a professional driver and jumping the canyon off a jump ramp."}, {"text": "== Portrayal in film ==Evel Knievel (1971), a biographical film directed by Marvin J. Chomsky and starring George Hamilton as Knievel."}, {"text": "== Portrayal in film ==Viva Knievel! (1977), a fictional story directed by Gordon Douglas and starring Evel Knievel as himself."}, {"text": "== Portrayal in film ==Evel Knievel (2004), a biographical film directed by John Badham and starring George Eads as Knievel."}, {"text": "== Portrayal in film ==Richard Hammond Meets Evel Knievel (2007), a television documentary film directed by Nigel Simpkiss."}, {"text": "== Portrayal in film ==I Am Evel Knievel (2014), a documentary directed by Derik Murray and David Ray."}, {"text": "== Portrayal in film ==Being Evel (2015), a documentary directed by Daniel Junge."}, {"text": "== Portrayal in film ==Evel, an upcoming biographical limited series written by Etan Frankel and starring Milo Ventimiglia as Knievel, was searching for a TV network as of 2020."}, {"text": "== See also ==Devlin, an animated TV series inspired by Evel Knievel"}, {"text": "== See also ==Evel Pie, an Evel Knievel–themed restaurant in Las Vegas co-owned by Kelly Knievel"}, {"text": "=== General bibliography ===\"Evel Knievel (Obituary)\". Orlando Sentinel. Associated Press. Retrieved July 27, 2010 – via Legacy.com."}, {"text": "=== General bibliography ===\"Evel Knievel; All-American motorcycle daredevil who thrilled a generation but then lost his health, his reputation and his fortune\". The Times. London. December 3, 2007. Retrieved July 27, 2010."}, {"text": "=== General bibliography ===Roscoe, Michael (December 3, 2007). \"Evel Knievel: Motorcycle daredevil famed for his bone-breaking jumps (Obituary)\". The Independent. London. Archived from the original on December 4, 2007. Retrieved July 27, 2010."}, {"text": "=== General bibliography ===Severo, Richard (December 1, 2007). \"Evel Knievel, 69, Daredevil on a Motorcycle, Dies\". The New York Times. Retrieved July 27, 2010."}, {"text": "=== General bibliography ===Squatriglia, Chuck (November 30, 2007). \"Evel Knievel Jumps the River Styx\". Wired. Retrieved July 27, 2010."}, {"text": "== External links ==Official website "}, {"text": "== External links ==Evel Knievel on ABC's Wide World of Sports"}, {"text": "== External links ==Evel Knievel at IMDb"}]