[{"text": "Genghis Khan (born Temüjin; c. 1162 – 25 August 1227), also Chinggis Khan, was the founder and first khan of the Mongol Empire, which he ruled from 1206 until his death in 1227; it later became the largest contiguous empire in history. After spending most of his life uniting the Mongol tribes, he launched a series of military campaigns, conquering large parts of China and Central Asia."}, {"text": "Born between 1155 and 1167 and given the name Temüjin, he was the oldest child of Yesugei, a Mongol chieftain of the Borjigin clan, and his wife Hö'elün. When Temüjin was eight, his father died and his family was abandoned by its tribe. Reduced to near-poverty, they managed to survive, although Temüjin killed his half-brother Behter to secure his position. As he grew to manhood, he began to gain followers, and he made alliances with two prominent steppe leaders named Jamukha and Toghrul; they worked together to retrieve Temüjin's kidnapped wife Börte. As his reputation grew, his relationship with Jamukha deteriorated into open warfare. Temüjin was decisively defeated in c. 1187, possibly spending the following years as a subject of the Jin dynasty; upon reemerging in 1196, he swiftly began gaining power. Toghrul came to view Temüjin as a threat, and launched a surprise attack on him in 1203. Temüjin retreated, then regrouped and overpowered Toghrul; after defeating the Naiman tribe and executing Jamukha, he was left as the sole ruler in the Mongolian steppe."}, {"text": "Temüjin formally adopted the title \"Genghis Khan\", the meaning of which is uncertain, at an assembly in 1206. Carrying out reforms designed to ensure long-term stability, he then transformed the Mongols' tribal structure into an integrated meritocracy dedicated to the service of the ruling family. After thwarting a coup attempt from a powerful shaman, Genghis began to consolidate his power. In 1209, he led a large-scale raid into the neighbouring Western Xia, who agreed to Mongol terms the following year. He then launched a campaign against the Jin dynasty, which lasted for four years and ended in 1215 with the capture of the Jin capital Zhongdu. His general Jebe annexed the Central Asian state of Qara Khitai in 1218. Genghis was provoked to invade the Khwarazmian Empire the following year following the execution of his envoys; the campaign toppled the Khwarazmian state and devastated the regions of Transoxiana and Khorasan, while Jebe and his colleague Subutai led an expedition that reached Georgia and Kievan Rus'. In 1227, Genghis died while subduing the rebellious Western Xia; following a two-year interregnum, Genghis's third son and heir Ögedei acceded to the throne in 1229."}, {"text": "Genghis Khan remains a controversial figure. He was generous and intensely loyal to his followers, but ruthless towards his enemies. He welcomed advice from diverse sources in his quest for world domination, for which he believed the shamanic supreme deity Tengri had destined him. The Mongol army under Genghis killed millions of people, but his conquests also facilitated heightened commercial and cultural exchange over an unprecedented geographical area. He is remembered as a backwards, savage tyrant in Russia and the Muslim world, while his legacy has undergone considerable reassessment in recent Western scholarship. He was posthumously deified in Mongolia; modern Mongolians recognise him as the founding father of their nation."}, {"text": "== Name and title ==There is no universal romanisation system used for Mongolian; as a result, modern spellings of Mongolian names vary greatly and may result in considerably different pronunciations from the original. The honorific most commonly rendered as \"Genghis\" ultimately derives from the Mongolian ᠴᠢᠩᠭᠢᠰ ᠬᠠᠭᠠᠨ, which may be romanised as Činggis. This was adapted into Chinese as 成吉思汗 Chéngjísī Hán, and into Persian as چنگیز خان Čəngīz H̱ān. As Arabic lacks a sound similar to [tʃ], represented in the Mongolian and Persian romanisations by ⟨č⟩, writers transcribed the name as J̌ingiz, while Syriac authors used Šīngīz.In addition to \"Genghis\", introduced into English during the 18th century based on a misreading of Persian sources, modern English spellings include \"Chinggis\", \"Chingis\", \"Jinghis\", and \"Jengiz\". His birth name \"Temüjin\" (ᠲᠡᠮᠦᠵᠢᠨ; 鐵木真 Tiěmùzhēn) is sometimes also spelled \"Temuchin\" in English.When Genghis's grandson Kublai Khan established the Yuan dynasty in 1271, he bestowed the temple name Taizu (太祖, meaning \"Supreme Progenitor\") and the posthumous name Shengwu huangdi (聖武皇帝, meaning \"Holy-Martial Emperor\") upon his grandfather. Kublai's great-grandson Külüg Khan later expanded this title into Fatian Qiyun Shengwu Huangdi (法天啟運聖武皇帝, meaning \"Interpreter of the Heavenly Law, Initiator of the Good Fortune, Holy-Martial Emperor\")."}, {"text": "== Sources ==As the sources are written in more than a dozen languages from across Eurasia, modern historians have found it difficult to compile information on the life of Genghis Khan. All accounts of his adolescence and rise to power derive from two Mongolian-language sources—The Secret History of the Mongols, and the Altan Debter ('Golden Book'). The latter, now lost, served as inspiration for two Chinese chronicles—the 14th-century History of Yuan and the Shengwu qinzheng lu ('Campaigns of Genghis Khan'). The History of Yuan, while poorly edited, provides a large amount of detail on individual campaigns and people; the Shengwu is more disciplined in its chronology, but does not criticise Genghis and occasionally contains errors."}, {"text": "== Sources ==The received text of the Secret History survived through being transliterated into Chinese characters during the 14th and 15th centuries. Its historicity has been disputed: the 20th-century sinologist Arthur Waley considered it a literary work with no historiographical value, but more recent historians have given the work much more credence. Although it is clear that the chronology of the work is suspect and that some passages were removed or modified for better narration, the Secret History is valued highly because the anonymous author is often critical of Genghis Khan: in addition to presenting him as indecisive and as having a phobia of dogs, the Secret History also recounts taboo events such as his fratricide and the possibility of his son Jochi's illegitimacy.Multiple chronicles in Persian have also survived, which display a mix of positive and negative attitudes towards Genghis Khan and the Mongols. Both  Minhaj-i Siraj Juzjani and Ata-Malik Juvayni completed their respective histories in 1260. Juzjani was an eyewitness to the brutality of the Mongol conquests, and the hostility of his chronicle reflects his experiences. His contemporary Juvayni, who had travelled twice to Mongolia and attained high position in the administration of a Mongol successor state, was more sympathetic; his account is the most reliable for Genghis Khan's western campaigns. The most important Persian source is the Jami' al-tawarikh ('Compendium of Chronicles') compiled by Rashid al-Din on the order of Genghis's descendant Ghazan in the early 14th century. Ghazan allowed Rashid privileged access to both confidential Mongol sources such as the Altan Debter and to experts on the Mongol oral tradition, including Kublai Khan's ambassador Bolad Chingsang. As he was writing an official chronicle, Rashid censored inconvenient or taboo details.There are many other contemporary histories which include additional information on Genghis Khan and the Mongols, although their neutrality and reliability are often suspect. Additional Chinese sources include the chronicles of the dynasties conquered by the Mongols, and the Song diplomat Zhao Hong, who visited the Mongols in 1221. Persian sources include Ibn al-Athir's Al-Kamil fi al-Tarikh ('The Complete History'), and a biography of the Khwarazmian prince Jalal al-Din by his companion al-Nasawi. There are also several Christian chronicles, including the Georgian Chronicles, and works by Europeans such as Carpini."}, {"text": "=== Birth and childhood ===The year of Temüjin's birth is disputed, as historians favour different dates: 1155, 1162 or 1167. Some traditions place his birth in the Year of the Pig, which was either 1155 or 1167. While a dating to 1155 is supported by the writings of both Zhao Hong and Rashid al-Din, other major sources such as the History of Yuan and the Shengwu favour the year 1162. The 1167 dating, favoured by Paul Pelliot, is derived from a minor source—a text of the Yuan artist Yang Weizhen—but is more compatible with the events of Genghis Khan's life than a 1155 placement, which implies that he did not have children until after the age of thirty and continued actively campaigning into his seventh decade. 1162 remains the most accepted date; the historian Paul Ratchnevsky notes that Temüjin himself may not have known the truth. The location of Temüjin's birth is similarly debated: the Secret History records his birthplace as Delüün Boldog on the Onon River, but this has been placed at either Dadal in Khentii Province or in southern Agin-Buryat Okrug, Russia."}, {"text": "=== Birth and childhood ===Temüjin was born into the Borjigin clan of the Mongol tribe to Yesügei, a chieftain who claimed descent from the legendary warlord Bodonchar Munkhag, and his principal wife Hö'elün, originally of the Olkhonud clan, whom Yesügei had abducted from her Merkit bridegroom Chiledu. The origin of his birth-name is contested: the earliest traditions hold that his father had just returned from a successful campaign against the Tatars with a captive named Temüchin-uge, after whom he named the newborn in celebration of his victory, while later traditions highlight the root temür (meaning 'iron') and connect to theories that \"Temüjin\" means 'blacksmith'. Several legends surround Temüjin's birth. The most prominent is that of a blood clot he clutched in his hand as he was born, a motif in Asian folklore which indicated the child would be a warrior. Others claimed that Hö'elün was impregnated by a ray of light which announced the child's destiny, a legend which echoed that of the mythical Borjigin ancestor Alan Gua. Yesügei and Hö'elün had three younger sons after Temüjin: Qasar, Hachiun, and Temüge, as well as one daughter, Temülen. Temüjin also had two half-brothers, Behter and Belgutei, from Yesügei's second wife Sochigel, whose identity is uncertain. The siblings grew up at Yesugei's main camp on the banks of the Onon, where they learned how to ride a horse and shoot a bow.When Temüjin was eight years old, Yesügei decided to betroth him to a suitable girl. He took his heir to the pastures of Hö'elün's prestigious Onggirat tribe, which had intermarried with the Mongols on many previous occasions. There, he arranged a betrothal between Temüjin and Börte, the daughter of an Onggirat chieftain named Dei Sechen. As the betrothal meant Yesügei would gain a powerful ally, and as Börte commanded a high bride price, Dei Sechen held the stronger negotiating position, and demanded that Temüjin remain in his household to work off his future debt. Accepting this condition, Yesügei requested a meal from a band of Tatars he encountered while riding homewards alone, relying on the steppe tradition of hospitality to strangers. However, the Tatars recognised their old enemy, and slipped poison into his food. Yesügei gradually sickened but managed to return home; close to death, he requested a trusted retainer called Münglig to retrieve Temüjin from the Onggirat. He died soon after."}, {"text": "=== Adolescence ===Yesügei's death shattered the unity of his people, which included members of the Borjigin, Tayichiud, and other clans. As Temüjin was only around ten, and Behter around two years older, neither was considered old enough to rule. The Tayichiud faction excluded Hö'elün from the ancestor worship ceremonies which followed a ruler's death and soon abandoned her camp. The Secret History relates that the entire Borjigin clan followed, despite Hö'elün's attempts to shame them into staying by appealing to their honour. Rashid al-Din and the Shengwu however imply that Yesügei's brothers stood by the widow. It is possible that Hö'elün may have refused to join in levirate marriage with one, resulting in later tensions, or that the author of the Secret History dramatised the situation. All the sources agree that most of Yesügei's people renounced his family in favour of the Tayichiuds and that Hö'elün's family were reduced to a much harsher life. Taking up a hunter-gatherer lifestyle, they collected roots and nuts, hunted for small animals, and caught fish.Tensions developed as the children grew older. Both Temüjin and Behter had claims to be their father's heir: although Temüjin was the child of Yesügei's chief wife, Behter was at least two years his senior. There was even the possibility that, as permitted under levirate law, Behter could marry Hö'elün upon attaining his majority and become Temüjin's stepfather. As the friction, exacerbated by frequent disputes over the division of hunting spoils, intensified, Temüjin and his younger brother Qasar ambushed and killed Behter. This taboo act was omitted from the official chronicles but not from the Secret History, which recounts that Hö'elün angrily reprimanded her sons. Behter's younger full-brother Belgutei did not seek vengeance, and became one of Temüjin's highest-ranking followers alongside Qasar. Around this time, Temüjin developed a close friendship with Jamukha, another boy of aristocratic descent; the Secret History notes that they exchanged knucklebones and arrows as gifts and swore the anda pact—the traditional oath of Mongol blood brothers–at the age of eleven.As the family lacked allies, Temüjin was taken prisoner on multiple occasions. Captured by the Tayichiuds, he escaped during a feast and hid first in the Onon and then in the tent of Sorkan-Shira, a man who had seen him in the river and not raised the alarm. Sorkan-Shira sheltered Temüjin for three days at great personal risk before allowing him to escape. Temüjin was assisted on another occasion by an adolescent named Bo'orchu who aided him in retrieving stolen horses. Soon afterwards, Bo'orchu joined Temüjin's camp as his first nökor ('personal companion'; pl. nökod). These incidents, related by the Secret History, are indicative of the emphasis its author put on Genghis' personal charisma."}, {"text": "=== Early campaigns ===Temüjin returned to Dei Sechen to marry Börte when he reached the age of majority at fifteen. Delighted to see the son-in-law he feared had been lost, Dei Sechen consented to the marriage and accompanied the newlyweds back to Temüjin's camp; his wife Čotan presented Hö'elün with an expensive sable cloak. Seeking a patron, Temüjin then chose to approach Toghrul, khan (ruler) of the Kerait tribe, who had fought alongside Yesügei and sworn the anda pact with him. Toghrul ruled a vast territory in central Mongolia, but he was suspicious of the loyalty of his chief followers and, after receiving the sable cloak as a gift, he welcomed Temüjin into his protection. The two grew close, and Temüjin began to build a following, as nökod such as Jelme entered into his service. Temüjin and Börte had their first child, a daughter named Qojin, around this time.Soon afterwards, seeking revenge for Yesügei's abduction of Hö'elün, around 300 Merkits raided Temüjin's camp. While Temüjin and his brothers were able to hide on Burkhan Khaldun mountain, Börte and Sochigel were abducted. In accordance with levirate law, Börte was given in marriage to the younger brother of the now-deceased Chiledu. Temüjin appealed for aid from Toghrul and his childhood anda Jamukha, who had risen to become chief of the Jadaran tribe. Both chiefs were willing to field armies of 20,000 warriors, and with Jamukha in command, the campaign was soon won. A now-pregnant Börte was recovered successfully and soon gave birth to a son, Jochi; although Temüjin raised him as his own, questions over his true paternity followed Jochi throughout his life. This is narrated in the Secret History and contrasts with Rashid al-Din's account, which protects the family's reputation by removing any hint of illegitimacy. Over the next decade and a half, Temüjin and Börte would have three more sons (Chagatai, Ögedei, and Tolui) and four more daughters (Checheyigen, Alaqa, Tümelün, and Al Altan).Temüjin and Jamukha camped together for a year and a half, during which, according to the Secret History, they reforged their anda pact, even sleeping together under one blanket. Traditionally seen as a bond solely of friendship, as presented in the source, Ratchnevsky has questioned if Temüjin actually became Jamukha's nökor, in return for the assistance with the Merkits. Tensions arose and the two leaders parted, ostensibly on account of a cryptic remark made by Jamukha on the subject of camping; scholarly analysis has focused on the active role of Börte in this separation, and whether her ambitions may have outweighed Temüjin's own. In any case, the major tribal rulers remained with Jamukha, but forty-one leaders joined Temüjin along with many commoners: these included Subutai and others of the Uriankhai, the Barulas, the Olkhonuds, and many more."}, {"text": "=== Early campaigns ===Temüjin was soon acclaimed by his close followers as khan of the Mongols. Toghrul was pleased at his vassal's elevation but Jamukha was resentful. Tensions escalated into open hostility, and in around 1187 the two leaders clashed in battle at Dalan Baljut: the two forces were evenly matched but Temüjin suffered a clear defeat. Later chroniclers including Rashid al-Din instead state that he was victorious but their accounts contradict themselves and each other.Modern historians such as Ratchnevsky and Timothy May consider it very likely that Temüjin spent a large portion of the decade following the clash at Dalan Baljut as a servant of the Jurchen Jin dynasty in North China. Zhao Hong recorded that the future Genghis Khan spent several years as a slave of the Jin. Formerly seen as an expression of nationalistic arrogance, the statement is now thought to be based in fact, especially as no other source convincingly explains Temüjin's activities between Dalan Baljut and c. 1195. Taking refuge across the border was a common practice both for disaffected steppe leaders and disgraced Chinese officials. Temüjin's reemergence having retained significant power indicates that he probably profited in the service of the Jin. As he would later go on to overthrow that state, such an episode, detrimental to Mongol prestige, was omitted from all their sources. Zhao Hong was bound by no such taboos."}, {"text": "=== Defeating rivals ===The sources do not agree on the events of Temüjin's return to the steppe. In early summer 1196, he participated in a joint campaign with the Jin against the Tatars, who had begun to act contrary to Jin interests. As a reward, the Jin awarded him the honorific cha-ut kuri, the meaning of which probably approximated \"commander of hundreds\" in Jurchen. At around the same time, he assisted Toghrul with reclaiming the lordship of the Kereit, which had been usurped by one of Toghrul's relatives with the support of the powerful Naiman tribe. The actions of 1196 fundamentally changed Temüjin's position in the steppe—although nominally still Toghrul's vassal, he was de facto an equal ally.Jamukha behaved cruelly following his victory at Dalan Baljut—he allegedly boiled seventy prisoners alive and humiliated the bodies of leaders who had opposed him. A number of disaffected followers, including Yesügei's follower Münglig and his sons, defected to Temüjin as a consequence; they were also probably attracted by Temüjin's newfound wealth. Temüjin was able to subdue the disobedient Jurkin tribe that had previously offended him at a feast and refused to participate in the Tatar campaign. After executing their leaders, he had Belgutei symbolically break a leading Jurkin's back in a staged wrestling match in retribution. This latter incident, which contravened Mongol customs of justice, was only noted by the author of the Secret History, who openly disapproved. These events occurred c. 1197."}, {"text": "=== Defeating rivals ===During the following years, Temüjin and Toghrul campaigned against the Merkits, the Naimans, and the Tatars; sometimes separately and sometimes together. In around 1201, a collection of dissatisfied tribes including the Onggirat, the Tayichiud, and the Tatars, swore to break the domination of the Borjigin-Kereit alliance, electing Jamukha as their leader and gurkhan (lit. '\"khan of the tribes\"'). After some initial successes, Temüjin and Toghrul routed this loose confederation at Yedi Qunan, and Jamukha was forced to beg for Toghrul's clemency. Desiring complete supremacy in eastern Mongolia, Temüjin defeated first the Tayichiud and then, in 1202, the Tatars; after both campaigns, he executed the clan leaders and took the remaining warriors into his service. These included Sorkan-Shira, who had come to his aid previously, and a young warrior named Jebe, who, by killing Temüjin's horse and refusing to hide that fact, had displayed martial ability and personal courage.The absorption of the Tatars left three military powers in the steppe: the Naimans in the west, the Mongols in the east, and the Kereit in between. Seeking to cement his position, Temüjin proposed that his son Jochi marry one of Toghrul's daughters. Led by Toghrul's son Senggum, the Kereit elite believed the proposal to be an attempt to gain control over their tribe, while the doubts over Jochi's parentage would have offended them further. In addition, Jamukha drew attention to the threat Temüjin posed to the traditional steppe aristocracy by his habit of promoting commoners to high positions, which subverted existing social norms. Yielding eventually to these demands, Toghrul attempted to lure his vassal into an ambush, but his plans were overheard by two herdsmen. Temüjin was able to gather some of his forces, but was soundly defeated at the Battle of Qalaqaljid Sands."}, {"text": "=== Defeating rivals ===Retreating southeast to Baljuna, an unidentified lake or river, Temüjin waited for his scattered forces to regroup: Bo'orchu had lost his horse and was forced to flee on foot, while Temüjin's badly wounded son Ögedei had been transported and tended to by Borokhula, a leading warrior. Temüjin called in every possible ally and swore a famous oath of loyalty, later known as the Baljuna Covenant, to his faithful followers, which would later grant them exclusivity and prestige. The oath-takers of Baljuna were a very heterogeneous group—men from nine different tribes who included Christians, Muslims, and Buddhists, united only by loyalty to Temüjin and to each other. This group became a model for the later empire, being termed a \"proto-government of a proto-nation\" by historian John Man. The Baljuna Covenant was omitted from the Secret History—as the group was predominantly non-Mongol, the author presumably wished to downplay the role of other tribes.A ruse de guerre involving Qasar allowed the Mongols to catch the Kereit unawares at the Jej'er Heights, but though the ensuing battle still lasted three days, it ended in a decisive victory for Temüjin. Toghrul and Senggum were both forced to flee, and while the latter escaped to Tibet, Toghrul was killed by a Naiman who did not recognise him. Temüjin sealed his victory by absorbing the Kereit elite into his own tribe: he took the princess Ibaqa as a wife, and married her sister Sorghaghtani and niece Doquz to his youngest son Tolui. The ranks of the Naimans had swelled due to the arrival of Jamukha and others defeated by the Mongols, and they prepared for war. Temüjin was informed of these events by Alaqush, the sympathetic ruler of the Ongud tribe. In May 1204, at the Battle of Chakirmaut in the Altai Mountains, the Naimans were decisively defeated: their leader Tayang Khan was killed, and his son Kuchlug was forced to flee west. The Merkits were decimated later that year, while Jamukha, who had abandoned the Naimans at Chakirmaut, was betrayed to Temüjin by companions who were executed for their lack of loyalty. According to the Secret History, Jamukha convinced his childhood anda to execute him honourably; other accounts state that he was killed by dismemberment."}, {"text": "=== Kurultai of 1206 and reforms ===Now sole ruler of the steppe, Temüjin held a large assembly called a kurultai at the source of the Onon River in 1206. Here, he formally adopted the title Genghis Khan, the etymology and meaning of which have been much debated. Some commentators hold that the title had no meaning, simply representing Temüjin's eschewal of the traditional gurkhan title, which had been accorded to Jamukha and was thus of lesser worth. Another theory suggests that the word \"Genghis\" bears connotations of strength, firmness, hardness, or righteousness. A third hypothesis proposes that the title is related to the Turkic tängiz ('ocean'), the title \"Genghis Khan\" would mean \"master of the ocean\", and as the ocean was believed to surround the earth, the title thus ultimately implied \"Universal Ruler\".Having attained control over one million people, Genghis Khan began a \"social revolution\", in May's words. As traditional tribal systems had primarily evolved to benefit small clans and families, they were unsuitable as the foundations for larger states and had been the downfall of previous steppe confederations. Genghis thus began a series of administrative reforms designed to suppress the power of tribal affiliations and to replace them with unconditional loyalty to the khan and the ruling family. As most of the traditional tribal leaders had been killed during his rise to power, Genghis was able to reconstruct the Mongol social hierarchy in his favour. The highest tier was occupied solely by his and his brothers' families, who became known as the altan uruq (lit. 'Golden Family') or chaghan yasun (lit. 'white bone'); underneath them came the qara yasun (lit. 'black bone'; sometimes qarachu), composed of the surviving pre-empire aristocracy and the most important of the new families.To break any concept of tribal loyalty, Mongol society was reorganised into a military decimal system. Every man between the age of fifteen and seventy was conscripted into a minqan (pl. minkad), a unit of a thousand soldiers, which was further subdivided into units of hundreds (jaghun, pl. jaghat) and tens (arban, pl. arbat). The units also encompassed each man's household, meaning that each military minqan was supported by a minqan of households in what May has termed \"a military–industrial complex\". Each minqan operated as both a political and social unit, while the warriors of defeated tribes were dispersed to different minqad to make it difficult for them to rebel as a single body. This was intended to ensure the disappearance of old tribal identities, replacing them with loyalty to the \"Great Mongol State\", and to commanders who had gained their rank through merit and loyalty to the khan. This particular reform proved extremely effective—even after the division of the Mongol Empire, fragmentation never happened along tribal lines. Instead, the descendants of Genghis continued to reign unchallenged, in some cases until as late as the 1700s, and even powerful non-imperial dynasts such as Timur and Edigu were compelled to rule from behind a puppet ruler of his lineage.Genghis's senior nökod were appointed to the highest ranks and received the greatest honours. Bo'orchu and Muqali were each given ten thousand men to lead as commanders of the right and left wings of the army respectively. The other nökod were each given commands of one of the ninety-five minkad. In a display of Genghis' meritocratic ideals, many of these men were born to low social status: Ratchnevsky cites Jelme and Subutai, the sons of blacksmiths, in addition to a carpenter, a shepherd, and even the two herdsmen who had warned Temüjin of Toghrul's plans in 1203. As a special privilege, Genghis allowed certain loyal commanders to retain the tribal identities of their units. Alaqush of the Ongud was allowed to retain five thousand warriors of his tribe because his son had entered into an alliance pact with Genghis, marrying his daughter Alaqa.A key tool which underpinned these reforms was the expansion of the keshig ('bodyguard'). After Temüjin defeated Toghrul in 1203, he had appropriated this Kereit institution in a minor form, but at the 1206 kurultai its numbers were greatly expanded, from 1,150 to 10,000 men. The keshig was not only the khan's bodyguard, but his household staff, a military academy, and the centre of governmental administration. All the warriors in this elite corps were brothers or sons of military commanders and were essentially hostages. The members of the keshig nevertheless received special privileges and direct access to the khan, whom they would serve and who in return would evaluate their capabilities and their potential to govern or command. Commanders such as Subutai, Chormaqan, and Baiju all started out in the keshig, before being given command of their own force."}, {"text": "=== Consolidation of power (1206–1210) ===From 1204 to 1209, Genghis Khan was predominantly focused on consolidating and maintaining his new nation. He faced a challenge from Kokechu, the son of Münglig, the trusted retainer of Yesügei, to whom Genghis had given his mother Hö'elün in marriage. Kokechu was the shaman who had proclaimed Temüjin as Genghis Khan and taken the Tengrist title \"Teb Tenggeri\" (lit. \"Wholly Heavenly\") on account of his sorcery. He was very influential among the Mongol commoners and sought to divide the imperial family. Genghis's brother Qasar was the first of Kokechu's targets—always distrusted by his brother, Qasar was humiliated and almost imprisoned on false charges before Hö'elün intervened by publicly reprimanding Genghis. Nevertheless, Kokechu's power steadily increased. When Temüge, Genghis's youngest brother, attempted to intervene he too was publicly shamed. Börte saw that Kokechu was a threat to Genghis's power and warned her husband, who still superstitiously revered the shaman; allowing Temüge to have Kokechu killed, he usurped the shaman's position as the Mongols' highest spiritual authority.During these years, the Mongols imposed their control on surrounding areas. Genghis dispatched Jochi northwards in 1207 to subjugate the Hoi-yin Irgen, a collection of tribes on the edge of the Siberian taiga. Having secured a marriage alliance with the Oirats and defeated the Yenisei Kyrgyz, he took control of the region's trade in grain and furs, as well as its gold mines. Mongol armies also rode westwards, defeating the Naiman-Merkit alliance on the River Irtysh in late 1208. Their khan was killed and Kuchlug fled into Central Asia. Led by Barchuk, the Uyghurs freed themselves from the suzerainty of the Qara Khitai and pledged themselves to Genghis in 1211 as the first sedentary society to submit to the Mongols."}, {"text": "=== Consolidation of power (1206–1210) ===The Mongols had started raiding the border settlements of the Tangut-led Western Xia kingdom in 1205, ostensibly in retaliation for allowing Senggum, Toghrul's son, refuge. More prosaic explanations include rejuvenating the depleted Mongol economy with an influx of fresh goods and livestock, or simply subjugating a semi-hostile state to protect the nascent Mongol nation. Most Xia troops were stationed along the southern and western borders of the kingdom to guard against attacks from the Song and Jin dynasties respectively, while its northern border relied only on the Gobi desert for protection. After a raid in 1207 sacked the Xia fortress of Wulahai, Genghis decided to personally lead a full-scale invasion in 1209.Wulahai was captured again in May and the Mongols advanced on the capital Zhongxing (modern-day Yinchuan) but suffered a reverse against a Xia army. After a two-month stalemate, Genghis broke the deadlock with a feigned retreat; the Xia forces were deceived out of their defensive positions and overpowered. Although Zhongxing was now mostly undefended, the Mongols lacked any siege equipment better than crude battering rams and were unable to progress the siege. The Xia requested aid from the Jin, but Emperor Zhangzong rejected the plea. Genghis's attempt to redirect the Yellow River into the city with a dam initially worked, but the poorly-constructed earthworks broke—possibly breached by the Xia—in January 1210 and the Mongol camp was flooded, forcing them to retreat. A peace treaty was soon formalised: the Xia emperor Xiangzong submitted and handed over tribute, including his daughter Chaka, in exchange for the Mongol withdrawal."}, {"text": "=== Campaign against the Jin (1211–1215) ===Wanyan Yongji usurped the Jin throne in 1209. He had previously served on the steppe frontier and Genghis greatly disliked him. When asked to submit and pay the annual tribute to Yongji in 1210, Genghis instead mocked the emperor, spat, and rode away from the Jin envoy—a challenge that meant war. Despite the possibility of being outnumbered eight-to-one by 600,000 Jin soldiers, Genghis had made preparations for an invasion of Jin since learning in 1206 that the state was wracked by internal instabilities. Genghis had two aims: to take vengeance for past wrongs committed by the Jin, foremost among which was the death of Ambaghai Khan in the mid-12th century, and to win the vast amounts of plunder his troops and vassals expected.After calling for a kurultai in March 1211, Genghis launched his invasion of Jin China in May, reaching the outer ring of Jin defences the following month. These border fortifications were guarded by Alaqush's Ongud, who allowed the Mongols to pass without difficulty. The three-pronged chevauchée aimed both to plunder and burn a vast area of Jin territory to deprive them of supplies and popular legitimacy, and to secure the mountain passes which allowed access to the North China Plain. The Jin lost numerous towns and were hindered by a series of defections, the most prominent of which led directly to Muqali's victory at the Battle of Huan'erzhui in autumn 1211. The campaign was halted in 1212 when Genghis was wounded by an arrow during the unsuccessful siege of Xijing (modern Datong). Following this failure, Genghis set up a corps of siege engineers, which recruited 500 Jin experts over the next two years.The defences of Juyong Pass had been strongly reinforced by the time the conflict resumed in 1213, but a Mongol detachment led by Jebe managed to infiltrate the pass and surprise the elite Jin defenders, opening the road to the Jin capital Zhongdu (modern-day Beijing). The Jin administration began to disintegrate: after the Khitans, a tribe subject to the Jin, entered open rebellion, Hushahu, the commander of the forces at Xijing, abandoned his post and staged a coup in Zhongdu, killing Yongji and installing his own puppet ruler, Xuanzong. This governmental breakdown was fortunate for Genghis's forces; emboldened by their victories, they had seriously overreached and lost the initiative. Unable to do more than camp before Zhongdu's fortifications while his army suffered from an epidemic and famine—they resorted to cannibalism according to Carpini, who may have been exaggerating—Genghis opened peace negotiations despite his commanders' militance. He secured tribute, including 3,000 horses, 500 slaves, a Jin princess, and massive amounts of gold and silk, before lifting the siege and setting off homewards in May 1214.As the northern Jin lands had been ravaged by plague and war, Xuanzong moved the capital and imperial court 600 kilometres (370 mi) southwards to Kaifeng. Interpreting this as an attempt to regroup in the south and then restart the war, Genghis concluded the terms of the peace treaty had been broken. He immediately prepared to return and capture Zhongdu. According to Christopher Atwood, it was only at this juncture that Genghis decided to fully conquer northern China. Muqali captured numerous towns in Liaodong during winter 1214–15, and although the inhabitants of Zhongdu surrendered to Genghis on 31 May 1215, the city was sacked. When Genghis returned to Mongolia in early 1216, Muqali was left in command in China. He waged a brutal but effective campaign against the unstable Jin regime until his death in 1223."}, {"text": "=== Defeating rebellions and Qara Khitai (1216–1218) ===In 1207, Genghis had appointed a man named Qorchi as governor of the subdued Hoi-yin Irgen tribes in Siberia. Appointed not for his talents but for prior services rendered, Qorchi's tendency to abduct women as concubines for his harem caused the tribes to rebel and take him prisoner in early 1216. The following year, they ambushed and killed Boroqul, one of Genghis's highest-ranking nökod. The khan was livid at the loss of his close friend and prepared to lead a retaliatory campaign; eventually dissuaded from this course, he dispatched his eldest son Jochi and a Dörbet commander. They managed to surprise and defeat the rebels, securing control over this economically important region.Kuchlug, the Naiman prince who had been defeated in 1204, had usurped the throne of the Central Asian Qara Khitai dynasty between 1211 and 1213. He was a greedy and arbitrary ruler who probably earned the enmity of the native Islamic populace whom he attempted to forcibly convert to Buddhism. Genghis sensed that Kuchlug might be a potential threat to his empire, and Jebe was sent with an army of 20,000 cavalry to the city of Kashgar; he undermined Kuchlug's rule by emphasising the Mongol policies of religious tolerance and gained the loyalty of the local elite. Kuchlug was forced to flee southwards to the Pamir Mountains, but was captured by local hunters. Jebe had him beheaded and paraded his corpse through Qara Khitai, proclaiming the end of religious persecution in the region."}, {"text": "=== Invasion of the Khwarazmian Empire (1219–1221) ===Genghis had now attained complete control of the eastern portion of the Silk Road, and his territory bordered that of the Khwarazmian Empire, which ruled over much of Central Asia, Persia and Afghanistan. Merchants from both sides were eager to restart trading, which had halted during Kuchlug's rule; the Khwarazmian ruler Muhammad II dispatched an envoy shortly after the Mongol capture of Zhongdu, while Genghis instructed his merchants to obtain the high-quality textiles and steel of Central and Western Asia. Many members of the altan uruq invested in one particular caravan of 450 merchants which set off to Khwarazmia in 1218 with a large quantity of goods. Muhammad had however grown suspicious of Genghis's intentions, and when Inalchuq, the governor of the border town of Otrar, decided to halt the caravan, massacre the merchants on grounds of espionage, and seize the goods, he either supported Inalchuq or turned a blind eye. A Mongol ambassador was sent with two companions to avert war, but Muhammad killed him and humiliated his companions. The killing of an envoy infuriated Genghis, who resolved to leave Muqali with a small force in North China and invade Khwarazmia with most of his army.Muhammad's empire was large but disunited: he ruled alongside his mother Terken Khatun in what Peter Golden terms \"an uneasy diarchy\", while the Khwarazmian nobility and populace were discontented with his warring and the centralisation of government. For these reasons and others he declined to meet the Mongols in the field, instead garrisoning his unruly troops in his major cities. This allowed the lightly armoured, highly mobile Mongol armies uncontested superiority outside city walls. Otrar was besieged in autumn 1219—the siege dragged on for five months, but in February 1220 the city fell and Inalchuq was executed. Genghis had meanwhile divided his forces. Leaving his sons Chagatai and Ogedei besieging the city, he had sent Jochi northwards down the Syr Darya river and another force southwards into central Transoxiana, while he and Tolui took the main Mongol army across the Kyzylkum Desert, surprising the garrison of Bukhara in a pincer movement."}, {"text": "=== Invasion of the Khwarazmian Empire (1219–1221) ===Bukhara's citadel was captured in February 1220 and Genghis moved against Muhammad's residence Samarkand, which fell the following month. Bewildered by the speed of the Mongol conquests, Muhammad fled from Balkh, closely followed by Jebe and Subutai; the two generals pursued the Khwarazmshah until he died from dysentry on a Caspian Sea island in winter 1220–21, having nominated his eldest son Jalal al-Din as his successor. Jebe and Subutai then set out on a 7,500 kilometres (4,700 mi)-expedition around the Caspian Sea. Later called the Great Raid, this lasted four years and saw the Mongols come into contact with Europe for the first time. Meanwhile, the Khwarazmian capital of Gurganj was being besieged by Genghis's three eldest sons. The long siege ended in spring 1221 amid brutal urban conflict. Jalal al-Din moved southwards to Afghanistan, gathering forces on the way and defeating a Mongol unit under the command of Shigi Qutuqu, Genghis's adopted son, in the Battle of Parwan. Jalal was weakened by arguments among his commanders, and losing decisively at the Battle of the Indus in November 1221, he was compelled to swim across the Indus river into India.Genghis's youngest son Tolui was concurrently conducting a brutal campaign in the regions of Khorasan. Every city that resisted was destroyed—Nishapur, Merv and Herat, three of the largest and wealthiest cities in the world, were all annihilated. This campaign established Genghis's lasting image as a ruthless, inhumane conqueror. Contemporary Persian historians placed the death toll from the three sieges alone at over 5.7 million—a number regarded as grossly exaggerated by modern scholars. Nevertheless, even a total death toll of 1.25 million for the entire campaign, as estimated by John Man, would have been a demographic catastrophe."}, {"text": "=== Return to China and final campaign (1222–1227) ===Genghis abruptly halted his Central Asian campaigns in 1221. Initially aiming to return via India, Genghis realised that the heat and humidity of the South Asian climate impeded his army's skills, while the omens were additionally unfavourable. Although the Mongols spent much of 1222 repeatedly overcoming rebellions in Khorasan, they withdrew completely from the region to avoid overextending themselves, setting their new frontier on the Amu Darya river. During his lengthy return journey, Genghis prepared a new administrative division which would govern the conquered territories, appointing darughachi (commissioners, lit. \"those who press the seal\") and basqaq (local officials) to manage the region back to normalcy. He also summoned and spoke with the Taoist patriarch Changchun in the Hindu Kush. The khan listened attentively to Changchun's teachings and granted his followers numerous privileges, including tax exemptions and authority over all monks throughout the empire—a grant which the Taoists would later use to try to gain superiority over Buddhism.The usual reason given for the halting of the campaign is that the Western Xia, having declined to provide auxiliaries for the 1219 invasion, had additionally disobeyed Muqali in his campaign against the remaining Jin in Shaanxi. May has disputed this, arguing that the Xia fought in concert with Muqali until his death in 1223, when, frustrated by Mongol control and sensing an opportunity with Genghis campaigning in Central Asia, they ceased fighting. In either case, Genghis initially attempted to resolve the situation diplomatically, but when the Xia elite failed to come to an agreement on the hostages they were to send to the Mongols, he lost patience.Returning to Mongolia in early 1225, he spent the year in preparation for a campaign against them. This began in the first months of 1226 with the capture of Khara-Khoto on the Xia's western border. The invasion proceeded apace. Genghis ordered that the cities of the Gansu Corridor be sacked one by one, granting clemency only to a few. Having crossed the Yellow River in autumn, the Mongols besieged present-day Lingwu, located just 30 kilometres (19 mi) south of the Xia capital Zhongxing, in November. On 4 December, Genghis decisively defeated a Xia relief army; the khan left the siege of the capital to his generals and moved southwards with Subutai to plunder and secure Jin territories."}, {"text": "== Family and succession ==The tribes of the Mongol steppe had no fixed succession system, but often defaulted to some form of ultimogeniture—succession of the youngest son—because he would have had the least time to gain a following for himself and needed the help of his father's inheritance. However, this type of inheritance applied only to property, not to titles. Through the Mongol appanage system, Genghis allocated lands and populations as property to each member of his close family. His brothers Qasar, Hachiun, Temüge, and Belgutei were given lands along the Greater Khingan mountains in the east, and the lands of his three elder sons were located in the west: for Jochi, along the Irtysh river, extending into Siberia and the territory of the Kipchaks; for Chagatai, the former Qara Khitai territories surrounding Almaligh in Turkestan; and for Ogedei, lands in Dzungaria. Tolui, the youngest son, received the Mongolian heartland near the Altai Mountains.The Secret History records that Genghis chose his successor at the behest of his wife Yisui while preparing for the Khwarazmian campaigns in 1219; Rashid al-Din, on the other hand, states that the decision came before Genghis's final campaign against the Xia. Regardless of the date, there were five possible candidates: Genghis's four sons and his youngest brother Temüge, who had the weakest claim and who was never seriously considered. Even though there was a strong possibility Jochi was illegitimate, Genghis was not particularly concerned by this; nevertheless, he and Jochi became increasingly estranged over time, due to Jochi's preoccupation with his own appanage. After the siege of Gurganj, where he only reluctantly participated in reducing the wealthy city that would become part of his territory, he failed to give Genghis the normal share of the booty, which exacerbated the tensions. Genghis was angered by Jochi's refusal to return to him in 1223, and was considering sending Ogedei and Chagatai to bring him to heel when news came that Jochi had died from an illness.Chagatai's attitude towards Jochi's possible succession—he had termed his elder brother \"a Merkit bastard\" and had brawled with him in front of their father—led Genghis to view him as uncompromising, arrogant, and narrow-minded, despite his great knowledge of Mongol legal customs. His elimination left Ogedei and Tolui as the two primary candidates. Tolui was unquestionably superior in military terms—his campaign in Khorasan had broken the Khwarazmian Empire, while his elder brother was far less able as a commander. Ogedei was also known to drink excessively even by Mongol standards—it was eventually the cause of his death in 1241. However, he possessed talents all his brothers lacked—he was generous and generally well-liked. Aware of his own lack of military skill, he was able to trust his capable subordinates, and unlike his elder brothers, compromise on issues; he was also more likely to preserve Mongol traditions than Tolui, whose wife Sorghaghtani, herself a Nestorian Christian, was a patron of many religions including Islam. Ogedei was thus recognised as the heir to the Mongol throne."}, {"text": "== Death and aftermath ==Genghis fell from his horse while hunting in the winter of 1226–27 and became increasingly ill during the following months. This slowed the siege's progress, as his sons and commanders urged him to end the campaign and return to Mongolia to recover, arguing that the Xia would still be there another year. Incensed by insults from Xia's leading commander, Genghis insisted that the siege be continued. He died on 25 August 1227, but his death was kept a closely guarded secret and Zhongxing, unaware, fell the following month. The city was put to the sword and its population was treated with extreme savagery—the Xia civilization was essentially extinguished in what Man described as a \"very successful ethnocide\". The exact nature of the khan's death has been the subject of intense speculation. Rashid al-Din and the History of Yuan mention he suffered from an illness—possibly malaria, typhus, or bubonic plague. Marco Polo claimed that he was shot by an arrow during a siege, while Carpini reported that Genghis was struck by lightning. Legends sprang up around the event—the most famous recounts how the beautiful Gurbelchin, formerly the Xia emperor's wife, injured Genghis's genitals with a dagger during sex.After his death, Genghis was transported back to Mongolia and buried on or near the sacred Burkhan Khaldun peak in the Khentii Mountains, on a site he had chosen years before. Specific details of the funeral procession and burial were not made public knowledge; the mountain, declared ikh khorig (lit. \"Great Taboo\"; i.e. prohibited zone), was out of bounds to all but its Uriankhai guard. When Ogedei acceded to the throne in 1229, the grave was honoured with three days of offerings and the sacrifice of thirty maidens. Ratchnevsky theorises that the Mongols, who had no knowledge of embalming techniques, may have buried the khan in the Ordos to avoid his body decomposing in the summer heat; Atwood rejects this hypothesis.Serving as regent after Genghis's death, Tolui established a precedent for the customary traditions after a khan's death. These included the halting of all military offensives involving Mongol troops, the establishment of a lengthy mourning period overseen by the regent, and the holding of a kurultai which would nominate successors and select them. For Tolui, this presented an opportunity. He was still a viable candidate for succession and had the support of the family of Jochi. Any general kurultai, attended by the commanders Genghis had promoted and honoured, would however observe their former ruler's desires without question and appoint Ogedei as ruler. It has been suggested that Tolui's reluctance to hold the kurultai was driven by the knowledge of the threat it posed to his ambitions. In the end, Tolui had to be persuaded by the advisor Yelu Chucai to hold the kurultai; in 1229, it crowned Ogedei as khan, with Tolui in attendance."}, {"text": "== Character and achievements ==No eyewitness description or contemporaneous depiction of Genghis Khan survives. The two earliest descriptions come from the Persian chronicler Juzjani and the Song diplomat Zhao Hong. Both record that he was tall and strong with a powerful stature. Zhao said that Genghis had a broad brow and long beard while Juzjani remarks that the khan lacked grey hair and had cat's eyes. The Secret History records that Börte's father remarked on his \"flashing eyes and lively face\" when meeting him.Atwood has suggested that many of Genghis Khan's values, especially the emphasis he placed on an orderly society, derive from his turbulent youth. He valued loyalty above all and mutual fidelity became a cornerstone of his new nation. Genghis did not find it difficult to gain the allegiance of others: he was superbly charismatic even as a youth, as shown by the number of people who left existing social roles behind to join him. Although his trust was hard to earn, if he felt loyalty was assured, he granted his total confidence in return. Recognised for his generosity towards his followers, Genghis unhesitatingly rewarded previous assistance. The nökod most honoured at the 1206 kurultai were those who had accompanied him since the beginning, and those who had sworn the Baljuna Covenant with him at his lowest point. He took responsibility for the families of nökod killed in battle or who otherwise fell on hard times by raising a tax to provide them with clothing and sustenance."}, {"text": "== Character and achievements ==The principal source of steppe wealth was post-battle plunder, of which a leader would normally claim a large share; Genghis eschewed this custom, choosing instead to divide booty equally between himself and all his men. Disliking any form of luxury, he extolled the simple life of the nomad in a letter to Changchun, and objected to being addressed with obsequious flattery. He encouraged his companions to address him informally, give him advice, and criticise his mistakes. Genghis's openness to criticism and willingness to learn saw him seeking the knowledge of family members, companions, neighbouring states, and enemies. He sought and gained knowledge of sophisticated weaponry from China and the Muslim world, appropriated the Uyghur alphabet with the help of the captured scribe Tata-tonga, and employed numerous specialists across legal, commercial, and administrative fields. He also understood the need for a smooth succession and showed good judgement in choosing his heir.Although he is today renowned for his military conquests, very little is known about Genghis's personal generalship. His skills were more suited to identifying potential commanders. His institution of a meritocratic command structure gave the Mongol army military superiority, even though it was not technologically or tactically innovative. The army that Genghis created was characterised by its draconian discipline, its ability to gather and use military intelligence efficiently, a mastery of psychological warfare, and a willingness to be utterly ruthless. Genghis thoroughly enjoyed exacting vengeance on his enemies—the concept lay at the heart of achi qari'ulqu (lit. '\"good for good, evil for evil\"'), the steppe code of justice. In exceptional circumstances, such as when Muhammad of Khwarazm executed his envoys, the need for vengeance overrode all other considerations.Genghis came to believe the supreme deity Tengri had ordained a great destiny for him. Initially, the bounds of this ambition was limited only to Mongolia, but as success followed success and the reach of the Mongol nation expanded, he and his followers came to believe he was embodied with suu (lit. ''divine grace''). Believing that he had an intimate connection with Heaven, anyone who did not recognise his right to world power was treated as an enemy. This viewpoint allowed Genghis to rationalise any hypocritical or duplicitous moments on his own part, such as killing his anda Jamukha or killing nökod who wavered in their loyalties."}, {"text": "== Legacy and historical assessment ==Genghis Khan left a vast and controversial legacy. His unification of the Mongol tribes and his foundation of the largest contiguous state in world history \"permanently alter[ed] the worldview of European, Islamic, [and] East Asian civilizations\", according to Atwood. His conquests enabled the creation of Eurasian trading systems unprecedented in their scale, which brought wealth and security to the tribes. Although he very likely did not codify the written body of laws known as the Great Yasa, he did reorganise the legal system and establish a powerful judicial authority under Shigi Qutuqu.On the other hand, his conquests were ruthless and brutal. The prosperous civilizations of China, Central Asia, and Persia were devastated by the Mongol assaults, and underwent multi-generational trauma and suffering as a result. Perhaps Genghis's greatest failing was his inability to create a working succession system—his division of his empire into appanages, meant to ensure stability, actually did the reverse, as local and state-wide interests diverged and the empire started to split into the Golden Horde, the Chagatai Khanate, the Ilkhanate, and the Yuan dynasty. In the mid-1990s, the Washington Post acclaimed Genghis Khan as the \"man of the millennium\" who \"embodied the half-civilized, half-savage duality of the human race\". This complex image has remained prevalent in modern scholarship, with historians emphasising both Genghis Khan's positive and negative contributions."}, {"text": "=== Mongolia ===For many centuries, Genghis was remembered in Mongolia as a religious figure, not a political one. After Altan Khan converted to Tibetan Buddhism in the late 1500s, Genghis was deified and given a central role in the Mongolian religious tradition. As a deity, Genghis drew upon Buddhist, shamanistic, and folk traditions: for example, he was defined as a new incarnation of a chakravartin (idealised ruler) like Ashoka, or of the martial bodhisattva Vajrapani; he was connected genealogically to the Buddha and to ancient Buddhist kings; he was invoked during weddings and festivals; and he took a large role in ancestor veneration rituals. He also became the focus point of a sleeping hero legend, in which he will return to help the Mongol people in a time of great need. His cult was centred at the naiman chagan ordon (lit. '\"Eight White Yurts\"'), today a mausoleum in Inner Mongolia, China.In the 19th and early 20th century, Genghis began to be viewed as the national hero of the Mongolian people. Foreign powers recognised this: during its occupation of Inner Mongolia, Imperial Japan funded the construction of a temple to Genghis, while both the Kuomintang and the Chinese Communist Party used the memory of Genghis to woo potential allies in the Chinese Civil War. This attitude was maintained during World War II, when the Soviet-aligned Mongolian People's Republic promoted Genghis to build patriotic zeal against invaders; however, as he was a non-Russian hero who could serve as an anticommunist figurehead, this attitude swiftly changed after the war's end. According to May, Genghis \"was condemned as a feudal and reactionary lord [who] exploited the people.\" His cult was repressed, the alphabet he chose was replaced with the Cyrillic script, and celebrations planned for the 800th anniversary of his birth in 1962 were cancelled and denigrated after loud Soviet complaints. Because Chinese historians were largely more favourable towards him than their Soviet circumstances, Genghis played a minor role in the Sino-Soviet split."}, {"text": "=== Mongolia ===The arrival of the policies of glasnost and perestroika in the 1980s paved the way for official rehabilitation. Less than two years after the 1990 revolution, Lenin Avenue in the capital Ulaanbaatar was renamed Chinggis Khan Avenue. Since then, Mongolia has named Chinggis Khaan International Airport and erected a large statue in Sükhbaatar Square (which was itself renamed after Genghis between 2013 and 2016). His visage appears on items ranging from postage stamps and high-value banknotes to brands of alcohol and toilet paper. In 2006, the Mongolian parliament officially discussed the trivialization of his name through excessive advertising.Modern Mongolians tend to downplay Genghis's military conquests in favour of his political and civil legacy—they view the destructive campaigns as \"a product of their time\", in the words of the historian Michal Biran, and secondary to his other contributions to Mongolian and world history. His policies—such his use of the kurultai, his establishment of the rule of law through an independent judiciary, and human rights—are seen as the foundations that allowed the creation of the modern, democratic Mongolian state. Viewed as someone who brought peace and knowledge rather than war and destruction, Genghis Khan is idealised for making Mongolia the centre of international culture for a period. He is generally recognised as the founding father of Mongolia."}, {"text": "=== Elsewhere ===Under the Yuan dynasty in China, Genghis was revered as the nation's creator, and he remained in this position even after the foundation of the Ming dynasty in 1368. Although the late Ming somewhat disavowed his memory, the positive viewpoint was restored under the Manchu Qing dynasty (1644–1911), who positioned themselves as his heirs. The rise of 20th-century Chinese nationalism initially caused the denigration of Genghis as a traumatic occupier, but he was later resurrected as a useful political symbol on a variety of issues. Modern Chinese historiography has generally viewed Genghis positively and he has been portrayed as a Chinese hero. By contrast, Genghis is viewed extremely negatively in Russia, where historians have consistently portrayed the rule of the Golden Horde—the \"Tatar Yoke\"—as backwards, destructive, inimical to all progress, and the reason for all of Russia's flaws.Similarly, the modern Muslim world views Genghis as the ultimate \"accursed enemy\", a \"barbarian savage who began the demolition of civilization which culminated in [the Siege of Baghdad in 1258]\". The West, never directly affected by Genghis, has viewed him in shifting and contrasting ways. During the 14th century, as shown by the works of Marco Polo and Geoffrey Chaucer, he was seen as a just and wise ruler, but during the 18th century he came to embody the Enlightenment stereotype of a tyrannical Oriental despot. In recent decades, Western scholarship has become increasingly nuanced, viewing Genghis as a more complex individual."}]