[{"text": "Grace Patricia Kelly (November 12, 1929 – September 14, 1982), also known as Grace of Monaco, was an American actress and Princess of Monaco as the wife of Prince Rainier III from their marriage on April 18, 1956, until her death. Prior to her marriage, she starred in several significant films in the early to mid-1950s. She received an Academy Award, three Golden Globe Awards and was ranked 13th on the American Film Institute's 25 Greatest Female Stars list.Kelly was born into a prominent Catholic family in Philadelphia. After graduating from the American Academy of Dramatic Arts in 1949, Kelly began appearing in New York City theatrical productions and television broadcasts. She made her film debut in Fourteen Hours (1951) and gained stardom from her roles in Fred Zinnemann's western film High Noon (1952), and John Ford's adventure-romance Mogambo (1953), the latter of which earned her the Academy Award for Best Supporting Actress nomination. She won the Academy Award for Best Actress for her performance in the drama The Country Girl (1954). Other notable works include the war film The Bridges at Toko-Ri (1954), the romantic comedy High Society (1956), and three Alfred Hitchcock suspense thrillers: Dial M for Murder (1954), Rear Window (1954), and To Catch a Thief (1955)."}, {"text": "Kelly retired from acting at age 26 to marry Rainier and began her duties as Princess of Monaco. Grace and Rainier had three children: Princess Caroline, Prince Albert, and Princess Stéphanie. Princess Grace's charity work focused on young children and the arts. In 1964, she established the Princess Grace Foundation to support local artisans. Her organization for children's rights, AMADE Mondiale, gained consultive status within UNICEF and UNESCO. Her final film role was narrating The Children of Theatre Street (1977), which was nominated for an Academy Award for Best Documentary Feature."}, {"text": "Kelly died at the age of 52 at Monaco Hospital, from injuries sustained in a car crash. Her son, Prince Albert, helped establish the Princess Grace Awards in 1984 to recognize emerging performers in film, theatre, and dance."}, {"text": "== Early life and family ==Grace Patricia Kelly was born on November 12, 1929, at Hahnemann University Hospital in Philadelphia, Pennsylvania, to an affluent and influential family. Her father, John B. Kelly Sr., was born to Irish immigrants and won three Olympic gold medals for sculling. He owned a successful brickwork contracting company that was well known on the East Coast. As Democratic nominee in the 1935 election for Mayor of Philadelphia, he lost by the closest margin in the city's history. In later years he served on the Fairmount Park Commission and, during World War II, was appointed by President Roosevelt as National Director of Physical Fitness. His brother Walter C. Kelly was a vaudeville star, who also made films for Metro-Goldwyn-Mayer and Paramount Pictures, and another named George was a Pulitzer Prize-winning dramatist, screenwriter, and director.Kelly's mother, Margaret Majer, was of German ancestry. Margaret had taught physical education at the University of Pennsylvania and had been the first woman to coach women's athletics at Penn. She also modeled for a time in her youth. After marrying John Kelly in 1924, Margaret focused on being a homemaker until all her children were of school age, following which she began actively participating in various civic organizations. Patrilineally, Margaret descended from Prof. Johann Christian von Majer (1741–1821) from Ludwigsburg, who worked as a political scientist, jurist and theologian, and was elected five times Rector of the University of Tübingen. Through him, Grace was descended from the Stauffenberg family and many other minor German noble families, such as von Plieningen, von Münchingen, von Ow, von Bettendorf, von Nippenburg, and von Roth.Grace Kelly had two older siblings, Margaret and John Jr., and a younger sister, Elizabeth. The children were raised in the Catholic faith.Kelly grew up in a small, close-knit Catholic community. She was baptized and received her elementary education in the parish of Saint Bridget's in East Falls. Founded in 1853 by Saint John Neumann, the fourth Bishop of Philadelphia, Saint Bridget's was a relatively young parish, with families very familiar with one another. While attending Ravenhill Academy, a Catholic girls' school, Kelly modeled fashions at local charity events with her mother and sisters. In 1942, at the age of 12, she played the lead in Don't Feed the Animals, a play produced by the Old Academy Players also in East Falls."}, {"text": "== Early life and family ==In May 1947, she graduated from Stevens School, a private institution in nearby Chestnut Hill, where she participated in drama and dance programs. Her graduation yearbook listed her favorite actress as Ingrid Bergman and her favorite actor as Joseph Cotten. Written in the \"Stevens' Prophecy\" section was: \"Miss Grace P. Kelly – a famous star of stage and screen\". Owing to her low mathematics scores, Kelly was rejected by Bennington College in July 1947. Despite her parents' initial disapproval, Kelly decided to pursue her dreams of becoming an actress. Her father was particularly displeased with her decision, as he viewed acting as \"a slim cut above streetwalker\" at the time. In 1947, Kelly signed with the Walter Thornton Model Agency gracing the covers of magazines.In 1954, Kelly dated and was engaged to Oleg Cassini after his divorce from Gene Tierney."}, {"text": "=== 1949–1950: Beginnings ===To start her career, she auditioned for the American Academy of Dramatic Arts in New York, using a scene from her uncle George Kelly's The Torch-Bearers (1923). Although the school had already met its semester quota, she obtained an interview with the admissions department, and was admitted through George's influence. Kelly worked diligently, and practiced her speech by using a tape recorder. Her early acting pursuits led her to the stage, and she made her Broadway debut in Strindberg's The Father, alongside Raymond Massey. At 19, her graduation performance was as Tracy Lord in The Philadelphia Story. Her uncle continued to advise and mentor Kelly throughout her acting career.At her father's insistence, she lived at the Barbizon Hotel for Women in Manhattan. She was hired as a model by the John Robert Powers agency, where some of her first modeling jobs were doing commercials for bug spray and cigarettes. Kelly was reportedly \"fond of dancing to Hawaiian music down the hallways of the Barbizon, and given to shocking her fellow residents by performing topless\". She later wrote that she had \"wonderful memories of the three years I spent at the Barbizon.\"Television producer Delbert Mann cast Kelly as the lead in an adaptation of the Sinclair Lewis novel Bethel Merriday; this was her first of nearly sixty live television programs. She was mentioned in Theatre World magazine as \"[a] most promising personality of the Broadway stage of 1950\". Some of her well-known works as a theater actress were: The Father, The Rockingham Tea Set, The Apple Tree, The Mirror of Delusion, Episode (for Somerset Maugham's tele-serial), among others.Impressed by her work in The Father, Henry Hathaway, director of the Twentieth Century-Fox film Fourteen Hours (1951), offered her a small role in the film. Kelly had a minor role opposite Paul Douglas, Richard Basehart, and Barbara Bel Geddes, as a young woman contemplating divorce. Douglas commented: \"In two senses, she did not have a bad side – you could film her from any angle, and she was one of the most un-temperamental, cooperative people in the business.\" Following the release of the film, the \"Grace Kelly Fan Club\" was established, gaining popularity across the country with local chapters springing up and attracting many members. Kelly referred to her fan club as \"terrifically amusing\".Kelly was noticed during a visit to the set of Fourteen Hours by Gary Cooper. However, Kelly's performance in Fourteen Hours went largely unnoticed by critics and did not contribute to her film career's momentum. She continued her work in the theater and on television, although she lacked \"vocal horsepower\", and it was thought she would likely not have had a lengthy stage career."}, {"text": "=== 1951–1953: Early films and breakthrough ===Kelly was performing at Colorado's Elitch Theatre when producer Stanley Kramer offered her a role co-starring opposite Cooper in Fred Zinnemann's High Noon (1952), a Western filmed in Columbia, California. She accepted the role, and the film was shot in the late summer and early fall of 1951 over a 28-day shooting schedule in hot weather conditions. She was cast as a \"young Quaker bride to Gary Cooper's stoic marshal\", and wore a \"suitably demure vaguely Victorian dress\". High Noon garnered four Academy Awards, and has since been ranked by some reviewers among the best films of all time.Biographer H. Haughland stated: \"Miss Kelly's acting did not excite the critics, or live up to her own expectations.\" Some critics scoffed at the conclusion of the film in which Cooper's character has to be saved by Kelly's. One critic argued that her pacifist character, killing a man who is about to shoot her husband, was cold and abstract. Alfred Hitchcock described her performance as \"rather mousy\", and stated that it lacked animation. He said that it was only in her later films that she \"really blossomed\" and showed her quality."}, {"text": "=== 1951–1953: Early films and breakthrough ===After filming High Noon, Kelly returned to New York City and took private acting lessons, wanting to be taken seriously as an actress. She performed in a few dramas in the theater, and in TV serials. She appeared in several television plays, and screen-tested for the film Taxi in the spring of 1952. Director John Ford noticed Kelly in the screen test, and his studio flew her out to Los Angeles to audition in September 1952. Ford said that Kelly showed \"breeding, quality, and class\". She was given the role, along with a seven-year contract at the relatively low salary of $850 a week (equivalent to $9,753 in 2023). Kelly signed the deal under two conditions: first, that one out of every two years, she had time off to work in the theatre; and second, that she be able to live in New York City at her residence in Manhattan House, at 200 E. 66th Street, now a landmark.In November 1952, Kelly and the cast arrived in Nairobi to begin the production of the film Mogambo, replacing Gene Tierney, who dropped out at the last minute due to personal issues. Kelly later told Hollywood columnist Hedda Hopper, \"Mogambo had three things that interested me: John Ford, Clark Gable, and a trip to Africa, with expenses paid. If Mogambo had been made in Arizona, I wouldn't have done it.\" Kelly played Linda Nordley, a contemplative English wife with a romantic interest in Clark Gable's character. Filming took place over the course of three months. The costumes were designed by Helen Rose. A break in the filming schedule afforded her and Mogambo co-star Ava Gardner a visit to Rome. The film was released in 1953, and had a successful run at the box office. Kelly won a Golden Globe Award for Best Supporting Actress, and received her first Academy Award nomination for Best Supporting Actress for her performance."}, {"text": "=== 1954–1956: Critical acclaim and final films ===After the success of Mogambo, Kelly starred in the television play The Way of an Eagle with Jean-Pierre Aumont, before being cast in the film adaptation of Frederick Knott's Broadway play Dial M for Murder, opposite Ray Milland and Robert Cummings. Kelly played the role of the wealthy wife of a retired professional tennis player. Alfred Hitchcock became one of Kelly's mentors during the last years of her career. She was subsequently loaned by MGM to work in several Hitchcock films, which would become some of her most critically acclaimed and recognized work. Kelly began filming scenes for her next film, The Bridges at Toko-Ri, in early 1954, with William Holden, for Paramount Pictures. The story, based on the novel by James Michener, is about American Navy jet fighters stationed to fight in Asia. Kelly played the role of Holden's wife. Edith Head, with whom she had established a friendly relationship, did her costumes.Kelly unhesitatingly turned down the opportunity to star alongside Marlon Brando in On the Waterfront (1954). Eva Marie Saint, who replaced her, went on to win an Academy Award for the role. Instead, Kelly played the role of Lisa Fremont in Rear Window. Kelly stated, \"All through the making of Dial M for Murder, he (Hitchcock) sat and talked to me about Rear Window all the time, even before we had discussed my being in it.\" Kelly's co-star, James Stewart, was highly enthusiastic about working with her. The role of Lisa Fremont, a wealthy Manhattan socialite and fashion model who \"never wore the same dress twice,\" was unlike any of the previous women she had played. This marked her first performance as an independent career woman. In line with their previous collaborations, Hitchcock provided the camera with a slow-sequenced silhouette of Kelly, along with close-ups of the two stars kissing, finally lingering closely on her profile. Hitchcock brought her elegance to the foreground by changing her dresses many times, including: \"glamorous evening short dresses, a sheer negligee over a sleek nightgown, a full-skirted floral dress, and a casual pair of jeans\". Upon the film's opening in October 1954, Kelly was again praised. Variety's film critic remarked on the casting, commenting on the \"earthy quality to the relationship between Stewart and Miss Kelly\", as \"both do a fine job of the picture's acting demands\"."}, {"text": "=== 1954–1956: Critical acclaim and final films ===Kelly played the role of Bing Crosby's long-suffering wife, Georgie Elgin, in The Country Girl (1954), after a pregnant Jennifer Jones bowed out. Already familiar with the play, Kelly was highly interested in the part. To do it, MGM once again would have to lend Kelly to Paramount Pictures. Kelly was adamant, and threatened the studio, saying that if they did not allow her to do the film she would pack her bags and leave for New York for good. MGM eventually relented. Kelly also negotiated a more lucrative contract in light of her recent success. In the film, Kelly played the wife of a washed-up, alcoholic singer, played by Crosby. Her character becomes torn emotionally between her two lovers, played by Crosby and William Holden. She was again dressed by Edith Head to suit her role in the film, initially appearing in fashionable dresses, shifting to ordinary-looking cardigans toward the end of the film.As a result of her performance in The Country Girl, Kelly won the Academy Award for Best Actress. Her acceptance speech was brief: \"The thrill of this moment keeps me from saying what I really feel. I can only say thank you with all my heart to all who made this possible for me. Thank you.\" Her main competitor was Judy Garland for her performance in A Star Is Born. After receiving the Oscar nomination, Kelly won the New York Film Critics Circle Award for best actress for her performances in her three big movie roles of 1954: Rear Window, Dial M For Murder, and The Country Girl. At the Golden Globe Awards in 1955, Kelly won the Award for Best Actress in a Motion Picture – Drama. The New York Times praised her performance in The Country Girl as \"excellent\", and Rear Window got her marquee credits on a par with, and beyond, those of Stewart and Hitchcock.In April 1954, Kelly flew to Colombia for a 10-day shoot on her next project, Green Fire, with Stewart Granger. She played Catherine Knowland, a coffee plantation owner. Kelly told Hedda Hopper, \"It wasn't pleasant. We worked at a pathetic village – miserable huts and dirty. Part of the crew got shipwrecked ... It was awful.\" After the consecutive filming of Rear Window, Toko-Ri, Country Girl, and Green Fire, Kelly flew to the French Riviera to work on her third, and last, film for Hitchcock, To Catch a Thief. Loaned to Paramount for the fifth time, Kelly played the role of a temptress who wears \"luxurious and alluring clothes\", while Cary Grant played the role of a former cat burglar, then looking to catch a thief who is imitating him. Kelly and Grant developed a mutual bond and admiration for each other. Years later, when asked to name his all-time favorite actress, Grant replied: \"Well, with all due respect to dear Ingrid Bergman, I much preferred Grace. She had serenity.\"In 1956, Kelly resided in a home rented from Bill Lear in the Pacific Palisades, California for the duration of her filming. She portrayed Princess Alexandra in the film The Swan, directed by Charles Vidor, opposite Alec Guinness and Louis Jourdan. Her final role was in Charles Walters's musical film High Society, a re-make of MGM's The Philadelphia Story (1940). She portrayed Tracy Lord, opposite Bing Crosby, Frank Sinatra, and Celeste Holm in the other leads. When it was released in July 1956. Variety stated, \"Miss Kelly impresses as the femme lead with pleasantly comedienne overtones,\" and that it was \"possibly her most relaxed performance.\""}, {"text": "== Marriage ==Kelly headed the U.S. delegation at the Cannes Film Festival in April 1955. While there, she was invited to participate in a photo session with Prince Rainier III, the sovereign of the Principality of Monaco, at the Prince's Palace of Monaco. After a series of delays and complications, she met him at the palace on May 6, 1955.  "}, {"text": "== Marriage ==After a year-long courtship described as containing \"a good deal of rational appraisal on both sides,\" they married on April 19, 1956.The Napoleonic Code of Monaco and the laws of the Catholic Church necessitated two ceremonies, civil and religious. The 16-minute civil ceremony took place in the Palace Throne Room of Monaco on April 18, 1956, and a reception later in the day was attended by 3,000 Monégasque citizens. The 142 official titles that she acquired in the union (counterparts of her husband's) were formally recited. The church ceremony took place the following day at Monaco's Saint Nicholas Cathedral, presided over by Bishop Gilles Barthe. The wedding was estimated to have been watched by over 30 million viewers on television, and was described by biographer Robert Lacey in 2010 as \"the first modern event to generate media overkill\". Her wedding dress, designed by MGM's Helen Rose, was worked on for 6 weeks by three dozen dress makers. The couple left that night for their seven-week Mediterranean honeymoon cruise on the prince's yacht."}, {"text": "== Princess of Monaco ==Princess Grace gave birth to the couple's first child, Princess Caroline, on January 23, 1957. Their next child and the heir to the throne, Prince Albert, was born on March 14, 1958. Their youngest, Princess Stéphanie, was born on February 1, 1965."}, {"text": "== Princess of Monaco ==During her marriage, Grace discontinued her acting career. Instead, she performed her daily duties as princess and became involved in philanthropic work. As princess consort, she became the President of the Red Cross of Monaco (with her sister Peggy Davis and sister-in-law Princess Antoinette as the Vice-Presidents) and the Patron of Rainbow Coalition Children, an orphanage which was run by former  dancer, singer and actress Josephine Baker. She hosted an annual Christmas celebration with presents for orphaned children in Monaco. The Princess also served as president of the Garden Club of Monaco, and president of the organizing committee of the International Arts Foundation. Grace retained her link to America by her dual U.S. and Monégasque citizenship.Grace and her husband visited Ireland on three occasions, and in 1976 she purchased her family's ancestral homestead in Drumilra, near Newport, County Mayo.Grace founded AMADE Mondiale, a Monaco-based, non-profit organization which is recognized by the UN, after she witnessed the plight of Vietnamese children in 1963. According to UNESCO's website, AMADE promotes and protects the \"moral and physical integrity\" and the \"spiritual well-being of children throughout the world, without distinction of race, nationality or religion, and in a spirit of complete political independence.\" The organization currently has cooperative branches across Europe, Asia, South America, and Africa. They retain consultive status with UNICEF, UNESCO, and U.N. Economic & Social Council, alongside participative status with The Council of Europe."}, {"text": "== Princess of Monaco ==Princess Grace was active in improving the arts institutions of Monaco, forming the Princess Grace Foundation in 1964 to support local artisans. In 1965, she accepted the invitation to be an honorary member of La Leche League, a worldwide mother-to-mother support group which focuses on mothering through breastfeeding. She was a speaker at their 1971 conference in Chicago, addressing 1,400 mothers, 1,600 fathers and babies. Grace was a known advocate of breastfeeding, and successfully fed her three children. In 1975, Grace helped found the Princess Grace Academy, the resident school of the Monte Carlo Ballet. She later advocated to preserve the Belle Époque-era architecture of the principality. Grace hosted a yearly American Week in Monaco, where guests would play baseball and eat ice cream. The palace also celebrated American Thanksgiving annually.Alfred Hitchcock offered Princess Grace the lead in his film Marnie in 1962. She was eager, but public outcry in Monaco against her involvement in a film where she would play a kleptomaniac made her reconsider and ultimately reject the project. Director Herbert Ross tried to interest her in a part in his film The Turning Point (1977), but Rainier dismissed the idea. Later that year, she returned to the arts in a series of poetry readings on stage and narration of the documentary The Children of Theatre Street. She also narrated ABC's made-for-television film The Poppy Is Also a Flower (1966)."}, {"text": "== Princess of Monaco ==Grace joined the board of the 20th Century-Fox Film Corporation in 1976, becoming one of its first female members. In 1980, she published My Book of Flowers with Gwen Robyns, detailing her sense of floral aesthetics, symbolism, and flower pressing. Grace and Rainier worked together on a 33-minute independent film titled Rearranged in 1979, which received interest from ABC TV executives in 1982 after its premiere in Monaco, on the condition that it be extended to an hour. Before more scenes could be shot, Grace died and the film was never released, nor was it publicly shown again.In the early 1980s, Grace collaborated with Springmaid Company, the now-defunct bed linen brand. The collaboration was titled GPK after the initials of her maiden name and features bed linens, tablecloths, napkins, placemats, and others. Both collaborated after Neil Mandell, a newly hired Springmaid stylist, found the designs Grace made in a People magazine article on the exhibition in a Paris Gallery. Princess Grace received more than $1 million in royalties, which she donated to her favorite charities."}, {"text": "== Death ==On September 13, 1982, Kelly suffered a mild cerebral hemorrhage while driving back to Monaco from her country home in Roc Agel. As a result, she lost control of her 1972 Rover P6 3500 and drove off the steep, winding road and down the 120-foot (37 m) mountainside. Her daughter Stéphanie, who was in the passenger seat, unsuccessfully tried to regain control of the car.The Princess was taken to the Monaco Hospital (later named the Princess Grace Hospital Centre) with injuries to the brain and thorax and a fractured femur. Initially that afternoon, she was officially diagnosed with the cerebral hemorrhage and was said to be able to make a full recovery before a second, more severe, hemorrhage struck while at the hospital. With no reasonable chance of recovery, she died the following night at 10:55 p.m. after Rainier decided to turn off her life support.Stéphanie suffered a light concussion and a hairline fracture of a cervical vertebra, and was unable to attend her mother's funeral.Princess Grace's funeral was held at the Cathedral of Our Lady Immaculate in Monaco-Ville, on September 18, 1982. After a Requiem Mass, she was buried in the Grimaldi family vault. Over 400 people attended, including Cary Grant, Nancy Reagan, Danielle Mitterrand, Empress Farah of Iran, and Diana, Princess of Wales.Rainier, who did not remarry, was buried alongside her after his death in 2005."}, {"text": "== Legacy ==\"I would like to be remembered as someone who accomplished useful deeds, and who was a kind and loving person. I would like to leave the memory of a human being with a correct attitude and who did her best to help others.\""}, {"text": "== Legacy ==Kelly left a lasting legacy as a theater artist, television actress, and iconic Hollywood film star. Kelly has been cited as one of the \"classic Hitchcock blondes\", and as one of the most elegant women in cinematic and world history. One author describes her as the \"elegant glamour girl of the screen\". In 1999, Kelly was listed by Joan McIver as one of \"30 Irish-American Women Who Changed Our World.\" In a 2019 edition of the American Journal of Irish Studies, she was described as \"Irish America's poster girl\" and \"an understated Irish-American icon.\" Katherine Boyle of The Washington Post claimed that Kelly \"had dramatic effects on views of Irish Catholic immigrants in the 1950s. Indeed, America seemed to pardon her tainted blood, tuning into her televised nuptial Mass in droves despite aversion to the religious spectacle.\"Kelly appeared on the cover of the January 31, 1955, issue of the weekly magazine Time. The magazine hailed her as the top movie star who brought about \"a startling change from the run of smoky film sirens and bumptious cuties\". She was described as the \"Girl in White Gloves\" because she wore \"prim and noticeable white gloves\", and journalists often called her the \"lady\" or \"Miss Kelly\" for this reason. In appreciation of her work with Hitchcock in three of his films, Kelly later wrote a foreword to the book The Art of Alfred Hitchcock by Donald Spoto. Spoto also has written High Society: The Life of Grace Kelly, a biography published 25 years after her death.In 1982, the Princess Grace Foundation-USA was established by her husband to continue the work she had done anonymously during her lifetime, assisting emerging theater, dance and film artists in America. Incorporated in 1982, PGF-USA is headquartered in New York City and is a tax-exempt, non-profit, publicly supported organization. The Princess Grace Awards, a program of the Princess Grace Foundation-USA, has awarded nearly 800 artists at more than 100 institutions in the U.S. with more than $15 million to date. The foundation also says it \"holds the exclusive rights and facilitates the licensing of her name and likeness throughout the world.\" Her daughter, Princess Caroline, took over as president for both the Foundation and AMADE Mondiale after her death, with Prince Albert as vice president. The original Monaco branch of her foundation, named Fondation Princesse Grace, remains active and continues to provide direct aid to students and children within the Monaco and France regions."}, {"text": "== Legacy ==In 1955, Kelly was photographed by Howell Conant in Jamaica. He photographed her without makeup in a naturalistic setting, a departure from the traditional portrayal of actresses. The resulting photographs were published in Collier's, with a celebrated photo of her rising from the water with wet hair making the cover. Following Grace's marriage, Conant was the unofficial photographer to the House of Grimaldi and extensively photographed her, Rainier, and their three children. In 1992, Conant published Grace, a book of photographs that he took during her 26-year tenure as Princess of Monaco. Princess Grace has been depicted by many pop artists, including Andy Warhol and James Gill. Warhol made a portrait of her for the Institute of Contemporary Art, Philadelphia as a limited edition silkscreen in 1984.In 2012, Grace's childhood home was made a Pennsylvania historic landmark, and a historical marker was placed on the site. The house, located at 3901 Henry Avenue in the East Falls section of Philadelphia, was built by her father John B. Kelly Sr. in 1929. Grace lived in the house until 1950, and Prince Rainier III proposed to her there in 1955. The Kelly family sold the property in 1974. Prince Albert of Monaco purchased the property, speculating that the home would be used either as museum space or as offices for the Princess Grace Foundation."}, {"text": "=== Fashion and style ===While pregnant with her daughter Caroline in 1956, Princess Grace was frequently photographed clutching a distinctive leather handbag manufactured by Hermès. The purse, or Sac à dépêches, was likely a shield to prevent her pregnant abdomen from being exposed to the prying eyes of the paparazzi. The photographs, however, popularized the purse and became so closely associated with the fashion icon that it would thereafter be known as the Kelly bag.Grace was inaugurated into the International Best Dressed List Hall of Fame in 1960 and in 1955, the Custom Tailored Guild of America listed her as the \"Best-Tailored Woman\". Numerous exhibitions have been held of Kelly's life and clothing. The Philadelphia Museum of Art presented her wedding dress in a 2006 exhibition to mark the 50th anniversary of her marriage, and a retrospective of her wardrobe was held at London's Victoria and Albert Museum in 2010. The V&A exhibition continued in Australia at the Bendigo Art Gallery in 2012. This famous dress, seen around the world, took thirty five tailors six weeks to complete. An exhibition of her life as Princess of Monaco was held at the Ekaterina Cultural Foundation in Moscow in 2008 in conjunction with Monaco's Grimaldi Forum. In 2009, a plaque was placed on the \"Rodeo Drive Walk of Style\" in recognition of her contributions to style and fashion.After her death, Grace's legacy as a fashion icon lived on. Modern designers, such as Tommy Hilfiger and Zac Posen, have cited her as a fashion inspiration. During her lifetime, she was known for introducing the \"fresh faced\" look, one that involved bright skin and natural beauty with little makeup. Her fashion legacy was even commemorated at the Victoria and Albert Museum of London, where an exhibit titled, \"Grace Kelly: Style Icon\" paid tribute to her impact on the world of fashion. The exhibit included 50 of her legendary ensembles. She is remembered for her \"college-girl\" everyday fashion, defined by her pulled-together yet simple look. In 2016, Forbes included her on the list 10 Fashion Icons and the Trends They Made Famous.The look and style of TV series Mad Men's Betty Draper is influenced by Grace Kelly, and she is frequently complimented in the show by other characters for resembling her. American actress Elle Fanning attended 78th Golden Globe Awards with mint-green Gucci gown designed by Alessandro Michele that was inspired by Grace Kelly's gown worn at the 27th Academy Awards. According to Vogue, American singer-songwriter Billie Eilish, who attended 2021 Met Gala, wore a red Oscar de la Renta gown inspired by Kelly's gown worn in the 1955 film To Catch a Thief. The gown was designed by Fernando Garcia and Laura Kim.On July 15, 2021, the Princess Grace Foundation-USA launched Grace de Monaco, a luxury brand. The brand had been planned since 2019. On the same day, Grace de Monaco launched their first fragrance named Promenade sur le Rocher. The product was named after the official residence of the princely family for over seven centuries."}, {"text": "=== Monaco and elsewhere ===A rose garden in Monaco's Fontvieille district is dedicated to the memory of Kelly. It was opened in 1984 by Rainier. A hybrid tea rose, named Rosa 'Princesse de Monaco', was named after her. She is commemorated in a statue by Kees Verkade in the garden, which features 4,000 roses. Prince Rainier also established the Princess Grace Irish Library in her memory, containing her personal collection of over 9,000 books and sheet music. Avenue Princesse Grace in Monaco, \"the most expensive street in the world\", is named for her, as is Boulevard Princesse Grâce de Monaco in Nice, France.In 2007, Monaco hosted an international-scale exhibition in honor of Princess Grace, named \"The Grace Kelly Years, Princess of Monaco\", containing letters, personal belongings, fashion accessories, and sound recordings on display. Les Ballets de Monte-Carlo was established in 1985, in accordance to the wishes of Princess Grace, with its first performance taking place on December 21. In 1993, Kelly appeared on a U.S. postage stamp, released in conjunction with a Monaco postage stamp featuring her image on the same day. To commemorate the 25th anniversary of Kelly's death, €2 commemorative coins were issued on July 1, 2007, with the \"national\" side bearing the image of her. In 2019, the government of Monaco released three designs of commemorative postage stamps, each depicting a different phase of her life, to mark the 90th anniversary of her birth.In 2003, the Henley Royal Regatta renamed the Women's Quadruple Sculls the \"Princess Grace Challenge Cup\". The Henley Stewards invited her to present the prizes at the 1981 regatta, expiating the ill will from her father's falling foul of its amateurism rules in 1920. Prince Albert presented the prizes at the 2004 regatta. Various hotels, including Hotel Bel-Air, the Ritz-Carlton Hotel de la Paix, the InterContinental Carlton Cannes Hotel, and the Shelbourne Hotel established suites inspired by her life and likeness. A yacht in Monaco, M/Y Grace, was named after her.Cheryl Ladd portrayed Kelly in the made-for-TV film Grace Kelly in 1983. The film received mixed reviews. Nicole Kidman portrayed Kelly in Grace of Monaco (2014), directed by Olivier Dahan. Reaction to the film was largely negative; many people, including the princely family of Monaco, felt it was overly dramatic, had historical errors, and lacked depth.In November 2022, the Monnaie de Paris (Paris Mint) issued silver and gold coins to commemorate the 40th anniversary of Grace Kelly's death, with the consent of the Prince Albert II."}, {"text": "=== Discography ===\"True Love\", a duet with Bing Crosby from High Society (1956)"}, {"text": "=== Discography ===L'Oiseau du Nord et L'Oiseau du Soleil, in French and in English (1978)"}, {"text": "=== Discography ===Birds, Beasts & Flowers: A Programme of Poetry, Prose and Music (1980)"}, {"text": "== Awards and nominations ==Other honors"}, {"text": "== Awards and nominations ==Star on the Hollywood Walk of Fame (1960)"}, {"text": "== Awards and nominations ==American Film Institute's 13th Greatest Female Star of Classic American Cinema (1999)"}, {"text": "== Awards and nominations ==Rosa 'Princesse de Monaco' (1981)"}, {"text": "== Titles, styles, and honors ==Upon her marriage to Prince Rainier III in 1956, as the consort of the reigning sovereign prince of Monaco, she was styled \"Her Serene Highness Princess Grace of Monaco\". She also bore all historical titles of her husband, in the feminine."}, {"text": "=== National honors === Monaco: Knight Grand Cross of the Order of Saint-Charles"}, {"text": "=== Foreign honors === Austria: Recipient of the Red Cross Medal"}, {"text": "=== Foreign honors === Belgium: Recipient of the Red Cross Medal"}, {"text": "=== Foreign honors === France: Recipient of the Red Cross Medal"}, {"text": "=== Foreign honors === Greek Royal Family: Dame Grand Cross of the Royal Order of Beneficence"}, {"text": "=== Foreign honors === Iranian Imperial Family: Recipient of the Commemorative Medal of the 2,500 year Celebration of the Persian Empire"}, {"text": "=== Foreign honors === Italy: Grand Officer of the Order of the Star of Solidarity"}, {"text": "=== Foreign honors === Vatican: Dame Grand Cross of the Order of the Holy Sepulchre"}, {"text": "=== Foreign honors === Sovereign Military Order of Malta: Dame Grand Cross of the Order of Merit, Special Class"}, {"text": "=== Foreign honors === Nicaragua: Grand Cross of the Order of Rubén Darío"}, {"text": "=== Foreign honors === Spain: Recipient of the Red Cross Plaque of Honor and Merit"}, {"text": "=== Bibliography ===Bren, Paulina (2021). The Barbizon: The Hotel That Set Women Free. New York: Simon & Schuster. ISBN 978-1-9821-2389-5."}, {"text": "=== Bibliography ===Haugland, H. Kristina (2006). Grace Kelly: Icon of Style to Royal Bride (Philadelphia Museum of Art). Yale University Press. ISBN 978-0-300-11644-1. Archived from the original on August 29, 2013. Retrieved October 16, 2015."}, {"text": "=== Bibliography ===Leigh, Wendy (2007). True Grace: The Life and Times of an American Princess. New York: Thomas Dunne Books. ISBN 978-0-312-34236-4."}, {"text": "=== Bibliography ===Spoto, Donald (1994). High Society: The Life of Grace Kelly. Crown Publishing Group. ISBN 978-0-307-39562-7."}, {"text": "=== Bibliography ===Spoto, Donald (2010). High Society: Grace Kelly and Hollywood. Random House. ISBN 978-0-09-951537-1."}, {"text": "=== Bibliography ===Taraborrelli, J. Randy (2003). Once Upon a Time: Behind the Fairy Tale of Princess Grace and Prince Rainier. Grand Central Publishing. ISBN 978-0-7595-2790-4."}, {"text": "=== Bibliography ===Wydra, Thilo (2014). Grace. A Biography. New York: Skyhorse Publishing. ISBN 978-1-62914-541-9."}, {"text": "== External links ==Grace Kelly at IMDb"}, {"text": "== External links ==Grace Kelly at the TCM Movie Database "}, {"text": "== External links ==Grace Kelly at Rotten Tomatoes"}, {"text": "== External links ==Grace Kelly at AllMovie"}, {"text": "== External links ==Grace Kelly at the Internet Broadway Database "}, {"text": "== External links ==Princess Grace Foundation – USA"}, {"text": "== External links ==FBI Records: The Vault – Grace Kelly at fbi.gov"}, {"text": "== External links ==Biography of Grace Kelly at Encyclopedia Britannica"}, {"text": "== External links ==Grace Kelly Footage"}, {"text": "== External links ==\"High Society – The Life of Grace Kelly\". The Washington Post. November 15, 2009."}, {"text": "== External links ==Princess Grace Of Monaco interview on BBC Radio 4 Desert Island Discs, April 24, 1981"}, {"text": "== External links ==Princess Grace of Monaco interviewed by Vera Maxwell and John Touhey on December 19, 1978 for the Fashion Institute of Technology"}]