[{"text": "Henry Franklin Winkler (born October 30, 1945) is an American actor, comedian, author, producer, and director. Widely known as Arthur \"Fonzie\" Fonzarelli on the American television series Happy Days, Winkler has distinguished himself as a character actor for roles on stage and screen. His many accolades include three Emmy Awards, two Golden Globe Awards, and two Critics Choice Awards."}, {"text": "Winkler studied theater at both Emerson College and the Yale School of Drama, and spent a year and half with the Yale Repertory Theater. After getting cast in a small role in The Mary Tyler Moore Show, he became a star playing the role of \"Fonzie\" on the American Broadcasting Company (ABC) sitcom Happy Days (1974–1984). He then helped develop the original ABC series MacGyver and directed Memories of Me (1988) and Cop and a Half (1993). "}, {"text": "Winkler acted in films such as Heroes (1977), Night Shift (1982), Scream (1996), The Waterboy (1998), Holes (2003), The French Dispatch (2021), and Black Adam (2022). He also found a career resurgence in television portraying humorous characters such as Barry Zuckerkorn in Arrested Development (2003–2019), Eddie R. Lawson in Royal Pains (2010–2016), Dr. Saperstein in Parks and Recreation (2013–2015), and Gene Cousineau in Barry (2018–2023). The latter earned him the Primetime Emmy Award for Outstanding Supporting Actor in a Comedy Series.Winkler was a member of the main cast of the National Broadcasting Company (NBC) reality series Better Late Than Never (2016–2018). In 2003, he drew upon his childhood struggles with dyslexia to co-write the Hank Zipzer series of children's books, which he then adapted into the British Broadcasting Corporation (BBC) Hank Zipzer TV series (2014–2016) in which Winkler appears as Mr. Rock. He has also written three memoirs: Being Henry: The Fonz ... and Beyond (2023), I've Never Met an Idiot on the River (2011), and The Other Side of Henry Winkler: My Story (1976)."}, {"text": "=== 1939–1945: Family history ===Winkler's parents, Ilse Anna Marie (née Hadra) and businessman Harry Irving Winkler were German Jews living in Berlin during the rise of Nazi Germany. By 1939, rising hostilities against Jews led his father to conclude that it was time to leave Germany. He arranged to take his wife on a six-week business trip to the United States. Although Winkler's Uncle Helmut was supposed to join them, at the last minute he decided to leave at a later date, and was eventually murdered during the Holocaust. Soon after arriving, his parents settled in New York City, where his father established a new version of his German company, which bought and sold wood."}, {"text": "=== 1945–1963: Early life and education ===Henry Franklin Winkler was born on October 30, 1945, on the West Side of New York City's Manhattan borough. The \"H\" in his first name is a reference to his Uncle Helmut, while his middle name refers to President Franklin D. Roosevelt. He has an older sister named Beatrice.Although his family did not keep kosher, Winkler was raised in the traditions of Conservative Judaism. During his childhood, Winkler and his family spent their summers at Lake Mahopac, New York, and as a teenager he was a water skiing instructor at Blue Mountain camps.While growing up, Winkler had a difficult relationship with his father, who wanted him to continue the family business. When his father grew frustrated with Winkler's focus on acting, he would ask his son why he had brought the business over from Germany to the United States. Winkler would respond: \"Besides being chased by the Nazis, Dad, was there a bigger reason than that?\""}, {"text": "==== Difficulties in school ====Winkler first attended P.S. 87 on West 78th Street, Manhattan, and then the McBurney School on Manhattan's Upper West Side. Although he was \"outgoing\" and \"the class comedian\" in school, he also lived in a state of \"constant anxiety\" over his struggles with schoolwork. His parents were perpetually frustrated by his poor grades, referred to him as \"dummer Hund\" (dumb dog), and repeatedly punished him for his inability to excel in school. Winkler has said that this time period was \"excruciating\" as his \"self-image was almost nonexistent.\" In addition, his consistently poor academic performance made it difficult to be involved in the theater, as he was \"grounded most of my high school career,\" and was almost never academically eligible. However, he did manage to appear in two theatrical productions: Billy Budd when he was in the eighth grade and Of Thee I Sing in the eleventh grade.Although Winkler graduated from the McBurney School in 1963, he was not allowed to attend graduation, as he had to repeat geometry for the fourth time during summer school. After finally passing the course, he received his diploma in the mail."}, {"text": "=== 1963–1967: Emerson College ===Winkler applied to 28 colleges but was only admitted to two of them. He enrolled in Emerson College in Boston in 1963, where he majored in theater and minored in child psychology, as he considered becoming a child psychologist if he did not succeed as an actor. He was also a member of the Alpha Pi Theta fraternity, and appeared in Emerson's production of Peer Gynt as the title character. Winkler later recalled that he had nearly failed his first and second years but managed to stay for four years and graduated in 1967. In 1978, Emerson awarded him an honorary Doctor of Humane Letters (DHL)."}, {"text": "=== 1967–1970: Yale School of Drama ===During his senior year at Emerson, Winkler decided to audition for the Yale School of Drama. Although his then-undiagnosed dyslexia led to his forgetting the Shakespearean monologue he was supposed to perform, forcing him to improvise, Winkler was still admitted to the M.F.A. program in 1967.He appeared in They Told Me That You Came This Way, Any Day Now, Any Day Now, and The Bacchae (as a member of the chorus). During the summers, he and his Yale classmates stayed in New Haven, and opened a summer stock theater called the New Haven Free Theater. They performed various plays including Woyzeck, where he portrayed the title role, and Just Add Water for improv night. He also performed in the political piece, The American Pig at the Joseph Papp Public Theater for the New York Shakespeare Festival in New York City, with classmates James Keach, James Naughton, and Jill Eikenberry. In addition, he also appeared in a number of Yale Repertory Theatre productions while still a student, including, The Government Inspector, The Rhesus Umbrella, Don Juan, Endgame, and The Physicists. He also appeared in Sweeney Agonistes and Hughie. Winkler would later credit his time at Yale as critical to his future success.Out of his original cohort of 25 actors at Yale, Winkler was one of 11 who graduated when he received his MFA in 1970. Over two decades later, in May 1996, he served as the Senior Class Day Speaker for Yale University's graduating seniors."}, {"text": "==== Yale Repertory Theatre company ====After receiving his MFA in 1970, Winkler was one of three students from his graduating class of 11 who were invited to become a part of the Yale Repertory Theatre company. He joined on June 30, 1970, was paid $173 a week, and appeared throughout the 1970–71 season. He performed in Story Theater Reportory, Gimpel the Fool and Saint Julian the Hospitaler and Olympian Games. He also appeared in The Revenger's Tragedy, Where Has Tommy Flowers Gone?, Macbeth, and Woyzeck and Play. He also appeared in a double feature of two works by Bertolt Brecht, The Seven Deadly Sins (ballet chanté), and The Little Mahagonny during May–June 1971 and January 20–29, 1972."}, {"text": "==== New York and California ====In the fall of 1971, Winkler was invited to be a part of the play Moonchildren which would open at the Arena Stage in Washington, D.C. Three weeks into rehearsals, director Alan Schneider fired him as Winkler had been hired to fill the space until the actor that Schneider really wanted was available. At the time, Winkler was certain that because he had been fired, he would never be hired as an actor again.Winkler moved back to New York, and began to audition for plays, movies, and commercials. He was able to earn a living through performing in commercials, thus, he was able to perform with the Manhattan Theater Club for free.Winkler's first appearance on Broadway was as \"John\" in 42 Seconds from Broadway, a play that opened and closed on March 11, 1973. He swore to himself that one day he would \"make that right.\" By 1973, he had roles in two independent films, The Lords of Flatbush and Crazy Joe. He also performed with the improv group, Off the Wall New York. He continued to feel anxiety, however, with the process of cold reading during auditions and depended upon compensation strategies.By 1973, his agent told him that it was time to leave New York and explore possibilities in California. Although Winkler was initially resistant, thinking he was not a good fit for Hollywood, his agent was persistent. Winkler ultimately decided that he had earned enough money through his work in commercials to try Hollywood for one month. He and his Lords of Flatbush co-star, Perry King, thus traveled to Los Angeles on September 18, 1973. After meeting with his agency's west coast branch, and spending five days going to auditions, Winkler was hired for a small part on The Mary Tyler Moore Show, appearing in Season 4, Episode 10, \"The Dinner Party\"."}, {"text": "=== 1973–1984: Happy Days and stardom ===During his second week in Los Angeles, Winkler auditioned for the part of Arthur Herbert Fonzarelli, better known as \"Fonzie\" or \"The Fonz\", on a new show called Happy Days. Although he was an unknown, and not the first choice for the role, he was asked to return after his first audition for a second one in costume. In costume, and with a different voice, Winkler said his six lines, threw his script in the air, and left the room. He was offered the role on his birthday, and accepted it based on his condition that the producers would show who the character was when he took his jacket off. Winkler appeared on the first episode of Happy Days in January 1974, and was with the series continuously until it ended in July 1984.\"The Fonz\" was initially written as a minor role and developed as the foil for the central protagonist of the series, Richie Cunningham (Ron Howard). Winkler made his own interpretation of the character during the first episode, choosing not to comb his hair, chew gum, or keep a box of cigarettes rolled in his sleeve like actors typically did with this type of character. Although he tried to explain this philosophy to the producers, he was told he had to follow the script and comb his hair. He thus stood at the mirror, motioned in a way that suggested \"Hey I don't have to because it's perfect,\" and in doing so, created the seminal moment which defined the character. ABC executives did not want to see Fonzie wearing leather, thinking it would imply that the character was a criminal. Thus, during the first season, Winkler wore two different windbreaker jackets, one of which was green. Marshall argued with the executives about the jacket, and eventually they made a compromise: Fonzie could wear the leather jacket, but only in scenes with his motorcycle. Marshall thus made certain that his motorcycle was written into every scene. In reality, Winkler did not know how to ride a motorcycle. As he almost crashed it the first time he tried, he subsequently never rode the motorcycle during the series.By the middle of the second season in December 1974, \"The Fonz\" began his transition as a breakout character when he was featured as the central protagonist in the episode, \"Guess Who's Coming to Christmas\". By the third season, he became the lead of the series, as the storylines shifted away from the original protagonist, Richie Cunningham, to \"The Fonz\". Winkler recalled in a 2018 interview that he directly addressed the issue with Ron Howard, who portrayed Cunningham. According to Winkler, Howard told him that although he \"was signed on as the star, you did nothing except be as good as you could be. It's good for the show, we're friends.\" In 2021, Howard reiterated these points by stating that Winkler had been \"sort of a big brother\" to him.In a 2018 interview with Winkler, journalist Michael Schneider suggests that it was at this point that the character \"became the biggest icon on television\" at that time. Winkler responded by stating that he \"went from somebody who had no sense of self\" to a situation that was \"scary.\" He has also admitted that while he shares some characteristics with \"The Fonz\" such as loyalty to friends and an undercurrent of anger that he drew from his struggles with school as a child, they were fundamentally different from one another.During his decade on Happy Days, Winkler also appeared in a variety of roles in film and on television. In film, he appeared in Heroes (1977) with Harrison Ford and Sally Field and was nominated for a Golden Globe Award for Best Actor – Motion Picture Drama. He later appeared in Carl Reiner's The One and Only (1978) and in Ron Howard's 1982 directorial debut, Night Shift with Shelley Long before she appeared in Cheers and a then-unknown Michael Keaton. He was nominated for a Golden Globe Award for Best Actor – Motion Picture Musical or Comedy for his work in Night Shift.In television, he served as executive producer and host for the 50-minute television version of the documentary, Who Are the DeBolts? And Where Did They Get Nineteen Kids? (1978), which was nominated for a Primetime Emmy Award for Outstanding Informational Series or Special. He was also an executive producer for the ABC Afterschool Special: Run, Don't Walk (1981), based on the novel of the same name by Harriet May Savitz, and featuring his Happy Days co-star, Scott Baio. He further directed Baio in the 13th episode of the Happy Days spin-off, Joanie Loves Chachi, also starring Erin Moran.In addition, Winkler starred in An American Christmas Carol (1979), and served as a co-host for the Music for UNICEF Concert (1979). He also appeared as \"Fonzie\" on Sesame Street to promote the letter \"A\" (ayyyy), later recalling that it was \"the only time I ever appeared as the Fonz on something else. I had a strict rule about that, but they asked me and it was my pleasure.\""}, {"text": "=== Post Happy Days ===After Happy Days ended in 1984, Winkler was typecast, and could not get acting roles until 1991. He later stated that his \"agent would put me out there and people would say, 'You know, he's great, he's a wonderful guy, really good actor. Funny, So funny. But he was the Fonz.'\" Winkler, who desired to be a working actor, felt \"rudderless\" during this period; desiring to continue a presence in the industry, he started the production company Fair Dinkum Productions in the late 1970s. The name fair dinkum was taken from Australian English slang, meaning something is \"honest\" or \"authentic\". In 1987, he inked a new feature film and development pact with the studio.In 1984, Winkler directed, and was executive producer for, the CBS Schoolbreak Special: \"All the Kids Do It\" starring Scott Baio, which won the 1985 Daytime Emmy for Outstanding Children's Special and was nominated for the 1985 Daytime Emmy for Outstanding Directing in Children's Programming. In addition to a few episodes of television sitcoms that he directed in the late 1990s and early 2000s, Winkler directed his first theatrical release in 1988, Memories of Me with Billy Crystal. In 1993, he directed his second theatrical release, Cop and a Half, a film produced by Ron Howard's company, Imagine Entertainment, and starring Burt Reynolds.Winkler was an executive producer for Rob Reiner's second film as a director, The Sure Thing (1985). He was also the executive producer for the original MacGyver television series, which won the Genesis Award for Best TV Drama in 1991, and for Dead Man's Gun, which won the Bronze Wrangler in 1998. In 1988, he was the executive producer for the ABC Afterschool Special: A Family Again starring Jill Eikenberry and Michael Tucker. In addition, he was the executive producer for a number of series, including Sightings and So Weird. In 2002, he partnered with Michael Levitt to revamp and update The Hollywood Squares for the fifth season of the 1998 reboot. It was nominated for a Daytime Emmy Award for Outstanding Game Show in 2003."}, {"text": "=== 1991–2003: Acting roles ===Winkler returned to acting in the early 1990s. He starred in the 1991 television film, Absolute Strangers, and in the short-lived 1994 television series Monty with David Schwimmer (before his debut on Friends). He also starred in the 1994 television film One Christmas, with Katharine Hepburn in her last role, and Swoosie Kurtz.In 1996, he appeared in his friend Wes Craven's 1996 film Scream as foul-mouthed high school principal Arthur Himbry. His role was uncredited, however, as the producers were concerned that he would only be seen as The Fonz, and thus distract from the film. After the screening, he received positive feedback for his role and was subsequently asked to participate in the publicity campaign for Scream.In 2000, Winkler was nominated for a Primetime Emmy, Outstanding Guest Actor in a Drama Series, for his portrayal of Dr. Henry Olson in three episodes of The Practice. He also portrayed Stanley Yelnats III in Holes (2003)."}, {"text": "==== Work with Adam Sandler ====Winkler began to collaborate with Adam Sandler in the 1990s, after Sandler included Fonzie in the Saturday Night Live skit, The Chanukah Song (1994). Winkler called Sandler to thank him, which led first to a friendship, and later to the role of Coach Klein in the 1998 film The Waterboy, and as Sandler's father in Click (2006). He also made cameo appearances in Little Nicky (2000), You Don't Mess with the Zohan (2008), and Sandy Wexler (2017)."}, {"text": "==== Work with John Ritter ====Winkler worked on a few projects with his longtime friend, actor John Ritter, whom he first met in 1978 at ABC's 25th anniversary party, when Winkler was still on Happy Days, and Ritter was Jack Tripper on the television series Three's Company. He directed Ritter in the 1986 television movie A Smoky Mountain Christmas starring Dolly Parton, and in 1993, they co-starred in the made-for-television movie, The Only Way Out.Later in 1999, Neil Simon gave Winkler the chance to be involved with his first theatrical production since 1973, when he asked him to do a read-through of The Dinner Party. Given the problems he had with cold-readings, Winkler initially panicked. However, he asked for the script in advance in order to memorize it, and managed to get through the reading. Simon eventually contacted Winkler again, and asked him to be in the theatrical version he was staging, to which Winkler agreed. He was also excited to be working with Ritter again. Although their initial debut was not well-received, they were invited to perform the play in Washington, D.C. with a few casting changes, and it received positive reviews. The play then moved to Broadway, and again received positive reviews.In September 2003, he was slated for a guest appearance on Ritter's show, 8 Simple Rules. However, during the filming of the episode, Ritter became ill and had to be taken to the hospital, dying hours later. The episode was never completed, and Winkler's role was dropped."}, {"text": "=== 2003–2019: Arrested Development ===In 2003, Mitch Hurwitz wanted Winkler to portray the incompetent lawyer Barry Zuckerkorn on one episode of Arrested Development. However, as Winkler notes, he \"went for one episode and...stayed for five years.\" He also returned for the later seasons in 2013 and 2018. For his portrayal of Barry Zuckerkorn, Winkler won a Gold Derby Award: Comedy Guest Actor in 2004. In 2014, Winkler was nominated as part of the cast for a Screen Actors Guild Award for Outstanding Performance by an Ensemble in a Comedy Series.Arrested Development is known for its \"inside jokes\". In three episodes of the 2013 reboot, Winkler's son Max portrayed \"young Barry Zuckerkorn\" in flashbacks. In addition, there were a number of references to Happy Days, such as in the season three episode \"Forget-Me-Now\", where Scott Baio joined the cast as the potentially new lawyer Bob Loblaw, stating, \"look, this is not the first time I've been brought in to replace Barry Zuckerkorn.\" Vulture argues that this statement is \"a nod to Happy Days, where [Baio] was brought on as Chachi, to be a new teen idol as Henry Winkler got older.\" In addition, Barry's \"hopping\" over the shark on the pier in \"Motherboy XXX\" is a reference to Jon Hein's phrase jumping the shark. Hein coined the phrase in 1985, in response to a 1977 Happy Days episode in which Fonzie jumps over a shark while on water-skis."}, {"text": "=== 2003–2019: Hank Zipzer ===Winkler's career as an author began with the Hank Zipzer series of children's books about the adventures of a dyslexic child, which he co-wrote with Lin Oliver. During the early 2000s, when Winkler experienced \"a lull in [his] acting career\", his manager Alan Berger suggested that he write children's books about the difficulties he experienced as a child before he knew that he was dyslexic. Winkler was resistant to the idea until Berger suggested that Winkler co-write the books with an experienced author.Berger introduced Winkler to Oliver, and the two met for lunch and created the character of Hank Zipzer. Winkler chose the name Hank from the nickname for Henry, and Zipzer from the name of a neighbor in the apartment building that he grew up in. Winkler and Oliver's writing process, which involved developing ideas during in-person discussions, drew upon their mutual background in television. According to Winkler, the system drew upon his strengths as an actor, allowing him to work through ideas out loud.The original series spanned seventeen books, published from 2003 to 2010. Following that, Winkler and Oliver wrote a prequel series, Here's Hank (2014 to 2019), which explores Hank's life as a second-grader before he was diagnosed as dyslexic. The Here's Hank series uses a dyslexic-friendly font called Dyslexie, marking the first time that this font was used in a book published in the United States.Winkler and Oliver also created the television adaptation Hank Zipzer, which ran for three seasons, from 2014 to 2016. The series appeared on the children's BBC Channel, as they could not find an American buyer for it. After the series was successful on the BBC, it was broadcast on the Universal Kids Channel in the United States. Winkler played the music teacher Mr. Rock, who was based a teacher at McBurney who encouraged Winkler. They also produced the 2016 stand-alone television film Hank Zipzer's Christmas Catastrophe."}, {"text": "==== Theater ====Winkler returned to the stage in 2006 as Captain Hook in Peter Pan at the New Wimbledon Theatre, London. He reprised the role in Woking for Christmas 2007. For the 2008/2009 season, he played Captain Hook at the Milton Keynes Theatre, and once again for the 2009/2010 panto season at the Liverpool Empire. A few years later in 2012, Winkler made his third Broadway appearance as \"Chuck Wood\" in The Performers (November 14–18)."}, {"text": "==== Television and film ====Winkler has continued his work as a character actor in television and film. In television, he was nominated in 2004 for a Daytime Emmy, Outstanding Performer in an Animated Program, and in 2005, he won the Daytime Emmy, Outstanding Performer in an Animated Program, for his voice-work as Norville in Clifford's Puppy Days. Additional television roles include Dr. Stewart Barnes in Out of Practice (2005–2006), Eddie R. Lawson in Royal Pains (2010–2016), Sy Mittleman in Childrens Hospital (2010–2016), Dr. Saperstein in Parks and Recreation (2013–2015), and Fritz in the 2021–present animated streaming television series Monsters at Work.His film roles include Uncle Ralph in the Christmas film The Most Wonderful Time of the Year (2008), Marty Streb in Here Comes the Boom (2012), Ed Koch in Donald Trump's The Art of the Deal: The Movie (2016),  Grandpa Bill in All I Want for Christmas Is You (2017), Uncle Joe in Wes Anderson's 2021 release The French Dispatch, and a cameo appearance as Al Pratt (Uncle Al) in the 2022 release Black Adam."}, {"text": "==== 2016–2018: Better Late Than Never ====Winkler was both an executive producer for and star of the American reality-travel show, Better Late Than Never. He starred along with William Shatner, Terry Bradshaw, George Foreman, and Jeff Dye, in this adaptation of the South Korean reality series, Grandpas Over Flowers.Winkler was the focus of the Season 2 episode \"Berlin: How Do You Say Roots in German?\" as the group explored the city from which his parents escaped in 1939. The journey culminated at the site of a brass memorial plaque, known as a stolperstein, embedded in the pavement in front of the workplace and home of his uncle, Helmut Winkler. The discovery came as a complete surprise to Winkler, as Jeff Dye had secretly enlisted the help of Winkler's children, who planned the surprise."}, {"text": "==== 2018–2023: Barry ====When Bill Hader developed the HBO comedy Barry with Alec Berg, he asked HBO if they could \"get\" Winkler for the part of acting teacher Gene Cousineau. According to Hader, he was \"out of [his] mind\" when HBO told him that Winkler was coming to audition for the role. In addition, Winkler's son Max, who is a director, helped him to prepare for this audition.Work for the first season of Barry began in 2016. Winkler has noted parallels between Barry and his time on Happy Days. He \"was 27 when I did the Fonz, and now, I'm 72. I just flipped the numbers.\" In his role as Cousineau, he wears Garry Marshall's tie as \"a tribute to my mentor\". Cousineau was originally written to be \"much darker, much colder—really cynical\", but after Winkler added his own insight, the character became more affectionate. Portraying Cousineau allowed Winkler to draw upon decades of experience with acting teachers. Winkler continued his lifelong habit of improvising when he forgot his lines, something he has \"done my whole career—except I drove Bill mad.\"Winkler received his first Primetime Emmy Award in 2018 for his portrayal of Gene Cousineau. He also won two Critics' Choice Television Awards for Best Supporting Actor in a Comedy Series in 2019 and 2023. In addition, he received three Primetime Emmy nominations, three Golden Globe nominations, and four Screen Actors Guild Awards nominations for the role."}, {"text": "== Filmography and accolades ==Winkler states that during his lifetime, he has worked with \"five directing geniuses\": Garry Marshall (Happy Days), Adam Sandler, Mitch Hurwitz (Arrested Development), Bill Hader and Alec Berg (Barry).After portraying Fonzie on Happy Days, Winkler evolved into a character actor, with roles that include the high school principal Arthur Himbry in Scream, Coach Klein in The Waterboy, Barry Zuckerkorn in Arrested Development, Sy Mittleman in Childrens Hospital, Dr. Saperstein in Parks and Recreation, Mr. Rock in the Hank Zipzer BBC series, Eddie R. Lawson in Royal Pains, Fritz in Monsters at Work, Uncle Joe in The French Dispatch, Al Pratt in Black Adam, and Gene Cousineau in Barry. He is also the recipient of a Primetime Emmy, two Golden Globe Awards, two Critics Choice Awards, and two Daytime Emmys."}, {"text": "== Philanthropy ==In March 2020, Winkler contributed via Zoom to social justice issues during COVID-19 pandemic in the United States. On May 7, 2020, the Office of the Governor of California, Gavin Newsom, posted a video of Winkler on Facebook and Twitter reminding Californians to practice social distancing and to follow stay-at-home orders.During this time, Winkler also offered aid \"to SAG-AFTRA artists and their families\" through the virtual table read of Season 3, Episode 2 (\"The Motorcycle\", 1975) of Happy Days. Winkler reprised the role of \"Fonzie\", while SAG members Glenn Close, John Carroll Lynch, Eli Goree, Aldis Hodge, Jamie Chung, Luke Newton, and Nicola Coughlan read the roles of Marion Cunningham, Howard Cunningham, Richie Cunningham, Ralph Malph, Joanie Cunningham, Potsie, and a waitress at Al's diner."}, {"text": "== Personal life ==Winkler met Stacey (formerly Weitzman; née Furstman) in a Beverly Hills clothing store in 1976, and they married in 1978, in the synagogue where he had his bar mitzvah. They have two children, Max and Zoe, and Jed Weitzman, Stacey's son from her previous marriage to Howard Weitzman, is Winkler's stepson.His cousin, the late actor and comedian Richard Belzer, starred as John Munch in the TV series Law & Order: Special Victims Unit (1999–2013).In 2018, almost 80 years after his parents had left Germany, Winkler returned to Berlin for the television show Better Late Than Never and shared their story on the Season 2 episode \"Berlin: How Do You Say Roots in German?\".Winkler continues to remain close with members of the Happy Days cast, telling the Hollywood Reporter in November 2021 that \"I loved the people. They are still my friends.\""}, {"text": "=== Dyslexia ===During his time on Happy Days, Winkler realized that he was dyslexic after his stepson Jed was diagnosed with the learning disability. Previously, Winkler had known that aspects of reading and memorizing were difficult for him, but not why. He had developed coping mechanisms that allowed him to mask the difficulties he had with cold-reading scripts. He later recalled that prior to learning about dyslexia, he frequently embarrassed himself in front of his fellow cast members as he would \"stumble at least once or twice a paragraph\"."}, {"text": "== Additional books and legacy ==Winkler's 2011 memoir I've Never Met an Idiot on the River explores his interest in fly fishing. The next year, he and his writing partner Lin Oliver created the Ghost Buddy book series (2012–2013), about the friendship between the protagonist Billy and a \"ghost buddy\".A few years later they wrote the science fiction trilogy Alien Superstar (2019–2021). The adventures of Alien Superstar's protagonist are loosely based on Winker's own experiences after arriving in Los Angeles.Winkler released a new memoir, Being Henry: The Fonz...and Beyond in October 2023. He also began a new series of children's books with Lin Oliver in 2023 called Detective Duck."}, {"text": "=== The Fonz and Hank Zipzer ===TV Guide ranked \"The Fonz\" as No. 4 on its \"50 Greatest TV Characters of All Time\" list in 1999, and a 2001 poll conducted by Channel 4 in the UK ranked him as 13th on their list of the 100 Greatest TV Characters."}, {"text": "=== The Fonz and Hank Zipzer ===When asked which books influenced him in childhood, American journalist Anderson Cooper, who is dyslexic, responded that, \"I also loved the Fonz and read a book when I was around 8 called The Fonz: The Henry Winkler Story. I actually keep it in my office at CNN. Henry Winkler was very important to me when I was a child.\" This sentiment reflects National Museum of American History, Smithsonian Institution curator Eric Jentsch's statement on the description of Fonzie's leather jacket that Winkler donated to the Smithsonian in 1980: \"Fonzie was a representation of cool at a time when you were learning about what cool was.\""}, {"text": "=== The Fonz and Hank Zipzer ===Winkler won two Golden Globe Awards, and earned three Emmy Award nominations for Outstanding Lead Actor in a Comedy Series for the role. In 1981, he received a Star on the Hollywood Walk of Fame (for Television), largely due to his portrayal of Fonzie. A few decades later, American artist Gerald P. Sawyer, unveiled the Bronze Fonz on the Milwaukee Riverwalk in downtown Milwaukee, Wisconsin, on August 18, 2008.Winkler would eventually be recognized for contributing to a greater understanding of dyslexia through the Hank Zipzer series. He was given the Key to the City of Winnipeg for \"contributions to education and literacy\" in 2010, was appointed an Honorary Officer of the Order of the British Empire (OBE) \"for services to children with special educational needs and dyslexia in the UK\" by Queen Elizabeth in 2011, was named one of the United Kingdom's Top 10 Literacy Heroes in 2013, and was awarded the Bill Rosendahl Public Service Award for Contributions to the Public Good for his children's books in 2019 by the Los Angeles Press Club. "}, {"text": "== Bibliography ==Standalone"}, {"text": "== Bibliography ==Winkler, Henry (1976). The Other Side of Henry Winkler: My Story. Warner Books. ISBN 978-0-446-87340-6. OCLC 475068133."}, {"text": "== Bibliography ==Winkler, Henry (2011). I've Never Met an Idiot on the River: Reflections on Family, Photography and Fly-Fishing. Insight Editions. ISBN 978-1-608-87020-2. OCLC 1132359326."}, {"text": "== Bibliography ==Winkler, Henry (2023). Being Henry: The Fonz ... and Beyond. Celadon Books. ISBN 978-1250888099.Series (with Lin Oliver)"}, {"text": "== Bibliography ==Hank Zipzer: The World's Greatest Underachiever (18 volumes, 2003–2010, 2015)."}, {"text": "== Bibliography ==Ghost Buddy (4 volumes, 2012–2013)."}, {"text": "== Bibliography ==Here's Hank (12 volumes, 2014–2019)."}, {"text": "== Bibliography ==Alien Superstar (3 volumes, 2019–2021)."}, {"text": "== Bibliography ==Detective Duck (2023-present)."}, {"text": "== See also ==List of breakout characters"}, {"text": "== See also ==List of children's literature writers"}, {"text": "== See also ==List of people with dyslexia"}, {"text": "== See also ==List of public art in Milwaukee"}, {"text": "== See also ==List of stars on the Hollywood Walk of Fame"}, {"text": "== Further reading ==Amato, Jennifer (August 18, 2021). \"Gold Award candidate seeks help of Henry Winkler for school library project\". CentralJersey.com."}, {"text": "== Further reading ==Green, Jonathon (1978). The Fonz & Henry Winkler: His Real Life Story. Castle Books. ISBN 978-0-89009-200-2. OCLC 858068258."}, {"text": "== Further reading ==Klam, Matthew. (April 27, 2022). \"Henry Winkler Breaks the Curse of Stardom\". The New York Times Magazine."}, {"text": "== Further reading ==Pike, Charles E. (1976). The Fonz: The Henry Winkler Story. Outbackpress. ISBN 978-0-86888-044-0. OCLC 475655439."}, {"text": "== External links ==Henry Winkler on Twitter"}, {"text": "== External links ==Henry Winkler at IMDb"}, {"text": "== External links ==Henry Winkler at the Internet Broadway Database "}, {"text": "== External links ==Henry Winkler on Playbill"}, {"text": "== External links ==Henry Winkler at the Internet Speculative Fiction Database"}, {"text": "== External links ==Henry Winkler at The Interviews: An Oral History of Television  (2006)"}]