[{"text": "Hilary Erhard Duff (born September 28, 1987) is an American actress, singer, author and businesswoman. She is the recipient of various accolades, including seven Nickelodeon Kids' Choice Awards, four Teen Choice Awards, and two Young Artist Awards. She began her acting career at a young age, quickly being labeled a teen idol as the title character in the Disney Channel comedy series Lizzie McGuire (2001–2004) and in the film based on the series, The Lizzie McGuire Movie (2003)."}, {"text": "Thereafter, she appeared in numerous mainstream films such as Cadet Kelly (2002), Agent Cody Banks (2003), Cheaper by the Dozen (2003), and A Cinderella Story (2004). She later appeared in independent films playing a wider range of adult-themed roles, such as War, Inc. (2008), According to Greta (2009), Bloodworth (2011), and The Haunting of Sharon Tate (2019). From 2015 to 2021, Duff starred as Kelsey Peters in TV Land's longest-running original series Younger, for which she received two People's Choice Awards nominations. Between 2022 and 2023, she has produced and starred as Sophie Tompkins in the Hulu sitcom How I Met Your Father.Musically, Duff first came to prominence after releasing her debut studio album, the Christmas-themed Santa Claus Lane (2002), through Buena Vista Records. Her second album, Metamorphosis (2003), was hugely successful, topping the Billboard 200 chart and earning a 4× Platinum certification by the Recording Industry Association of America (RIAA). She enjoyed significant commercial success with her subsequent Platinum and Gold-certified albums released through Hollywood Records; Hilary Duff (2004), Most Wanted (2005), and Dignity (2007). Following a hiatus from music, Duff signed with RCA Records for her fifth album, Breathe In. Breathe Out. (2015). Duff has been hailed as an inspiration by subsequent Disney teen stars such as Miley Cyrus, Demi Lovato, and Selena Gomez, and has sold an estimated 15 million records worldwide.In addition to music and acting, she has also co-authored a trilogy of novels, beginning with Elixir (2010), which became a New York Times best seller, and followed by the sequels Devoted (2011) and True (2013). Duff's success in the entertainment industry led her to venture into business with fashion lines of her own such as Stuff by Hilary Duff, Femme for DKNY, and the \"Muse x Hilary Duff\" collection, a collaborative effort with GlassesUSA which was credited to have boosted GlassesUSA's sales for its premium brands. She has also invested in a number of businesses ranging from cosmetics to children's products."}, {"text": "== Early life ==Hilary Erhard Duff was born on September 28, 1987, in Houston, Texas. Her parents are Robert Erhard Duff, a partner in a chain of convenience stores, and Susan Colleen Duff (née Cobb), a homemaker turned film and music producer. Duff has one older sister named Haylie. She was raised between Houston and San Antonio, the locations of her father's convenience stores. Encouraged by their mother, both Hilary and her sister enrolled in acting, singing, and ballet classes. The siblings earned roles in local theater productions, and later participated in a touring BalletMet production of The Nutcracker in San Antonio. Increasingly interested in the pursuit of show business, the Duff sisters and their mother moved to California in 1993, while their father stayed in Houston to take care of his business. The sisters auditioned for several years and were cast in many television commercials. Due to her acting career, Duff was home-schooled from the age of eight. The pair also modeled for various clothing brands. Duff stated, \"My sister and I really showed an interest in [performing] and dedication, and [our mother] was like, 'How can I tell my kids no?' It's the same as kids that are going into sports. Parents support them and push them.\""}, {"text": "=== 1993–1999: Career beginnings ===During her initial acting years, Duff primarily played minor roles, such as her uncredited part in the Hallmark Entertainment western miniseries True Women (1997) and as an uncredited extra in the ensemble comedy-drama Playing by Heart (1998). The same year, Duff landed her first major role as Wendy in Casper Meets Wendy, based on the Harvey Comics characters. After appearing in the supporting role of Ellie in the television film The Soul Collector (1999), Duff received a Young Artist Award for Best Performance in a TV Movie or Pilot (Supporting Young Actress). In March 2000, Duff appeared as a sick child in the CBS medical drama series Chicago Hope. She was next cast as one of the children in the pilot episode of the NBC comedy series Daddio. Her Daddio co-star Michael Chiklis stated, \"After working with her the first day, I remember saying to my wife, 'This young girl is gonna be a movie star.' She was completely at ease with herself and comfortable in her own skin.\" However, producers dropped Duff from the cast prior to the airing of the show."}, {"text": "=== 2000–2003: Mainstream success, Lizzie McGuire, and Metamorphosis ===A week after being dropped from Daddio, Duff landed the title role of a newly developed Disney Channel series, Lizzie McGuire. Lizzie McGuire premiered on January 12, 2001, and became a ratings hit, with an estimated 2.3 million viewers per episode. Duff quickly became labeled as a teen idol and household name, particularly within the show's pre-teen adolescent target demographic. Disney began marketing the series through soundtracks, books, dolls, toys, and video games based on Duff's character; the company reportedly made an estimated $100 million from the show's merchandise alone. The actress was featured in the Game Boy Advance video games that were created for her Lizzie McGuire character. Duff made her feature film debut in Human Nature (2002), in which she portrayed the younger version of Patricia Arquette's character. Duff also starred in the 2002 Disney Channel television film Cadet Kelly, which became the network's most watched program in its then 19-year history.Duff began making appearances on various soundtracks for the Disney channel, recording a cover of the Brooke McClymont song \"I Can't Wait\" for the soundtrack to Lizzie McGuire. She later recorded a cover of \"The Tiki Tiki Tiki Room\" for DisneyMania. Upon expressing interest in a music career, production on Duff's debut Christmas themed album began. Santa Claus Lane was released in October 2002, peaking in the lower portion of the Billboard 200 chart in the United States. The album was initially distributed through Walt Disney Records, with Buena Vista later re-releasing the project. It went on to receive a Gold certification from the Recording Industry Association of America (RIAA) for shipments exceeding 500,000 copies. The album was initially only released in North America, but received numerous re-releases in the following years. Duff later signed a recording contract with Andre Recke of Hollywood Records to release future recordings. Though her early music recordings garnered much success on Radio Disney, Recke and Buena Vista Records envisioned Duff appealing to a more mature audience.In 2003, Duff earned a co-starring role in the children's action comedy film Agent Cody Banks with Frankie Muniz. Scott Foundas of Variety called Duff's performance \"charming\", and thought she was \"sidelined with little to do much of the time.\" The same year, Duff reprised her role as Lizzie McGuire for The Lizzie McGuire Movie. The film also saw her portraying the character of Isabella Parigi, an Italian pop star who McGuire is later mistaken for. Duff recorded the original song \"What Dreams Are Made Of\" for the film's finale, which was later included on the film's soundtrack. She also recorded the single \"Why Not\"; the song became a top-twenty hit in Australia and New Zealand and was her first song to chart worldwide. The soundtrack to The Lizzie McGuire Movie went on to be certified Platinum in Canada and 2× Platinum by the RIAA.Duff released her second studio album, Metamorphosis, in August 2003. The album received mixed reviews from contemporary music critics but went on to reach the top of the Billboard 200 chart in the United States. The album became a major hit for Duff, selling over five million copies within its first two years of release. The album sold over three million copies in the United States, becoming her highest selling album to date and earning a 3× Platinum certification from the RIAA. The album spawned the successful singles \"So Yesterday\" and \"Come Clean\". \"So Yesterday\" achieved Platinum status in Australia and \"Come Clean\" received a Gold certification from the RIAA in the United States. \"Come Clean\" was used as the theme song to the MTV series Laguna Beach: The Real Orange County. Metamorphosis earned Duff multiple awards and nominations following its release. Duff further promoted the album with the Metamorphosis Tour that ran from November to December 2003. Later that year, Duff co-starred as one of the twelve children of Steve Martin and Bonnie Hunt in the family comedy Cheaper by the Dozen, which remains her highest-grossing film to date. Slant Magazine reviewer Nick Schager wrote that Duff \"does nothing more than look perky and stylish.\""}, {"text": "=== 2004–2006: Hilary Duff, Most Wanted, and film projects ===Lizzie McGuire aired its final episode on February 14, 2004, following the fulfillment of Duff's 65-episode contract. Despite reports that the series was in talks for a second film and further television spin-off considered for sister network ABC, these plans fell through as Duff's salary for the proposal was insufficient.In 2004, Duff starred opposite Chad Michael Murray in the romantic comedy A Cinderella Story. The film went on to become a moderate box office hit despite negative reviews. At the 2004 World Music Awards, Duff won the Best New Female Artist award. Duff's self-titled third studio album was released in September of that year. Duff was more involved in the production of this album than she had been in her previous record. The album, featuring prominent rock elements and drawing comparison to works from Avril Lavigne and Ashlee Simpson, debuted at number two on the Billboard 200 and went on to sell over 1.8 million copies in the United States. The album contained the single \"Fly\" which failed to chart on the Billboard Hot 100 but performed moderately worldwide. Later in the year, Duff starred in the musical drama Raise Your Voice, which was panned and unsuccessful at the box office. Several reviews were critical of her vocals, a number finding fault with what appeared to be her digitally enhanced voice. Her performances in A Cinderella Story and Raise Your Voice earned Duff her first Razzie nomination for Worst Actress in 2004. Duff launched her first clothing line, \"Stuff by Hilary Duff\", in 2004. The line was distributed by Target in the U.S., Kmart in Australia, Zellers in Canada, and Edgars Stores in South Africa from March 2004 until 2007."}, {"text": "=== 2004–2006: Hilary Duff, Most Wanted, and film projects ===In 2005, Duff had a starring role, alongside Heather Locklear, in the film The Perfect Man, which went on to become a box office success. The Village Voice's Matt Singer wrote, \"Duff plays her standard character—an introverted romantic who falls for a guy whose hunky exterior belies an artistic soul.\". That August, Duff released her first compilation album, Most Wanted. The album featured songs from Duff's previous albums, as well as remixes and new material. It included the hit single \"Wake Up\", which became her second single to be certified Gold by the RIAA. The compilation debuted at number one on the Billboard 200, and sold over one million copies a month after its release. Duff later appeared in Cheaper by the Dozen 2, which resulted in her second Razzie nomination for Worst Actress in 2005. Mike Clarke of USA Today said, \"Duff just looks like she'd rather be in a different movie.\"Duff co-starred with her sister Haylie in the satirical comedy Material Girls (2006). The film earned both sisters a shared Razzie Award nomination for Worst Actress, becoming Duff's third consecutive nomination in three years. The sisters were also nominated for Worst Screen Couple. Hilary and Haylie collaborated on a cover of Madonna's single \"Material Girl\" for the film's soundtrack. Duff released her first perfume, \"With Love... Hilary Duff\", in September 2006. The line was distributed by the Elizabeth Arden company. Initially only sold in Macy's department stores, the fragrance became available in Europe, Japan, and Canada and was one of the three best-selling fragrances launched in department stores in 2006. That same year, Duff was stalked by a 19-year-old Russian immigrant identified as Max and his 50-year-old roommate David Joseph Klein. She filed for restraining orders against the two men, claiming that Max \"threatened to kill himself\" to get her attention. She also alleged that he threatened to \"remove enemies\" who stand in his way, including Duff's then-boyfriend Joel Madden. Max, later identified as Maksim Myaskovskiy, was sentenced to 117 days in prison."}, {"text": "=== 2007–2009: Dignity and independent films ===In 2007, Duff began working on material for her fourth studio album. Duff co-wrote thirteen of the album's fourteen songs, along with writers such as Kara DioGuardi. The finished product, Dignity (2007), featured production from Rhett Lawrence, Tim & Bob, and Richard Vission, resulting in a dance and electropop sound for the record. The album received critical praise, despite some critics noting Duff's \"weak\" vocals. The album was praised for its lyrical content and new musical direction. The album dealt with topics such as her parents' divorce, her breakup with Joel Madden, and the stalking incident during the prior year. The television special Hilary Duff: This Is Now was produced to chronicle Duff's return to music. The two-part project aired on MTV before the album's release. Despite positive critical reception, Dignity failed to match the commercial success of her previous releases. Debuting at number three on the Billboard 200, the album received a Gold certification from the RIAA. Despite the album's lackluster performance, it included the single \"With Love\", which went on to become her highest-charting single in the United States. Both \"With Love\" and the album's third single, \"Stranger\" topped the Billboard Hot Dance Club Play chart in the United States."}, {"text": "=== 2007–2009: Dignity and independent films ===Alongside the release of Dignity and the music videos for \"With Love\" and \"Stranger\", Duff began to adapt a more mature image. Duff's new image inspired some to consider her a \"sex symbol\". This image was reinforced by her appearance in the political satire film War, Inc. (2008), in which Duff portrayed an \"oversexed\" Central Asian pop star named Yonica Babyyeah. The film received a limited release in the United States. Duff recorded the songs \"Boom Boom Bang Bang\" and \"I Want to Blow You Up\" for the film. A re-release of Dignity was initially announced for a 2008 release, but Hollywood Records instead released a greatest hits album. Best of Hilary Duff (2008) received little promotion prior to its release, entering the Billboard 200 at number 125. It became her first album released in the United States to not receive a certification from the RIAA. The compilation included the single \"Reach Out\", which samples the Depeche Mode song \"Personal Jesus\". The song featured provocative lyrics referencing sex, while its music video similarly saw Duff in a more risqué light. The song became her third consecutive single to top the Hot Dance Club Play chart in the United States. She announced to MTV that she would begin writing another album in December 2008, but it was never developed. That same year, Duff ceased to have control over Stuff by Hilary Duff, thus the line was discontinued.Duff had a leading role as the title character of the film According to Greta (2009), which chronicled the life of a suicidal and rebellious teen. Her performance received mixed reviews. Andrew Barker of Variety criticized Duff's \"child star\" approach to acting and wanted her to stay away from teen roles. However, Los Angeles Times critic Robert Abele wrote that her attempt to \"transform her bright-eyed wholesomeness into rebellious snark\" in Greta \"is a valiant one.\" Later that year, she co-starred as a narcissistic seductress in What Goes Up. Brian Lowry of Variety magazine stated that Duff's performance \"amounts to a near-adult role,\" yet labeled her role and the film \"confused\". Despite having previously turned down a role in The CW drama 90210 to avoid projects within the \"teen\" genre, it was later confirmed that Duff would appear as a recurring character in the third season of the hit series Gossip Girl. Duff portrayed famous actress Olivia Burke, who enrolled at New York University in search of a traditional college experience. Duff's character sparked a romantic relationship with male lead character Dan Humphrey, and was later the center of controversy when the two had a threesome with Humphrey's friend Vanessa Abrams. The following year, she won a Teen Choice Award for Best Television Female Scene Stealer for her appearance on Gossip Girl. In 2009, Duff collaborated with DKNY Jeans and co-designed an apparel line titled Femme for DKNY Jeans. With the objective of designing a clothing line for women her own age, the line debuted in the United States in August 2009 and was available for a limited time."}, {"text": "=== 2010–2013: Other endeavors ===Duff continued to appear in film roles, starring in the ABC Family television film Beauty & the Briefcase (2010), where she also served as an executive producer. The film saw Duff as a fashion magazine columnist who wrote about her dating struggles in the city. The premiere received 2.4 million viewers, attracting a strong female audience that drove the network to an all-time high in viewers. Following this appearance, she made another in an episode of the NBC sitcom Community. She then co-starred as Raven Halfacre, the teenage daughter of a promiscuous alcoholic, in the drama Bloodworth. Her performance was generally praised, with The Examiner writing that the \"biggest surprise performance [in the film] probably belongs to Hilary Duff.\" In 2010, Duff set up a book-writing deal with Simon & Schuster. She collaborated with Elise Allen on a young adult novel titled Elixir which was published in October 2010. It was subsequently released internationally and became a New York Times best-seller.The following year, Duff co-starred in the independent comedy Stay Cool (2011) which was critically panned. The film saw Duff in a major role alongside Winona Ryder. Devoted, the sequel to Duff's authorial debut, was released in October 2011. In January 2012, Duff confirmed that she had again begun working on music. Throughout 2012, Duff primarily worked with songwriter Ali Tamposi, musicians Matt Squire and Jason Evigan. However, these works were not released. The same year, she co-starred in Rob Margolies' comedy She Wants Me, as a well-known starlet who enters a love triangle. In August 2012, Duff signed a deal with 20th Century Fox to develop and produce a sitcom in which she would star. However, this plan failed to develop. She appeared as a guest judge in Project Runway that September.In early 2013, Duff guest starred in the Fox sitcom Raising Hope. She later guest starred in the tenth season finale of the CBS sitcom Two and a Half Men. Duff provided voice work for the animated film Wings, alongside Jesse McCartney and Josh Duhamel; she later appeared in its sequel the following year. By July 2013, Duff had finished filming the independent film Flock of Dudes, which was released in September 2016. That same year, Duff released the third and final novel in her Elixir trilogy, titled True (2013)."}, {"text": "=== 2014–2017: Breathe In. Breathe Out. and television success with Younger ===On January 15, 2014, Duff signed on to co-star opposite Sutton Foster in the comedy-drama pilot Younger. The series is based on a Pamela Redmond Satran novel, and created and executive-produced by Darren Star for TV Land. Duff was cast as Kelsey Peters, an \"ambitious 20-something\" who persuades Foster's character to work in a publishing firm. In April 2014, it was announced that the pilot was picked up for a series with a 12-episode deal. The show marked Duff's first starring role in a television series since her appearance on Lizzie McGuire. Younger premiered on March 31, 2015. The series received generally positive reviews from critics and her performance as Kelsey Peters earned her acclaim. It earned her nominations for Favorite Cable TV Actress at the 2016 and 2017 People's Choice Awards, two Teen Choice Awards nominations, and a nomination for the Gracie Allen Awards.Duff attended the 2014 iHeartRadio Music Awards on May 1, 2014, where she confirmed that she was working with songwriter Savan Kotecha and English singer Ed Sheeran. On July 23, 2014, it was revealed that Duff had signed with RCA Records. She released the single \"Chasing the Sun\" and its accompanying music video on July 29, 2014. The song entered the Billboard Hot 100 at number 79, becoming her first song to enter the chart since \"Stranger\" (2007). The song's music video garnered fourteen million views in its first week of release on popular video sharing website YouTube. \"All About You\" was released as a single on August 12. It failed to enter the Hot 100 chart, but charted on the Mainstream Top 40 chart. It became a top-twenty hit in Australia, where it later earned a Gold certification from the ARIA. In November 2014, Duff provided voice work for a special Dora the Explorer episode as Jessica the Ice Witch.On April 6, 2015, Duff released the single \"Sparks\" from her fifth studio album Breathe In. Breathe Out. which debuted and peaked at number 93 on the Billboard Hot 100 and became her fourth top ten hit on the Billboard Dance Club Songs chart. Breathe In. Breathe Out was released on June 12, 2015. It debuted at number 5 on the Billboard 200, becoming her fifth top-five album. Duff had planned to tour in support of the album in early 2016, but announced in February 2016 that she would not be touring. The album was Duff's first studio effort to not have received any certification from RIAA, and is her only album release under RCA Records.In June 2016, Duff revealed that she was working on a new album. In contrast to Breathe In. Breathe Out, she said that the new album has a \"darker and heavier tone\". She teased a new song via her Snapchat post, which was then confirmed to be titled \"Tied to You\". Earlier that year, Duff's cover of Fleetwood Mac's \"Little Lies\" was released, to coincide with the second season of the series Younger which she starred in. It was Duff's final release under RCA Records.In January 2017, Duff became one of the investors for the cosmetic line Kopari Beauty."}, {"text": "=== 2018–2020: Entrepreneurship and scrapped Lizzie McGuire revival ===Duff returned to her fashion designing career in January 2018 for the first time in nine years since \"Femme for DKNY\". She launched a collaborative eyewear line with GlassesUSA called the \"Muse x Hilary Duff\" collection. Further collaborations with the brand resulted in the \"Muse\" collection being the best-selling brand for GlassesUSA's premium brand category. Later in January 2018, she announced that she was filming an independent movie, The Haunting of Sharon Tate, relating to the Tate murders. The film was written and directed by Daniel Farrands while Duff served as an executive producer on the film. She starred alongside Lydia Hearst and former Cheaper by the Dozen 2 co-star, Jonathan Bennett. The film was released in April 2019; at the 2019 Hollywood Reel Independent Film Festival, Duff won the Best Actress award for her portrayal of the title character.The Haunting of Sharon Tate was panned by major mainstream film critics and Variety called Duff as being \"too contemporary\" to portray Sharon. Debra Tate, the sister of the late Sharon, expressed her disapproval of the project. The film was nominated for several categories at the 40th Golden Raspberry Awards, and Duff was awarded the Worst Actress award. Later that year, Duff appeared in an episode in the tenth season of Who Do You Think You Are? which revealed that the King of Scots Robert the Bruce is Duff's 21 times maternal great-grandfather.In September 2018, it was confirmed that Duff would be lending her voice as the lead character in the animated film Meet Your Tooth Fairy. In November, Duff alongside several other celebrities were named investors in the viral 2-in-1 children's product \"Cubcoat\", and raised $4.85 million. She also launched a capsule collection under her sister Haylie's children clothing line \"Little Moon Society\".In January 2019, Duff and comedian Chelsea Handler invested in the cosmetics line \"Nudestix\". Her investment resulted in her launching her own make-up kit named \"Daydreamer\", in September 2019. Earlier in July, Younger was announced to be renewed for a seventh and final season. The series became the network's longest-running original series and one of the longest-running cable comedies in television history. For Duff, her role as Kelsey Peters is the longest television role she has played in her career after Lizzie McGuire in Lizzie McGuire.Duff announced at the D23 Expo in August 2019 that she would reprise her role as the titular character in a revival of the Lizzie McGuire series on the streaming service Disney+. The creator Terri Minsky initially was to return as the showrunner, with Duff serving as an executive producer. The series' storyline was to revolve around McGuire as a 30-year-old navigating life in New York City. However, on January 9, 2020, following the filming of two episodes, it was reported that Minsky departed as showrunner due to \"creative differences\", and the production of the series was halted. The following month, Duff revealed that Disney+ had restricted the project to a PG rating. She claimed that restricting it to such rating would be a \"disservice\" to fans and urged for it to be instead moved to Hulu. In August 2020, Duff affirmed that she was \"optimistic that [the revival] will happen\" and that she would continue filming the revival series following the completion of filming Younger's final season. However, on December 16, 2020, she confirmed that the revival was scrapped by Disney+. On the same day, Disney issued a statement to USA Today, reasoning that fans of the show \"have high expectations for any new stories\", and that they would hold off the show \"until we are confident we can meet those expectations\".In November 2019, Duff was announced to be the new co-owner and Chief Brand Officer of Naturalena Brands' line of products: the baby products brand \"Happy Little Camper\" and its sister company, the feminine care products brand \"Veeda\". The collaboration however, led to a lawsuit, in which Duff alleged that Naturalena Brands used the COVID-19 pandemic as the reason to end their agreement with Duff. Both Duff and Naturalena Brands eventually reached a settlement.In February 2020, music producer RAC released the single \"Never Let You Go\" a cover of the hit from the band Third Eye Blind, which featured both Duff and her husband Matthew Koma on vocals. The single was released under the label Counter Records. Later that month, Duff made a cameo in the music video for the single \"CVS\" by Koma's band, Winnetka Bowling League. She made another brief cameo in the music video for the band's follow up single, \"Kangaroo\" which was released in May that year."}, {"text": "=== 2021–present: How I Met Your Father and continued entrepreneurship ===In May 2020, it was reported that Duff would be starring in a spinoff series of Younger, reprising her role as Kelsey Peters. Younger's creator Darren Star was attached to the project. In April 2021, Star described the spinoff as a \"female Entourage\", and said that it would focus on Kelsey Peters in Los Angeles. However, on June 10, 2021, it was announced that the spin-off was no longer in the works. The Younger soundtrack album was released digitally in July 2021, and Duff's cover of Dolly Parton's \"9 to 5\" which she performed in the season six premiere together with Sutton Foster and Miriam Shor was included. Her 2016 cover of Fleetwood Mac's \"Little Lies\" was also featured.Duff released a children's picture book titled My Little Brave Girl in March 2021, which was published by Random House Children's and illustrated by Kelsey Garrity-Riley. Duff said that she was inspired to write this book by her daughter Banks. The book is aimed to mothers and also daughters aged 3 to 7 and it is a \"beautiful and inspiring book about bravery and love\". This was Duff's fourth overall book release and her first since True from 2013. The book debuted at #8 on The New York Times best-seller list on the children's picture books category. Its sequel, and her second children’s picture book, was released in November 2023 titled My Little Sweet Boy.Duff announced in April 2021 that she would star in a spinoff of How I Met Your Mother titled How I Met Your Father. In addition to starring as main character Sophie, Duff is also a producer on the show. A ten-episode run was ordered by Hulu, with This Is Us co-showrunners Isaac Aptaker and Elizabeth Berger named as the creators of the show. Filming for the spinoff began in August 2021 in Los Angeles. Just three days into filming the series, Duff contracted COVID-19, pausing the show's shoot. The series premiered on January 18, 2022. The first season was met with mixed reception. On February 15, 2022, Hulu renewed the series for a 20-episode second season. In September 2023, Hulu cancelled the series after two seasons.Additionally, Duff has made a number of business ventures beginning 2021 onwards. She collaborated with the romper company Smash + Tess to design a collection of rompers for mothers and their young children, which was launched on February 23, 2021, and reportedly sold out within minutes. Next, on May 18, 2022, Duff became the first-ever  Chief Mom Officer of the children's apparel company Carter's; via the collaboration, she designed a clothing capsule collection for children.  In November 2023, she unveiled a new business venture as Chief Brand Director of Below 60°, a line of home fragrance products launched that same month."}, {"text": "== Musical style ==With her debut, Duff's music featured prominent pop and pop rock elements. Duff cited listening to rock music as a child for the main influence behind the theme. She worked heavily with The Matrix for her second studio album, leading critics to compare the effort to releases from artists such as Avril Lavigne, Ashlee Simpson, and Lindsay Lohan. These themes were featured more prominently on her third studio album, Hilary Duff. The album makes further use of strong drum and guitar beats. Duff co-wrote multiple songs for the album, with the lyrics speaking on topics such as criticism, following your dreams, and love. The new material featured on her Most Wanted (2005) compilation album began to see Duff transfer towards a more pop and dance friendly sound. This was later expanded upon for her fourth studio album, Dignity (2007). Dignity was heavily influenced by Europop, hip hop, and rock 'n roll. Duff described the music as \"dance\", \"rock\", and \"electro\". Duff co-wrote all but one of the songs on the album, which dealt with topics including her stalker, her breakup with Joel Madden, and her parents' divorce. Following its release, critics stated the album was \"slightly ahead of its time.\"Duff's 2014 releases featured a more folk influenced, \"earthy\" indie pop sound, compared to her previous releases. The album's lead single was planned to be \"All About You\" (2014) and, among other instruments, it featured a banjo and an acoustic sound. Instead of the original plans, Duff released a dance-pop record which balanced EDM with the folk pop sound originally planned for the record. This album consolidated Duff as a dance-pop singer."}, {"text": "== Legacy and public image ==Following the launch of Lizzie McGuire, Duff received a significant amount of fame and media attention. The series proved to be a major hit for the network, and led to a string of merchandising that included Lizzie McGuire dolls, video games, plush figures, and even McDonald's Happy Meal Toys. The success of The Lizzie McGuire Movie \"indicated that Duff's television fanbase could be migrated to film.\" Following her success from Lizzie McGuire, Richard Huff of the New York Daily News called Duff \"a 2002 version of Annette Funicello\" but admitted that the character of Lizzie McGuire was both a blessing and burden for her. In 2003, Huff stated that Duff's public image is \"tied\" to Lizzie McGuire. In 2005, Katie Long from the Centre of Parent/Youth Understanding wrote an analysis of Duff and her suitability as an idol for young teens. Duff, she wrote, \"is not like Britney Spears or Christina Aguilera... yet\" but remains \"someone that adolescent girls can relate to.\"Duff was credited with the revival of Hollywood Records following the release of Metamorphosis (2003). The San Fernando Valley Business Journal wrote that the album was \"giving Hollywood Records a needed shot in the arm\" after a decline in CD sales during the previous two years had forced the label to reduce costs and alter its operation. Hilliard Lyons analyst Jeffrey Thomison cited Metamorphosis as a reflection of Disney's ability to develop \"great synergy between their cable, film and music segments\" Duff's transition from Disney star to successful singer became a formula that Hollywood Records tried to implement with future acts such as Miley Cyrus, Selena Gomez, Demi Lovato, and Bridgit Mendler among others. Artists such as Cyrus, Gomez, Lovato, and Keke Palmer have all cited Duff as influences on their careers."}, {"text": "== Legacy and public image ==Her song \"Come Clean\" (2003) was used as the theme song to the MTV reality series Laguna Beach, which is in turn credited with helping promote the song in the United States. Her song \"Sweet Sixteen\" (2003) was used as the theme for the MTV reality series of the same name. Multiple dates on her Most Wanted Tour to promote Hilary Duff (2004) sold out in minutes. She had sold over fifteen million albums by 2014.Her transition from teenage star to adult actress has been praised by some critics, while her transition is often compared to the less successful transitions of her peers. In 2007, Duff's appearance on the cover of Maxim was accompanied by the declaration that she had gone \"from the queen of teen to breakout sex symbol.\" Following this, Duff placed at #23 on the annual Hot 100 Women list compiled by Maxim. She has remained on the list ever since in addition to being regularly listed on the annual FHM list of the 100 Sexiest Women (she peaked at No. 8 in 2008). The Associated Press wrote that this sudden provocativeness was representative of \"a clear move [on Duff's part] to put her Lizzie McGuire past behind her\", and that more provocative imaging of her would help her singles to garner mainstream radio play: \"Ultimately, nature, time and genetics may help Duff in a way Disney, despite all its might, cannot.\" However, despite \"the fact that she is grown up,\" Duff \"has managed to maintain her sweet persona,\" wrote Young Hollywood.Following the birth of her son in 2012, Duff said that it took her a year for her to lose her baby weight and that she lost nearly 50 pounds by 2013. Duff stated that she revamped her diet and hired a personal trainer. Duff's slow but healthy method in shedding off her post-pregnancy weight was praised by health experts and was looked up to by actress Tia Mowry, who cited Duff as her idol in taking up a healthy and safer way to lose the excess weight gained during pregnancy. Duff has credited her weight loss success to a balanced lifestyle and the practice of flexible \"macro counting\" or IIFYM (If It Fits Your Macros) because it makes for allowances in indulgences such as bread and chocolate."}, {"text": "=== Social media controversies ===Duff created media attention in Halloween of 2016 due to the costumes she and then boyfriend Jason Walsh wore to a party. Duff and Walsh wore a Pilgrim and Native American costume respectively, drawing criticism online with some social media users accusing them of cultural appropriation. Following the backlash, both Duff and Walsh posted apology messages on their respective social media accounts.In May 2018, Duff uploaded a series of Instagram stories to her account, publicly condemning her New York apartment neighbor. She claimed he smoked \"cigarettes and weed all night long\" and that her \"apartment reeks\". Police later confirmed that an altercation had occurred between the neighbor and Duff's then-boyfriend Matthew Koma. Duff's representative issued a statement saying \"Hilary and her young son have been subjected to excessive secondhand smoke, late night noise, garbage in the hallways, and an overall hazardous living environment for months now.\" Duff's allegations of her neighbor's behavior were corroborated by other neighbors, including journalist Shelley Ross."}, {"text": "=== Disapproval of paparazzi ===Duff is very vocal about her disapproval of paparazzi photographing children. In 2014, Duff expressed her anger on Twitter regarding two paparazzi who were taking pictures of her son without her consent. She tweeted, \"I chose to let them off with a stern warning, next time I will not be so nice. #NoKidsPolicy\" The hashtag refers to a bill that was pushed by fellow actresses Halle Berry and Jennifer Garner, which prohibits paparazzi from taking pictures of celebrities' children.In February 2020, Duff uploaded an Instagram video post documenting her confrontation with a photographer who was taking photographs of her children at her son's football game. In the video she was seen telling the photographer, \"I'm asking you human to human, as a mother, if you don't know anyone here, can you please stop taking pictures of our children playing football this morning\". She clarified the situation in a series of Instagram stories uploads the day after, saying that it was \"really highly frustrating\" and that the police dismissed her complaint because she was at a public park when the incident happened. She voiced her dissatisfaction and demanded for the law to be changed. The video has since been viewed for more than 2 million times as of November 2020."}, {"text": "== Accolades ==Among her various accolades, Duff has received seven Nickelodeon Kids' Choice Awards, four Teen Choice Awards, and two Young Artist Awards. She has also been nominated for two People's Choice Awards and an MTV Video Music Award."}, {"text": "=== Relationships ===In 2001, it was confirmed that Duff was in a relationship with fellow teen star Aaron Carter. He later guest-starred in an episode of Lizzie McGuire with Duff. The relationship garnered media attention with reports of a love triangle between Duff, Carter, and actress Lindsay Lohan. Duff and Carter continued an on-again-off-again relationship for three years, before ultimately ending their relationship.In July 2004, 16-year-old Duff began dating Good Charlotte singer Joel Madden, who was then 25 years old. After a long period of tabloid speculation, Duff's mother Susan announced their relationship in a June 2005 interview for Seventeen magazine. Madden worked with Duff on her compilation album, Most Wanted. In November 2006, Duff and Madden broke up. Paper magazine later observed that the media chose not to call the relationship illegal even though Duff was underage.Duff began dating Canadian National Hockey League (NHL) player Mike Comrie in 2007. Duff and Comrie announced their engagement in February 2010, and married on August 14, 2010, in Santa Barbara, California. Duff announced her pregnancy in 2011, and gave birth to their son on March 20, 2012. On January 10, 2014, Duff and Comrie announced that they had amicably separated and would continue to co-parent their son. In February 2015, Duff filed for divorce from Comrie, citing irreconcilable differences, and requesting primary physical and legal joint child custody of their son. The divorce was finalized in February 2016.Following her split from Comrie, Duff dated personal sports trainer Jason Walsh from August 2015 until November 2016. She also briefly dated businessman Ely Sandvik in the summer of 2017, when she and Koma took a temporary break from their relationship.Duff began dating singer-songwriter Matthew Koma in January 2017. They worked together for her 2015 album Breathe In. Breathe Out.; the title track is a track he co-wrote and produced. They announced she was pregnant with their first child together, a girl, on June 8, 2018. On October 25, 2018, Duff gave birth to their first daughter. Duff and Koma then became engaged in May 2019, and were married on December 21, 2019. On October 24, 2020, Duff announced her third pregnancy via Instagram. On March 24, 2021, the couple's second child together, also a daughter, was born. On December 12, 2023, Duff announced her fourth pregnancy."}, {"text": "=== Education ===On January 31, 2005, Duff began taking classes at Harvard University as part of the Harvard Extension School. On February 4, she wrote on her website that she was taking classes \"for Harvard University.\" Her statement upset some students at Harvard, who felt that she did not have the right to claim she was attending Harvard University, when she was attending its Extension School. The Harvard Crimson published a scathing opinion piece which insulted both Duff and the Extension School. The following week, The Harvard Crimson published a letter to the editor which criticized the opinion piece."}, {"text": "== Philanthropy ==Duff has been involved with various philanthropic activities. For natural disasters, she donated $250,000 to help the victims of Hurricane Katrina in addition to donating over 2.5 million meals to Hurricane Katrina victims in the southern US in 2005. In August 2006, Duff traveled to a New Orleans elementary school and worked with USA Harvest to distribute meals.She has helped various youth charities and is a member of Kids with a Cause. Duff has also served on the advisory board of the Audrey Hepburn Child Benefit Fund and the Celebrity Council of Kids with a Cause. In October 2008, Duff starred in a public service announcement for The Think Before You Speak Campaign by Ad Council and GLSEN to prevent youth from using anti-LGBT vocabulary, such as the phrase \"That's So Gay.\" In July 2009, Duff was named as a youth ambassador to the children of the Colombian capital, Bogotá. As a Youth Ambassador, she spent five days in the country, distributing backpacks filled with food to needy children.In 2012, Duff was actively involved in the Johnson's Baby Cares campaign. The campaign included activities such as sending care kits and care cards to new mothers across the U.S. as a motivation. It also raises funds for children and poor families together with Save The Children.In November 2013, Duff teamed up with Duracell in Canada for a campaign for kids in hospitals. The campaign called Powering Holiday Smiles donated 20,000 batteries to hospitals across Canada. In order to promote the campaign, Duff visited The Hospital for Sick Children in Toronto, Ontario. She discussed the campaign on Breakfast Television Toronto, a radio show, and in numerous magazine interviews.She has participated in various online charity campaigns, including a partnership with Claritin, and raising relief efforts for the 2018 Hanalei floods via sales of her \"Muse x Hilary Duff Collection\". She was also one of the celebrities who participated in the 2017 telethon for the Houston floods and contributed an essay about the devastating effect the hurricane left on her hometown on Marie Claire's official website.In 2020, aside from sharing a donation of a sum of money with her husband Matthew Koma for the Australian bushfires relief efforts, Duff also donated baby products to parents in need during the COVID-19 pandemic via her \"Happy Little Camper\" brand. In October that year, she launched the \"Veeda in Action\" donation campaign, via her feminine care line \"Veeda\". Partnering up with PERIOD, \"a global, youth-powered non-profit that is fighting to end period poverty and period stigma through service, education, and advocacy\", the donation campaign ran through the month of October to donate period products to those in need."}, {"text": "== Discography ==Santa Claus Lane (2002)"}, {"text": "== Discography ==Metamorphosis (2003)"}, {"text": "== Discography ==Hilary Duff (2004)"}, {"text": "== Discography ==Dignity (2007)"}, {"text": "== Discography ==Breathe In. Breathe Out. (2015)"}, {"text": "== Tours ==Metamorphosis Tour (2003–2004)"}, {"text": "== Tours ==Most Wanted Tour (2004–2005)"}, {"text": "== Tours ==Still Most Wanted Tour (2005–2006)"}, {"text": "== Tours ==Dignity Tour (2007–2008)"}, {"text": "== Published works ==Elixir Trilogy"}, {"text": "== Published works ==Elixir (2010) (Book 1)"}, {"text": "== Published works ==Devoted (2011) (Book 2)"}, {"text": "== Published works ==True (2013) (Book 3)Other published works"}, {"text": "== Published works ==My Little Brave Girl (2021)"}, {"text": "== Published works ==My Little Sweet Boy (2023)"}, {"text": "== Further reading ==Dougherty, Terri (2007). Hilary Duff. People in the News. Farmington Hills, Michigan: Lucent Books. ISBN 978-1-4205-0012-7. OCLC 162126826."}, {"text": "== External links ==Official website "}, {"text": "== External links ==Hilary Duff at IMDb"}]