[{"text": "Terry Gene Bollea (; born August 11, 1953), better known by his ring name Hulk Hogan, is an American retired professional wrestler. He is widely regarded as the most recognized wrestling star worldwide, the most popular wrestler of the 1980s, and as one of the greatest professional wrestlers of all time."}, {"text": "Hogan began his professional wrestling career in 1977, but gained worldwide recognition after signing with the World Wrestling Federation (WWF, now WWE) in December 1983. There, his persona as a heroic all-American helped usher in the 1980s professional wrestling boom, where he headlined the WWF's flagship annual event WrestleMania eight times (a record which was broken by Roman Reigns): 1, 2, 3, 5, 6, 7, 8 and 9."}, {"text": "Hogan also was a regular headliner of Saturday Night's Main Event and its spin-off The Main Event in which he headlined 31 editions of both shows combined. During his initial run, he was a five-time WWF Champion, with his 1,474-day reign being the longest of the WrestleMania era ever. He is the first wrestler to win consecutive Royal Rumble matches, winning in 1990 and 1991. His match with Andre the Giant on WWF The Main Event on February 5, 1988, still holds American television viewership records for wrestling with a 15.2 Nielsen rating and 33 million viewers."}, {"text": "In 1993, Hogan departed the WWF to pursue a career in film and television. He was lured back to the ring when he signed with rival promotion World Championship Wrestling (WCW) in 1994. He won the WCW World Heavyweight Championship six times, and holds the record for the longest reign. In 1996, he underwent a career renaissance upon adopting the villainous persona of \"Hollywood\" Hulk Hogan, leading the popular New World Order (nWo) stable. As a result, he became a major figure during the \"Monday Night War\", another boom of mainstream professional wrestling. He headlined WCW's annual flagship event Starrcade three times (1994, 1996 and 1997) in which Starrcade 1997 was the most profitable WCW pay-per-view in the company's history."}, {"text": "Hogan returned to the WWF in 2002 following its acquisition of WCW the prior year, winning the Undisputed WWF Championship for his record equaling (for the time) sixth reign before departing in 2003. He was inducted into the WWE Hall of Fame in 2005, and inducted a second time in 2020 as a member of the nWo."}, {"text": "Hogan also performed for the American Wrestling Association (AWA), where he headlined the inaugural AWA closed circuit supercard, Super Sunday in 1983, New Japan Pro-Wrestling (NJPW) – where he was the inaugural winner of the original IWGP Heavyweight Championship – and Total Nonstop Action Wrestling (TNA)."}, {"text": "During and after wrestling, Hogan had an extensive acting career, beginning with his 1982 cameo role in Rocky III. He has starred in several films (including No Holds Barred, Suburban Commando and Mr. Nanny) and three television shows (Hogan Knows Best, Thunder in Paradise, and China, IL), as well as in Right Guard commercials and the video game, Hulk Hogan's Main Event. He was the frontman for The Wrestling Boot Band, whose sole record, Hulk Rules, reached No. 12 on the Billboard Top Kid Audio chart in 1995."}, {"text": "== Early life ==Hogan was born in Augusta, Georgia, on August 11, 1953, the son of construction foreman Pietro \"Peter\" Bollea (December 6, 1913 – December 18, 2001) of Italian descent and homemaker and dance teacher Ruth V. (née Moody; 1922 – January 1, 2011). He had an older brother named Allan (1947–1986) who died at the age of 38 from a drug overdose. Bollea is of Panamanian, Scottish and French descent. When he was one and a half years old, his family moved to Port Tampa, Florida. As a boy, he was a pitcher in Little League Baseball. Hogan attended Robinson High School. He began watching professional wrestling at 16 years old. While in high school, he revered Dusty Rhodes, and he regularly attended cards at the Tampa Sportatorium. It was at one of those wrestling cards where he first noticed Superstar Billy Graham and began looking to him for inspiration; since he first saw Graham on TV, Hogan wanted to match his \"inhuman\" look."}, {"text": "== Early life ==Hogan was also a musician, spending a decade playing fretless bass guitar in several Florida-based rock bands. He went on to study at Hillsborough Community College and the University of South Florida. After music gigs began to get in the way of his time in college, he dropped out of the University of South Florida. Eventually, Hogan and two local musicians formed a band called Ruckus in 1976. The band soon became popular in the Tampa Bay region. During his spare time, Hogan worked out at Hector's Gym in the Tampa Bay area, where he began lifting. Many of the wrestlers who were competing in the Florida region visited the bars where Ruckus was performing. Among those attending his performances were Jack and Gerald Brisco, two brothers who wrestled together as a tag team in the Florida region."}, {"text": "== Early life ==Impressed by Hogan's physical stature, the Brisco brothers asked Hiro Matsuda—the man who trained wrestlers working for Championship Wrestling from Florida (CWF)—to make him a potential trainee. In 1976, the two brothers asked Hogan to try wrestling. Hogan eventually agreed. At first, Mike Graham, the son of CWF promoter Eddie Graham, refused to put Hogan in the ring; according to Hogan, he met Graham while in high school and the two did not get along. After Hogan quit Ruckus and started telling people in town that he was going to be a wrestler, Graham finally agreed to accept the Brisco Brothers' request. During the first session in training, Matsuda broke Hogan's leg. After 10 weeks of rehab, Hogan returned to train with Matsuda and blocked him when he tried to break his leg again."}, {"text": "=== Early years (1977–1979) ===In mid-1977, after training for more than a year with Matsuda, the Brisco brothers dropped by Matsuda's gym to see Hogan. During this visit, Jack Brisco handed Hogan a pair of wrestling boots and informed him that he was scheduled to wrestle his first match the following week. In his professional wrestling debut, Eddie Graham booked him against Brian Blair in Fort Myers, Florida, on August 10, 1977, in CWF. A short time later, Hogan donned a mask and assumed the persona of \"The Super Destroyer\", a hooded character first played by Don Jardine and subsequently used by other wrestlers."}, {"text": "=== Early years (1977–1979) ===Hogan eventually could no longer work with Hiro Matsuda, whom he felt was an overbearing trainer, and left CWF. After declining an offer to wrestle for the Kansas City circuit, Hogan took a hiatus from wrestling and managed The Anchor club, a private club in Cocoa Beach, Florida, for a man named Whitey Bridges. Eventually, Whitey and Hogan became close friends, and opened a gym together; the gym became known as Whitey and Terry's Olympic gym."}, {"text": "=== Early years (1977–1979) ===Soon after, Hogan's friend Ed Leslie (later known as Brutus Beefcake) came to Cocoa Beach to help Hogan and Bridges manage both the Anchor Club and the Whitey and Terry's Olympic Gym. In his spare time, he and Leslie worked out in the gym together, and eventually Beefcake developed a muscular physique. Hogan was impressed by Beefcake's physical stature and became convinced that the two of them should wrestle together as tag team partners. Depressed and yearning to return to wrestling, Hogan called Superstar Billy Graham in 1978 with hopes that Graham could find him a job wrestling outside of Florida; Graham agreed and Hogan soon joined Louie Tillet's Alabama territory. Hogan also convinced Leslie, who had yet to become a wrestler, to come with him and promised to teach him everything he knew about the sport."}, {"text": "=== Early years (1977–1979) ===In Alabama, Hogan and Leslie wrestled as Terry and Ed Boulder, known as The Boulder Brothers. These early matches prompted a rumor among wrestling fans (who were not aware of the inner workings of the wrestling business) that the two really were brothers, as few people actually knew their real names outside of immediate friends, family, and the various promoters the two worked for. After wrestling a show for Continental Wrestling Association (CWA) in Memphis, Jerry Jarrett, the promoter for the CWA, approached Hogan and Leslie and offered them a job in his promotion for $800 a week; this was far more than the $175 a week they would make working for Tillet. Hogan and Leslie accepted this offer and left Tillet's territory."}, {"text": "=== Early years (1977–1979) ===During his time in Memphis, Hogan appeared on a local talk show, where he sat beside Lou Ferrigno, star of the television series The Incredible Hulk. The host commented on how Hogan, who stood 6 ft 7 in (201 cm) and weighed 295 pounds with 24-inch biceps, actually dwarfed \"The Hulk\". Watching the show backstage, Mary Jarrett noticed that Hogan was actually bigger than Ferrigno, who was well known at the time for having large muscles. As a result, Hogan began performing as Terry \"The Hulk\" Boulder and sometimes wrestled as Sterling Golden."}, {"text": "=== Early years (1977–1979) ===On December 1, 1979, Hogan won his first professional wrestling championship, the NWA Southeastern Heavyweight Championship (Northern Division), recognized in Alabama and Tennessee, when he defeated Bob Roop in Knoxville, Tennessee. He dropped it in January 1980 to Bob Armstrong. He briefly wrestled in the Georgia Championship Wrestling (GCW) territory from September through December 1979 as Sterling Golden."}, {"text": "=== World Wrestling Federation (1979–1981) ===In the fall of 1979, former NWA World Heavyweight Champion Terry Funk introduced Bollea to the World Wrestling Federation (WWF) owner/promoter Vincent J. McMahon, who was impressed with his charisma and physical stature. McMahon, who wanted to use an Irish name, gave him the last name Hogan, and also wanted him to dye his hair red. Bollea claims his hair was already beginning to fall out by that time, and he refused to dye it, simply replying, \"I'll be a blond Irish\". Bollea wrestled his first match in the WWF under the ring name \"Hulk Hogan\" by defeating Harry Valdez on the November 17 episode of Championship Wrestling. He made his first appearance at Madison Square Garden on December 17, 1979, defeating Ted DiBiase after a bearhug. After the match, Hogan thanked DiBiase for putting him over and told him that he \"owed him one\", a favor he repaid during DiBiase's second run with the company in the late 1980s and early 1990s as \"The Million Dollar Man\". McMahon gave Hogan former tag team champion Tony Altomare as chaperone and guide. At this time, Hogan wrestled Bob Backlund for the WWF Championship, and he started his first big feud with André the Giant, which culminated in a match with André at Shea Stadium in August 1980. During his initial run as a villain in the WWF, Hogan was paired with \"Classy\" Freddie Blassie, himself a villainous wrestler-turned-manager."}, {"text": "=== New Japan Pro-Wrestling (1980–1985) ===In 1980, Hogan began appearing in New Japan Pro-Wrestling (NJPW) where Japanese wrestling fans nicknamed him \"Ichiban\" (一番, \"Number One\"). Hogan first appeared on May 13, 1980, while he was still with the WWF. He occasionally toured the country over the next few years, facing a wide variety of opponents ranging from Tatsumi Fujinami to Abdullah the Butcher. When competing in Japan, Hogan used a vastly different repertoire of wrestling moves, relying on more technical, traditional wrestling holds and maneuvers as opposed to the power-based, brawling style American fans became accustomed to seeing from him. In addition, Hogan used the Axe Bomber, a crooked arm lariat, as his finisher in Japan instead of the running leg drop that has been his standard finisher in America. Hogan still made appearances for the WWF, even unsuccessfully challenging Pedro Morales for the Intercontinental Championship on March 26, 1981. On June 2, 1983, Hogan became the first International Wrestling Grand Prix (IWGP) tournament winner and the first holder of an early version of the IWGP Heavyweight Championship, defeating Antonio Inoki by knockout in the finals of a ten-man tournament. Since then, this championship was defended annually against the winner of the IWGP League of the year until it was replaced by current IWGP Heavyweight Championship, that is defended regularly."}, {"text": "=== New Japan Pro-Wrestling (1980–1985) ===Hogan and Inoki also worked as partners in Japan, winning the MSG (Madison Square Garden) Tag League tournament two years in a row: in 1982 and 1983. In 1984, Hogan returned to NJPW to wrestle Inoki to defend the early version of the IWGP title after that Inoki won in the finals of the IWGP League, becoming the new no. 1 contender to the championship. Hogan lost the match and title belt by countout, thanks to interference from Riki Choshu. Hogan also defended his WWF World Heavyweight Championship against Seiji Sakaguchi and Fujinami, among others, until ending his tour in Nagoya on June 13 losing to Inoki via count-out in a championship match for the early version of the IWGP Heavyweight Championship. Hogan was the only challenger in the history of that title that didn't win the tournament to become the no. 1 contender to the championship."}, {"text": "=== American Wrestling Association (1981–1983) ===After accepting an offer to work on the film Rocky III (a decision Vincent J. McMahon disapproved of and subsequently chose to release Hogan from the promotion for), Hogan made his debut in the American Wrestling Association (AWA), owned by Verne Gagne, in August 1981. Hogan started his AWA run as a villain, with \"Luscious\" Johnny Valiant as his manager. This did not last long, however, as the AWA fans fell in love with Hogan's presence and Hogan became the top fan favorite of the AWA, battling the Heenan Family and Nick Bockwinkel."}, {"text": "=== American Wrestling Association (1981–1983) ===Hogan's turn as a fan favorite came at the end of July 1981, when during a television taping that aired in August, Jerry Blackwell, after suffering a pinfall loss to Brad Rheingans, began beating down Rheingans and easily fighting off anyone who tried to run in for the save. Hogan ran in, got the upper hand and ran Blackwell from the ring. Hogan was eventually victorious in his feud with Blackwell and by the end of 1981, gained his first title matches against Bockwinkel."}, {"text": "=== American Wrestling Association (1981–1983) ===In March 1982, Hogan defeated Bockwinkel and his manager Bobby Heenan in a non-title handicap match in the International Amphitheatre in Chicago, Illinois. Hogan went on to repeatedly challenge Bockwinkel for the AWA World Heavyweight Championship, with the matches generally ending in disqualifications (a decision wherein the Championship does not change hands). In April 1982, Hogan defeated Bockwinkel and was declared the new AWA World Heavyweight Champion, only for the decision to be overturned by AWA President Stanley Blackburn due to the use of a foreign object during the match."}, {"text": "=== American Wrestling Association (1981–1983) ===Hogan left the AWA in November 1983."}, {"text": "==== Rise of Hulkamania (1983–1984) ====After purchasing the company from his father in 1982, Vincent K. McMahon had plans to expand the territory into a nationwide promotion, and he handpicked Hogan to be the company's showpiece attraction due to his charisma and name recognition. Hogan made his return at a television taping in St. Louis, Missouri, on December 27, 1983, defeating Bill Dixon."}, {"text": "==== Rise of Hulkamania (1983–1984) ====On the January 7, 1984, episode of Championship Wrestling, Hogan confirmed his fan favorite status (for any WWF fans unaware of his late 1981 babyface turn) by saving Bob Backlund from a three-way assault by the Wild Samoans. Hogan's turn was explained simply by Backlund: \"He's changed his ways. He's a great man. He's told me he's not gonna have Blassie around\". The storyline shortcut was necessary because less than three weeks later on January 23, Hogan won his first WWF World Heavyweight Championship, pinning The Iron Sheik (who had Blassie in his corner) in Madison Square Garden. The storyline accompanying the victory was that Hogan was a \"last minute\" replacement for the Sheik's original opponent Bob Backlund, and became the champion by way of being the first man to escape the camel clutch (the Iron Sheik's finishing move)."}, {"text": "==== Rise of Hulkamania (1983–1984) ====Immediately after the title win, commentator Gorilla Monsoon proclaimed: \"Hulkamania is here!\". Hogan frequently referred to his fans as \"Hulkamaniacs\" in his interviews and introduced his three \"demandments\": training, saying prayers, and eating vitamins. Eventually, a fourth demandment (believing in oneself) was added during his feud with Earthquake in 1990. Hogan's ring gear developed a characteristic yellow-and-red color scheme; his ring entrances involved him ritualistically ripping his shirt off his body, flexing, and listening for audience cheers in an exaggerated manner. The majority of Hogan's matches during this time involved him wrestling heels who had been booked as unstoppable monsters, using a format which became near-routine: He delivered steady offense, but eventually lose momentum, seemingly nearing defeat. After being hit with his opponent's finishing move, he got a sudden second wind, fighting back while \"feeding\" off the energy of the audience, becoming impervious to attack –  a process described as \"Hulking up\". His signature maneuvers –  pointing at the opponent (later accompanied by a loud \"you!\" from the audience), shaking his finger to scold him, three punches, an Irish whip, the big boot and running leg drop – followed, ensuring victory. That finishing sequence occasionally changed depending on the storyline and opponent; for instance, with \"giant\" wrestlers, the sequence might involve a body slam."}, {"text": "==== Rise of Hulkamania (1983–1984) ====In 1984, similarities between Hogan's character and that of The Incredible Hulk led to a quitclaim deal between Titan Sports, Marvel Comics and himself wherein Marvel obtained the trademarks \"Hulk Hogan\", \"Hulkster\" and \"Hulkamania\" for 20 years, and Titan agreed to no longer refer to him as \"incredible\" nor simply \"Hulk\" or ever dress him in purple or green. Marvel also subsequently received .9% of reportable gross merchandise revenue associated with Hogan, $100 for each of his matches and 10% of Titan's portion of his other earnings under this name (or 10% of the earnings, if Titan held no interest). This extended to WCW, whose parent company Turner Broadcasting System merged with Time Warner in 1996 and became sister companies with Marvel rival DC Comics. (As Hogan was well underway with the nWo storyline under the \"Hollywood Hogan\" ring name at the time, this avoided Time Warner the awkward situation of paying Marvel the rights to the name while owning its chief rival.) In a story in 1988's Marvel Comics Presents #45, a wrestler resembling Hogan was tossed through an arena roof by The Incredible Hulk, because he \"picked the wrong name.\""}, {"text": "==== International renown (1985–1988) ====Over the next year, Hogan became the face of professional wrestling as McMahon pushed the WWF into a pop culture enterprise with The Rock 'n' Wrestling Connection on MTV, drawing record houses, pay-per-view buyrates, and television ratings in the process. The centerpiece attraction for the first WrestleMania on March 31, 1985, Hogan teamed with legit friend, TV and movie star Mr. T to defeat his archrival \"Rowdy\" Roddy Piper and \"Mr Wonderful\" Paul Orndorff when \"Cowboy\" Bob Orton, who had been in the corner of Piper and Orndorff, accidentally caused his team's defeat by knocking out Orndorff after he jumped from the top turnbuckle and hit him in the back of the head with his arm cast in a shot meant for Hogan. On Saturday Night's Main Event I, Hogan successfully defended the WWF World Heavyweight Championship against Orton in a match that Hogan won by disqualification."}, {"text": "==== International renown (1985–1988) ====Hogan was named the most requested celebrity of the 1980s for the Make-a-Wish Foundation children's charity. He was featured on the covers of Sports Illustrated (the first and as of 2013, only professional wrestler to do so), TV Guide, and People magazines, while also appearing on The Tonight Show and having his own CBS Saturday morning cartoon titled Hulk Hogan's Rock 'n' Wrestling. Hogan, as the premier WWF icon, headlined seven of the first eight WrestleMania events. He also co-hosted Saturday Night Live on March 30, 1985, during this lucrative run. AT&T reported that the 900 number information line he ran while with the WWF was the single biggest 900 number from 1991 to 1993. Hogan continued to run a 900 number after joining World Championship Wrestling (WCW)."}, {"text": "==== International renown (1985–1988) ====On Saturday Night's Main Event II, he successfully defended the title against Nikolai Volkoff in a flag match. He met long-time rival Roddy Piper in a WWF title match at the Wrestling Classic pay-per-view (PPV) event. Hogan retained the title by disqualification after Bob Orton interfered and hit Hogan with his cast. Hogan had many challengers in the way as the new year began. Throughout 1986, Hogan made successful title defenses against challengers such as Terry Funk, Don Muraco, King Kong Bundy (in a steel cage match at WrestleMania 2), Paul Orndorff, and Hercules Hernandez."}, {"text": "==== International renown (1985–1988) ====In the fall of 1986, Hogan occasionally wrestled in tag team matches with The Machines as Hulk Machine under a mask copied from NJPW's gimmick \"Super Strong Machine\". At WrestleMania III in 1987, Hogan was booked to defend the title against André the Giant, who had been the sport's premier star and was pushed as undefeated for the previous fifteen years. A new storyline was introduced in early 1987; Hogan was presented a trophy for being the WWF World Heavyweight Champion for three consecutive years. André the Giant, who was Hogan's good friend, came out to congratulate him. Shortly afterward, André was presented a slightly smaller trophy for being \"undefeated in the WWF for 15 years\". Hogan came out to congratulate André, who walked out in the midst of Hogan's speech. Then, on an edition of Piper's Pit, Hogan was confronted by Bobby \"The Brain\" Heenan, who announced that André was his new protégé, and Andre challenged Hogan to a title match at WrestleMania III, where Hogan successfully defended the WWF World Heavyweight Championship against André the Giant. During the match, Hogan hit a body slam on the 520-pound André (which was dubbed \"the bodyslam heard around the world\") and won the match after a leg drop."}, {"text": "==== The Mega Powers (1988–1989) ====Hulk Hogan vs Big Boss Man on March 7, 1989, at the El Paso Civic Center for a video-taping of a WWF \"Superstars of Wrestling\" event."}, {"text": "==== The Mega Powers (1988–1989) ====Hogan remained WWF World Heavyweight Champion for four years (1,474 days). In front of 33 million viewers, Hogan finally lost the title to André on The Main Event I after a convoluted scam involving \"The Million Dollar Man\" Ted DiBiase and Earl Hebner (who assumed the place of his twin brother Dave Hebner, the match's appointed referee). After André delivered a belly to belly suplex on Hogan, Hebner counted the pin while Hogan's left shoulder was clearly off the mat. After the match, André handed the title over to DiBiase to complete their business deal. As a result, the WWF World Heavyweight Championship was vacated for the first time in its 25-year history because then WWF President Jack Tunney decreed the championship could not be sold from one wrestler to another. At WrestleMania IV, Hogan participated in a tournament for the vacant WWF World Heavyweight Championship to regain it; he and André were given a bye into quarter-finals, but their match resulted in a double disqualification. Later that night in the main event, Hogan came to ringside to stop André interfering which helped \"Macho Man\" Randy Savage defeat Ted DiBiase to win the title."}, {"text": "==== The Mega Powers (1988–1989) ====Together, Hogan, Savage, and manager Miss Elizabeth formed a partnership known as The Mega Powers. After Savage became WWF World Heavyweight Champion at WrestleMania IV, they feuded with The Mega Bucks (André the Giant and Ted DiBiase) and defeated them at the main event of the first SummerSlam. They then went on to feud with Slick's Twin Towers: Akeem and Big Boss Man."}, {"text": "==== The Mega Powers (1988–1989) ====In mid-1988, Hogan wrestled at house shows in singles competition with his \"War Bonnet\", a red and yellow gladiator helmet with a fist-shaped crest. This was notably used to give Bad News Brown his first WWF loss at a Madison Square Garden house show before it was discarded altogether. The War Bonnet gimmick was revisited in the WWE's online comedy series Are You Serious? in 2012."}, {"text": "==== The Mega Powers (1988–1989) ====The Mega Powers began to implode due to Savage's burgeoning jealousy of Hogan and his paranoid suspicions that Hogan and Elizabeth were more than friends. At the Royal Rumble in 1989, Hogan eliminated Savage from the Royal Rumble match while eliminating Bad News Brown, which caused tension, only to be eliminated by The Twin Towers himself. In early 1989, the duo broke up while wrestling The Twin Towers on The Main Event II, when Savage accidentally collided with Miss Elizabeth during the match, and Hogan took her backstage to receive medical attention, temporarily abandoning Savage. After ensuring Elizabeth was all right, Hogan returned to the ring and begged Savage to tag him in. Savage, in a fury, grabbed Hogan's outstretched hand with one hand, and slapped him across the face with the other before leaving the ring. Hogan eventually won the match by himself. After the match, Savage attacked Hogan backstage, which started a feud between the two. Their feud culminated in Hogan beating Savage for his second WWF World Heavyweight Championship at WrestleMania V."}, {"text": "==== Final WWF Championship reigns (1989–1993) ====Hogan's second run in 1989 lasted a year, during which he defended the title in two matches against Savage in April that he lost both times by count-out, before defeating The Big Boss Man in a steel cage match on the Saturday Night's Main Event XXI, which was aired on May 27. In May on WWF on NESN, Hogan retained the title by losing once again by count-out against Savage. This was also the last time the WWF World Heavyweight Championship was referred to as such during a televised title defense, as Hogan's next successful title defense against The Honky Tonk Man on Saturday Night's Main Event XXII saw the title being renamed and referred simply as the WWF Championship. Also during Hogan's second reign as champion, he starred in the movie No Holds Barred, which was the inspiration of a feud with Hogan's co-star Tom Lister, Jr., who appeared at wrestling events as his movie character, Zeus (an \"unstoppable monster\" who was jealous over Hogan's higher billing and wanted revenge). Hogan easily beat Zeus in a series of matches across the country during late 1989, beginning with a tag team match at SummerSlam, in which Hogan and Brutus Beefcake topped Zeus and Savage. Hogan and Zeus met at the Survivor Series, where the \"Hulkamaniacs\" faced the \"Million Dollar Team\"; in the early part of the match, Hogan put Zeus over by hitting him with everything to no effect. Zeus then manhandled Hogan and shoved referee Dave Hebner down twice, with the second shove prompting Hebner to disqualify Zeus from the match. Hogan and Beefcake then defeated Zeus and Savage in a rematch at the No Holds Barred pay-per-view to end the feud. Hogan also had defeated Savage to retain the WWF Championship in their official WrestleMania rematch on October 10, at United Kingdom-only pay-per-view First WWF UK Event at London Arena. During his second reign as the WWF Champion, Hogan won the 1990 Royal Rumble match, before losing to Intercontinental Champion The Ultimate Warrior in a title versus title match at WrestleMania VI on April 1, 1990."}, {"text": "==== Final WWF Championship reigns (1989–1993) ====Hogan soon became embroiled in a heated feud with the 468-pound Earthquake, who had crushed Hogan's ribs in a sneak attack on The Brother Love Show in May 1990. On television, announcers explained that both Hogan's injuries and his WrestleMania VI loss to Warrior took such a huge toll on his fighting spirit that he wanted to retire. Viewers were asked to write letters to Hogan and send postcards asking for his return (they got a postcard-sized picture in return, autographed by Hogan, as a \"thank you\"). Hogan returned by SummerSlam, and he dominated Earthquake for several months in a series of matches across the country. His defeat of this overwhelmingly large foe prompted Hogan to add a fourth demandment—believing in yourself—and he also became known as \"The Immortal\" Hulk Hogan. Hogan became the first wrestler to win two Royal Rumble matches in a row, as he won the 1991 Royal Rumble match. At WrestleMania VII, Hogan stood up for the United States against Sgt. Slaughter, defeating him for his third WWF Championship, and then defeating him again in the rematch at United Kingdom-only pay-per-view UK Rampage at London Arena. In the fall of 1991, Hogan was challenged by Ric Flair, the former NWA World Heavyweight Champion who recently arrived in the WWF. The challenge went unmet, as Hogan lost the WWF Championship to The Undertaker at Survivor Series. Jack Tunney immediately granted Hogan a rematch at This Tuesday in Texas six days later, which Hogan won. Flair had interfered in both matches and due to the resulting controversy, the championship was again declared vacant. It was decided that the winner of the 1992 Royal Rumble match would also be declared the new WWF Champion. Hogan entered in the #26 spot, but failed to regain the championship as he was eliminated by friend Sid Justice. In turn, Hogan "}, {"text": "==== Final WWF Championship reigns (1989–1993) ====helped cause Sid's elimination, leaving Flair (who had entered the match as the 3rd entrant) as the winner and new WWF Champion. Hogan and Sid patched things up and teamed together on Saturday Night's Main Event XXX against Flair and Undertaker, but during the match Sid abandoned Hogan, starting their feud. At WrestleMania VIII, Hogan defeated Sid via disqualification due to interference by Sid's manager Harvey Wippleman. Hogan was then attacked by Papa Shango and was saved by the returning Ultimate Warrior."}, {"text": "==== Final WWF Championship reigns (1989–1993) ====At this time, news sources began to allege that Dr. George Zahorian, a doctor for the Pennsylvania State Athletic Commission, had been selling steroids illegally to wrestlers in general and Hogan in particular. Hogan appeared on an episode of The Arsenio Hall Show to deny the allegations. Due to intense public scrutiny, Hogan took a leave of absence from the company. Hogan returned to the WWF in February 1993, helping out his friend Brutus Beefcake in his feud with Money Inc. (Irwin R. Schyster and \"The Million Dollar Man\" Ted DiBiase), and officially renaming themselves The Mega-Maniacs, taking on Money Inc.'s former manager \"The Mouth of the South\" Jimmy Hart (a long-time friend of Hogan's outside of wrestling) as their manager in what was the first time WWF audiences had seen Hart as a fan favorite. At WrestleMania IX, Hogan and Beefcake took on Money Inc. for the WWF Tag Team Championship, a match the Mega-Maniacs lost via disqualification. Hogan went into the match injured (he had a cut above his left eyebrow, and the left eye itself was fully black). The WWF used Hogan's injury in a storyline that had DiBiase allegedly paying a group of thugs in a failed attempt to take Hogan out before WrestleMania. Later that night, Hogan won his fifth WWF Championship by pinning Yokozuna in an impromptu match only moments after Yokozuna had defeated Bret Hart for the championship. Hogan reportedly used his influence to have the finish of WrestleMania changed the weekend of the event so he would be champion during an upcoming international and de facto farewell tour."}, {"text": "==== Final WWF Championship reigns (1989–1993) ====At the first annual King of the Ring pay-per-view on June 13, Hogan defended the WWF championship in a rematch against Yokozuna. This was Hogan's first and only title defense since defeating Yokozuna at WrestleMania IX. Yokozuna kicked out of Hogan's signature leg drop and scored the pinfall win after Hogan was blinded by a fireball shot by a \"Japanese photographer\" (actually a disguised Harvey Wippleman). The victorious Yokozuna proceeded to give Hogan a Banzai Drop. This was Hogan's last WWF pay-per-view appearance until 2002, as both he and Jimmy Hart were preparing to leave the promotion. Hogan continued his feud on the international house show circuit with Yokozuna until August 1993. After that, Hogan sat out the rest of his contract which expired later that year."}, {"text": "=== Return to NJPW (1993–1994) ===On May 3, 1993, Hogan returned to NJPW as WWF Champion and defeated IWGP Heavyweight Champion The Great Muta in a dream match at Wrestling Dontaku. Hogan wrestled against Muta again, this time under his real name (Keiji Mutoh), on September 26, 1993. Hogan also wrestled The Hell Raisers with Muta and Masahiro Chono as his tag team partners. His last match in Japan was on January 4, 1994, at Battlefield, when he defeated Tatsumi Fujinami."}, {"text": "==== World Heavyweight Champion (1994–1996) ====Starting in March 1994, Hogan began making appearances on WCW television, as interviewer Gene Okerlund—who was now a WCW employee—visited him on the set of Thunder in Paradise episodes. Hype then built over whether Hogan should remain with Thunder in Paradise or join WCW and have an opportunity to wrestle Ric Flair. On the May 28, 1994, episode of WCW Saturday Night, Hogan tore up his Thunder in Paradise contract and stated he was now willing to quit the show and return to wrestling, and Okerlund issued a telephone survey asking if people wanted to see Hogan in WCW. On June 11, 1994, Hogan officially signed with Ted Turner's World Championship Wrestling (WCW) in a ceremony that was held at Disney-MGM Studios. The next month, with Jimmy Hart as his manager, Hogan won the WCW World Heavyweight Championship in his debut match, defeating Ric Flair in a \"dream match\" at Bash at the Beach. Hogan continued his feud with Flair (who defeated him by count-out on the Clash of the Champions XXVIII, thus Hogan retained the title), which culminated in a steel cage match (with Flair's career on the line and Mr. T as the special guest referee) that Hogan won."}, {"text": "==== World Heavyweight Champion (1994–1996) ====After Hogan headlined WCW's premier annual event Starrcade (Starrcade: Triple Threat) in December 1994 by defeating The Butcher for the title, his next feud was against Vader, who challenged him for the WCW World Heavyweight Championship at SuperBrawl V, where Hogan won by disqualification after the returning Flair's interference. Hogan then defeated Vader (who was managed part-time by Flair) in a non-title leather strap match at Uncensored. Because of the controversial ending caused once again by Flair at Uncensored, Hogan's feud with Vader culminated in a steel cage match for the WCW World Heavyweight Championship at Bash at the Beach, where Hogan won by escaping the cage. After successfully retaining the WCW World Heavyweight Championship against Big Bubba Rogers and Lex Luger in two separate matches on Nitro in September 1995. The October 9, 1995, broadcast of Nitro was Hogan's first appearance in an all-black attire. Hogan feuded with The Dungeon of Doom, which led to a WarGames match at Fall Brawl where Hogan's team (Lex Luger, Randy Savage, and Sting) won. Hogan's reign as WCW World Heavyweight Champion (which, at 469 days, is the longest in the title's history) ended when he lost the WCW World Heavyweight Championship to The Giant at Halloween Havoc via disqualification."}, {"text": "==== World Heavyweight Champion (1994–1996) ====Following the controversial loss (which was due to a \"contract clause\"), the WCW World Heavyweight Championship became vacant and a new champion was to be crowned in a 60-man three-ring battle royal at World War III, where The Giant cost Hogan the title. This led to a steel cage match between Hogan and The Giant at SuperBrawl VI, where Hogan won to end their feud. In early 1996, Hogan reformed The Mega Powers with Randy Savage to feud with The Alliance to End Hulkamania, which culminated at Uncensored in a Doomsday Cage match that Hogan and Savage won. After coming out victorious from his feuds, Hogan began to only appear occasionally on WCW programming."}, {"text": "==== New World Order (1996–1999) ====At Bash at the Beach in 1996, during a six-man tag team match pitting The Outsiders (Kevin Nash and Scott Hall) against WCW loyalists, Hogan interfered and attacked Randy Savage on behalf of Hall and Nash, thereby turning heel for the first time in nearly fifteen years. After the match, Hogan delivered a promo, accosting the fans and WCW for under-appreciating his talent and drawing power, and announcing the formation of the New World Order (nWo). The new stable gained prominence in the following weeks and months. Hogan grew a beard alongside his famous mustache and dyed it black, traded his red and yellow garb in for black and white clothing, often detailed with lightning bolts, and renamed himself \"Hollywood\" Hulk Hogan (often shortened to Hollywood Hogan). Hogan won his second WCW World Heavyweight Championship at Hog Wild by defeating The Giant for the title. He spray painted \"nWo\" across the title belt, scribbled across the nameplate, and referred to the title as the \"nWo title\". Hogan then started a feud with Lex Luger after Luger and The Giant defeated Hogan and Dennis Rodman in a tag team match at Bash at the Beach."}, {"text": "==== New World Order (1996–1999) ====On the August 4, 1997, episode of Nitro, Hogan lost the title to Lex Luger by submission. Five days later at Road Wild, Hogan defeated Luger to regain the WCW World Heavyweight Championship. Hogan then lost the title to Sting in a match at Starrcade. In the match, WCW's newly contracted Bret Hart accused referee Nick Patrick of fast-counting a victory for Hogan and had the match restarted – with himself as referee. Sting later won by submission. After a rematch the following night on Nitro, where Sting controversially retained the title, the WCW World Heavyweight Championship became vacant. Sting went on to win the vacant title against Hogan at SuperBrawl VIII, and Hogan then developed a rivalry with former friend (and recent nWo recruit) Randy Savage, who had just cost Hogan the title match at SuperBrawl by hitting him with a spray can. The feud culminated in a steel cage match at Uncensored, which ended in a no contest. Savage took the WCW World Heavyweight Championship from Sting at Spring Stampede, while Hogan teamed with Kevin Nash to take on Roddy Piper and The Giant in the first-ever bat match."}, {"text": "==== New World Order (1996–1999) ====Hogan betrayed Nash by hitting him with the bat and then challenged Savage the following night on Nitro for the world title. In the no disqualification match for Savage's newly won title, Nash entered the ring and hit a powerbomb on Hogan as retribution for the attack the previous night, but Bret Hart interfered moments later and jumped in to attack Savage and preserve the victory for Hogan, who won his fourth WCW World Heavyweight Championship. Nash's attack on him signified a split of the nWo into two separate factions – Hogan's became nWo Hollywood and Nash's became nWo Wolfpac –  that feuded with each other for the remainder of the year. Hogan defended the title until July of that year, when WCW booked him in a match against newcomer and then WCW United States Heavyweight Champion Goldberg, who had yet to lose a match in the company. Late in the match, Hogan was distracted by Karl Malone, and Goldberg pinned Hogan to win the WCW World Heavyweight Championship."}, {"text": "==== New World Order (1996–1999) ====Hogan spent the rest of 1998 wrestling celebrity matches: his second tag team match with Dennis Rodman pitted them against Diamond Dallas Page and Karl Malone at Bash at the Beach, and at Road Wild he and Eric Bischoff lost to Page and Jay Leno thanks to interference from Kevin Eubanks. Hogan also had a critically panned rematch with The Warrior at Halloween Havoc, where his nephew Horace aided his victory."}, {"text": "==== New World Order (1996–1999) ====On the Thanksgiving episode of The Tonight Show with Jay Leno, Hogan officially announced his retirement from professional wrestling, as well as his candidacy for President of the United States. Campaign footage aired on Nitro of Hogan and Bischoff holding a press conference, making it appear legitimate. Both announcements were false and made as publicity stunts to draw some of the hype of Jesse Ventura's Minnesota gubernatorial win back to him. After some time off from WCW, Hogan returned on the January 4, 1999, episode of Nitro to challenge Kevin Nash for the WCW World Heavyweight Championship which Hogan won for the fifth time, but many people found the title change to be \"scandalous\". As a result, the warring factions of the nWo reunited into one group, which began feuding with Goldberg and The Four Horsemen."}, {"text": "==== Final years in WCW (1999–2000) ====Hogan lost the WCW World Heavyweight Championship to Ric Flair at Uncensored in a steel cage First Blood match. Later, Hogan was severely injured in a Texas tornado match for the WCW World Heavyweight Championship featuring him, Diamond Dallas Page, Flair, and Sting at Spring Stampede. On the July 12 episode of Nitro, Hogan made his return as a face for the first time in three years and accepted an open challenge from Savage, who had won the WCW World Heavyweight Championship at Bash at the Beach the night before in a tag team match by pinning Kevin Nash. Thanks to interference from Nash, Hogan defeated Savage to win his sixth and final WCW World Heavyweight Championship. Nash turned on him the next week, and the two began a feud that lasted until Road Wild."}, {"text": "==== Final years in WCW (1999–2000) ====On August 9, 1999, Hogan started the night dressed in the typical black and white, but after a backstage scene with his son came out dressed in the traditional red and yellow for his main event six-man tag team match. Hogan then defeated Nash in a retirement match at Road Wild to retain the WCW World Heavyweight Championship. Injuries and frustrations mounted, and he was absent from television from October 1999 to February 2000. In his book Hollywood Hulk Hogan, Hogan said that he was asked to take time off by newly hired head of creative booking Vince Russo and was not told when he would be brought back at the time. Despite some reservations, he agreed to do so. On October 24 at Halloween Havoc, Hogan was to face Sting for the WCW World Heavyweight Championship. Hogan came to the ring in street clothes, lay down for the pin, and left the ring."}, {"text": "==== Final years in WCW (1999–2000) ====Soon after his return in February 2000, at Bash at the Beach on July 9, Hogan was involved in a controversial work with Vince Russo. Hogan was scheduled to challenge Jeff Jarrett for the WCW World Heavyweight Championship. Before the match, there was a backstage dispute between Hogan and Russo; Hogan wanted to take the title, but Russo was going to have Jarrett win, and lose it to Booker T. Russo told Hogan that he was going to have Jarrett lie down for him, simulating a real conflict, although Jarrett was not told it was a work. When the bell rang, Jarrett lay down in the middle of the ring while Russo threw the WCW World Heavyweight Championship belt in the ring and yelled at Hogan from ringside to pin Jarrett. A visibly confused Hogan complied with a foot on Jarrett's chest after getting on the microphone and telling Russo, \"Is this your idea, Russo? That's why this company is in the damn shape it's in, because of bullshit like this!\" After winning and being announced as the new WCW World Heavyweight Champion, Hogan immediately took the WCW title belt. Moments later, Russo returned to the ring, angrily proclaiming this would be the last time fans would ever see \"that piece of shit\" in a WCW stadium. This is also when the public discovered, through Russo, the \"creative control\" clause that Hogan had, which meant that Hogan could control what would happen with his own character, without anyone else telling him no. In his Bash at the Beach shoot promo, Russo said that he was arguing with Hogan all day prior to the event in the back because he wanted to use the clause in the Jarrett match, saying, \"That means that, in the middle of this ring, when [Hogan] knew it was bullshit, he beats Jeff Jarrett!\". Since Hogan refused to job to Jarrett, a new WCW World Heavyweight Championship was created, setting the stage for a title match between Booker T and Jarrett later that night."}, {"text": "==== Final years in WCW (1999–2000) ====As a result, Hogan filed a defamation of character lawsuit against Russo soon after, which was eventually dismissed in 2002. Russo claims the whole thing was a work, and Hogan claims that Russo made it a shoot. Eric Bischoff agreed with Hogan's side of the story when he wrote that Hogan winning and leaving with the belt was a work (devised by Bischoff rather than Russo), and that he and Hogan celebrated after the event over the success of the angle, but that Russo coming out to fire Hogan was an unplanned shoot which led to the lawsuit filed by Hogan. It was the last time he was seen in WCW."}, {"text": "=== Post-WCW endeavors (2001) ===In the months following the eventual demise of WCW in March 2001, Hogan underwent surgery on his knees in order for him to wrestle again. As a test, Hogan worked a match in Orlando, Florida on November 14, for the Xcitement Wrestling Federation (XWF) promotion run by his longtime manager Jimmy Hart. Hogan defeated Curt Hennig in this match and felt healthy enough to accept an offer to return to the WWF in February 2002."}, {"text": "=== Second return to WWF/WWE (2002–2003) ===At No Way Out in February 2002, Hogan returned to the WWF as a heel. Returning as leader of the original nWo with Scott Hall and Kevin Nash, the three got into a confrontation with The Rock and cost Stone Cold Steve Austin a chance at becoming the Undisputed WWF Champion against Chris Jericho in the main event. The nWo feuded with both Austin and The Rock, and Hogan accepted The Rock's challenge to a match at WrestleMania X8, where Hogan asked Hall and Nash not to interfere, wanting to defeat The Rock by himself. Despite the fact that Hogan was supposed to be the heel in the match, the crowd cheered for him heavily. The Rock cleanly won the contest, and befriended Hogan at the end of the bout, helping him fight off Hall and Nash, who were upset by Hogan's conciliatory attitude. After the match, Hogan turned face by siding with The Rock, though he continued wearing black and white tights for a few weeks after WrestleMania X8 until he resumed wearing his signature red and yellow tights. During this period, the \"Hulk Rules\" logo of the 1980s was redone with the text \"Hulk Still Rules\", and Hogan also wore the original \"Hulk Rules\" attire twelve years earlier, when he headlined WrestleMania VI at the same arena, in the SkyDome. For a time, he was still known as \"Hollywood\" Hulk Hogan, notably keeping the Hollywood Hogan style blond mustache with black beard while wearing Hulkamania-like red and yellow tights and using the \"Voodoo Child\" entrance theme music he'd used in WCW. On the April 4, 2002 episode of SmackDown!, Hogan began a feud with Triple H, and then defeated him for the Undisputed WWF Championship at Backlash, thus becoming the last ever WWF Champion, as a legal battle with the World Wildlife Fund soon compelled the company to change its name from World Wrestling Federation/WWF to World Wrestling Entertainment/WWE in May 2002."}, {"text": "=== Second return to WWF/WWE (2002–2003) ===On May 19 at Judgment Day, Hogan lost the WWE Undisputed Championship to The Undertaker. After losing a number one contender match for the WWE Undisputed Championship to Triple H on the June 6 episode of SmackDown!, Hogan began feuding with Kurt Angle resulting in a match between the two at the King of the Ring, which Angle won by submission. On the July 4 episode of SmackDown!, Hogan teamed with Edge to defeat Billy and Chuck and capture the WWE Tag Team Championship for the first time. They celebrated by waving the American flag as the overjoyed audience sang along to Hogan's theme song \"Real American\". They lost the belts to The Un-Americans (Christian and Lance Storm) at Vengeance. In August 2002, Hogan was used in an angle with Brock Lesnar, culminating in a main event singles match on the August 8 episode of SmackDown!, which Lesnar won by technical submission (the match was called after Hogan became unconscious from a bear hug hold). Lesnar became only the second WWE wrestler to defeat Hogan by submission (after Kurt Angle), and the first to defeat Hogan by having the match called. Following the match, Lesnar continued to beat on Hogan, leaving him bloody and unconscious in the ring."}, {"text": "=== Second return to WWF/WWE (2002–2003) ===As a result of Lesnar's assault, Hogan went on hiatus until early 2003, shaving off his black beard and dropping \"Hollywood\" from his name in his return. Hogan battled The Rock (who had turned heel) once again at No Way Out and lost and defeated Mr. McMahon at WrestleMania XIX in a street fight billed as \"twenty years in the making\". After WrestleMania, he had a run as the masked Mr. America, a character who, despite sounding and behaving like Hogan, consistently denied he was the Hulkster. Mr. America used Hogan's \"Real American\" as his entrance theme, as well as all of Hogan's signature gestures, moves, and phrases. He was the subject of a storyline that took place after Hogan was forced by Mr. McMahon to sit out the rest of his contract. A WWE pre-debut push took place with mysterious Mr. America promos airing for weeks during SmackDown!. There was also on-screen discussion on SmackDown! between then General Manager Stephanie McMahon and other players concerning her hiring Mr. America \"sight unseen\". On May 1, Mr. America debuted on SmackDown! on a Piper's Pit segment. McMahon appeared and claimed that Mr. America was Hogan in disguise; Mr. America shot back by saying, \"I am not Hulk Hogan, brother!\" (lampooning Hogan's use of \"brother\" in his promos). The feud continued through the month of May, with a singles match between Mr. America and Hogan's old rival \"Rowdy\" Roddy Piper at Judgment Day, a match Mr. America won."}, {"text": "=== Second return to WWF/WWE (2002–2003) ===Mr. America's last WWE appearance was on the June 26 episode of SmackDown! when Big Show and The World's Greatest Tag Team (Charlie Haas and Shelton Benjamin) defeated Brock Lesnar, Kurt Angle, and Mr. America in a six-man tag team match. After the show went off the air, Mr. America unmasked to show the fans that he was indeed Hogan, putting his finger to his lips telling the fans to keep quiet about his secret. The next week, Hogan quit WWE due to frustration with the creative team. On the July 3 episode of SmackDown!, McMahon showed the footage of Mr. America unmasking as Hogan and \"fired\" him, although Hogan had already quit in real life. It was later revealed that Hogan was unhappy with the payoffs for his matches after his comeback under the Mr. America gimmick. McMahon terminated Hogan's contract in 2003."}, {"text": "=== Second return to NJPW (2003) ===Hogan returned to NJPW in October 2003, when he defeated Masahiro Chono at Ultimate Crush II in the Tokyo Dome."}, {"text": "=== Total Nonstop Action Wrestling (2003) ===Shortly after Hogan left WWE, Total Nonstop Action Wrestling (TNA) began making overtures to Hogan, culminating in Jeff Jarrett, co-founder of TNA and then NWA World Heavyweight Champion, launching an on-air attack on Hogan in Japan in October 2003. The attack was supposed to be a precursor to Hogan battling Jarrett for the NWA World Heavyweight Championship at TNA's first three-hour pay-per-view. Due to recurring knee and hip problems, Hogan did not appear in TNA. Still, the incident has been shown several times on TNA broadcasts, and was included in the TNA DVD TNA's Fifty Greatest Moments."}, {"text": "=== Third return to WWE (2005–2007) ===On April 2, 2005, Hogan was inducted into the WWE Hall of Fame class of 2005 by actor and friend Sylvester Stallone. At WrestleMania 21 on April 3, Hogan came out to rescue Eugene, who was being attacked by Muhammad Hassan and Khosrow Daivari. The build-up to Hogan's Hall of Fame induction and preparation for his WrestleMania angle was shown on the first season of Hogan Knows Best. The next night on Raw, Hassan and Daivari came out to confront and assault fan favorite Shawn Michaels. The following week on Raw, Michaels approached Raw General Manager Eric Bischoff demanding a handicap match with Hassan and Daivari. Bischoff refused, but told Michaels if he found a partner he would be granted a tag team match. Michaels then made a plea for Hogan to team with him. On the April 18 episode of Raw, Hassan again led an attack on Michaels until Hogan appeared, saving Michaels and accepting his offer. At Backlash, Hassan and Daivari lost to Hogan and Michaels."}, {"text": "=== Third return to WWE (2005–2007) ===Hogan then appeared on July 4 episode of Raw, as the special guest of Carlito on his talk-show segment Carlito's Cabana. After being asked questions by Carlito concerning his daughter Brooke, Hogan attacked Carlito. Kurt Angle then also appeared, making comments about Brooke, which further upset Hogan, who was eventually double teamed by Carlito and Angle, but was saved by Shawn Michaels. Later that night, Michaels and Hogan defeated Carlito and Angle in a tag team match; during the post-match celebration, Michaels performed the Sweet Chin Music on Hogan and walked off. The following week on Raw, Michaels appeared on Piper's Pit and challenged Hogan to face him one-on-one for the first time. Hogan appeared on Raw one week later and accepted the challenge. The match took place at SummerSlam, which Hogan won. After the match, Michaels extended his hand to him, telling him that he \"had to find out for himself\", and Hogan and Michaels shook hands as Michaels left the ring to allow Hogan to celebrate with the crowd."}, {"text": "=== Third return to WWE (2005–2007) ===Prior to WrestleMania 22 in April 2006, Hogan inducted friend and former announcer \"Mean\" Gene Okerlund into the WWE Hall of Fame class of 2006. Hogan returned on Saturday Night's Main Event XXXIII with his daughter Brooke. During the show, Randy Orton flirted with Brooke and later attacked Hogan in the parking lot. He later challenged Hogan to a match at SummerSlam, which Hogan won. This was Hulk Hogan's final match wrestling for the WWE, although he had negotiations for a match against John Cena at WrestleMania 25 which ultimately fell through."}, {"text": "=== Memphis Wrestling (2007–2008) ===After a brief fall out with McMahon and WWE, Hogan was lured to Memphis Wrestling with the proposal of wrestling Jerry Lawler. The match had been promoted on Memphis Wrestling Prime Time for several months. On April 12, 2007, Lawler announced in a news conference that WWE had barred him from wrestling Hogan on the basis that NBC performers (including Lawler, on the basis of co-hosting the NBC-owned USA Network's Raw and his appearances on the biannual WWE's Saturday Night's Main Event) are contractually prohibited from appearing on VH1, the channel on which Hogan Knows Best airs. The situation resulted in a lawsuit being filed against WWE by event promoter Corey Maclin. Lawler was replaced with Paul Wight. Hogan defeated Wight at Memphis Wrestling's PMG Clash of Legends on April 27, 2007, when he picked up and hit a body slam on Wight before pinning him following his signature running leg drop."}, {"text": "=== Hulkamania: Let the Battle Begin (2009) ===On November 21, 24, 26 and 28, Hogan performed with a group of wrestlers including Spartan-3000, Heidenreich, Eugene, Brutus \"The Barber\" Beefcake and Orlando Jordan across Australia in a tour titled Hulkamania: Let The Battle Begin. The main event of each show was a rematch between Hogan and Ric Flair – the wrestler who defeated Hogan more times than any other. Hogan defeated Flair in all four matches."}, {"text": "==== Dixie Carter's business partner (2009–2010) ====On October 27, 2009, it was announced that Hogan had signed a contract to join TNA on a full-time basis. The footage of his signing and the press conference at Madison Square Garden following it were featured on the October 29 episode of Impact!."}, {"text": "==== Dixie Carter's business partner (2009–2010) ====On December 5, 2009, Hogan announced on Ultimate Fighting Championship (UFC)'s The Ultimate Fighter that he would make his official TNA debut on January 4, 2010, in a special live three-hour Monday night episode of Impact! to compete with WWE's Raw (which featured the return of Bret Hart)."}, {"text": "==== Dixie Carter's business partner (2009–2010) ====On the January 4 episode of Impact!, Hogan debuted, reuniting briefly with former nWo partners Kevin Nash, Scott Hall, and Sean Waltman, the latter two of whom made their returns to the company. He refused to join them for a full-fledged reunion of their group claiming, \"it's a different time\", and stuck to his business relations with Bischoff, who made his appearance to declare that, the two of them would \"flip the company upside down\" and everyone would have to earn their spot. Hogan also encountered TNA founder Jeff Jarrett on the broadcast, appearing via video wall and interrupting Jarrett's company success speech, stating that Carter was instrumental to the company's survival, and that just like the rest, Jarrett would have to earn his spot in TNA."}, {"text": "==== Dixie Carter's business partner (2009–2010) ====On the February 18 episode of Impact!, Hogan took Abyss under his wing, and during this sequence, gave him his Hall of Fame ring and claimed it would make him a \"god of wrestling\". Hogan made his in-ring return on March 8, teaming with Abyss to defeat A.J. Styles and Ric Flair when Abyss scored a pinfall over Styles. Afterward, the returning Jeff Hardy saved Hogan and Abyss from a beatdown by Styles, Flair and Desmond Wolfe. The storyline became a Team Flair versus Team Hogan situation, with Jarrett and the debuting Rob Van Dam joining Team Hogan and Beer Money (James Storm and Robert Roode) and Sting joining Team Flair. At Lockdown, Team Hogan (Hulk Hogan, Abyss, Jeff Jarrett, Jeff Hardy and Rob Van Dam) defeated Team Flair (Ric Flair, Sting, Desmond Wolfe, Robert Roode and James Storm) in a Lethal Lockdown match."}, {"text": "==== Immortal (2010–2011) ====On the June 17 episode of Impact!, Hogan's alliance with Abyss came to an abrupt end when Abyss turned heel. Abyss later claimed that he was controlled by some entity that was coming to TNA. The next month, Hogan worked with Bischoff, Jeff Jarrett and Samoa Joe against Sting and Kevin Nash, who claimed that they knew that Hogan and Bischoff were up to something. During this time, Abyss went on a rampage, attacking Rob Van Dam to the point that he was forced to vacate the TNA World Heavyweight Championship and eventually put his hands on TNA president Dixie Carter, which led to her signing the paperwork, presented by Bischoff, that would have Abyss fired from TNA following his match with Van Dam at Bound for Glory. Hogan was set to wrestle with Jarrett and Joe against Sting, Nash and D'Angelo Dinero at Bound for Glory, but was forced to miss the event due to a back surgery. He made an appearance at the end of the event, and turned heel by helping Jeff Hardy win the vacant TNA World Heavyweight Championship and aligning himself with Hardy, Bischoff, Abyss and Jarrett. On the following episode of Impact!, it was revealed that Bischoff had tricked Carter and the paperwork she had signed a week earlier, were not to release Abyss, but to turn the company over to him and Hogan. Meanwhile, Bischoff's and Hogan's new stable, now known as Immortal, formed an alliance with Ric Flair's Fortune. Dixie Carter returned on the November 25 episode of Reaction, informing Hogan and Bischoff that a judge had filed an injunction against the two on her behalf over not having signatory authority, indefinitely suspending Hogan from TNA. During his absence, Hogan underwent a potentially career–ending spinal fusion surgery on December 21, 2010."}, {"text": "==== Immortal (2010–2011) ====Hogan returned to TNA on the March 3, 2011, episode of Impact!, declaring himself as the new owner of TNA, having won the court battle against Dixie Carter. In April, he began hinting at a possible return to the ring to face the TNA World Heavyweight Champion, Sting. On the May 12 episode of the newly renamed Impact Wrestling, Hogan lost control of the program to Mick Foley, who revealed himself as the Network consultant who had been causing problems for Immortal ever since Hogan and Bischoff took over the company. This angle was cut short three weeks later, when Foley left the promotion. During the following months, Hogan continued to interfere in Sting's matches, costing him the TNA World Heavyweight Championship first at Hardcore Justice, recruiting Kurt Angle to Immortal in the process, on the September 1 episode of Impact Wrestling and finally at No Surrender. On the September 15 episode of Impact Wrestling, Sting defeated Immortal member Ric Flair to earn the right to face Hogan at Bound for Glory. On October 4, it was reported that Hogan had signed a contract extension with TNA. After feigning retirement from professional wrestling, Hogan accepted the match at Bound for Glory on the October 6 episode of Impact Wrestling, while also agreeing to hand TNA back to Dixie Carter, should Sting win the match."}, {"text": "==== Immortal (2010–2011) ====Hogan was defeated by Sting at Bound For Glory, ending his storyline as the president of TNA. After the match, Immortal attacked Sting, but Hogan turned face by turning on Immortal and helping Sting. On the following episode of Impact Wrestling, Hogan, wearing his trademark yellow and red again, admitted to his mistakes, and put over Sting for winning."}, {"text": "==== Feud with Aces & Eights (2012–2013) ====During TNA's 2012 UK tour, on January 26 and 27, Hogan returned to the ring at house shows in Nottingham and Manchester, where he, James Storm and Sting defeated Bobby Roode, Bully Ray and Kurt Angle in a six-man tag team main event at both events, the latter of which was Hogan's final match. Hogan returned to Impact Wrestling on February 2, when he was revealed as Garett Bischoff's trainer. On the March 29 episode of Impact Wrestling, Hogan returned and accepted Sting's offer to replace him as the new General Manager."}, {"text": "==== Feud with Aces & Eights (2012–2013) ====In July, Hogan, alongside Sting, began feuding with a mysterious group of masked men, who had dubbed themselves the \"Aces & Eights\". The group's attack on Hogan on the July 12 episode of Impact Wrestling was used to write Hogan off television as he was set to undergo another back surgery."}, {"text": "==== Feud with Aces & Eights (2012–2013) ====In November, Hogan moved into a storyline with Bully Ray after Austin Aries revealed a secret relationship between Ray and Hogan's daughter Brooke. After seeing them kissing in a parking garage on the December 20 episode of Impact Wrestling, Hogan suspended Ray indefinitely. The following week on Impact Wrestling, after Ray saved Brooke from a kidnapping by the Aces & Eights, Brooke accepted his marriage proposal. Despite Hogan's disapproval, he still walked Brooke down the aisle for her wedding on the next episode of Impact Wrestling, during which Ray's groomsmen Taz interrupted and revealed himself as a member of the Aces & Eights, leading the group to attack Hogan, Ray, and the rest of the groomsmen."}, {"text": "==== Feud with Aces & Eights (2012–2013) ====On the January 31 episode of Impact Wrestling, Hogan reinstated Ray so he could take on the Aces & Eights. Hogan named Ray the number one contender to the TNA World Heavyweight Championship on the February 21 episode of Impact Wrestling. At Lockdown, Ray betrayed Hogan, after Aces & Eights helped him win the title, and he revealed himself as the President of the Aces & Eights. Following Lockdown, Hogan blamed Sting for Ray winning the title as it was Sting who encouraged Hogan to give Ray the title shot. Sting returned and saved Hogan from an attack by Aces & Eights on the April 25 episode of Impact Wrestling. The following week on Impact Wrestling, Hogan and Sting reconciled their differences. On the October 3 episode of Impact Wrestling, Hogan refused an offer from Dixie Carter to become her business partner and quit; this was done to officially write Hogan off, as a result of his contract expiring with TNA."}, {"text": "=== Fourth return to WWE (2014–2015) ===On February 24, 2014, on Raw, Hogan made his first WWE in-ring appearance since December 2007 to hype the WWE Network. On the March 24 episode of Raw, Hogan came out to introduce the guest appearances of Arnold Schwarzenegger and Joe Manganiello; this was to promote the guests' new movie Sabotage."}, {"text": "=== Fourth return to WWE (2014–2015) ===At WrestleMania XXX in April, Hogan served as the host, coming out at the start of the show to hype up the crowd. During his promo, he mistakenly referred to the Superdome, the venue the event was being held at, as the Silverdome, which became the subject of jokes throughout the night. Hogan was later joined by Stone Cold Steve Austin and The Rock, and they finished their promo by drinking beer together in the ring. Later in the show, Hogan shared a moment with Mr. T, Paul Orndorff and Roddy Piper, with whom he main-evented the first WrestleMania."}, {"text": "=== Fourth return to WWE (2014–2015) ===On February 27, 2015, Hogan was honored at Madison Square Garden during a WWE live event dubbed \"Hulk Hogan Appreciation Night\" with a special commemorative banner hanging from the rafters, honoring his wrestling career and historic matches he had in the arena."}, {"text": "=== Fourth return to WWE (2014–2015) ===On the March 23 episode of Raw, Hogan along with Snoop Dogg confronted Curtis Axel – who at the time had been \"borrowing\" Hogan's Hulkamania gimmick with Axel referring to himself as \"AxelMania\". On March 28, the night before WrestleMania, Hogan posthumously inducted longtime partner and rival \"Macho Man\" Randy Savage into the WWE Hall of Fame class of 2015. The next night at WrestleMania 31, Hogan reunited with Hall and Nash to reform the nWo, appearing in Sting's corner in his match against Triple H, who himself was joined by D-Generation X (DX) members Billy Gunn, X-Pac, Road Dogg, and Shawn Michaels."}, {"text": "==== Scandal and departure ====In July 2015, National Enquirer and Radar Online publicized an anti-black rant made by Hogan on a leaked sex tape recorded in 2007. In the recording, he is heard expressing disgust with the notion of his daughter dating a black man, referenced by repeated use of the racial slur \"nigger\". Hogan also admitted to being \"a racist, to a point\"."}, {"text": "==== Scandal and departure ====Once the recordings went public erupting in a media scandal, Hogan apologized for the remarks, which he said is \"language that is offensive and inconsistent with [his] own beliefs.\" Three black wrestlers who worked in the WWF and WCW with Hogan made supportive comments. Virgil commented \"Hogan has never given me a reason to believe he is a racist\" while Dennis Rodman said he \"most certainly is not a racist\" and Kamala added \"I do not think Hogan meant harm by saying that. Hogan is my brother until he decides not to be.\" Black wrestlers working in the WWE made different comments. Mark Henry said he was pleased by WWE's \"no tolerance approach to racism\" response, and that he was hurt and offended by Hogan's manner and tone. Booker T said he was shocked and called the statements unfortunate."}, {"text": "==== Scandal and departure ====On July 24, WWE terminated their contract with Hogan, stating that they are \"committed to embracing and celebrating individuals from all backgrounds,\" although Hogan's lawyer said Hogan chose to resign. A day prior, WWE removed almost all references to Hogan from their website, including his listing as a judge for Tough Enough, his merchandise from WWE Shop, and his entry from its WWE Hall of Fame page (he was still listed in the Hall of Fame entry of the official WWE encyclopedia released in October 2016). His DLC appearance from WWE 2K15 was taken down from sale, and his character was cut from then upcoming WWE 2K16 game during development."}, {"text": "==== Scandal and departure ====In response to the controversy, Mattel stopped producing Hogan action figures, while Hogan's merchandise was taken down from online stores of Target, Toys \"R\" Us, and Walmart. On July 28, Radar Online reported that Hogan had also used homophobic slurs on the leaked sex tape. Days later, it was reported that Hogan had used racist language in a 2008 call to his then-imprisoned son, Nick, and also said that he hoped they would not be reincarnated as black males."}, {"text": "==== Scandal and departure ====Hogan gave an interview with ABC on August 31 in which he pleaded forgiveness for his racist comments, attributing these to a racial bias inherited from his neighborhood while growing up. Hogan claimed that the term \"nigger\" was used liberally among friends in Tampa; former neighbors disputed this claim."}, {"text": "==== Scandal and departure ====In the time that followed, numerous African-Americans associated with wrestling expressed some level of support for Hogan including: The Rock, Dennis Rodman, Booker T, Kamala, Virgil, Mr. T, Mark Henry, Big E, and D'Angelo Dinero, who stressed his forgiveness of Hogan, whom he saw as having made a \"positive mark on humanity\" for over three decades."}, {"text": "=== Fifth return to WWE (2018–present) ===On July 15, 2018, Hogan was reinstated into the WWE Hall of Fame. Later that same night, he was invited backstage to WWE's Extreme Rules pay-per-view event and was briefly mentioned on the event's kickoff show. Hogan made his on-screen return on November 2, 2018, as the host of Crown Jewel. Hogan next appeared on the January 7, 2019, episode of Raw to present a tribute to his longtime friend and colleague Mean Gene Okerlund, who had died five days prior. It was the first time Hogan had appeared in a WWE ring in North America since his 2015 firing. Hogan subsequently appeared on a WWE Network special where he spoke further of his relationship with Okerlund."}, {"text": "=== Fifth return to WWE (2018–present) ===Hogan inducted his Mega-Maniacs tag team partner and longtime friend Brutus Beefcake into the WWE Hall of Fame on April 6, 2019. The following night at WrestleMania 35, he made a surprise appearance at the beginning of the show alongside WrestleMania host Alexa Bliss, welcoming fans to the event and parodying his gaffe from WrestleMania XXX, when he incorrectly referred to the Superdome as the Silverdome. On the June 17, 2019, Raw, WWE aired a Hogan interview about the U.S. Women's World Cup soccer team. On the July 22, 2019, Raw, Hogan appeared as part of the \"Raw Reunion\" special. Hogan was one of the speakers during the \"Toast to Raw\" segment along with Steve Austin. On September 30, 2019, episode of Raw, he and Ric Flair unveiled a 10-man tag team match, for Crown Jewel. Hogan and Flair made multiple appearances on shows with their teams leading up to the event, which saw Hogan manage his team to victory."}, {"text": "=== Fifth return to WWE (2018–present) ===Hogan made it public knowledge that he hoped to have one more match in the WWE, including during an interview with the Los Angeles Times. On December 9, 2019, it was announced that Hogan would be inducted into the WWE Hall of Fame a second time as a member of the New World Order, together with fellow former nWo stablemates Kevin Nash, Scott Hall, and Sean Waltman."}, {"text": "=== Fifth return to WWE (2018–present) ===Hogan made his only appearance of 2020 on WWE's non-WWE Network programming when he appeared via satellite on the February 14, 2020, episode of SmackDown to speak about the Hall of Fame. He was interrupted by Bray Wyatt, as Hogan warned him about his upcoming match with Goldberg. The 2020 Hall of Fame ceremony was subsequently delayed due to the COVID-19 pandemic and aired on April 6, 2021."}, {"text": "=== Fifth return to WWE (2018–present) ===Hogan made his first appearance of 2021 on the January 4 episode of Raw, which was a special Legends Night episode. He opened the show introducing the 'H-Phone,' his spin on an iPhone. He appeared in a backstage segment with Jimmy Hart, Drew McIntyre and Sheamus, where he gave his approval to McIntyre, the current WWE Champion. He also watched the championship main event match between McIntyre and Keith Lee on-stage with the rest of the guest legends."}, {"text": "=== Fifth return to WWE (2018–present) ===It was announced on the March 19, 2021, episode of WWE SmackDown he would co-host WrestleMania 37 with Titus O'Neil. Hogan opened both nights of WrestleMania 37 with O'Neil, appeared in multiple segments with Bayley, which led to a return of the Bella Twins, who attacked Bayley, and was introduced during the Hall of Fame celebration with Nash, Hall and Waltman."}, {"text": "=== Fifth return to WWE (2018–present) ===On January 23, 2023, Hogan appeared live alongside Jimmy Hart to open the WWE Raw is XXX show, celebrating the 30th Anniversary of Raw. On January 22, 2024, WWE celebrated the 40th anniversary of 'Hulkamania' with Hogan appearing in pre-taped footage."}, {"text": "=== Legacy ===Hogan has been described as one of the largest attractions in professional wrestling history and a major reason why Vince McMahon's expansion of his promotion worked. Wrestling historian and journalist Dave Meltzer stated that \"...You can't possibly overrate his significance in the history of the business. And he sold more tickets to wrestling shows than any man who ever lived\". Hogan's match with Andre the Giant at The Main Event on February 5, 1988, holds American television records for a wrestling audience with a 15.2 Nielsen rating and 33 million viewers. IMDb ranked Hogan as the biggest draw in Professional Wrestling history, ranking him number 1 in a list with 60 other wrestlers."}, {"text": "=== Legacy ===Fellow wrestler Cody Rhodes has said numerous times that Hogan's WrestleMania X8 match with The Rock is the greatest match in wrestling history and that it epitomized what professional wrestling is."}, {"text": "=== Legacy ===Fellow WWE Hall of Fame member Bret Hart has been repeatedly critical of Hogan's wrestling abilities, including in 2021 saying that he \"didn't know a headlock from a headlamp\", and that he was \"very limited\". Hart had previously referred to Hogan as a \"hero\" to fans. and previously complimented Hogan's look. \"You look at Hulk Hogan, okay? Unbelievable look, 6'8″ with the 24″ pythons, it's an incredible [look]. When he walks in the room, the whole room stops. Like, you see it. He [has] got, like, legs stuck on his shoulders. His arms are as big as somebody's legs."}, {"text": "=== Legacy ===Former writer Vince Russo, who Hogan had previously sued, said that more wrestlers in 2022 should wrestle like Hogan, as opposed to the modern-day style acrobats."}, {"text": "=== Legacy ===Hogan himself has previously said he is \"number two\" behind Ric Flair, who he said is the greatest wrestler of all time."}, {"text": "=== Legacy ===Chris Jericho said on his podcast in 2023 that Hogan was a better worker than Flair in his experience. \"Hogan is a better worker than Flair. For me. I always had amazing matches with Hogan because he knew exactly who he was as a babyface, as a heel, whatever. He was so great. He knew his audience. He didn't do anything he didn't have to. It was one of my favorite times in my career.\""}, {"text": "=== Legacy ===1980s wrestler The Warlord gave Hogan credit for his legacy in the ring and behind the scenes. \"He was very nice to everybody. He was just one of the boys back there, you know? I always respected him and he always respected me, and that meant a lot to me. He changed the business for a big man.\""}, {"text": "=== Legacy ===On February 20, 2019, it was announced that Chris Hemsworth would portray him in a biopic, directed by Todd Phillips."}, {"text": "=== Food industry ===Hogan created and financed a restaurant called Pastamania located in the Mall of America in Bloomington, Minnesota. It opened on the Labor Day weekend of 1995 and was heavily promoted on World Championship Wrestling (WCW)'s live show Monday Nitro. The restaurant, which remained in operation for less than a year, featured such dishes as \"Hulk-U's\" and \"Hulk-A-Roos\"."}, {"text": "=== Food industry ===In interviews on The Tonight Show and Late Night with Conan O'Brien, Hogan claimed that the opportunity to endorse what came to be known as the George Foreman Grill was originally offered to him, but when he failed to respond in time, Foreman endorsed the grill instead. Instead, Hogan endorsed a blender, known as the Hulk Hogan Thunder Mixer. He has since endorsed a grill known as \"The Hulk Hogan Ultimate Grill\", voluntarily recalled as a fire hazard in 2008 along with other QVC and Tristar grills."}, {"text": "=== Food industry ===In 2006, Hogan unveiled Hogan Energy, a drink distributed by Socko Energy. His name and likeness were also applied to a line of microwavable hamburgers, cheeseburgers, and chicken sandwiches sold at Wal-Mart called \"Hulkster Burgers\". On November 1, 2011, Hogan launched a new website called Hogan Nutrition, which features many nutritional and dietary products."}, {"text": "=== Food industry ===On New Year's Eve 2012, Hogan opened a beachfront restaurant called \"Hogan's Beach\", located in the Tampa area. The restaurant dropped Hogan's name in October 2015. Hogan later opened Hogan's Hangout in Clearwater Beach."}, {"text": "=== Finances ===In September 2008, Hogan's net worth was revealed to be around $30 million. In September 2011, Hogan revealed that his lavish lifestyle and divorce had cost him hundreds of millions of dollars and nearly bankrupted him."}, {"text": "=== Other ===In October 2007, Hogan transferred all trademarks referring to himself to his liability company named \"Hogan Holdings Limited\". The trademarks include Hulk Hogan, \"Hollywood\" Hulk Hogan, Hulkster, Hogan Knows Grillin, Hulkamania.com, and Hulkapedia.com."}, {"text": "=== Other ===In April 2008, Hogan announced that he would lend his license to video game developer Gameloft to create \"Hulkamania Wrestling\" for mobile phones. Hogan stated in a press release that the game would be \"true to [his] experiences in wrestling\" and use his classic wrestling moves like the Doublehand Choke Lift and Strong Clothesline. As of 2010, Hogan stars alongside Troy Aikman in commercials for Rent-A-Center. On March 24, 2011, Hogan made a special appearance on American Idol, giving a big surprise to wrestling fans Paul McDonald and James Durbin. On October 15, 2010, Endemol Games UK (a subsidiary of media production group Endemol UK) announced a partnership with Bischoff Hervey Entertainment to produce \"Hulk Hogan's Hulkamania\", an online gambling game featuring video footage of Hogan."}, {"text": "=== Other ===In October 2013, Hogan partnered with Tech Assets, Inc. to open a web hosting service called \"Hostamania\". To promote the service, a commercial video was released, featuring Hogan parodying Jean-Claude Van Damme's GoDaddy.com commercials and Miley Cyrus' \"Wrecking Ball\" music video. On November 21, 2013, Hulk Hogan and GoDaddy.com appeared together on a live Hangout On Air on Google Plus, where Hulk Hogan had a casual conversation about Hostamania, fans, and business."}, {"text": "=== Other ===Hogan became a distributor for multi-level marketing company ViSalus Sciences after looking for business opportunities outside of wrestling. Hogan supports the American Diabetes Association."}, {"text": "=== Acting ===Hogan's crossover popularity led to several television and movie roles. Early in his career Hogan played the part of Thunderlips in Rocky III (1982). He also appeared in No Holds Barred (1989), before starring in family films Suburban Commando (1991), Mr. Nanny (1993), Santa with Muscles (1996), and 3 Ninjas: High Noon at Mega Mountain (1998). Hogan also appeared in 1992 commercials for Right Guard deodorant. He starred in his own television series, Thunder in Paradise, in 1994. He is the star of The Ultimate Weapon (1998), in which Brutus Beefcake also appears in a cameo."}, {"text": "=== Acting ===In 1997, Hogan starred in the TNT original movie Assault on Devil's Island, as the leader of a commando unit featuring fellow genre veterans Carl Weathers and Shannon Tweed. Eric Bischoff was also listed as an executive producer. The characters were considered for a regular series, but instead received a second feature-length showcase two years later, called Assault on Death Mountain. In 1995, he appeared on TBN's Kids Against Crime. Hogan made cameo appearances in Muppets from Space, Gremlins 2: The New Batch (the theatrical cut) and Spy Hard as himself. Hogan also played the role of Zeus in Little Hercules in 3D. Hogan also made two appearances on The A-Team (in 1985 and 1986), along with Roddy Piper. He also appeared on Suddenly Susan in 1999. In 2001, Hogan guest-starred on an episode of Walker, Texas Ranger."}, {"text": "=== Acting ===Hogan has become a busy voice actor in later years making guest voice spots on Robot Chicken and American Dad! and as a primary actor in the Cartoon Network/Adult Swim series China, IL."}, {"text": "=== Reality television and hosting ===On July 10, 2005, VH1 premiered Hogan Knows Best a reality show which centered around Hogan, his then-wife Linda, and their children Brooke and Nick. In July 2008, a spin-off entitled Brooke Knows Best premiered, which focused primarily on Hogan's daughter Brooke."}, {"text": "=== Reality television and hosting ===Hogan hosted the comeback series of American Gladiators on NBC in 2008. He also hosted and judged the short-lived reality show, Hulk Hogan's Celebrity Championship Wrestling. Hogan had a special titled Finding Hulk Hogan on A&E on November 17, 2010."}, {"text": "=== Reality television and hosting ===In 2015, Hogan was a judge on the sixth season of Tough Enough, alongside Paige and Daniel Bryan, but due to the scandal, he was replaced by The Miz after episode 5."}, {"text": "=== Music and radio ===Hogan released a music CD, Hulk Rules, as Hulk Hogan and the Wrestling Boot Band, which also included Jimmy \"Mouth of the South\" Hart, his then-wife Linda and J.J Maguire. Despite negative reviews, Hulk Rules reached No. 12 on the Billboard Top Kid Audio chart in 1995. Green Jellÿ released a duet with Hogan, performing Gary Glitter's song \"I'm the Leader of the Gang (I Am)\". He has also made cameos in several music videos. From her self-named show Dolly, the music video for Dolly Parton's wrestling-themed love song \"Headlock on My Heart\" features Hogan as \"Starlight Starbright\". In the music video \"Pressure\" by Belly featuring Ginuwine, Hogan and his daughter Brooke both made brief cameo appearances."}, {"text": "=== Music and radio ===Hogan was a regular guest on Bubba the Love Sponge's radio show. He also served as the best man at Bubba's January 2007 wedding. On March 12, 2010, Hogan hosted his own radio show titled Hogan Uncensored, on Sirius Satellite Radio's Howard 101."}, {"text": "=== Merchandising ===The Wrestling Figure Checklist records Hogan as having 171 different action figures, produced between the 1980s and 2010s from numerous manufacturers and promotions."}, {"text": "== Video games ==Hogan provided his voice for the 2011 game Saints Row: The Third as Angel de la Muerte, a member of the Saints. In October 2011, he released a video game called Hulk Hogan's Main Event."}, {"text": "== Video games ==A likeness of him, as Rex Kwan-Do, is featured as a playable police officer in This Is The Police."}, {"text": "== Video games ==Hulk Hogan and Hollywood Hogan are featured in the following licensed wrestling video games:"}, {"text": "==== Belzer lawsuit ====On March 27, 1985, just days prior to the inaugural WrestleMania, Richard Belzer requested on his cable TV talk show Hot Properties that Hogan demonstrate one of his signature wrestling moves. After consistently refusing but being egged on by Belzer, Hogan put Belzer in a modified Guillotine choke, which caused Belzer to pass out. When Hogan released him, Belzer hit his head on the floor, sustaining a laceration to the scalp that required a brief hospitalization. Belzer sued Hogan for $5 million and later settled out of court. On October 20, 2006, on the Bubba the Love Sponge Show, it was claimed (with Hogan in the studio) that the settlement totaled $5 million, half from Hogan and half from Vince McMahon. During his June 23, 2008, appearance on Sirius Satellite Radio's The Howard Stern Show, Belzer suggested that the real settlement amount was actually closer to $400,000."}, {"text": "==== Testimony in McMahon trial ====In 1994, Hogan, having received immunity from prosecution, testified in the trial of Vince McMahon relating to shipments of steroids received by both parties from WWF physician George T. Zahorian. Under oath, Hogan admitted that he had used anabolic steroids since 1976 to gain size and weight, but that McMahon had neither sold him the drugs nor ordered him to take them. The evidence given by Hogan proved extremely costly to the government's case against McMahon. Due to this and jurisdictional issues, McMahon was found not guilty."}, {"text": "==== Gawker lawsuit ====In April 2012, a sex tape between Hogan and Heather Clem, the estranged wife of radio personality Bubba the Love Sponge, emerged online. On October 4, 2012, Gawker released a short clip of the video. In the video, Bubba can be heard saying that the couple can \"do their thing\" and he will be in his office. At the end of the video, he can also be heard telling Heather, \"If we ever need to retire, here is our ticket\". Hogan later told Howard Stern on his satellite radio show that, \"it was a bad choice and a very low point\" and \"I was with some friends and made a wrong choice. It has devastated me, I have never been this hurt\". On October 15, 2012, Hogan filed a lawsuit against Bubba and Heather Clem for invading his privacy. A settlement with Bubba was announced on October 29, 2012. Clem publicly apologized to Hogan. In December 2012, a federal court, the United States Court of Appeals for the Eleventh Circuit, found that Gawker's publication of the video snippet did not violate U.S. copyright law. Hogan then joined Gawker in the ongoing action against Heather Clem in state court in Florida, alleging invasion of privacy, negligent and intentional infliction of emotional distress and seeking $100 million in damages."}, {"text": "==== Gawker lawsuit ====On October 1, 2015, the New York Post reported that a Florida Judge granted Hogan access to Gawker's computer system for a forensic expert to search Gawker's computers and office."}, {"text": "==== Gawker lawsuit ====Hogan sued Gawker for $100 million for defamation, loss of privacy, and emotional pain, and on March 18, 2016, was awarded $115 million. Also, on August 11, 2016, a Florida judge gave Hogan control of the assets of A.J. Daulerio, former Gawker editor-in-chief, who was involved in the posting of Hogan's sex tape."}, {"text": "==== Gawker lawsuit ====Silicon Valley billionaire Peter Thiel helped Hogan to finance his lawsuit against Gawker Media."}, {"text": "==== Gawker lawsuit ====On November 2, 2016, Gawker reached a $31 million settlement with Hogan."}, {"text": "=== Family ===On December 18, 1983, Hogan married Linda Claridge. They have a daughter Brooke (born May 5, 1988) and a son Nick (born July 27, 1990). Hogan made his personal life the centerpiece of the television show Hogan Knows Best, which included his wife and two children."}, {"text": "=== Family ===According to an interview in the National Enquirer, Christiane Plante claimed that Hogan had an affair with her in 2007 while the Hogan family was shooting Hogan Knows Best. Plante was 33 years old at the time and had worked with Brooke Hogan on her 2006 album."}, {"text": "=== Family ===On November 20, 2007, Linda filed for divorce in Pinellas County, Florida. In November 2008, Linda claimed to the public that she made the decision to end her marriage after finding out about Hogan's affair. In his 2009 autobiography, Hogan acknowledged that Linda on numerous occasions suspected he was having infidelities whenever he developed friendships with other women, but denied allegations that he ever cheated on her. Hogan only retained around 30% of the couple's liquid assets totaling around $10 million in the divorce settlement. Hogan considered committing suicide after the divorce and credits Laila Ali, his co-star on American Gladiators, with preventing him from doing so."}, {"text": "=== Family ===Hulk Hogan began a relationship with Jennifer McDaniel in early 2008. The two were engaged in November 2009 and married on December 14, 2010, in Clearwater, Florida. On February 28, 2022, Hogan stated on Twitter that he and McDaniel divorced."}, {"text": "=== Family ===Hogan became engaged to yoga instructor Sky Daily in July 2023, proposing to her at actor Corin Nemec's wedding reception, and married on September 22, 2023."}, {"text": "=== Beliefs ===In 2007, he has spoken about his faith in his life saying, \"[I've] leaned on my religion. I was saved when I was 14. I accepted Christ as my savior. He died on the cross and paid for my sins ... I could have went the wrong way. I could have self-destructed, but I took the high road\"."}, {"text": "=== Beliefs ===On December 20, 2023, he was baptized at Indian Rocks Baptist Church in Largo, Florida."}, {"text": "=== Health ===Hogan has suffered numerous health problems, particularly with his back since retiring as a wrestler following the years of heavy weight-training and jolting as a wrestler."}, {"text": "=== Health ===In January 2013, Hogan filed a medical malpractice lawsuit against the Laser Spine Institute for $50 million, citing that the medical firm persuaded him to undergo a half-dozen \"unnecessary and ineffective\" spinal operations that worsened his back problems. He claimed that the six procedures he underwent over a period of 19 months only gave him short-term relief. After the procedures failed to cure his back problems, Hogan underwent traditional spinal fusion surgery in December 2010, which enabled him to return to his professional activities. In addition, the Laser Spine Institute used his name on their advertisements without his permission."}, {"text": "== Awards and honors ==Hogan was honored as the 2008 King of the Krewe of Bacchus, a New Orleans carnival organization. Hogan visited the Children's Hospital of New Orleans and rode in the parade where he threw doubloons with his likeness. Hogan received the honor in part because meeting Hogan is one of the most requested \"wishes\" of the terminally ill children benefited by the Make-A-Wish Foundation."}, {"text": "== Awards and honors ==Hogan was inducted in the Boys and Girls Club Alumni Hall of Fame on May 3, 2018."}, {"text": "== Championships and accomplishments ==International Professional Wrestling Hall of Fame"}, {"text": "== Championships and accomplishments ==Class of 2021"}, {"text": "== Championships and accomplishments ==New Japan Pro-Wrestling"}, {"text": "== Championships and accomplishments ==IWGP Heavyweight Championship (original version) (1 time)"}, {"text": "== Championships and accomplishments ==IWGP League Tournament (1983)"}, {"text": "== Championships and accomplishments ==MSG Tag League Tournament (1982, 1983) –  with Antonio Inoki"}, {"text": "== Championships and accomplishments ==Greatest 18 Club inductee"}, {"text": "== Championships and accomplishments ==Professional Wrestling Hall of Fame and Museum"}, {"text": "== Championships and accomplishments ==Class of 2003"}, {"text": "== Championships and accomplishments ==Pro Wrestling Illustrated"}, {"text": "== Championships and accomplishments ==Comeback of the Year (1994, 2002)"}, {"text": "== Championships and accomplishments ==Feud of the Year (1986) vs. Paul Orndorff"}, {"text": "== Championships and accomplishments ==Inspirational Wrestler of the Year (1983, 1999)"}, {"text": "== Championships and accomplishments ==Match of the Year (1985) with Mr. T vs. Roddy Piper and Paul Orndorff at WrestleMania I"}, {"text": "== Championships and accomplishments ==Match of the Year (1988) vs. André the Giant at The Main Event I"}, {"text": "== Championships and accomplishments ==Match of the Year (1990) vs. The Ultimate Warrior at WrestleMania VI"}, {"text": "== Championships and accomplishments ==Match of the Year (2002) vs. The Rock at WrestleMania X8"}, {"text": "== Championships and accomplishments ==Most Hated Wrestler of the Year (1996, 1998)"}, {"text": "== Championships and accomplishments ==Most Popular Wrestler of the Year (1985, 1989, 1990)"}, {"text": "== Championships and accomplishments ==Wrestler of the Year (1987, 1991, 1994)"}, {"text": "== Championships and accomplishments ==Ranked No. 1 of the top 500 singles wrestlers in the PWI 500 in 1991"}, {"text": "== Championships and accomplishments ==Ranked No. 1 of the top 500 singles wrestlers of the PWI Years in 2003"}, {"text": "== Championships and accomplishments ==Ranked No. 44 and No. 57 of the top 100 tag teams of the PWI Years with Antonio Inoki and Randy Savage in 2003"}, {"text": "== Championships and accomplishments ==Southeastern Championship Wrestling"}, {"text": "== Championships and accomplishments ==NWA Southeastern Heavyweight Championship (Northern Division) (1 time)"}, {"text": "== Championships and accomplishments ==NWA Southeastern Heavyweight Championship (Southern Division) (2 times)"}, {"text": "== Championships and accomplishments ==Tokyo Sports"}, {"text": "== Championships and accomplishments ==Best Foreigner Award (1983)"}, {"text": "== Championships and accomplishments ==Match of the Year (1991) vs. Genichiro Tenryu on December 12, 1991"}, {"text": "== Championships and accomplishments ==World Championship Wrestling"}, {"text": "== Championships and accomplishments ==WCW World Heavyweight Championship (6 times)"}, {"text": "== Championships and accomplishments ==World Wrestling Federation/World Wrestling Entertainment/WWE"}, {"text": "== Championships and accomplishments ==WWF/WWE Championship (6 times)"}, {"text": "== Championships and accomplishments ==WWE Tag Team Championship (1 time) –  with Edge"}, {"text": "== Championships and accomplishments ==Royal Rumble (1990, 1991)"}, {"text": "== Championships and accomplishments ==WWE Hall of Fame (2 times)"}, {"text": "== Championships and accomplishments ==Class of 2005 – individually "}, {"text": "== Championships and accomplishments ==Class of 2020 – as a member of the New World Order"}, {"text": "== Championships and accomplishments ==Wrestling Observer Newsletter"}, {"text": "== Championships and accomplishments ==Strongest Wrestler (1983)"}, {"text": "== Championships and accomplishments ==Best Babyface (1982–1991)"}, {"text": "== Championships and accomplishments ==Best Box Office Draw (1997)"}, {"text": "== Championships and accomplishments ==Best Gimmick (1996) as a member of New World Order"}, {"text": "== Championships and accomplishments ==Feud of the Year (1986) vs. Paul Orndorff"}, {"text": "== Championships and accomplishments ==Feud of the Year (1996) as a member of New World Order vs. World Championship Wrestling"}, {"text": "== Championships and accomplishments ==Most Charismatic (1985–1987, 1989–1991)"}, {"text": "== Championships and accomplishments ==Most Embarrassing Wrestler (1995, 1996, 1999, 2000)"}, {"text": "== Championships and accomplishments ==Most Obnoxious (1994, 1995)"}, {"text": "== Championships and accomplishments ==Most Overrated (1985, 1986, 1994–1998)"}, {"text": "== Championships and accomplishments ==Most Unimproved (1994, 1995)"}, {"text": "== Championships and accomplishments ==Readers' Least Favorite Wrestler (1985, 1986, 1991, 1994–1999)"}, {"text": "== Championships and accomplishments ==Worst Feud of the Year (1991) vs. Sgt. Slaughter"}, {"text": "== Championships and accomplishments ==Worst Feud of the Year (1995) vs. The Dungeon of Doom"}, {"text": "== Championships and accomplishments ==Worst Feud of the Year (1998) vs. The Warrior"}, {"text": "== Championships and accomplishments ==Worst Feud of the Year (2000) vs. Billy Kidman"}, {"text": "== Championships and accomplishments ==Worst on Interviews (1995)"}, {"text": "== Championships and accomplishments ==Worst Wrestler (1997)"}, {"text": "== Championships and accomplishments ==Worst Worked Match of the Year (1987) vs. André the Giant at WrestleMania III"}, {"text": "== Championships and accomplishments ==Worst Worked Match of the Year (1996) with Randy Savage vs. Arn Anderson, Meng, The Barbarian, Ric Flair, Kevin Sullivan, Z-Gangsta, and The Ultimate Solution in a Towers of Doom match at Uncensored"}, {"text": "== Championships and accomplishments ==Worst Worked Match of the Year (1997) vs. Roddy Piper at SuperBrawl VII"}, {"text": "== Championships and accomplishments ==Worst Worked Match of the Year (1998) vs. The Warrior at Halloween Havoc"}, {"text": "== Championships and accomplishments ==Wrestling Observer Newsletter Hall of Fame (Class of 1996)"}, {"text": "== Sources ==Bischoff, Eric (2006). Eric Bischoff: Controversy Creates Cash. Simon and Schuster. ISBN 978-1-4165-2729-9."}, {"text": "== Sources ==Hogan, Hulk (2002). Hollywood Hulk Hogan. Simon and Schuster. ISBN 978-0-7434-7556-3."}, {"text": "== Sources ==Hogan, Hulk; Dagostino, Mark (2009). My Life Outside the Ring. St. Martin's. ISBN 978-0-312-58889-2."}, {"text": "== Sources ==Loverro, Thom (2006). The Rise & Fall of ECW: Extreme Championship Wrestling. Simon and Schuster. ISBN 978-1-4165-1058-1."}, {"text": "== Sources ==Shields, Brian (2006). Main Event: WWE in the Raging 80s. Simon and Schuster. ISBN 978-1-4165-3257-6."}, {"text": "== External links ==Official website"}, {"text": "== External links ==Hulk Hogan on WWE.com"}, {"text": "== External links ==Hulk Hogan at IMDb"}, {"text": "== External links ==Hulk Hogan's profile at Cagematch.net , Wrestlingdata.com , Internet Wrestling Database "}, {"text": "== External links ==Professional Wrestling Hall of Fame profile"}, {"text": "== External links ==TNA Impact Wrestling profile (archived)"}]