[{"text": "Chan Kong-sang  (born 7 April 1954), known professionally as Jackie Chan, is a Hong Kong actor, director, writer, producer, martial artist, and stuntman known for his slapstick acrobatic fighting style, comic timing, and innovative stunts, which he typically performs himself. Before entering the film industry, he was one of the Seven Little Fortunes from the China Drama Academy at the Peking Opera School, where he studied acrobatics, martial arts, and acting. Chan has been acting since the 1960s, performing in more than 150 films. He is one of the most influential action film stars of all time.After appearing in many Hong Kong films as a stuntman, Chan's first major breakthrough was the 1978 kung fu action comedy film Snake in the Eagle's Shadow. He then starred in similar kung fu action comedy films such as 1978's Drunken Master and 1980's The Young Master. In 1979, he made his directorial debut with The Fearless Hyena, which was a box office success. 1983's Project A saw the official formation of the Jackie Chan Stunt Team and established Chan's signature style of elaborate, dangerous stunts combined with martial arts and slapstick humor, a style he further developed in a more modern setting with 1984's Wheels on Meals and 1985's Police Story. Rumble in the Bronx (1995), which had a successful worldwide theatrical run, brought Chan into the North American mainstream, leading to a successful Hollywood career with the Rush Hour and Shanghai series. In 2010, Chan appeared in his first dramatic role in an American film, The Karate Kid.Chan is one of the most recognisable and influential film personalities in the world, with a widespread global following in both the Eastern and Western hemispheres. He has received fame stars on the Hong Kong Avenue of Stars and the Hollywood Walk of Fame, as well as an honorary Academy Award for his \"extraordinary achievements\" in film. Chan has been referenced in various pop songs, cartoons, films, and video games. He is an operatically trained vocalist and is also a Cantopop and Mandopop star, having released a number of music albums and sung many of the theme songs for the films in which he has starred. He is also a globally known philanthropist and has been named one of the top 10 most charitable celebrities by Forbes magazine. In 2004, film scholar Andrew Willis stated that Chan was perhaps the \"most recognised film star in the world.\" In 2015, Forbes estimated his net worth to be $350 million, and as of 2016, he was the second-highest-paid actor in the world.Chan's views on Hong Kong politics have gradually shifted from a pro-democratic stance in the 1990s to a pro-Beijing stance since the 2010s. Since 2013, Chan has been a pro-Chinese Communist Party (CCP) politician, having served two terms as a delegate to the Chinese People's Political Consultative Conference, and, in 2021, expressing his desire to join the CCP."}, {"text": "== Early life ==Chan was born on 7 April 1954 in British Hong Kong as Chan Kong-sang to Charles and Lee-Lee Chan, political refugees from the Chinese Civil War. In circa 1937, Chan's father, originally named  Fang Daolong, briefly worked as a secret agent for Lieutenant General Dai Li, the chief spy in Kuomintang-ruled China. For fear of being arrested by the communist government, Chan's father fled to British Hong Kong in the 1940s and changed his surname from Fang to Chan. Chan was his wife Chan Lee-lee's surname. Chan discovered his father's identity and changed his Chinese name to Fang Shilong (房仕龍) in the late 1990s, the name he would have been named according to his kin's genealogy book.Chan spent his formative years within the grounds of the French consul's residence in the Victoria Peak, British Hong Kong, as his father worked as a cook there. Chan attended the Nah-Hwa Primary School on Hong Kong Island, where he failed his first year, after which his parents withdrew him from the school. In 1960, his father emigrated to Canberra, Australia to work as the head cook for the American embassy, and Chan was sent to the China Drama Academy, a Peking Opera School run by Master Yu Jim-yuen. Chan trained rigorously for the next decade, excelling in martial arts and acrobatics. He eventually became part of the Seven Little Fortunes, a performance group made up of the school's best students, gaining the stage name Yuen Lo (元樓) in homage to his master. Chan became close friends with fellow group members Sammo Hung and Yuen Biao, and the three of them later became known as the Three Brothers or Three Dragons. After entering the film industry, Chan along with Sammo Hung got the opportunity to train in hapkido under the grand master Jin Pal Kim, and Chan eventually attained a black belt. As a martial artist, Chan is also skilled in multiple forms of Kung-fu. He is also known to have trained in other martial art forms such as Karate, Judo, Taekwondo, and Jeet Kun Do.Chan joined his parents in Canberra, Australia in 1971, where he briefly attended Dickson College and worked as a construction worker. A fellow builder named Jack took Chan under his wing, thus earning Chan the nickname of \"Little Jack,\" later shortened to \"Jackie\", which has stuck with him ever since."}, {"text": "=== 1962–1975: Early small appearances ===He began his film career by appearing in small roles at the age of five as a child actor. At age eight, he appeared with some of his fellow \"Little Fortunes\" in the film Big and Little Wong Tin Bar (1962) with Li Li-Hua playing his mother. The following year, the young actor appeared in extras of Yen Chun's 1964 film Liang Shan Po and Chu Ying Tai and had a small role in King Hu's 1966 film Come Drink with Me. In 1971, after an appearance as an extra in another kung fu film, A Touch of Zen, Chan was signed to Chu Mu's Great Earth Film Company.Chan appeared in the Bruce Lee film Fist of Fury (1972), both as an extra and as a stunt double for the Japanese villain Hiroshi Suzuki (portrayed by Riki Hashimoto), particularly during the final fight scene where Lee kicks him and he flies through the air. Chan again appeared in another Bruce Lee film, Enter the Dragon (1973), as a minor henchman who gets killed by Lee's character. Sammo Hung helped Chan get minor roles in both of the Bruce Lee films. Chan also worked as a martial arts choreographer for John Woo's The Young Dragons (1974)."}, {"text": "=== 1976–1980: Start-up leading roles ===In 1976, Jackie Chan received a telegram from Willie Chan, a film producer in the Hong Kong film industry who had been impressed with Jackie's stunt choreography work. Willie Chan offered him an acting role in a film directed by Lo Wei. Lo saw Chan's performance in the John Woo film Hand of Death (1976) and planned to model him after Bruce Lee with the film New Fist of Fury. His stage name was changed to 成龍 (literally \"becoming the dragon\", Sing4 Lung4 in Jyutping or rarely as Cheng Long in pinyin), to emphasise his similarity to Bruce Lee, whose stage name meant \"Lee the Little Dragon\" in Chinese. (Note that \"dragon\" in Lee's name referred to Lee's birth year being the Dragon zodiac, not the Chinese dragon.) The film was unsuccessful because Chan was not accustomed to Lee's martial arts style. Despite the film's failure, Lo Wei continued producing films with similar themes, but with little improvement at the box office.Chan's first major breakthrough was the 1978 film Snake in the Eagle's Shadow, shot while he was loaned to Seasonal Film Corporation under a two-picture deal. Director Yuen Woo-ping allowed Chan complete freedom over his stunt work. The film established the comedic kung fu genre, and proved refreshing to the Hong Kong audience. The same year, Chan then starred in Drunken Master, which finally propelled him to mainstream success.Upon Chan's return to Lo Wei's studio, Lo tried to replicate the comedic approach of Drunken Master, producing and also showed new features at the time with Jackie as the Stunt Director Half a Loaf of Kung Fu and Spiritual Kung Fu. He also gave Chan the opportunity to make his directorial debut in The Fearless Hyena. When Willie Chan left the company, he advised Jackie to decide for himself whether or not to stay with Lo Wei. During the shooting of Fearless Hyena Part II, Chan broke his contract and joined Golden Harvest, prompting Lo to blackmail Chan with triads, blaming Willie for his star's departure. The dispute was resolved with the help of fellow actor and director Jimmy Wang Yu, allowing Chan to stay with Golden Harvest."}, {"text": "=== 1980–1987: Commercial success in the action comedy genre ===Willie Chan became Jackie's personal manager and firm friend, and remained so for over 30 years. He was instrumental in launching Chan's international career, beginning with his first forays into the American film industry in the 1980s. His first Hollywood film was The Big Brawl in 1980. Chan then played a minor role in the 1981 film The Cannonball Run, which grossed over US$100 million worldwide. Despite being largely ignored by North American audiences in favour of established American actors such as Burt Reynolds, Chan was impressed by the outtakes shown at the closing credits, inspiring him to include the same device in his future films."}, {"text": "=== 1980–1987: Commercial success in the action comedy genre ===After the commercial failure of The Protector in 1985, Chan temporarily abandoned his attempts to break into the US market, returning his focus to Hong Kong films.Back in Hong Kong, Chan's films began to reach a larger audience in East Asia, with early successes in the lucrative Japanese market including Drunken Master, The Young Master (1980) and Dragon Lord (1982). The Young Master went on to beat previous box office records set by Bruce Lee and established Chan as Hong Kong cinema's top star. With Dragon Lord, he began experimenting with elaborate stunt action sequences, including the final fight scene where he performs various stunts, including one where he does a back flip off a loft and falls to the lower ground.Chan produced a number of action comedy films with his opera school friends Sammo Hung and Yuen Biao. The three co-starred together for the first time in 1983 in Project A, which introduced a dangerous stunt-driven style of martial arts that won it the Best Action Design Award at the third annual Hong Kong Film Awards. Over the following two years, the \"Three Brothers\" appeared in Wheels on Meals and the original Lucky Stars trilogy. In 1985, Chan made the first Police Story film, a crime action film in which Chan performed a number of dangerous stunts. It won Best Film at the 1986 Hong Kong Film Awards. In 1986, Chan played \"Asian Hawk,\" an Indiana Jones-esque character, in the film Armour of God. The film was Chan's biggest domestic box office success up to that point, grossing over HK$35 million."}, {"text": "=== 1988–1998: Acclaimed film sequels and Hollywood breakthrough ===In 1988, Chan starred alongside Sammo Hung and Yuen Biao for the last time to date in the film Dragons Forever. Hung co-directed with Corey Yuen, and the villain in the film was played by Yuen Wah, both of whom were fellow graduates of the China Drama Academy.In the late 1980s and early 1990s, Chan starred in a number of successful sequels beginning with Project A Part II and Police Story 2, which won the award for Best Action Choreography at the 1989 Hong Kong Film Awards. This was followed by Armour of God II: Operation Condor, and Police Story 3: Super Cop, for which Chan won the Best Actor Award at the 1993 Golden Horse Film Festival. In 1994, Chan reprised his role as Wong Fei-hung in Drunken Master II, which was listed in Time Magazine's All-Time 100 Movies. Another sequel, Police Story 4: First Strike, brought more awards and domestic box office success for Chan, but did not fare as well in foreign markets.By the mid-1990s, he was the most popular action movie star in Asia and Europe. Up until January 1995, his films had grossed over HK$500 million (US$70 million) in Hong Kong and ¥39 billion (US$415 million) in Japan, while having sold over 33 million box office admissions in France, Germany, Italy and Spain up until then. Despite his international success, he was not very successful in North America, where he had only two wide releases as a leading actor, The Big Brawl and The Protector, grossing US$9.51 million (US$32 million adjusted for inflation). Despite this, there was a thriving North American home video market for Chan's Hong Kong films by the mid-1990s.Chan rekindled his Hollywood ambitions in the 1990s, but refused early offers to play villains in Hollywood films to avoid being typecast in future roles. For example, Sylvester Stallone offered him the role of Simon Phoenix, a criminal in the futuristic film Demolition Man. Chan declined and the role was taken by Wesley Snipes.Chan finally succeeded in establishing a foothold in the North American market in 1995 with a worldwide release of Rumble in the Bronx, attaining a cult following in the United States that was rare for Hong Kong movie stars. The success of Rumble in the Bronx led to a 1996 release of Police Story 3: Super Cop in the United States under the title Supercop, which grossed a total of US$16,270,600. Chan's first huge blockbuster success came when he co-starred with Chris Tucker in the 1998 buddy cop action comedy Rush Hour, grossing US$130 million in the United States alone. This film made him a Hollywood star, after which he wrote his autobiography in collaboration with Jeff Yang entitled I Am Jackie Chan."}, {"text": "=== 1999–2007: Fame in Hollywood and dramatisation ===In 1998, Chan released his final film for Golden Harvest, Who Am I?. After leaving Golden Harvest in 1999, he produced and starred alongside Shu Qi in Gorgeous, a romantic comedy that focused on personal relationships and featured only a few martial arts sequences. Although Chan had left Golden Harvest in 1999, the company continued to produce and distribute for two of his films, Gorgeous (1999) and The Accidental Spy (2001). Chan then helped create a PlayStation game in 2000 called Jackie Chan Stuntmaster, to which he lent his voice and performed the motion capture. He continued his Hollywood success in 2000 when he teamed up with Owen Wilson in the Western action comedy Shanghai Noon. A sequel, Shanghai Knights followed in 2003 and also featured his first on-screen fight scene with Donnie Yen. He reunited with Chris Tucker for Rush Hour 2 (2001), which was an even bigger success than the original, grossing $347 million worldwide. Chan experimented with the use of special effects and wirework for the fight scenes in his next two Hollywood films, The Tuxedo (2002) and The Medallion (2003), which were not as successful critically or commercially. In 2004, he teamed up with Steve Coogan in Around the World in 80 Days, loosely based on Jules Verne's novel of the same name. In 2004, film scholar Andrew Willis stated that Chan was \"perhaps\" the \"most recognised star in the world\".Despite the success of the Rush Hour and Shanghai Noon films, Chan became frustrated with Hollywood over the limited range of roles and lack of control over the filmmaking process. In response to Golden Harvest's withdrawal from the film industry in 2003, Chan started his own film production company, JCE Movies Limited (Jackie Chan Emperor Movies Limited) in association with Emperor Multimedia Group (EMG). His films have since featured an increasing number of dramatic scenes while continuing to succeed at the box office; examples include New Police Story (2004), The Myth (2005) and the hit film Rob-B-Hood (2006).Chan's next release was the third instalment in the Rush Hour film series directed by Brett Ratner: Rush Hour 3 in August 2007. It grossed US$255 million. However, it was a disappointment in Hong Kong, grossing only HK$3.5 million during its opening weekend."}, {"text": "=== 2008–present: New experiments and change in acting style ===Filming of The Forbidden Kingdom, Chan's first on-screen collaboration with fellow Chinese actor Jet Li, was completed on 24 August 2007 and the movie was released in April 2008. The movie featured heavy use of effects and wires. Chan voiced Master Monkey in Kung Fu Panda (released in June 2008), appearing with Jack Black, Dustin Hoffman, and Angelina Jolie. In addition, he has assisted Anthony Szeto in an advisory capacity for the writer-director's film Wushu, released on 1 May 2008. The film stars Sammo Hung and Wang Wenjie as father and son.In November 2007, Chan began filming Shinjuku Incident, a dramatic role featuring no martial arts sequences with director Derek Yee, which sees Chan take on the role of a Chinese immigrant in Japan. The film was released on 2 April 2009. According to his blog, Chan discussed his wishes to direct a film after completing Shinjuku Incident, something he has not done for a number of years. The film was expected to be the third in the Armour of God series, and had a working title of Armour of God III: Chinese Zodiac. The film was released on 12 December 2012. Because the Screen Actors Guild did not go on strike, Chan started shooting his next Hollywood movie The Spy Next Door at the end of October in New Mexico. In The Spy Next Door, Chan plays an undercover agent whose cover is blown when he looks after the children of his girlfriend. In Little Big Soldier, Chan stars alongside Leehom Wang as a soldier in the Warring States period in China. He is the lone survivor of his army and must bring a captured enemy soldier Leehom Wang to the capital of his province."}, {"text": "=== 2008–present: New experiments and change in acting style ===In 2010, he starred with Jaden Smith in The Karate Kid, a remake of the 1984 original. This was Chan's first dramatic American film. He plays Mr. Han, a kung fu master and maintenance man who teaches Jaden Smith's character kung fu so he can defend himself from school bullies. His role in The Karate Kid won him the Favorite Buttkicker award at the Nickelodeon Kids' Choice Awards in 2011. In Chan's next movie, Shaolin, he plays a supporting role as a cook of a temple instead of one of the major characters."}, {"text": "=== 2008–present: New experiments and change in acting style ===His 100th movie, 1911, was released on 26 September 2011. Chan was the co-director, executive producer, and lead star of the movie. While Chan has directed over ten films over his career, this was his first directorial work since Who Am I? in 1998. 1911 premiered in North America on 14 October.While at the 2012 Cannes Film Festival, Chan announced that he was retiring from action films citing that he was getting too old for the genre. He later clarified that he would not be completely retiring from action films, but would be performing fewer stunts and taking care of his body more.In 2013, Chan starred in Police Story 2013, a reboot of the Police Story franchise directed by Ding Sheng, and it was released in China at the end of 2013. Chan's next film Dragon Blade was released in early 2015 and co-starred Hollywood actors John Cusack and Adrien Brody. In 2015, Chan was awarded the title of \"Datuk\" by Malaysia as he helped Malaysia to boost its tourism, especially in Kuala Lumpur where he previously shot his films. In early 2017, Chan's new film titled Kung Fu Yoga, a Chinese-Indian project, which also starred Disha Patani, Sonu Sood and Amyra Dastur, was released. The film reunited Chan with director Stanley Tong, who directed a number of Chan's films in the 1990s. Upon release, the film was a huge success at the box office, and became the 5th highest-grossing film in China, one month after its release. In 2016, he teamed up with Johnny Knoxville and starred in his own production Skiptrace."}, {"text": "=== 2008–present: New experiments and change in acting style ===Chan starred in the 2016 action-comedy Railroad Tigers and the 2017 action-thriller The Foreigner, an Anglo-Chinese production. He also starred in the 2017 science fiction film Bleeding Steel. He then teamed up with John Cena and starred in the 2023 Chinese-American co-production Hidden Strike.His films had collectively grossed HK$1.14 billion (US$147 million) at the Hong Kong box office up until 2010, over US$72 million in South Korea between 1991 and 2010, and ¥48.4 billion (US$607 million) in Japan up until 2012. In Europe, his films collectively sold about 84 million tickets between 1973 and 2010.  As of 2021, his films have grossed over CN¥14 billion (US$2.17 billion) in China, and US$1.84 billion (more than US$2.44 billion adjusted for inflation) in the United States and Canada. As of 2018, 48 of his films have collectively grossed more than US$5 billion at the worldwide box office."}, {"text": "=== Music ===Chan had vocal lessons while at the Peking Opera School in his childhood. He began producing records professionally in the 1980s and has gone on to become a successful singer in Hong Kong and Asia. He has released 20 albums since 1984 and has performed vocals in Cantonese, Mandarin, Japanese, Taiwanese and English. He often sings the theme songs of his films, which play over the closing credits. Chan's first musical recording was \"Kung Fu Fighting Man\", the theme song played over the closing credits of The Young Master (1980). At least 10 of these recordings have been released on soundtrack albums for the films. His Cantonese song \"Story of a Hero\" (英雄故事) (theme song of Police Story) was selected by the Royal Hong Kong Police and incorporated into their recruitment advertisement in 1994.Chan voiced the character of Shang in the Chinese release of the Walt Disney animated feature Mulan (1998). He also performed the song \"I'll Make a Man Out of You\", for the film's soundtrack. For the US release, the speaking voice was performed by B.D. Wong and the singing voice was done by Donny Osmond. He also collaborated with Ani DiFranco on \"Unforgettable\".In 2007, Chan recorded and released \"We Are Ready\", the official one-year countdown song to the 2008 Summer Olympics which he performed at a ceremony marking the one-year countdown to the 2008 Summer Paralympics. Chan also released one of the two official Olympics albums, Official Album for the Beijing 2008 Olympic Games – Jackie Chan's Version, which featured a number of special guest appearances. Chan performed \"Hard to Say Goodbye\" along with Andy Lau, Liu Huan and Wakin (Emil) Chau, at the 2008 Summer Olympics closing ceremony."}, {"text": "=== Academia ===Chan received his honorary Doctorate of Social Science degree in 1996 from the Hong Kong Baptist University. In 2009, he received another honorary doctorate from the University of Cambodia, and has also been awarded an honorary professorship by the Savannah College of Art and Design in Hong Kong in 2008.Chan is currently a faculty member of the School of Hotel and Tourism Management at the Hong Kong Polytechnic University, where he teaches the subject of tourism management. As of 2015, he also serves as the Dean of the Jackie Chan Film and Television Academy under the Wuhan Institute of Design and Sciences."}, {"text": "== Personal life ==In 1982, Chan married Joan Lin, a Taiwanese actress. Their son, singer and actor Jaycee Chan, was born that same year. Chan had an extra-marital affair with Elaine Ng Yi-Lei and has a daughter Etta Ng Chok Lam by her, born on 18 January 1999. It turned into a scandal within the media. Although he reportedly gave Elaine HK$70,000 each month for her living expenses and HK$600,000 when she moved to Shanghai, the transactions were later claimed to be nonexistent by her lawyer. Despite regretting the results of the affair, Chan said he had \"only committed a fault that many men in the world commit\". During the incident, Elaine stated she would take care of her daughter without Chan.Chan speaks Cantonese, Mandarin, English, and American Sign Language and also speaks some German, Korean, Japanese, Spanish, and Thai. Chan is an avid football fan and supports the Hong Kong national football team, the England national football team, and Manchester City.He is a fan of the Italian duo Bud Spencer and Terence Hill, from whom he was inspired for his movies."}, {"text": "== Stunts and screen persona ==Chan has performed most of his own stunts throughout his film career, which are choreographed by the Jackie Chan Stunt Team. The team was established in 1983, and Chan has used them in all his subsequent films to make choreographing easier, given his understanding of each member's abilities. Chan and his team undertake many of the stunts performed by other characters in his films, shooting the scenes so that their faces are obscured.In the early 1980s, Jackie Chan began experimenting with elaborate stunt action sequences in films such as The Young Master (1980) and especially Dragon Lord (1982), which featured a pyramid fight scene that holds the record for the most takes required for a single scene, with 2900 takes, and the final fight scene where he performs various stunts, including one where he does a backflip off a loft and falls to the lower ground. In 1983, Project A saw the official formation of the Jackie Chan Stunt Team and added elaborate, dangerous stunts to the fights and typical slapstick humor; at one point, Chan falls from the top of a clock tower through a series of fabric canopies. Critics have compared his comedic stunts in Project A to Buster Keaton, who was also known to perform his own stunts, although Chan himself had not watched Keaton's films until years after Project A released; according to Chan, Project A was an evolution of the action stunt work he had been doing in earlier kung fu comedy films since The Young Master.Police Story (1985) contained many large-scale action scenes, including an opening sequence featuring a car chase through a shanty town, Chan stopping a double-decker bus with his service revolver and a climactic fight scene in a shopping mall. This final scene earned the film the nickname \"Glass Story\" by the crew, due to the huge number of panes of sugar glass that were broken. During a stunt in this last scene, in which Chan slides down a pole from several stories up, the lights covering the pole had heated it considerably, resulting in Chan suffering second-degree burns, particularly to his hands, as well as a back injury and dislocation of his pelvis upon landing. Chan performed similarly elaborate stunts in numerous other films, such as several Police Story sequels, Project A Part II, the Armor of God series, Dragons Forever, Drunken Master II, Rumble in the Bronx, and the Rush Hour series, among others."}, {"text": "== Stunts and screen persona ==The dangerous nature of his stunts makes it difficult to get insurance, especially in the United States where his stunt work is contractually limited. Chan holds the Guinness World Record for \"Most Stunts by a Living Actor\", which emphasises that \"no insurance company will underwrite Chan's productions in which he performs all his own stunts\".Chan has been injured frequently when attempting stunts; many of them have been shown as outtakes or as bloopers during the closing credits of his films. He came closest to death filming Armour of God when he fell from a tree and fractured his skull. Over the years, he has dislocated his pelvis and also broken numerous parts of his body, including his fingers, toes, nose, both cheekbones, hips, sternum, neck, ankle, and ribs. Promotional materials for Rumble in the Bronx emphasised that he performed all of the stunts, and one version of the movie poster even diagrammed his many injuries."}, {"text": "== Stunts and screen persona ==Chan created his screen persona as a response to the late Bruce Lee and the numerous imitators who appeared before and after Lee's death. Lee's characters were typically stern, morally upright heroes. In contrast, Chan plays well-meaning, slightly foolish regular men, often at the mercy of their friends, girlfriends, or families, who always triumph in the end despite the odds. Additionally, he has stated that he deliberately styles his movement to be the opposite of Lee's: where Lee held his arms wide, Chan holds his tight to the body; where Lee was loose and flowing, Chan is tight and choppy. Despite the success of the Rush Hour series, Chan has stated that he is not a fan of it since he neither appreciates the action scenes in the movie nor understands American humor.American filmmaker Quentin Tarantino classified Chan's style of acting and filmmaking as physical comedy, and considered him one of the greatest in the genre. British filmmaker Edgar Wright describes Jackie Chan as an \"expressive\" visual performer with an everyman persona. He notes that, in contrast to other action heroes (such as Bruce Lee, Sylvester Stallone, Clint Eastwood or Arnold Schwarzenegger), Chan presents himself as a loveable \"goofball\" underdog who overcomes the odds with almost \"superhuman\" acrobatic stunts and fighting abilities.In the 2000s, the ageing Chan grew tired of being typecast as an action hero, prompting him to act with more emotion in his latest films. In New Police Story, he portrayed a character suffering from alcoholism and mourning his murdered colleagues. To further shed the image of a \"nice guy\", Chan played an antihero for the first time in Rob-B-Hood starring as Thongs, a burglar with gambling problems. Chan plays a low-level gangster in 2009's Shinjuku Incident, a serious drama set in Tokyo about unsavory characters."}, {"text": "== Legacy ==Chan has received global recognition for his film acting and stunt work. His accolades include the Innovator Award from the American Choreography Awards and a lifetime achievement award from the Taurus World Stunt Awards. He has stars on the Hollywood Walk of Fame and the Hong Kong Avenue of Stars. In addition, Chan has also been honoured by placing his hand and footprints at Grauman's Chinese Theatre. Despite considerable box office success in Asia, Chan's Hollywood films have been criticised with regard to their action choreography. Reviewers of Rush Hour 2, The Tuxedo, and Shanghai Knights noted the toning down of Chan's fighting scenes, citing less intensity compared to his earlier films. The comedic value of his films is questioned; some critics stating that they can be childish at times. Chan was awarded the Order of the British Empire (MBE) in 1989 and the Silver Bauhinia Star (SBS) in 1999.When American filmmaker Quentin Tarantino presented Chan with the Lifetime Achievement Award at the 1995 MTV Movie Awards, Tarantino described Chan as \"one of the best filmmakers the world has ever known\" and \"one of the greatest physical comedians since sound came into film.\""}, {"text": "==== Film industry ====Numerous films from around the world have taken inspiration from Jackie Chan's fight sequences and action choreography. Examples include The Matrix and Kill Bill (both choreographed by his former colleague Yuen Woo-ping), the Kung Fu Panda series (where he also voiced Monkey), The Raid: Redemption (2011) from Indonesian cinema, Kingsman: The Secret Service (2014), the John Wick series, Atomic Blonde (2017), Marvel Cinematic Universe films such as Black Panther (2018) and Shang-Chi and the Legend of the Ten Rings (2021), the DC Extended Universe film Birds of Prey (2020), and the Netflix film Extraction (2020). British filmmaker Edgar Wright cited Chan as an influence and said that, \"No matter how many people try and rip off Jackie Chan movies, there's something which they can't rip off which is Jackie Chan himself.\" Tom Holland also cited Chan as an influence on several action scenes in Uncharted (2022), noting Chan's use of his surroundings to fight people in unique ways."}, {"text": "==== In popular culture and media ====Chan has been the subject of Ash's song \"Kung Fu\", Heavy Vegetable's \"Jackie Chan Is a Punk Rocker\", Leehom Wang's \"Long Live Chinese People\", as well as in \"Jackie Chan\" by Frank Chickens, and television shows Tim and Eric Awesome Show, Great Job!, Celebrity Deathmatch and Family Guy.He has been cited as the inspiration for manga and anime such as Dragon Ball, which was particularly inspired by Drunken Master, and the fight scenes in Jackie Chan movies; the show pays homage with a character by the alias \"Jackie Chun\". Toriyama said he had a young Jackie Chan in mind for a live-action Goku, stating that \"nobody could play Goku but him.\" Chan himself was a fan of the series, and had expressed some interest in adapting Dragon Ball into a live-action film, but said it would require \"a lot of amazing special effects and an enormous budget.\"The parkour movement was also inspired by Chan.A number of video games have been based on, or featured, Jackie Chan. His film Wheels on Meals (called Spartan X in Japan) spawned the hit 1984 beat 'em up arcade game Spartan X (released as Kung-Fu Master in Western markets), and its sequel Spartan X 2 for the Nintendo Famicom console. Spartan X laid the foundations for the beat 'em up genre, and inspired other games including Super Mario Bros. (1985) and Street Fighter (1987). Jackie Chan's Action Kung Fu was released in 1990 for the PC-Engine and Nintendo Entertainment System. In 1995, Chan was featured in the arcade game Jackie Chan The Kung-Fu Master. A series of Japanese video games were released on the MSX computer by Pony, based on several of Chan's films (Project A, Project A 2, Police Story, The Protector and Wheels on Meals). Other games based on Jackie Chan include Jackie Chan Stuntmaster, Jackie Chan Adventures and Jackie Chan J-Mat Fitness. Chan also inspired video game characters such as Lei Wulong in Tekken and the fighting-type Pokémon Hitmonchan.On 25 June 2013, Chan responded to a hoax Facebook page created a few days earlier that alleged he had died. He said that several people contacted him to congratulate him on his recent engagement, and soon thereafter contacted him again to ask if he was still alive. He posted a Facebook message, commenting: \"If I died, I would probably tell the world!\"In 2015, a made-up word inspired by Chan's description of his hair during an interview for a commercial, duang, became an internet viral meme particularly in China. The Chinese character for the word is a composite of two characters of Chan's name.A wax figure of Jackie Chan was revealed at Madame Tussauds New York in 2020."}, {"text": "==== Public image ====Jackie Chan has a sponsorship deal with Mitsubishi Motors that has resulted in the appearance of Mitsubishi cars in a number of his films. Furthermore, Mitsubishi launched a limited series of Evolution cars personally customised by Chan.Chan was also the primary catalyst for the creation of review aggregation website Rotten Tomatoes, whose founder Senh Duong was his fan and created the website after collecting all the reviews of Chan's Hong Kong action movies as they were being released in the United States. In anticipation for Rush Hour, Chan's first major Hollywood crossover, he coded the website in two weeks and the site went live shortly before the release of Rush Hour.Chan says he has always wanted to be a role model to children, and has remained popular with them due to his good-natured acting style. He has generally refused to play villains and has been very restrained in using swear words in his films – he persuaded the director of Rush Hour to take \"fuck\" out of the script. Chan's greatest regret in life is not having received a proper education, inspiring him to fund educational institutions around the world. He funded the construction of the Jackie Chan Science Centre at the Australian National University and the establishment of schools in poor regions of China.Chan is a spokesperson for the Government of Hong Kong, appearing in public service announcements. In a Clean Hong Kong commercial, he urged the people of Hong Kong to be more considerate with regards to littering, a problem that has been widespread for decades. Furthermore, in an advertisement promoting nationalism, he gave a short explanation of the March of the Volunteers, the national anthem of the People's Republic of China. When Hong Kong Disneyland opened in 2005, Chan participated in the opening ceremony. In the United States, Chan appeared alongside Arnold Schwarzenegger in a government advert to combat copyright infringement and made another public service announcement with Los Angeles County Sheriff Lee Baca to encourage people, especially Asian people, to join the Los Angeles County Sheriff's Department."}, {"text": "==== Cultural honors and depictions ====Construction has begun on a Jackie Chan museum in Shanghai. In November 2013, a statue of Chan was unveiled in front of what is now known as the JC Film Gallery, which opened in the spring of 2014.On 1 February 2015, Chan was awarded the honour of Knight Commander of the Order of the Territorial Crown by the Yang di-Pertuan Agong of Malaysia Tuanku Abdul Halim in conjunction with the country's Federal Territory Day. It carries the title of Datuk in Malaysia."}, {"text": "== Political views and controversy ==After the 1997 handover of Hong Kong from the United Kingdom to China, Chan's politics gradually shifted from a pro-democratic to a pro-Beijing stance. In 1989, Chan performed at the Concert for Democracy in China in support of democratic movement during the 1989 Tiananmen Square protests; by 2021, in contrast, he expressed his desire to join the Chinese Communist Party. According to Chan, he wanted to be a Party member but his moral failings make him unqualified. Chan stated that he can \"see the greatness of the CCP\" and his view that \"[i]t will deliver what it says, and what it promises in less than 100 years, but only a few decades.\"During a news conference in Shanghai on 28 March 2004, Chan referred to the recently concluded Republic of China 2004 presidential election in Taiwan, in which Democratic Progressive Party candidates Chen Shui-bian and Annette Lu were re-elected as president and vice-president, as \"the biggest joke in the world\". A Taiwanese legislator and senior member of the DPP, Parris Chang, called for the government of Taiwan to ban Around the World in 80 Days. Police and security personnel separated Chan from scores of protesters shouting \"Jackie Chan, get out\" when he arrived at Taipei airport in June 2008.Referring to his participation in the torch relay for the 2008 Summer Olympics in Beijing, Chan spoke out against demonstrators who disrupted the relay several times attempting to draw attention to a wide-ranging number of grievances against the Chinese government. He warned that \"publicity seekers\" planning to stop him from carrying the Olympic Torch \"not get anywhere near\" him. Chan also argued that the Olympics coverage that year would \"provide another way for us to tell the world about Chinese culture.\""}, {"text": "== Political views and controversy ==In 2009, Chan was named an \"anti-drug ambassador\" by the Chinese government, actively taking part in anti-drug campaigns and supporting President Hu Jintao's declaration that illegal drugs should be eradicated, and their users punished severely. In 2014, when his own son Jaycee was arrested for cannabis use, he said that he was \"angry\", \"shocked\", \"heartbroken\" and \"ashamed\" of his son. He also remarked, \"I hope all young people will learn a lesson from Jaycee and stay far from the harm of drugs. I say to Jaycee that you have to accept the consequences when you do something wrong.\"On 18 April 2009, during a panel discussion at the annual Boao Forum for Asia, he questioned whether or not broad freedom is a good thing. Noting the strong tensions in Hong Kong and Taiwan, he said, \"I'm gradually beginning to feel that we Chinese need to be controlled. If we're not being controlled, we'll just do what we want.\" Chan's comments prompted angry responses from several prominent figures in Taiwan and Hong Kong. A spokesman later said Chan was referring to freedom in the entertainment industry, rather than in Chinese society at large.In December 2012, Chan caused outrage when he criticised Hong Kong as a \"city of protest\", suggesting that demonstrators' rights in Hong Kong should be limited. The same month, in an interview with Phoenix TV, Chan stated that the United States was the \"most corrupt\" country in the world, which in turn angered parts of the online community. Other articles situated Chan's comments in the context of his career and life in the United States, including his \"embrace of the American film market\" and his seeking asylum in the United States from Hong Kong triads.From 2013 to 2023, Chan served two terms as a member of the Chinese People's Political Consultative Conference, representing the \"Literature and Arts\" sector.In April 2016, Chan was named in the Panama Papers. While Chan was not accused of engaging in illegal activity per se, he was listed as having up to six different offshore accounts, likely for the purposes of serving as tax shelters.In 2019, Chan criticised Hong Kong anti-extradition bill protests, saying that the \"'Five-starred Red Flag' is respected everywhere around the world.\" He also supports the National People's Congress decision on Hong Kong national security legislation."}, {"text": "== Entrepreneurship and philanthropy ==In addition to his film production and distribution company, JCE Movies Limited, Jackie Chan owns or co-owns the production companies JC Group China, Jackie & Willie Productions (with Willie Chan) and Jackie & JJ Productions. Chan has also put his name to Jackie Chan Theater International, a cinema chain in China, co-run by Hong Kong company Sparkle Roll Group Ltd. The first—Jackie Chan-Yaolai International Cinema—opened in February 2010, and is claimed to be the largest cinema complex in China, with 17 screens and 3,500 seats. Chan expressed his hopes that the size of the venue would afford young, non-commercial directors the opportunity to have their films screened. Fifteen further cinemas in the chain were planned for 2010, throughout Beijing, Shanghai and Guangzhou, with a potential total of 65 cinemas throughout the country proposed.In 2004, Chan launched his own line of clothing, which bears a Chinese dragon logo and the English word \"Jackie\", or the initials \"JC\". Chan also has a number of other branded businesses. His sushi restaurant chain, Jackie's Kitchen, has outlets throughout Hong Kong, as well as seven in South Korea, with plans to open another in Las Vegas. Jackie Chan's Cafe has outlets in Beijing, Singapore, and the Philippines. Other ventures include Jackie Chan Signature Club gyms (a partnership with California Fitness), and a line of chocolates, cookies and nutritional oatcakes. With each of his businesses, a percentage of the profits goes to various charities, including the Jackie Chan Charitable Foundation."}, {"text": "== Entrepreneurship and philanthropy ==In 2016, Chan partnered with Asian Le Mans Series champion David Cheng to form a racing team in the series and the FIA World Endurance Championship. The two met in March 2015 and Chan told Cheng about his interest in motorsports and raised the possibility of starting a team. Together, the two formed Baxi DC Racing Alpine, the first mainland China-based operation in WEC. In October, leading into the 2016–17 Asian Le Mans Series season, the team was rebranded to Jackie Chan DC Racing and raced with liveries promoting Chan's movie Kung Fu Yoga. At the 2017 24 Hours of Le Mans, the team became the first Chinese team to win its class (LMP2).Chan is a UNICEF Goodwill Ambassador, and has championed charitable works and causes. He has campaigned for conservation and against animal abuse, and has promoted disaster relief efforts for floods in mainland China and the 2004 Indian Ocean tsunami.In June 2006, citing his admiration of the efforts made by Warren Buffett and Bill Gates to help those in need, Chan pledged the donation of half his assets to charity upon his death. On 10 March 2008, Chan was the guest of honour for the launch, by Australian Prime Minister Kevin Rudd, of the Jackie Chan Science Centre at the John Curtin School of Medical Research of the Australian National University. Chan is also a supporter and ambassador of Save China's Tigers, which aims to save the endangered South China tiger through breeding and releasing them into the wild."}, {"text": "== Entrepreneurship and philanthropy ==Following the 2008 Sichuan earthquake, Chan donated RMB ¥10 million to help those in need. In addition, he planned to make a film about the Chinese earthquake to raise money for survivors. In response to the 2011 Tōhoku earthquake and tsunami, Chan and fellow Hong Kong-based celebrities, including American rapper MC Jin, headlined a special three-hour charity concert, titled Artistes 311 Love Beyond Borders, on 1 April 2011 to help with Japan's disaster recovery effort. The 3-hour concert raised over $3.3 million. In January 2017, Chan donated $65,000 to help flood victims in Thailand.Chan founded the Jackie Chan Charitable Foundation in 1988 to offer scholarship and active help to Hong Kong's young people and provide aid to victims of natural disaster or illness. In 2005, Chan created the Dragon's Heart Foundation to help children and the elderly in remote areas of China by building schools, providing books, fees, and uniforms for children; the organisation expanded its reach to Europe in 2011. The foundation also provides for the elderly with donations of warm clothing, wheelchairs, and other items."}, {"text": "=== Endorsements ===One product which Chan had endorsed in China was the \"Little Tyrant\" (\"小霸王\") produced by Subor, a Nintendo Entertainment System hardware clone marketed as a \"learning machine\" to circumvent China's then-ban on video game consoles. In 2010, Chan served as brand ambassador for Kaspersky Lab's antivirus software in Asia.There is an urban legend called the Jackie Chan curse, ABC News reported in 2010 that the legend originated because \"A slew of products sold in China bearing his name, smile and seal of approval have proven defective, prone to explosion, and in one case, potentially damaging to consumers' health.\" This led to a belief that any product or company which was endorsed by Jackie Chan would suffer setbacks. In 2016 the failure of fitness chain California Fitness was blamed on the curse. The curse was again invoked in 2021 when Evergrande Group suffered major losses following Chan's promotion of Evergrande Spring brand bottled water. However, Jackie Chan has also endorsed a number of products and companies which have not had issues."}, {"text": "== Honours == United Kingdom :"}, {"text": "== Honours ==Member of the Order of the British Empire (MBE) (1989)"}, {"text": "== Honours == Federal Territory (Malaysia) :"}, {"text": "== Honours == Commander of the Order of the Territorial Crown (PMW) – Datuk (2015)"}, {"text": "== Entering in the Walk of Fame ==Walk of Fame"}, {"text": "== Entering in the Walk of Fame ==2002 motion pictures star at 6801 Hollywood Boulevard on the Walk of Fame."}, {"text": "== Awards named after Jackie Chan ==The Jackie Chan Action Movie Awards, held at the Shanghai International Film Festival since 2015, is named after Jackie Chan."}, {"text": "== See also ==Hong Kong action cinema"}, {"text": "== External links ==Official website "}, {"text": "== External links ==Jackie Chan at IMDb "}, {"text": "== External links ==Jackie Chan at the Hong Kong Movie Database"}, {"text": "== External links ==Jackie Chan at AllMovie"}, {"text": "== External links ==Jackie Chan at Rotten Tomatoes"}]