[{"text": "Joseph Jason Namakaeha Momoa (; born August 1, 1979) is an American actor. He made his acting debut as Jason Ioane on the syndicated action drama series Baywatch: Hawaii (1999–2001), which was followed by portrayals of Ronon Dex on the Syfy science fiction series Stargate Atlantis (2005–2009), and Khal Drogo in the first two seasons of the HBO fantasy drama series Game of Thrones (2011–2012). He went on to play the lead roles in the Discovery Channel historical drama series Frontier (2016–2018) and the Apple TV+ science fiction series See (2019–2022)."}, {"text": "From 2016 to 2023, Momoa portrayed Aquaman in the DC Extended Universe (DCEU), primarily in the films Justice League (2017), Aquaman (2018), and Aquaman and the Lost Kingdom (2023), with cameo appearances in other media. Momoa has also played Duncan Idaho in the science fiction film Dune (2021), and has starred in the action film Fast X (2023)."}, {"text": "== Early life ==An only child, Momoa was born on August 1, 1979, in Honolulu, Hawaii, to Coni (Lemke), a photographer, and Joseph Momoa, a painter. His father is Native Hawaiian, while his mother is of German, Irish, and Pawnee ancestry. Shortly after his birth, his parents divorced and he and his mother moved to Norwalk, Iowa, where he was raised. He graduated from Norwalk High School where he was part of the soccer team alongside Brandon Routh. Momoa attended Des Moines Area Community College (DMACC) and later attended the University of Hawaii.While in his teens, Momoa became a rock climber and boulderer when his mother took him to Sylvan Lake in the Needles of South Dakota."}, {"text": "== Career ==At 19 years old, while living and working in Honolulu, Momoa decided to audition for the television series Baywatch Hawaii, in which he was cast as Jason Ioane (1999–2001). He was in the main cast on the 2004-2005 Fox drama North Shore as Frankie."}, {"text": "== Career ==In 2004 Momoa appeared in the film Johnson Family Vacation. From 2005 to 2009, Momoa appeared as Ronon in Stargate Atlantis, for which he learned martial arts.In 2009 he was cast as Roman in four episodes of the comedy-drama television series The Game (2009). He portrayed the title protagonist in Conan the Barbarian (2011), a reimagining of the 1982 film of the same name and a role made famous by Arnold Schwarzenegger. Momoa gained notoriety for his role of Khal Drogo on HBO's Game of Thrones. In his audition for the role, he performed a Haka, one of many intimidating Māori dances traditionally used to convey a challenge to an opponent, or a welcome to a visitor.Momoa directed and co-wrote Road to Paloma (2014), an American drama thriller film, together with writers Jonathan Hirschbein and Robert Homer Mollohan. The film stars Momoa, Sarah Shahi, Lisa Bonet, Michael Raymond-James and Wes Studi. It premiered at the 2014 Sarasota Film Festival in April 2014. The film had a limited theatrical release on July 15, 2014, in New York City and Los Angeles and a VOD release."}, {"text": "== Career ==In March 2014, Momoa joined the dark comedy/thriller indie Sugar Mountain alongside Cary Elwes and Haley Webb; its principal photography was done in Alaska. He also starred as Phillip Kopus, a Ramapough Mountain Indian, on the SundanceTV drama series The Red Road (2014–2015).In June 2014, Momoa was reported to have been cast in the role of Arthur Curry / Aquaman, after he auditioned for Bruce Wayne / Batman. He first played the role in a cameo in the superhero film Batman v Superman: Dawn of Justice, marking Aquaman's live action film debut. Momoa played the character in a leading role in the 2017 ensemble film Justice League and its director's cut; Zack Snyder's Justice League. He then starred in the Aquaman solo film, which was released in late 2018. He also reprised this role in The Lego Movie 2: The Second Part.In August 2014, Momoa portrayed Connor in the Canadian horror action film Wolves, and starred in the Sci-fi horror movie Debug; it was written and directed by Momoa's former Stargate Atlantis co-star, British-born Canadian actor David Hewlett. In February 2015, it was announced that he would portray a cannibal in the drama thriller film The Bad Batch. In 2015, Momoa was cast in the Canadian action film Braven, which was released on February 2, 2018."}, {"text": "== Career ==In March 2017, it was announced that Momoa would play Rico Rodriguez in the official Just Cause film series.Between 2016 and 2018, Momoa portrayed Declan Harp in all three seasons of the Canadian historical drama television series Frontier and was an executive producer on the show. The series chronicles the North American fur trade in late 1700s Canada, and follows Declan Harp, a part-Irish, part-Cree outlaw who is campaigning to breach the Hudson's Bay Company's monopoly on the fur trade in Canada, which has become corrupt and engages in illegal activities to enrich itself.In July 2018, Momoa was cast for Apple's post-apocalyptic drama series See.In February 2019, Momoa was cast as Duncan Idaho in the Denis Villeneuve film Dune.In February 2020, Momoa appeared in a halftime commercial for Rocket Mortgage for Super Bowl LIV. He also appeared in the teaser for \"Scary Little Green Men\" by Ozzy Osbourne from his album Ordinary Man."}, {"text": "== Career ==In January 2022, it was announced that Momoa joined the cast of the tenth Fast & Furious film titled Fast X as the main villain, Dante Reyes, the son of Hernan Reyes (Joaquim de Almeida), the main antagonist killed by Luke Hobbs (Dwayne Johnson) in Fast Five. Fast X is produced by and stars Vin Diesel."}, {"text": "== Personal life ==Momoa met his first fiancée, actress Simmone Jade Mackinnon, on the set of Baywatch in 1999. They were together for 6 years and became engaged in 2004. Mackinnon and Momoa called off their engagement after Momoa began a relationship with actress Lisa Bonet in 2005.Although it was previously believed that Momoa and Bonet had married on November 15, 2007, the couple did not marry until October 2017. Daughter Lola Iolani was born in July 2007, and son Nakoa-Wolf Manakauapo Namakaeha was born in December 2008. In January 2022, Momoa and Bonet announced their split. In January 2024, Bonet filed for divorce, citing irreconcilable differences and listing their date of separation as October 7, 2020.He is a fan of heavy metal music and has noted that he \"build[s] [his] characters off of metal songs\". He invited members of Archspire for cameo appearances in the first episode of the TV series See, and he also practiced proper screaming technique with the vocalist of Archspire, Oli Peters, for a significant scene in the series. On October 30, 2020, Momoa was featured in the song \"Doom\" by black metal band Scour. Momoa is a hobby musician and plays bass guitar, mandolin, ukulele and guitar in his spare time, the first of which he took up after listening to Tool's song \"Sober\".Momoa has numerous tattoos, including a half sleeve on his left forearm, a tribute to his family god, or \"aumakua\".He participated in protests against the building of the Thirty Meter Telescope on Mauna Kea, a holy spiritual site for native Hawaiians.In 2017 Momoa began practicing Brazilian jiu-jitsu."}, {"text": "=== Facial scar ===On November 15, 2008, Momoa was slashed across the face with a broken beer glass during an altercation at the Birds Cafe, a tavern in Los Angeles, California. He received approximately 140 stitches during reconstructive surgery and the scar through his left eyebrow is apparent in his later work. The assailant was sentenced to five years in prison for the attack."}, {"text": "== External links ==Jason Momoa at IMDb"}, {"text": "== External links ==Jason Momoa on Twitter"}]