[{"text": "Jennifer Ann McCarthy-Wahlberg (née McCarthy; born November 1, 1972) is an American actress, model, and television personality. She began her career in 1993 as a nude model for Playboy magazine and was later named their Playmate of the Year. McCarthy then had a television and film acting career, beginning as a co-host on the MTV game show Singled Out (1995–1997) and afterwards starring in the eponymous sitcom Jenny (1997–1998), as well as films including BASEketball (1998), Scream 3 (2000), Dirty Love (2005), John Tucker Must Die (2006), and Santa Baby (2006). In 2013, she hosted her own television talk show The Jenny McCarthy Show, and became a co-host of the ABC talk show The View, appearing on the program until 2014. Since 2019, McCarthy has been a judge on the Fox musical competition show The Masked Singer."}, {"text": "McCarthy has written several books about parenting and has promoted research into environmental causes and alternative medical treatments for autism. She has promoted the disproven idea that vaccines cause autism, and said that chelation therapy, a quack remedy, helped cure her son of autism. McCarthy's proselytization of these views has been called \"dangerous\", \"reckless\", and \"uninformed\". She has been described by journalists as \"the nation's most prominent purveyor of anti-vaxxer ideology\" and \"the face of the anti-vaxx movement\". She disputes the anti-vaccine label saying she prefers the term \"pro-safe-vaccine-schedule\", a term that has met strong criticism."}, {"text": "== Early life ==McCarthy was born on November 1, 1972, at Little Company of Mary Hospital located in the southwest Chicago suburb of Evergreen Park, Illinois. She was born to a working-class Catholic family, and has German, Irish, and Polish ancestry. She lived in the West Elsdon neighborhood of Chicago. She is the second of four daughters – her sisters are named Lynette, Joanne, and Amy; actress Melissa McCarthy is her cousin. McCarthy's mother, Linda, was a housewife and courtroom custodian, and her father, Dan McCarthy, was a steel mill foreman.As a teenager McCarthy attended Mother McAuley Liberal Arts High School, whose school sweater she donned in the pages of Playboy, and was a cheerleader at both Brother Rice High School and St. Laurence High School, although she has referred to herself as an \"outcast\" at her school and has said she was repeatedly bullied by classmates. She spent two years at Southern Illinois University."}, {"text": "=== Modeling, acting and broadcasting ===In 1993, Playboy magazine offered McCarthy $20,000 to pose for its October issue. McCarthy became the Playmate of the Month for October 1993. Playboy publisher Hugh Hefner cites McCarthy's \"wholesome Catholic girl\" persona as the unique quality for which she was selected out of 10,000 applicants. Her layout emphasized her Catholic upbringing with a schoolgirl theme. According to McCarthy, the pictorial caused an uproar in her Catholic neighborhood, and resulted in her house being pelted with eggs, her sisters being taunted at school, and McCarthy, who counted Catholic nuns among her aunts, being lectured about her future damnation by those close to her. McCarthy was later made the Playmate of the Year, and was paid a $100,000 salary. In 1994, because of her newfound public attention, McCarthy moved to Los Angeles and, for a time, hosted Hot Rocks, a Playboy TV show featuring uncensored music videos.In 1995, when MTV chose McCarthy to co-host a new dating show called Singled Out, she left Hot Rocks. Her job as a co-host was a success, and Playboy wanted her to do more modeling. That same year she also appeared at World Wrestling Federation (WWF) pay-per-view event WrestleMania XI as a guest valet for villain Shawn Michaels, who faced heroic WWF Champion, Diesel. She left after the match with the victor, Diesel. McCarthy returned to World Wrestling Entertainment (WWE, formerly the WWF) on the August 2, 2008 Saturday Night's Main Event XXXVI to thank the fans for supporting Generation Rescue, an autism advocacy organization. In 1996, she landed a small part in the comedy The Stupids. In 1997, McCarthy launched two shows. The first one was an MTV sketch comedy show The Jenny McCarthy Show, which was sufficiently popular for NBC to sign her for an eponymous sitcom later that year, Jenny. Also in 1997, she appeared on one of two covers for the September issue of Playboy (the other cover featured Pamela Anderson). McCarthy also released an autobiography: Jen-X: Jenny McCarthy's Open Book.In 1998, McCarthy's first major movie role was alongside Trey Parker and Matt Stone in the comedy BASEketball. The following year, she starred in Diamonds. In 2000, she had a role in the horror movie Scream 3, and three years later she parodied that role in horror film spoof Scary Movie 3 along with fellow Playmate and actress Anderson. In 2005, McCarthy produced, wrote, and starred in the film Dirty Love, which was directed by her husband at the time, John Asher. In March 2006, she was given Razzie Awards for Worst Actress, Worst Screenplay, and Worst Picture for her work on Dirty Love, which also earned Asher a Razzie for \"Worst Director\".In addition to her early TV fame on MTV and her short-lived, self-titled NBC sitcom, McCarthy has guest-starred in a variety of other television shows, including Stacked, Charmed, The Drew Carey Show, Wings, Fastlane, Two and a Half Men and Just Shoot Me!. She was the voice of Six in the third season of Canadian computer-animated science-fiction cartoon Tripping the Rift. In 2005, McCarthy hosted a show on E! called Party at the Palms. The reality show, which was filmed at The Palms Hotel in Las Vegas, featured hotel guests, party goers, and celebrities.McCarthy has continued her work with Playboy over the years, both as a model and in other capacities. She appeared on the cover of the magazine's January 2005 issue wearing a leopard skin version of the company's iconic \"bunny suit\" and was featured in a pictorial shot at Elvis Presley's Graceland mansion in that same issue. She was the second woman (following Carmen Electra) and first former Playmate to become a celebrity photographer for the Playboy Cyber Club, where she photographed model Jennifer Madden."}, {"text": "=== Modeling, acting and broadcasting ===Her younger sister, Amy McCarthy, also has posed for Playboy. She was Cyber Girl of the Week for September 27, 2004, and Cyber Girl of the Month for January 2005."}, {"text": "=== Modeling, acting and broadcasting ===In 2007, McCarthy starred in a five-episode online series, called In the Motherhood, along with Chelsea Handler and Leah Remini. The show aired on MSN and was based on being a mother where users could submit their stories to have it made into real webisodes."}, {"text": "=== Modeling, acting and broadcasting ===She also appeared in two video games: playing the role of Agent Tanya in the video game Command and Conquer: Red Alert 3, replacing Kari Wührer, and the fitness video game Your Shape Featuring Jenny McCarthy.On December 31, 2010, McCarthy began her decade-long tenure as correspondent in Times Square for ABC's Dick Clark's New Year's Rockin' Eve with Ryan Seacrest. Until her marriage, McCarthy was known for kissing a member of the U.S. Armed Forces at the stroke of midnight; the kiss was reserved for her husband after her marriage."}, {"text": "=== Modeling, acting and broadcasting ===In 2020, she chose not to participate in this event.She was the host of season 2 of Love in the Wild, which aired in the summer of 2012 on NBC.She was on the cover of Playboy in the July/August 2012 issue after saying she wanted to pose for it again before her 40th birthday.In 2013, McCarthy appeared in a series of commercials for Blu electronic cigarettes.After 17 guest appearances, in July 2013, McCarthy was announced as a new co-host on ABC's The View, replacing former co-host Elisabeth Hasselbeck. To tone down her looks, McCarthy always wore glasses on the show. Barbara Walters praised McCarthy's intelligence, warmth, humor and fresh point of view, and calling her a great addition to the show. She debuted as a co-host on September 9, 2013. The departures of McCarthy and co-host Sherri Shepherd from The View were announced in June 2014. The Wrap reported that ABC had decided not to renew McCarthy's contract. In an interview with Access Hollywood, McCarthy denied being fired from the show.McCarthy became a SiriusXM series host of a show called Dirty, Sexy, Funny with Jenny McCarthy on October 27, 2014. The title of the show was changed to The Jenny McCarthy Show on July 12, 2016.She is one of the panelists on The Masked Singer. The show premiered on January 2, 2019."}, {"text": "=== Public persona ===McCarthy once modeled for Candie's, a shoe company. In one magazine ad, McCarthy posed on a toilet seat with her underwear near her ankles. Cultural scholar Collin Gifford Brooke wrote that the ad's \"taboo nature\" brought it attention, while noting that the ad itself helped to weaken that taboo. Another Candie's ad depicted McCarthy \"passing wind\" in a crowded elevator."}, {"text": "=== Autism activism and views on vaccines ===In May 2007, McCarthy announced that Evan had been diagnosed with autism in 2005. McCarthy wrote that he was gifted, a \"crystal child\", and that she was an \"indigo mom\".In a 2014 Daily Beast article she said that her son, then 12, was doing okay: \"Evan's amazing, ... He doesn't meet the diagnostic characteristics for autism. He definitely has quirks and issues from the seizures. He has a little bit of brain damage due to his seizures. He doesn't qualify for any more services, but he does have issues in his school.\" McCarthy served as a spokesperson for Talk About Curing Autism (TACA) from June 2007 until October 2008. She participated in fundraisers, online chats, and other activities for the non-profit organization to help families affected by autism spectrum disorders. Her first fundraiser for TACA, Ante Up for Autism, was held on October 20, 2007, in Irvine, California. She is a prominent spokesperson and activist for the Generation Rescue foundation, and serves on its board of directors as of January 2011.McCarthy's book dealing with autism, Louder than Words: A Mother's Journey in Healing Autism, was published September 17, 2007. She said both in her book and during her appearance on The Oprah Winfrey Show that her husband was unable to deal with their son's autism, which led to their divorce. In 2008, she appeared on a Larry King Live special dedicated to the subject and argued that vaccines can trigger autism. As of 2008, her son's physician was vaccine critic Jay Gordon. In an April 27, 2010, PBS Frontline documentary, she was interviewed about the debate between vaccine opponents and public health experts.In addition to conventional, intensive Applied Behavioral Analysis (ABA) therapy, McCarthy prescribed for her son a gluten-free and casein-free diet, hyperbaric oxygen chambers, chelation, aromatherapies, electromagnetics, spoons rubbed on his body, multivitamin therapy, B-12 shots, and numerous prescription drugs. \"Try everything\", she advises parents. \"It was amazing to watch, over the course of doing this, how certain therapies work for certain kids and they completely don't work for others... When something didn't work for Evan, I didn't stop. I stopped that treatment, but I didn't stop.\" She has denied that her son was misdiagnosed. McCarthy has claimed on talk shows and at rallies that chelation therapy helped her son recover from autism. The underlying rationale for chelation, the speculation that mercury in vaccines causes autism, has been roundly rejected by scientific studies, with the National Institute of Mental Health concluding that children with autism are unlikely to receive any benefit to balance the risks of heart attack, stroke and cardiac arrest posed by the chelating agents used in the treatment.McCarthy's public presence and vocal activism on the vaccination-autism controversy, led, in 2008, to her being awarded the James Randi Educational Foundation's Pigasus Award, which is a tongue-in-cheek award granted for contributions to pseudoscience, for the \"Performer Who Has Fooled the Greatest Number of People with the Least Amount of Effort\". Randi stated in a video on the JREF's website that he did sympathize with the plight of McCarthy and her child, but admonished her for using her public presence in a way that may discourage parents from having their own children vaccinated. In 2019 Rolling Stone magazine published a list of seventeen anti-vaccination celebrities, from which according to Stuart Vyse McCarthy was one of the most active anti-vaccine celebrities.McCarthy's claims that vaccines cause autism are not supported by any medical evidence, and the original paper by Andrew Wakefield that formed the basis for the claims (and for whose book McCarthy wrote a foreword) was based on manipulated data and fraudulent research. The BMJ published a 2011 article by journalist Brian Deer, based on information uncovered by Freedom of Information legislation after the British General Medical Council (GMC) inquiry into allegations of misconduct against Wakefield that led to him being struck off from the medical register (and thus unable to practice medicine in the UK) and his articles retracted, saying that Wakefield had planned a venture to profit from the MMR vaccine scare.Generation Rescue released a statement saying that the \"media circus\" following the revelation of Wakefield's fraud and manipulation of data was \"much ado about nothing\", which led USA Today to report that McCarthy had \"taken a beating on Twitter\". Mary Elizabeth Williams responded to Generation Rescue's statement:"}, {"text": "=== Autism activism and views on vaccines ===\"It's high time the woman who once said that 'I do believe sadly it's going to take some diseases coming back to realize that we need to change and develop vaccines that are safe' took a step back and reconsidered the merits of that increasingly crackpot stance. And it's time she acknowledged that clinging to research that's been deemed patently fraudulent does not make one a 'mother warrior.' It makes her a menace.\""}, {"text": "=== Autism activism and views on vaccines ===In January 2011, McCarthy defended Wakefield, saying that he had listened to parents, reported what they said, and recommended further investigation:"}, {"text": "=== Autism activism and views on vaccines ===\"Since when is repeating the words of parents and recommending further investigation a crime? As I've learned, the answer is whenever someone questions the safety of any vaccines. For some reason, parents aren't being told that this 'new' information about Dr. Wakefield isn't a medical report, but merely the allegations of a single British journalist named Brian Deer.\""}, {"text": "=== Autism activism and views on vaccines ===Having written three books on the subject after her son was diagnosed with the syndrome, \"by dint of sheer energy and celebrity, McCarthy became the nation's most prominent purveyor of anti-vaxxer ideology\", and has reiterated that she is not against vaccines. In an earlier October 2013 interview for TV Guide, McCarthy is quoted as saying:"}, {"text": "=== Autism activism and views on vaccines ===\"It's been three years now since I've even talked about autism or vaccines — I was taken aback when people freaked out that I was going to come on The View and preach. ... I will clarify my stance, which is still the same: That parents are in charge. Space it out, slow it down and do your homework. But I am not at all against vaccines.\""}, {"text": "=== Autism activism and views on vaccines ===Jeffrey Kluger, senior writer at Time, has criticized McCarthy several times. In an open letter article referring to their past conflicts, he reproved her and rejected her denials:"}, {"text": "=== Autism activism and views on vaccines ===\"Jenny, as outbreaks of measles, mumps and whooping cough continue to appear in the U.S.—most the result of parents refusing to vaccinate their children because of the scare stories passed around by anti-vaxxers like you—it's just too late to play cute with the things you've said. You are either floridly, loudly, uninformedly antivaccine or you are the most grievously misunderstood celebrity of the modern era. Science almost always prefers the simple answer, because that's the one that's usually correct. Your quote trail is far too long—and you have been far too wrong—for the truth not to be obvious.\""}, {"text": "=== Autism activism and views on vaccines ===One month later in May 2014, McCarthy published an opinion-editorial addressing her position on vaccines, which specifically mentions Kluger:"}, {"text": "=== Autism activism and views on vaccines ===\"I am not 'anti-vaccine.' This is not a change in my stance nor is it a new position that I have recently adopted. For years, I have repeatedly stated that I am, in fact, 'pro-vaccine' and for years I have been wrongly branded as 'anti-vaccine.' ... Blatantly inaccurate blog posts about my position have been accepted as truth by the public at large as well as media outlets (legitimate and otherwise), who have taken those false stories and repeatedly turned them into headlines.\""}, {"text": "=== Autism activism and views on vaccines ===During a subsequent Daily Beast interview she said:"}, {"text": "=== Autism activism and views on vaccines ===\"I am not anti-vaccine, ... I'm in this gray zone of, I think everyone should be aware and educate yourself and ask questions. And if your kid is having a problem, ask your doctor for an alternative way of doing the shots. ... The ironic thing is my position has always remained the same. People just never listened to it.\""}, {"text": "=== Autism activism and views on vaccines ===In a 2015 Medscape article about celebrities who \"speak out about illness\", Jeffrey A. Lieberman criticized McCarthy and her views on vaccines, thimerosal, and autism. He had this to say about her influence: \"She has no idea what she is talking about. What she said is misleading and harmful, and the measles outbreak is a clear indication of the response to the spread of such pseudoscientific myths.\""}, {"text": "=== Objections to appointment on The View ===McCarthy's appointment to The View called forth many protests. Amy Pisani of Every Child By Two wrote a letter to The View's Barbara Walters and Bill Geddie saying that McCarthy's \"unfounded claims that vaccines cause autism have been one of the greatest impediments to public health in recent decades\", and that McCarthy's assertions \"[have] spread fear among young parents, which has led to an increased number of children who have not received life-saving vaccines.\"James Poniewozik, a television critic for Time magazine, criticized McCarthy's addition to the series and Walters' endorsement of McCarthy, arguing that The View is largely aimed at parents, on whom the public health system is dependent, and that the credibility that McCarthy's hiring will give her will endanger the public. Poniewozik argued that McCarthy's views, which might be brought up in discussions with the other hosts, would have the effect of framing the issue of whether vaccines cause autism as a matter of opinion, rather than a firmly refuted idea.David Freeman, senior science editor for The Huffington Post, wrote about the concerns of Bill Nye who said: \"I believe Ms. McCarthy's views will be discredited.\"Alex Pareene also protested and published a letter to ABC in Salon, entitled \"Anti-vaccine conspiracist and 'View' co-host Jenny McCarthy isn't just quirky—she spreads lies that hurt people.\"Michael Specter, writing in The New Yorker stated:"}, {"text": "=== Objections to appointment on The View ===\"Jenny McCarthy... will be the show's first co-host whose dangerous views on childhood vaccination may—if only indirectly—have contributed to the sickness and death of people throughout the Western world. McCarthy, who is savvy, telegenic, and pulchritudinous, is also the person most visibly associated with the deadly and authoritatively discredited anti-vaccine movement in the United States.\""}, {"text": "=== Objections to appointment on The View ===Brendan Nyhan, writing in Columbia Journalism Review, commented: \"ABC's announcement yesterday that actress/comedian Jenny McCarthy will become a co-host of The View brought forth a torrent of condemnation from doctors, science journalists, opinion writers, and even entertainment commentators who oppose giving the anti-vaccine activist a high-profile platform to spread misinformation.\" After an extensive review of news coverage of the hiring, Nyhan concluded that \"[t]here is no perfect way to cover McCarthy's hiring, of course, but giving 'balanced' coverage to fringe beliefs is the worst approach to covering misinformation.\"Toronto Public Health officially denounced the appointment and \"launched a Twitter campaign to get... McCarthy fired from the ABC show The View\", tweeting \"Jenny McCarthy's anti-vaccine views = misinformation. Please ask The View to change their mind\", and \"Jenny McCarthy cites fraudulent research on vaccines & it's irresponsible to provide her with The View platform.\"Katrina vanden Heuvel, member of the Council on Foreign Relations and Editor of The Nation, objected to the appointment and wrote about \"Jenny McCarthy's Vaccination Fear-Mongering and the Cult of False Equivalence\":"}, {"text": "=== Objections to appointment on The View ===\"One of the most prominent promoters of this falsehood [that vaccines cause autism] is actress Jenny McCarthy, who was recently named as Elisabeth Hasselbeck's replacement on ABC's hit daytime talk-show, The View. Once she's on air, it will be difficult to prevent her from advocating for the anti-vaccine movement. And the mere act of hiring her would seem to credit her as a reliable source. ... By giving science deniers a public forum, media outlets implicitly condone their claims as legitimate. ... False equivalency is one of journalism's great pitfalls, and in an effort to achieve 'balance', reporters often obscure the truth. What's the merit in 'he said, she said' reporting when he says the world is round and she insists it is flat. Indeed, there is an enormous cost to society when the truth could save lives.\""}, {"text": "=== Objections to appointment on The View ===McCarthy finished as co-host of the show in 2014, nine months after her debut.Psychologist Stuart Vyse in an article for Skeptical Inquirer regarding the false cause between vaccination and autism and also the false cures said: "}, {"text": "=== Objections to appointment on The View ===\"McCarthy became the face of the anti-vaccination movement, and the subsequent rise in vaccine hesitancy has been called “The Jenny McCarthy Effect” (Dominus 2011). It is important to recall that correlation does not mean causation, but the Google Trends[...] data shows a sustained increase in Google searches for “autism & vaccines” following McCarthy’s book launch media blitz. It’s also impossible to know who was searching and why, but for a time Jenny McCarthy was the undisputed leader of the anti-vaxx movement.\""}, {"text": "== Personal life ==McCarthy dated manager Ray Manzella from 1994 until 1998 and began dating actor/director John Mallory Asher late in 1998. The couple was engaged in January 1999 and married on September 11 of that year. They have a son, Evan, born in May 2002, who was diagnosed with autism in May 2005. McCarthy and Asher divorced in September 2005.In December 2005, McCarthy began dating actor Jim Carrey. They did not make their relationship public until June 2006. She announced on The Ellen DeGeneres Show on April 2, 2008, that she and Carrey were living together but had no plans to marry, as they did not need a \"piece of paper\". Carrey almost made a mock proposal to McCarthy as a promotion for the film Yes Man (2008) for Ellen's Twelve Days of Christmas. In April 2010, McCarthy and Carrey announced that they had split up.In July 2013, McCarthy stated that she was dating singer and actor Donnie Wahlberg, known for being a member of New Kids on the Block and the television series Blue Bloods. On April 16, 2014, McCarthy announced on The View that she and Wahlberg were engaged, and they married on August 31, 2014."}, {"text": "== Bibliography ==Jen-X: Jenny McCarthy's Open Book, an autobiography (Harpercollins November 1997, ISBN 978-0-06-039233-8)."}, {"text": "== Bibliography ==Belly Laughs: The Naked Truth about Pregnancy and Childbirth (DaCapo Press, December 13, 2005, ISBN 978-0-7382-0949-4)"}, {"text": "== Bibliography ==Baby Laughs: The Naked Truth about the First Year of Mommyhood (Plume, April 4, 2006, ISBN 978-0-525-94883-4)"}, {"text": "== Bibliography ==Life Laughs: The Naked Truth about Motherhood, Marriage, and Moving On (Plume, March 27, 2007, ISBN 978-0-525-94947-3)"}, {"text": "== Bibliography ==Louder than Words: A Mother's Journey in Healing Autism (Plume, September 17, 2007, ISBN 978-0-525-95011-0)"}, {"text": "== Bibliography ==Mother Warriors: A Nation of Parents Healing Autism Against All Odds (Plume, September 23, 2008, ISBN 978-0-525-95069-1)"}, {"text": "== Bibliography ==Healing and Preventing Autism Co-written with Dr. Jerry Kartzinel. (Dutton Adult, March 31, 2009, ISBN 978-0-525-95103-2)"}, {"text": "== Bibliography ==Love, Lust & Faking It: The Naked Truth About Sex, Lies, and True Romance (Harper, September 28, 2010, ISBN 978-0062012982)"}, {"text": "== Bibliography ==Bad Habits: Confessions of a Recovering Catholic (Hyperion, October 2, 2012, ISBN 0060392339),"}, {"text": "== See also ==List of people in Playboy 1990–1999"}, {"text": "== External links ==Jenny McCarthy at Playboy Online"}, {"text": "== External links ==Jenny McCarthy at IMDb"}, {"text": "== External links ==Jenny McCarthy on Twitter"}]