[{"text": "Jennifer Lynn Affleck (née Lopez; born July 24, 1969), also known by her nickname J.Lo, is an American actress, singer, and dancer. Often dubbed the \"Queen of Dance\", Lopez is regarded as one of the most influential entertainers of her time, credited with breaking barriers for Latino Americans in Hollywood and helping propel the Latin pop movement in music. She is also noted for her impact on popular culture through fashion, branding, and shifting mainstream beauty standards."}, {"text": "Lopez began her career as a dancer, making her television debut as a Fly Girl on the sketch comedy series In Living Color in 1991. She later rose to prominence as an actress, with leading roles in the films Selena (1997), Anaconda (1997) and Out of Sight (1998) establishing her as the highest-paid Latin actress. She successfully ventured into the music industry with her debut album On the 6 (1999). In 2001, she became the first woman to simultaneously have the number one album and film in the United States with her second album J.Lo and romantic comedy The Wedding Planner. She has since become known for starring in romantic comedies, including Maid in Manhattan (2002), Shall We Dance? (2004), and Monster-in-Law (2005). Lopez released two albums in 2002: J to tha L–O! The Remixes and This Is Me... Then, the former becoming the first remix album to top the US Billboard 200. "}, {"text": "Media scrutiny and the failure of her film Gigli (2003) preceded a career downturn. Her subsequent albums included Rebirth (2005) and Como Ama una Mujer (2007); the latter broke first-week sales records for a debut Spanish album. In 2011, Lopez returned to prominence as a judge on American Idol and released the album Love?. In the latter 2010s, she performed a concert residency, starred in the police drama series Shades of Blue (2016–2018), served as a judge on World of Dance (2017–2020), and garnered critical praise for her performance in the crime drama Hustlers (2019). She has since starred in the films Marry Me (2022), The Mother (2023) and This Is Me... Now: A Love Story (2024)."}, {"text": "With over 80 million records sold, Lopez's most successful singles include: \"If You Had My Love\", \"Waiting for Tonight\", \"Let's Get Loud\", \"Love Don't Cost a Thing\", \"I'm Real\", \"Ain't It Funny\", \"Jenny from the Block\", \"All I Have\", \"Get Right\", and \"On the Floor\". Her accolades include a star on the Hollywood Walk of Fame, the Billboard Icon Award and the Michael Jackson Video Vanguard Award. She has been ranked among the 100 most influential people in the world by Time and the World's 100 Most Powerful Women by Forbes. Her other ventures include a lifestyle brand, beauty and fashion lines, fragrances, a production company and a charitable foundation."}, {"text": "== Early life ==Jennifer Lynn López was born on July 24, 1969, in the Bronx, a borough of New York City, and raised in its Castle Hill neighborhood. Her parents, David López and Guadalupe Rodríguez, were born in Puerto Rico and met in New York City. After serving in the army, David worked as a computer technician at Guardian Insurance Company. Guadalupe was a homemaker for the first ten years of López's life and later worked as a Tupperware salesperson and a kindergarten and gym teacher. They divorced in the 1990s after 33 years of marriage."}, {"text": "== Early life ==Lopez is a middle child; she has an older sister, Leslie, and a younger sister, Lynda. The three shared a bedroom. Lopez has described her upbringing as \"strict\". She was raised in a Roman Catholic family; she attended Mass every Sunday and received a Catholic education, attending Holy Family School and the all-girls Preston High School. In school, Lopez ran track on a national level, participated in gymnastics and was on the softball team. She danced in school musicals and played a lead role in a production of Godspell. She described herself as a \"tomboy\" and \"very athletic\"."}, {"text": "== Early life ==There was \"lots of music\" in the typically Puerto Rican household, and Lopez and her sisters were encouraged to sing, dance and create their own plays for family events. West Side Story made a particular impression on the young Lopez, who wanted to be an entertainer from an early age. As a teenager, she learned flamenco, jazz and ballet at the Kips Bay Boys & Girls Club and taught dance to younger students, including Kerry Washington. After graduating from high school, she had a part-time secretarial job at a law firm and studied business at New York's Baruch College for one semester. At age 18, she enrolled as a full-time student at Manhattan's Phil Black Dance Studio, where she had already taken night classes in jazz and tap dance. Her parents were unhappy with her decision to leave college to pursue a dance career. According to Lopez, her parents felt it was \"foolish\" because \"no Latinas did that\". Her mother asked her to move out of the family home and they stopped speaking for eight months. Lopez moved to Manhattan, sleeping in the dance studio's office for the first few months."}, {"text": "=== 1989–1996: Professional dancing and early acting roles ===Lopez's first professional job came in 1989 when she spent five months touring Europe with the musical revue show Golden Musicals of Broadway. She was upset at being the only member of the chorus not to have a solo, and later characterized it as a pivotal moment where she had to \"try harder and become that much more committed\". In 1990, she danced alongside MC Hammer in an episode of Yo! MTV Raps, and traveled around Japan for four months as a chorus member in Synchronicity. When she returned to the United States, she was hired as a backup dancer for New Kids on the Block's performance of \"Games\" at the 1991 American Music Awards. She also traveled around America with regional productions of the musicals Jesus Christ Superstar and Oklahoma!. During this period, Lopez also danced in music videos including Doug E. Fresh's \"Summertime\", Richard Rogers' \"Can't Stop Loving You\", EPMD's \"Rampage\", and Samantha Fox's \"(Hurt Me! Hurt Me!) But the Pants Stay On\". Lopez stated: \"I'd dance in a piece-of-garbage rap or pop video for 50 bucks and make the money last a whole month.\""}, {"text": "=== 1989–1996: Professional dancing and early acting roles ===Her most high-profile job as a professional dancer was as a Fly Girl jazz-funk dancer on the sketch comedy television series In Living Color. The show's choreographer, Rosie Perez said she chose Lopez because \"she had that look that I knew the audience would tune in to\". Lopez moved to Los Angeles in late 1991 for the job; she filmed In Living Color during the day and attended acting classes taught by Aaron Speiser at night. Lopez felt ostracized by the other Fly Girls because of her \"voluptuous figure\", and also clashed with Perez. The head of Virgin Records considered signing The Fly Girls as a girl group to rival the Spice Girls, but the deal fell apart. After appearing as a Fly Girl in seasons three and four of In Living Color, Lopez left to work as a backup dancer for Janet Jackson, and appeared in the music video for \"That's the Way Love Goes\". She was scheduled to tour with Jackson on her Janet World Tour in late 1993 but opted to pursue an acting career instead. Lopez hired In Living Color producer Eric Gold as her manager. He advised Lopez to lose weight if she wanted to succeed as an actress."}, {"text": "=== 1989–1996: Professional dancing and early acting roles ===Lopez's first professional acting job was a small recurring role on the television show South Central (1994). She was invited to audition for the pilot by a casting director who had seen her speak to camera during a behind-the-scenes In Living Color segment. She then acquired an agent and was cast in the CBS show Second Chances; the series was quickly cancelled, but her popularity with viewers led to her being cast in its spin-off Hotel Malibu. She subsequently appeared in the television film Lost in the Wild (1993). For her first major movie role, in Gregory Nava's 1995 drama Mi Familia, Lopez received a nomination for the Independent Spirit Award for Best Supporting Actress. She then starred in the action comedy Money Train (1995). The film was not a box office success, though her performance was reviewed positively, which led to her being further noticed in Hollywood. In 1996, Lopez had a supporting role opposite Robin Williams in the comedy Jack, which director Francis Ford Coppola cast her in after seeing her performance in Mi Familia. She next starred opposite Jack Nicholson in the neo-noir thriller Blood and Wine (1996), where David Rooney of Variety felt she delivered in \"juggling\" the \"smoldering and soulful sides\" of the character."}, {"text": "=== 1997–1999: Breakthrough with Selena and On the 6 ===With her casting as the singer Selena Quintanilla-Pérez in the biopic Selena (1997), Lopez became the first Latina actress to earn $1 million. She described her salary for the film as a \"statement to the world\", but expressed disappointment that other Latina actors were not being afforded the same opportunities. Despite having previously worked with the film's director Gregory Nava on Mi Familia, Lopez participated in an intense auditioning process and spent time with the late singer's family in Corpus Christi, Texas before filming began. Selena was a box office hit, and Lopez's performance received critical acclaim. Roger Ebert of the Chicago Sun-Times described it as \"a star-making performance\" and wrote: \"She has the star presence to look convincing in front of 100,000 fans.\" Lopez received her first Golden Globe nomination for the performance. Nava asked the heads of Warner Bros. to fund an Academy Award campaign for Lopez but was told the Academy would \"never nominate a Latina.\" Later in 1997, Lopez starred opposite Ice Cube in the horror film Anaconda, which received negative reviews from critics but was a box office success. Joe Leydon of Variety found the film \"silly\" but said it deserved \"a little credit\" for being \"the first movie of its kind to have a Latina and an African-American\" as its stars. In the crime film U Turn (1997), Lopez appeared topless in a sex scene that was added by director Oliver Stone during filming. Speaking in 2003, Lopez said it was not something \"I would have chosen to do\" and that she and Stone fought over it: \"It's hard being the only woman on a set.\""}, {"text": "=== 1997–1999: Breakthrough with Selena and On the 6 ===Lopez starred opposite George Clooney in the crime caper Out of Sight (1998), Steven Soderbergh's adaptation of the Elmore Leonard novel of the same name. Cast as a deputy federal marshal who falls for a charming criminal, she won rave reviews for her performance. Janet Maslin of The New York Times described it as her \"best movie role thus far, and she brings it both seductiveness and grit; if it was hard to imagine a hard-working, pistol-packing bombshell on the page, it couldn't be easier here.\" Turan of the Los Angeles Times described Lopez as \"an actress who can be convincingly tough and devastatingly erotic\" and said the film solidified \"her position as a woman you can confidently build a film around.\" In 2021, Peter Bradshaw of The Guardian named Lopez and Clooney's partnership as one of the best examples of on-screen chemistry in cinema history. Also in 1998, Lopez provided the voice of Azteca in the animated film Antz, and ventured into product endorsement, becoming a national spokesperson for Coca-Cola and L'Oréal."}, {"text": "=== 1997–1999: Breakthrough with Selena and On the 6 ===Lopez decided to pursue a music career after working on Selena, realizing that she had missed \"the excitement of the stage\". Her new manager Benny Medina sought to position her as \"a brand name that will cross over into all media.\" Lopez, who was \"really feeling [her] Latin roots\", recorded a Spanish-language demo for circulation among prospective labels. With Lopez being a high-profile personality, a bidding war ensued. Tommy Mottola, the head of Sony Music's Work Group, signed her but suggested that she sing in English instead. Her record deal with Sony was described as \"lucrative\", having outbid other offers from Capitol Records and EMI Latin. While Lopez worked on her debut album, Sony \"began a major push\" to feature her with other high-profile entertainers, leading her to appear in the Sean Combs music video \"Been Around the World\" (1997). "}, {"text": "=== 1997–1999: Breakthrough with Selena and On the 6 ===Her debut album On the 6 (1999), named after the 6 Subway line which connected her childhood home in the Bronx to Manhattan, was met with positive reviews and further propelled her public profile. The album was a success and Lopez's debut single, \"If You Had My Love\", topped the U.S. Billboard Hot 100 for five consecutive weeks, with another single, \"Waiting for Tonight\", reaching number eight and becoming a celebratory anthem for the new millennium. Other singles from the album included \"Let's Get Loud\", which became one of Lopez's signature songs, and \"No Me Ames\", a duet with future husband Marc Anthony. In July 1999, she performed \"If You Had My Love\" and \"Let's Get Loud\" at the 1999 FIFA Women's World Cup closing ceremony. It was watched by over one billion viewers worldwide, exposing Lopez's music career to a larger international audience."}, {"text": "=== 2000–2002: International success ===In February 2000, Lopez and then-boyfriend Sean Combs attended the Grammy Awards, with Lopez wearing a plunging green Versace silk chiffon dress. The dress generated worldwide attention and became the most popular search query in Google's history, leading to the creation of Google Images, while boosting Lopez's album and movie ticket sales. Later that year, Lopez starred in the psychological thriller The Cell, for which she received a $4 million salary. The film, where Lopez played a psychologist who uses radical experimental therapy to enter the mind of a killer, received mixed reviews but was a box office success."}, {"text": "=== 2000–2002: International success ===Lopez became the first woman to have a number one film and album simultaneously in January 2001, with the release of her sophomore album J.Lo and her romantic comedy The Wedding Planner, which co-stars Matthew McConaughey. The Wedding Planner received highly negative reviews but became a box office success. Jessica Winter of The Village Voice found Lopez miscast as a \"buttoned down, celibate\" woman in the film. Lopez titled her album J.Lo after the nickname which her fans and the media had been increasingly referring to her as. She also adopted J.Lo as her stagename. J.Lo received polarized reviews from critics but became the most successful album of her career, selling 12 million copies worldwide. It included the singles \"Love Don't Cost a Thing\", which reached number one in various countries, \"I'm Real\" featuring Ja Rule, which peaked atop the Billboard Hot 100, \"Ain't It Funny\", and \"Play\". In support of the album, Lopez performed two-concert residency in Puerto Rico, which was later broadcast in November 2001 as an NBC special, Jennifer Lopez in Concert. It was one of the most-watched concert specials of the year in the United States, with an audience of almost 12 million. "}, {"text": "=== 2000–2002: International success ===In other 2001 work, Lopez launched her first business venture, the clothing line J.Lo by Jennifer Lopez. The line catered to women of all sizes, as Lopez felt \"the voluptuous woman [was] almost ignored\" in the fashion industry. She also founded her production company, Nuyorican Productions, with manager Benny Medina. Her next film was the romantic drama Angel Eyes, starring opposite Jim Caviezel. Lopez's performance was well-reviewed, though the film was a critical and commercial disappointment. She was slated to star alongside Ricky Martin in a remake of Elvis Presley's Viva Las Vegas, but this did not eventuate. "}, {"text": "=== 2000–2002: International success ===Lopez released two albums in 2002. The first was J to tha L–O! The Remixes, which became the first remix album in history to debut at number one on the Billboard 200. Its singles included \"Ain't It Funny (Murder Remix)\" and \"I'm Gonna Be Alright\", which reached number one and ten on the Billboard Hot 100, respectively. Lopez's third studio album, This Is Me... Then, was released in late 2002, and was heavily influenced by her relationship with then-fiancé Ben Affleck. It received mixed critical reviews; Billboard's Michael Paoletta noted the \"considerable growth she reveals as a performer and tunesmith\" on the album, while Jon Caramanica called it \"the least interesting music on the pop charts today.\" The album became a commercial success, achieving the highest opening sales week of her career. The album's lead single \"Jenny from the Block\", which peaked at number three on the Billboard Hot 100, was viewed as a response to the notion that Lopez had alienated her \"core fan base: the black and Hispanic hip-hop community.\" The album also spawned the number one single \"All I Have\". "}, {"text": "=== 2000–2002: International success ===Lopez starred as an abused wife who fights back in the thriller Enough (2002), a role which required her to learn Krav Maga. An overworked Lopez suffered a nervous breakdown in 2001 while filming it. The film received negative reviews; Ebert of the Chicago Sun-Times felt it was \"tacky material\" and was surprised to see \"an actress like Jennifer Lopez\" involved with the project. Her next film was the romantic comedy, Maid in Manhattan (2002), in which Lopez starred opposite Ralph Fiennes as a maid and single mother from the Bronx. It became the highest-grossing film of her career. Reviewing Maid in Manhattan, A. O. Scott of The New York Times enjoyed Lopez as a romantic lead and said \"her greatest skill as an actress\" was \"her ability to melt without cracking the hard shell of composure she wears.\" In 2002 business ventures, Lopez opened Madre's, a Los Angeles restaurant serving Latin cuisine, and released her first fragrance, Glow by JLo. It became the top-selling fragrance in the US."}, {"text": "=== 2003–2009: Media scrutiny and career downturn ===Lopez became the subject of widespread media criticism in 2003 due to her public relationship with Ben Affleck and the tabloid depiction of her as a demanding diva. She fired both her personal manager Benny Medina and her publicist in mid-2003; The New York Times reported that movie executives had become frustrated by having their communications with Lopez \"largely filtered\" through Medina. That year, Lopez starred opposite Affleck in the romantic comedy Gigli, which was a box-office bomb and is considered one of the worst films of all time. Rex Reed of The Observer criticized the lead actors, calling them \"pathetically incompetent\" in both \"craft and talent\". Roger Ebert agreed that the movie \"doesn't quite work\", but found Lopez and Affleck \"appealing in their performances\" and noted the couple's chemistry. Later in 2003, she released her second fragrance Still Jennifer Lopez, and became the face of Louis Vuitton's fall advertising campaign. "}, {"text": "=== 2003–2009: Media scrutiny and career downturn ===Lopez had a minor role opposite Affleck in the film Jersey Girl (2004). Following test audiences' negative reactions to the onscreen couple, her screen time was halved. Lopez later described this as the lowest point of her career and admitted she felt \"eviscerated\" by the media coverage surrounding Gigli: \"I lost my sense of self, questioned if I belonged in this business, thought maybe I did suck at everything. And my relationship self-destructed in front of the entire world. It was a two-year thing for me until I picked myself up again.\" Months later, she starred opposite Richard Gere in the romantic comedy-drama Shall We Dance?, which was a box-office success. Lopez's clothing lines and two fragrances generated over $300 million in revenue throughout 2004."}, {"text": "=== 2003–2009: Media scrutiny and career downturn ===The marketing for the romantic comedy Monster-in-Law (2005), in which Lopez starred opposite Jane Fonda, played up her \"Gigli-and-tabloid tarnished image\", and it became a box office success. She released her fourth studio album, Rebirth, in early 2005. Its title was symbolic of Lopez's hopes for \"a new professional beginning\". It was recorded during a period where Lopez felt \"a little bit lost, trying to get my footing in a new life\", \"I had just gotten married [to singer Marc Anthony] ... I wasn't with Benny [Medina].\" In a review of Rebirth, journalist Alexis Petridis remarked that the title \"suggests even Lopez has realised that something is amiss with her career ... Despite the highlights, you're still left pondering the question: what happened to Jennifer Lopez?\" The album reached number two on the Billboard 200, but failed to replicate the sales of her previous albums. Its lead single \"Get Right\", however, reached number twelve on the Billboard Hot 100, becoming one of her most successful songs. Also in 2005, Lopez launched her second fashion label, Sweetface, which was geared towards \"high fashion\" in comparison, and appeared in a Kill Bill-inspired Pepsi commercial with Beyoncé and David Beckham. The next year, she returned to the top five of the Billboard Hot 100 as a featured artist on \"Control Myself\", the lead single from LL Cool J's twelfth studio album."}, {"text": "=== 2003–2009: Media scrutiny and career downturn ===Lopez's next three movie projects were box office failures. She starred alongside Robert Redford and Morgan Freeman in the drama An Unfinished Life (2005). Ebert of the Chicago Sun-Times predicted that the typical review would be unkind: \"It will have no respect for Jennifer Lopez, because she is going through a period right now when nobody is satisfied with anything she does ... Give Lopez your permission to be good again; she is the same actress now as when we thought her so new and fine.\" In 2006, she reunited with director Gregory Nava  to star in the crime drama Bordertown as a journalist investigating female homicides in Ciudad Juárez, Mexico. The film was negatively reviewed and received a direct-to-video release. David D'Arcy of Screen Daily found Lopez \"unconvincing\" as a journalist. In 2007, she starred opposite her then-husband Marc Anthony in the music biopic El Cantante, which told the story of Puerto Rican salsa singer Héctor Lavoe and his wife Puchi. It did not perform well at the box office and received mixed reviews from film critics; Lopez's performance, which she expressed pride in, drew both praise and criticism."}, {"text": "=== 2003–2009: Media scrutiny and career downturn ===Lopez released two studio albums in 2007. Her fifth album, Como Ama una Mujer, was her first to be recorded entirely in Spanish. Chris Willman of Entertainment Weekly acknowledged that the album offered \"fairly persuasive proof\" that Lopez can sing, but was unimpressed by the \"flaccid torch songs.\" It became the fifth Spanish album to debut in the top ten of the Billboard 200, and achieved the highest first-week sales for an artist's debut Spanish album at the time. The lead single \"Qué Hiciste\" reached number 86 on the Billboard Hot 100 while the second single \"Me Haces Falta\" failed to chart. Lopez's sixth studio album Brave, released later that year, was her lowest-charting album worldwide. Jonathan Bernstein of Entertainment Weekly was disappointed that Lopez had returned to \"listless vocals\" for her \"back-to-the-dance-floor album.\" The album debuted at number 12 on the Billboard 200 and produced two singles, \"Do It Well\" and \"Hold It Don't Drop It\". The first peaked at number 31 on the Billboard Hot 100 chart, while the latter failed to chart. While pregnant with twins, Lopez embarked upon her first ever concert tour, a show co-headlined by Anthony, in September 2007; the tour was well-received. She also created, produced and was featured in the MTV show DanceLife, which she described as a \"passion project\"."}, {"text": "=== 2003–2009: Media scrutiny and career downturn ===After giving birth to twins in February 2008, Lopez took a career break. Her restaurant Madre's closed permanently, as did her two fashion lines. After rehiring former manager Medina, Lopez released two songs in late 2009, \"Louboutins\" and \"Fresh Out of the Oven\". The songs were intended for her seventh studio album but failed to make an appearance on the Billboard charts, leading to her departure from Sony Music and Epic Records. "}, {"text": "=== 2010–2015: American Idol and career rejuvenation ===Lopez's first theatrical role in three years was in the romantic comedy The Back-up Plan (2010). Manohla Dargis of The New York Times was unimpressed by the movie and described Lopez as \"an appealing screen presence with a disappointing big-screen track record. That's probably not all her fault: romantic roles for women often are the provenance of the bland or the blonde.\" A \"big turning point\" in Lopez's career came when she joined the judging panel of the singing competition series American Idol for its tenth season, replacing Simon Cowell. Despite being advised that it was a \"huge gamble\", she accepted the job, as she was \"not getting offered a whole bunch of movies\". Lopez's appearance on American Idol in 2011 returned her to prominence. Hannah Elliot of Forbes described it as \"a remarkable comeback\", writing: \"Idol humanized her. Viewers who knew only an attention-grabbing siren met a hardworking, self-made, empathetic single mother, who got emotional when contestants did well and when they failed.\" "}, {"text": "=== 2010–2015: American Idol and career rejuvenation ===Lopez subsequently experienced what Billboard called \"the most impressive reality-TV-based rejuvenation of a music career ever.\" After signing a new recording contract with Island Records, her seventh studio album, Love?, was released in early 2011. While the album itself was a moderate commercial success, the single \"On the Floor\" was the year's highest-selling single by a female artist. It reached number three on the Billboard Hot 100, becoming her highest-charting single as a lead artist since \"All I Have\". The album produced two more singles, \"I'm Into You\" and \"Papi\". Around this time, Lopez became a brand ambassador for L'Oréal, Gilette Venus, Tous and Fiat. She also launched the Jennifer Lopez Collection, a clothing and homeware line with Tommy Hilfiger for Kohl's; the collection generated an estimated $3 billion in sales during its first year."}, {"text": "=== 2010–2015: American Idol and career rejuvenation ===Lopez returned as a judge for American Idol's eleventh season in 2012, earning a reported $20 million. That year, she released her greatest hits album Dance Again... the Hits, to fulfil her contractual obligations with her former label Epic Records. Lopez, who was divorcing Anthony and navigating the \"breakup of a family\", felt as if the album's sole single, \"Dance Again\", had come to her at the \"perfect moment\". \"Dance Again\" reached number 17 on the US Billboard Hot 100. Lopez launched the Dance Again World Tour, her first headlining concert tour, in mid-2012. It grossed over $1 million per show. Also that year, she launched Teeology, a luxury T-shirt brand."}, {"text": "=== 2010–2015: American Idol and career rejuvenation ===Lopez returned to the big screen in 2012, starring alongside an ensemble cast in the film What to Expect When You're Expecting, which is based on the book of the same name. Lopez voiced Shira, a saber tooth tiger, in the animated film, Ice Age: Continental Drift, the fourth film in the Ice Age franchise. Also in 2012, a talent show, ¡Q'Viva! The Chosen followed Lopez, Anthony, and director-choreographer Jamie King as they travelled across 21 countries in Latin America to find new talent for a Las Vegas show. In 2013, Lopez starred alongside Jason Statham in the crime thriller Parker, in which she played Leslie. Her performance earned positive reviews, with the Chicago Tribune commending the role for giving Lopez \"an opportunity to be dramatic, romantic, funny, depressed, euphoric and violent. The audience stays with her all the way\". That year, Lopez released the single \"Live It Up\", founded the mobile phone retail brand Viva Móvil, and was named chief creative officer of NuvoTV. She also served as an executive producer of the television series The Fosters (2013–2018), a show about a lesbian couple raising a family. Lopez's desire to work on the series was driven by her late aunt, who was gay."}, {"text": "=== 2010–2015: American Idol and career rejuvenation ===After a one-season absence, Lopez returned to American Idol for its thirteenth season, earning a reported $17.5 million. Her eighth studio album, A.K.A., was released in mid-2014 through Capitol Records, experiencing lacklustre sales, becoming her lowest-selling album in the US. The album produced three singles: \"I Luh Ya Papi\", featuring French Montana, \"First Love\", and \"Booty\", featuring Iggy Azalea. They reached 77, 87 and 18 respectively on the Billboard Hot 100. Also that year, Lopez released \"We Are One (Ole Ola)\", the official song for the 2014 FIFA World Cup along with Pitbull and Claudia Leitte. Lopez partnered with Endless Jewelry on a range of jewelry, and released a book, True Love, which became a New York Times best-seller."}, {"text": "=== 2010–2015: American Idol and career rejuvenation ===2015 saw the release of The Boy Next Door, an erotic thriller that Lopez both co-produced and starred in as a high school teacher who becomes involved with a student, which eventually leads to his dangerous obsession with her. The film received negative reviews from critics. Despite this, it became her most successful opening at the box office for a live action film since Monster-in-Law. Lopez had a voice role in the animated feature Home and contributed the single \"Feel the Light\" to the film's official soundtrack. She also starred in the independent drama film Lila & Eve, alongside Viola Davis."}, {"text": "=== 2016–2021: Television work, Hustlers and Super Bowl LIV ===In January 2016, Lopez commenced a concert residency show, All I Have, at Planet Hollywood's Zappos Theater in Las Vegas. She performed 120 shows during the three-year run, grossing over $100 million in ticket sales. At the beginning of the residency, Lopez signed a multi-album deal with her former label Epic Records, and released \"Ain't Your Mama\", one of her most successful singles during the 2010s. Also in 2016, she began starring in NBC's crime drama series Shades of Blue, which she also executive produced. She played Harlee Santos, a single mother and police detective who goes undercover for the FBI to investigate her own squad. The series' premiere brought NBC its most-watched Thursday debut in seven years. Starring alongside Ray Liotta, Lopez's performance received critical praise. That year, she also reprised her voice role as Shira in the animated film Ice Age: Collision Course (2016), and designed a capsule collection of shoes and jewelry in collaboration with Giuseppe Zanotti."}, {"text": "=== 2016–2021: Television work, Hustlers and Super Bowl LIV ===Lopez was executive producer and judge on NBC's dance competition series World of Dance, which was a ratings success upon its May 2017 premiere. That year, Lopez released the singles \"Ni Tú Ni Yo\" and \"Amor, Amor, Amor\", which were intended to be included on her second Spanish-language album Por Primera Vez, which was ultimately shelved. In late 2017, she was announced as the new face of clothing company Guess, becoming the oldest spokeswoman in the company's history."}, {"text": "=== 2016–2021: Television work, Hustlers and Super Bowl LIV ===In 2018, Lopez released a string of Spanish and Spanglish singles: \"Se Acabó el Amor\", \"El Anillo\", \"Dinero\" featuring DJ Khaled and Cardi B, and \"Te Guste\" with Bad Bunny. Forbes noted that the songs were unable to \"completely connect on a crossover, mainstream level\", but were more successful on US-based Latin charts, nearly all of them reaching number one on the Billboard Latin Airplay chart. In collaboration with Inglot Cosmetics, she launched a limited-edition makeup collection. She later starred in and executive produced the comedy film Second Act (2018), directed by Peter Segal; she also recorded the single \"Limitless\" for its soundtrack. Second Act earned mixed reviews from critics, but performed well at the box office, grossing $72.3 million during its theatrical run."}, {"text": "=== 2016–2021: Television work, Hustlers and Super Bowl LIV ===In the first half of 2019, Lopez embarked on an international concert tour, It's My Party, to celebrate her 50th birthday. The tour grossed an estimated $54.7 million from thirty-eight shows. Variety reported that most shows were sold out. She also signed with new label Hitco Entertainment and released the single \"Medicine\" featuring French Montana. In other 2019 activities, she became the global face of the Coach brand, launched a collection of sunglasses with the brand Quay Australia, and modeled an updated version of her Green Versace dress at Milan Fashion Week. She also became executive producer of two television series, Good Trouble and Thanks a Million."}, {"text": "=== 2016–2021: Television work, Hustlers and Super Bowl LIV ===Lopez executive produced and starred in the crime drama film Hustlers (2019). Directed by Lorene Scafaria, the film is inspired by a true story, following a group of Manhattan strippers who con wealthy men. Lopez's portrayal of a veteran stripper in Hustlers garnered acclaim from critics, with some deeming it the best performance of her acting career. The film also gave Lopez her highest opening weekend at the box office for a live action film, grossing $33.2 million. Her performance received nominations for Best Supporting Actress at the Golden Globe Awards, Screen Actors Guild Awards, Critics' Choice Movie Awards and Independent Spirit Awards; her omission from the Academy Awards nominations was widely viewed as a snub. The success of Hustlers was regarded by various media outlets as a comeback as an actress for Lopez. "}, {"text": "=== 2016–2021: Television work, Hustlers and Super Bowl LIV ===In February 2020, Lopez co-headlined the Super Bowl LIV halftime show in Miami, Florida alongside Shakira; the performance included an appearance by her child Emme Muñiz. The performance was widely praised and became the most-watched Super Bowl halftime show to date. Later that year, Lopez released the singles \"Pa' Ti\" with Maluma―which became her most successful song since 2017―and \"In the Morning\", before headlining the 2021 Dick Clark’s New Year’s Rockin’ Eve with Ryan Seacrest special on ABC. "}, {"text": "=== 2016–2021: Television work, Hustlers and Super Bowl LIV ===In January 2021, she performed at the 2021 inauguration of President Joe Biden in Washington, D.C. In business, Lopez focused on investments and creating her own brands. She launched her skin care line, JLo Beauty, released a shoe collection in partnership with DSW, and invested in companies including Hims & Hers Health, Bodyarmor SuperDrink, Goli nutritional supplements and meal delivery service Wonder. In mid-2021, she signed a multi-year deal with Netflix to produce a range of films and television shows through her own Nuyorican Productions, and released the reggaeton Spanish single \"Cambia el Paso\" with Rauw Alejandro."}, {"text": "=== 2022–present: Focus on film and This Is Me... Now ===Lopez co-produced and starred opposite Owen Wilson and Maluma in the romantic comedy Marry Me, which was released in February 2022. The film grossed over $50 million at the box office while becoming the most-streamed day-and-date film on Peacock, and received generally mixed reviews from critics. Lopez also released a soundtrack for the film, with Maluma, which generated the singles \"On My Way\" and \"Marry Me\". In March 2022, Lopez was appointed as the chief \"entertainment and lifestyle\" officer of the cruise line, Virgin Voyages. Her next project was the documentary Jennifer Lopez: Halftime, which focuses on her life following the release of Hustlers and in preparation for her Super Bowl performance. Released on Netflix in June 2022 following its premiere at the Tribeca Film Festival, it garnered generally positive reviews from film critics. In September, Lopez was announced as the global ambassador of Italian lingerie label Intimissimi. The following month, Jimmy Fallon and Lopez released a children's book, Con Pollo: A Bilingual Playtime Adventure, which became a New York Times best-seller."}, {"text": "=== 2022–present: Focus on film and This Is Me... Now ===Lopez co-produced and starred opposite Josh Duhamel and Jennifer Coolidge in the action-comedy Shotgun Wedding, which was released on Amazon Prime Video in January 2023. It became one of the top-streamed films on Prime Video that year. She also led and co-produced the action thriller feature The Mother, directed by Niki Caro and released on Netflix in May 2023. The film received mixed reviews, but became the most-watched film on the platform in 2023. That September, she entered a \"recording and publishing\" partnership with BMG Rights Management, in conjunction with her Nuyorican Productions. Lopez's business ventures in 2023 included: launching a spritz brand named Delola, a collaboration between her lifestyle brand J.Lo by Jennifer Lopez and fashion retailer Revolve, and a footwear line, JLO Jennifer Lopez, which was released as three collections in March, May, and June."}, {"text": "=== 2022–present: Focus on film and This Is Me... Now ===Lopez's ninth studio album This Is Me... Now, a sequel album to This Is Me... Then (2002), was released by Nuyorican and BMG on February 16, 2024. The album formed part of a \"three-part multimedia project\" which included a companion musical film, This Is Me... Now: A Love Story directed by Dave Meyers, and a documentary, The Greatest Love Story Never Told, both of which were released on Prime Video. Lopez plays a fictionalized version of herself in A Love Story, which was described as an \"autobiographical musical rom-com action sci-fi\"; Tim Jonze of The Guardian suggested that Lopez had possibly invented the \"therapy-musical biopic\" genre. After potential partners backed out, Lopez financed the film herself for $20 million before Amazon subsequently purchased it. \"Can't Get Enough\" was released as the album's lead single. Lopez also released a lingerie collection with Intimissimi which was inspired by the album. She is set to embark on the This Is Me... Live tour in North America, beginning June 2024. "}, {"text": "==== Upcoming projects ====Lopez filmed the sci-fi thriller Atlas from September to November 2022 in Los Angeles and New Zealand, her third project under her Netflix deal. She will star alongside Jharrel Jerome in William Goldenberg's biographical wrestling drama Unstoppable, produced by Ben Affleck and Matt Damon, and based on the life of wrestler Anthony Robles. Lopez has signed on to star in the Bill Condon-directed film adaptation of the Broadway musical Kiss of the Spider Woman, which she will also executive produce. It is her first role in a full-fledged musical; filming will begin in April 2024 in New Jersey. She has also committed to lead and co-produce Netflix's film adaptation of the bestselling novel, The Cipher. She has several projects in the works as a producer. In May 2024, Lopez will co-host the annual Met Gala in Manhattan."}, {"text": "== Personal life ==Lopez was in a nearly decade-long relationship with David Cruz, her high school boyfriend, until the mid-1990s. The couple were engaged at one point, and Cruz relocated to Los Angeles to be with Lopez when she began pursuing her career. She would later say of Cruz, \"You get lucky, you have a first love like that.\" She was married to Cuban waiter Ojani Noa from February 1997 to January 1998. In subsequent court cases, Noa was prevented from publishing a book about their marriage and from using private honeymoon footage of Lopez in a documentary. "}, {"text": "== Personal life ==Lopez was in an on again–off again relationship with record producer and rapper Sean Combs (then known as \"Puff Daddy\") from 1999 to early 2001. On the night of December 27, 1999, Lopez and Combs were arrested and charged with criminal possession of a weapon and possession of stolen property, after leaving the scene of a shooting at a Times Square nightclub. Charges against Lopez were dropped within an hour while Combs was acquitted of all charges at trial in early 2001. They broke up shortly thereafter. Lopez later said that, while she had \"cared very much\" about Combs, their \"crazy, tumultuous\" relationship \"was always something I knew would end.\" She was married to Cris Judd, her former backup dancer, from September 2001 to January 2003."}, {"text": "== Personal life ==Before her divorce with Judd was finalized, Lopez was in a relationship with actor and filmmaker Ben Affleck from mid-2002 to early 2004. Although they had crossed paths several times before (including at the 70th Academy Awards and at the premiere of Armageddon,  both in 1998), the first major meeting was on the set of Gigli (2003) in December 2001. They later worked together on the music video for \"Jenny from the Block\" and the film Jersey Girl (2004). Her album This Is Me... Then was dedicated to and inspired by Affleck. Their relationship was extensively publicized. Tabloids referred to the couple as \"Bennifer\", a portmanteau Vanity Fair described as \"the first of that sort of tabloid branding\". They became engaged in November 2002, but their planned wedding on September 14, 2003, was postponed with four days' notice because of \"excessive media attention\". They ended their engagement in January 2004. Years later, Lopez said Affleck's discomfort with media scrutiny was one reason for their split and described it as her \"first real heartbreak\": \"I think different time, different thing, who knows what could've happened, but there was a genuine love there.\""}, {"text": "== Personal life ==After her relationship with Affleck, Lopez stopped discussing her personal life in interviews. She was married to singer Marc Anthony from June 2004 to June 2014; they had previously worked together and dated for a few months in the late 1990s. Their wedding took place five months after the end of her relationship with Affleck. During their marriage, they collaborated on music and performed together, as well as co-starring in El Cantante (2006). Lopez gave birth to fraternal twins, a boy and a girl, on Long Island in February 2008. People paid a reported US$6 million for the first photographs of the twins, making them the most expensive celebrity pictures ever taken at the time. In 2009, Anthony and Lopez purchased a stake in the Miami Dolphins. The couple announced their separation in July 2011. Anthony filed for divorce in April 2012 and it was finalized in June 2014. Lopez retained primary physical custody of the two children. Lopez occasionally performs with Emme."}, {"text": "== Personal life ==Lopez had an on again-off again relationship with her former backup dancer Casper Smart from October 2011 to August 2016. She dated New York Yankees baseball player Alex Rodriguez from February 2017 to early 2021. They became engaged in March 2019 but postponed their wedding twice due to the COVID-19 pandemic. In response to tabloid speculation about the state of their relationship, they released a statement in March 2021, saying they were \"working through some things\". They announced the end of their relationship in April 2021."}, {"text": "== Personal life ==In April 2021, Lopez and Affleck were reported to be dating again, with Lopez publicly confirming their rekindled relationship that July. In April 2022, Lopez announced their second engagement, 20 years after the first proposal. They were married in Las Vegas on July 16, 2022, and held a wedding celebration for family and friends the following month."}, {"text": "=== Philanthropy ===Following the September 11 attacks, Lopez was heavily involved in charitable activities. Joining other artists, she was featured on charitable singles such as \"What's Going On\" and \"El Ultimo Adios (The Last Goodbye)\", which benefited people affected by the tragedy. In February 2007, Lopez was honored with the Artists for Amnesty prize by Amnesty International for her work in Bordertown, which shed light on the hundreds of feminicides in Ciudad Juárez. Lopez described it as \"one of the world's most shocking and disturbing, underreported crimes against humanity\". That year, one dollar from each ticket sold at Lopez and Anthony's co-headlining North American concert tour, which grossed an estimated $10 million, was donated to the Run for Something Better program, which fights childhood obesity."}, {"text": "=== Philanthropy ===Lopez has been a long-time supporter of the Children's Hospital Los Angeles. Her album Rebirth (2005) is dedicated to Paige Peterson, an eleven-year-old cancer patient she befriended at the hospital who died in 2004. Lopez stated that \"[she doesn't] like to do [her] charity work in public. That's not what you do it for.\" In 2009, Lopez launched the Lopez Family Foundation (originally known as the Maribel Foundation) alongside her sister, Lynda. The organization works to increase healthcare access for underprivileged women and children, including through a telemedicine program in partnership with the Children's Hospital Los Angeles. The foundation has facilitated the expansion of medical facilities in Panama and Puerto Rico, and created the Center for a Healthy Childhood at Montefiore Medical Center in the Bronx."}, {"text": "=== Philanthropy ===In December 2012, Lopez held a charity drive to benefit her three favorite charities: the Gloria Wise Boys and Girls Club, the Children's Hospital Los Angeles and the American Red Cross, mainly benefiting victims of Hurricane Sandy. In May 2015, she became the first celebrity spokesperson for the Children's Miracle Network Hospitals and the BC Children's Hospital Foundation (BCCHF), appearing in a campaign entitled \"Put Your Money Where the Miracles Are\". That September, she became the first Global Advocate for Girls and Women at the United Nations Foundation. This role sees her mobilizing action to address issues including maternal health care programs, education and violence against women."}, {"text": "=== Philanthropy ===In September 2017, following Hurricane Irma and Hurricane Maria, Lopez donated $1 million from the proceeds of her Las Vegas residency to humanitarian aid for Puerto Rico. Along with Marc Anthony, she launched a humanitarian relief campaign entitled Somos Una Voz (English: We Are One Voice), an effort supported by various celebrities to rush supplies to areas affected by Hurricane Maria. Lopez and Anthony presented a subsequent concert and telethon for disaster relief, \"One Voice: Somos Live!\", which raised over $35 million. She was also among various artists featured on Lin-Manuel Miranda's charity single \"Almost Like Praying\" which benefits Puerto Rico."}, {"text": "=== Philanthropy ===As of 2021, Lopez continues to regularly donate to and support charities. In September 2021, she launched her own philanthropic organization, Limitless Labs, that supports and empowers Latina entrepreneurs and business owners. Lopez announced a partnership between the venture and the 10,000 Small Businesses initiative. In June 2022, Lopez and Limitless Labs partnered with nonprofit Grameen America as a national ambassador to empower women-led Latina businesses with $14 billion in business loans and \"6 million hours of financial education and training by 2030.\" Lopez has performed at charity concerts throughout her career, including the Los Angeles Dodgers Foundation's Blue Diamond Gala in 2022, which raised $3.6 million for education, health care, homelessness and social justice causes."}, {"text": "=== Political views and activism ===A supporter of the Democratic Party, Lopez has a long history of backing Democratic candidates for public office. She endorsed President Barack Obama in his 2012 presidential campaign, speaking in television advertisements and attending fundraising events for Obama. She endorsed Democratic presidential nominee Hillary Clinton in 2016, headlining a free concert in Florida in support of her that October."}, {"text": "=== Political views and activism ===Lopez was critical of President Donald Trump during his presidency. During her Super Bowl halftime show performance in 2020, she performed her song \"Let's Get Loud\" while cloaked in a large Puerto Rican flag, with children in metal cages displayed on the field. It was interpreted as a statement about the Mexico–United States border crisis and Trump's immigration policy. The NFL attempted to remove the cages from the performance but Lopez refused. She endorsed President Joe Biden in his 2020 presidential campaign. She later performed at Biden's 2021 inauguration, where she sang \"This Land Is Your Land\" and \"America the Beautiful\", while reciting the last phrase of the Pledge of Allegiance in Spanish. She also worked \"Let's Get Loud\" into the performance as a \"reprise\" to her political message at the Super Bowl."}, {"text": "=== Political views and activism ===Lopez is an avid supporter of LGBT rights, and has raised millions of dollars for HIV/AIDS research. In June 2013, amfAR presented her with its humanitarian award for her philanthropic work. That September, she was awarded the Ally for Equality award presented by the Human Rights Campaign, for her support of the LGBT community. The following year, she received the GLAAD Vanguard Award. In July 2016, Lopez released a single entitled \"Love Make the World Go Round\", a collaboration with Lin-Manuel Miranda, which benefits victims of the Orlando nightclub shooting. She was also featured on the song \"Hands\" along with numerous other artists, also benefiting those affected by the Orlando shooting. Lopez signed an open letter from Billboard magazine to the United States Congress in 2016, which demanded action on gun control."}, {"text": "=== Political views and activism ===In June 2020, Lopez attended a Black Lives Matter movement protest in Los Angeles, in connection with the broader George Floyd protests. Lopez has also been an active advocate for the Time's Up movement. In January 2022, she became one of the Co-Chairs for Michelle Obama's When We All Vote. She expressed solidarity with the people of the Gaza Strip during the 2023 Israel–Hamas war. Lopez, as part of a group called Artists4Ceasefire, signed a letter urging President Joe Biden to call for an immediate ceasefire in Gaza."}, {"text": "=== Influences ===Lopez has cited Madonna as her \"first big musical influence\", explaining \"It was all about Madonna for me. She inspired me to want to sing, to dance, to work hard.\" Her other major influences include Tina Turner, James Brown, and Michael Jackson. Another major influence on Lopez is Barbra Streisand, stating that, \"watching her career over the years, watching her sing and act and direct, was very inspiring to me.\" Lopez has cited Janet Jackson as a major inspiration for her own dance and videos, stating that she \"probably started dancing\" because of Jackson's music video for \"The Pleasure Principle\". She also looked to the careers of Cher, Bette Middler and Diana Ross, and has been inspired by younger artists such as Lady Gaga."}, {"text": "=== Influences ===Growing up, she was influenced by Latin music styles ranging from salsa to bachata, and artists including Celia Cruz and Tito Puente. However, it was the hip hop song \"Rapper's Delight\" (1979) by The Sugarhill Gang that she said changed her life. Another key inspiration for Lopez in her youth was Puerto Rican actress Rita Moreno's performance in the musical film West Side Story (1961). Moreno was the only performer Lopez was able to identify with, at a time when Latinos were rarely on television."}, {"text": "=== Musical style ===Musically, Lopez is described as a \"chameleon\" by outlets like Variety and Forbes, having been known to experiment and jump between genres. Her music strongly identifies with hip hop while exploring the \"romantic innocence\" of Latin music. Billboard observed that she has \"never been one to downplay her Latinidad, and always makes sure to display it\" in her music, \"regardless of genre\". On the 6 and J.Lo, described by Lopez as Latin soul, fuse a wide range of Latin genres with R&B and hip hop, while also containing dance-pop. While mostly English, the albums include some Spanish and bilingual songs such as \"Cariño\", with Lopez also speaking in Spanish and asserting her Latin identity on songs like \"Let's Get Loud\". A departure from her previous work, This Is Me... Then blends 1970s soul with \"streetwise\" hip hop. Rebirth was noted for its \"relaxing\" atmosphere, while Como Ama una Mujer was characterized as \"silkily Spanish Sade worship\"."}, {"text": "=== Musical style ===Described as autobiographical, much of Lopez's music has centered around the \"ups and downs\" of love. Lyrically, This Is Me... Then is largely focused on her relationship with Ben Affleck, with the song \"Dear Ben\" being described as the album's \"glowing centerpiece\". Its sequel album, This Is Me... Now, was informed by her reunion and marriage with Affleck; Lopez called it an \"emotional, spiritual, and psychological journey of the past two decades\". Como Ama una Mujer features introspective lyrics about romance, heartache and self-loathing. Regarding Love?, Lopez stated: \"There's still so much to learn and that's why the question mark.\" Other recurrent themes in Lopez's music have included her upbringing in the Bronx, social class and women's empowerment."}, {"text": "=== Musical style ===Lopez has received mixed reviews for her \"light\" soubrette voice, which critics have deemed limited, \"radio-friendly\" and overshadowed by her music's production. With On the 6, The Baltimore Sun regarded Lopez as having a \"breathy\" stylistic range but lacking personality, while Rolling Stone remarked: \"Instead of strained vocal pyrotechnics, Lopez sticks to the understated R&B murmur of a round-the-way superstar who doesn't need to belt because she knows you're already paying attention ... She makes a little va-va and a whole lot of voom go a long way.\" "}, {"text": "=== Musical style ===In reviewing Love?, AllMusic called her voice \"slight\" and wrote: \"Lopez was never, ever about singing; she was about style\". Pitchfork described her \"notoriously serviceable, airy and light\" voice as being \"stronger than ever\" on This Is Me... Now, while noting that \"the thinness of the voice has often been beside the point, if not a boon to her early career\", which was marked by \"Bronx regularness\". Lopez has been criticized for her use of background vocals from demo singers, prompting rumors of ghost singers' vocals being used in place of her own. The rumors have been debunked by producers and background singers who worked with Lopez. Christina Milian, who is credited as a writer and background singer on \"Play\", called the controversy \"funny\" and said: \"It's no different than Michael Jackson having background singers on songs or Britney Spears. This is what music is made of.\""}, {"text": "=== Dance, videos and stage ===Considered one of dance's \"greatest success stories\", Lopez has received praise for her highly choreographed dancing, and is noted for her technical skill. Lopez, who felt an emotional connection to dance since her youth, has been trained in a range of dance styles, including ballet, jazz, flamenco, ballroom, pole dancing, breakdancing, street dance, and hip hop. A dominant figure on MTV since early in her career, she is known for her body-emphasizing music videos and provocative choreography. CNN's Holly Thomas stated that \"Lopez's years of professional dance experience gave her a captivating, commanding presence in her videos.\" Madeline Roth of MTV wrote: \"Her diverse videography encompasses some of the most memorable visuals of the 21st century\", with Rolling Stone writer Brittany Spanos observing that her \"dancing skills and ability to toy with her own celebrity have made her videos an important part of the new millennium's pop canon\". Her videography has sometimes attracted controversy for its sexual suggestiveness, and has been noted for its influence on 2000s fashion trends."}, {"text": "=== Dance, videos and stage ===On stage, Lopez is recognized for her showmanship, sex appeal, and costumes, which often include bodysuits. Author Priscilla Peña Ovalle stated in Dance and the Hollywood Latina: Race, Sex and Stardom (2011) that Lopez was one of the Latin stars who \"used dance to gain agency as working performers with mainstream careers, yet many of their roles paradoxically racialized and sexualized their bodies\". Troy Patterson of Entertainment Weekly also observed that she used her body for emphasis on stage, \"She turned herself out as the fly girl hyperversion of postfeminist power, flaunting her control by toying with the threat of excess. In consequence, her star went supernova.\" Her signature movements include \"clock-wise pivoting with salsa hip circles and sequential torso undulations\". While being noted to lip sync in the early stages of career, Lopez's Dance Again World Tour was praised for showcasing live vocals and choreography synchronously. In a review of her Las Vegas residency All I Have, Los Angeles Times writer Nolan Feeney remarked that her dancing is \"undoubtedly the centerpiece of the show\"."}, {"text": "=== Dance, videos and stage ===Her provocative stage performances have also drawn scrutiny at times. Robin Givhan of The Daily Beast criticized Lopez's performance at the 2011 American Music Awards where she wore a nude bodysuit, stating that it \"cried out for attention in all the wrong ways\" and was \"banal exhibitionism\". In May 2013, her performance on the finale of the television series Britain's Got Talent was deemed inappropriate for family-friendly television, and drew viewer complaints to Ofcom. Following her controversial performance at the musical festival Mawazine in 2015, Moroccan Prime Minister Abdelilah Benkirane called it \"indecent\" and \"disgraceful\", while an education group claimed that she \"disturbed public order and tarnished women's honor and respect\"."}, {"text": "=== Acting and screen ===Lopez's films often see her playing \"relatable everywomen\", with Cady Lang of Time writing: \"A longtime hallmark of Lopez’s filmography is her penchant for stories about survivors. Her characters are never shrinking violets.\" Discussing the roles she is drawn to, Lopez said in 1998: \"I don't think of them as strong women ... I like characters that are really part of the story as opposed to window dressing, but I think the interesting thing is that they are real people. Nobody walks around being strong all the time.\""}, {"text": "=== Acting and screen ===Film critic Stephanie Zacharek described Lopez as \"one of the most gifted and appealing performers of the past two decades ... and yet the movies have rarely known what to do with her and her significant gifts as an actor.\" While Lopez received acclaim for her early film work, The New York Times writer Kyle Buchanan noted that her tendency to star in romantic comedies, and her pop music career, \"lowered her critical bona fides\". Taylor Hackford, who directed Lopez in Parker, said she \"can really act\": \"She knows how to transmit nuances, to make the subtlest of shifts. Does she have humor? Yes. But at the same time she can get into the deepest dramatic areas.\" Lopez, who identifies the romantic comedy as her favorite film genre, has been referred to as the \"Patron Saint of Romantic Comedies\" and the \"Queen of Romantic Comedies\"."}, {"text": "=== Acting and screen ===In her early films, Lopez played stereotypical roles which signified her as a \"racialized, exoticized\" other. In films such as Blood and Wine and U Turn, her body is fetishized \"through extreme close-ups\" and \"framed as animalistic, primitive, and irresistibly dangerous to the Anglo American male characters.\" This shifted with her role in Selena, which \"affirmed her Latinx identity, and won her the loyalty of that significant section of the US and global audience.\" She has also been criticized for playing ethnically ambiguous parts and tapping into \"the ability to perform a panethnic other\" to commodify herself. Her role as an Italian woman in The Wedding Planner has been described as \"a case of classic Hollywood whitewashing.\""}, {"text": "== Public image ==Lopez has been a polarizing figure in popular culture. Andrew Barker of Variety writes that she \"exhibits a plethora of contradictions\", observing: \"Despite a carefully cultivated image as an imperious pop empress in ludicrously expensive outfits, her signature hits bear the titles 'I'm Real' and 'Jenny From the Block'.\" In 2002, Lynette Holloway of The New York Times described Lopez's image as including \"a dash of ghetto fabulousness\" and \"middle-class respectability\" for mass appeal. The media discerned a shift in her public image upon joining American Idol in 2011, with Entertainment Weekly writing: \"Gone was her old cut-a-bitch swagger; J. Lo 2.0 is an all-embracing, Oprahfied earth madre.\" People editor Peter Castro said American Idol made Lopez \"a celebrity of the people\" whereas before, \"there was a huge distance with the American public.\""}, {"text": "== Public image ==Lopez is widely celebrated for her curvaceous hourglass figure, which earned her the nickname La Guitarra (the guitar). Vanity Fair described her buttocks as \"in and of themselves, a cultural icon\". Recounting her experience on early films, Lopez stated: \"I've always had costume people looking at me a little weary and immediately fitting me out with things to hide my bottom.\" She often wears revealing outfits to accentuate her curves. Author Mary Beltrán opined that for Lopez to \"unashamedly display her well-endowed posterior during this time period\" could be viewed as \"a revolutionary act with respect to Anglo beauty ideals\". However, she was also criticized for perceived changes in her image upon launching her music career, which included \"weight loss and lightening her hair\"."}, {"text": "== Public image ==Considered a fashion icon, Lopez is known for her sense of style and \"breaking fashion rules\". She is recognized for both her \"bold\" red carpet fashion and her everyday street style, which is \"discussed ad infinitum by the fashion press.\" British Vogue said she \"added megawatt glamour to every outfit she wore\", with Billboard describing her style as \"scantily clad\". Lopez's style has been influenced by \"women who epitomize old Hollywood glamour like Rita Hayworth\", as well as her Bronx upbringing and Nuyorican identity. Described as the \"ultimate sex symbol\" of the early 21st century, various publications have ranked her as the most beautiful or sexiest woman in the world, including People, People en Español, Vibe, Details, and FHM, with Lopez topping the latter's 100 Sexiest Women list twice. Lopez has criticized \"this funny notion in America that you can't be a mom and be sexy\", stating: \"The truth is that women can be sexy until the day they die.\""}, {"text": "== Public image ==Described as \"one of the most photographed women in the world\", Lopez has been a tabloid fixture, and admits to having a \"less-than-perfect\" public image. Frances Negrón-Muntaner wrote that by 1999, \"Internet chat rooms exploded with anti-Lopez babble\" and she became \"one of the easiest moving targets for cheap laughs as well as anxieties about working-class ‘loud’ sexuality and specifically Latino visibility.\" Much of the media coverage surrounding Lopez in the 2000s \"focused on her dramatic private life\", with several writers describing her as overexposed at the time, despite her continued success. Media outlets often compare her to actress Elizabeth Taylor, due to her numerous failed relationships and glamorous public persona. Her high-profile relationship with Combs was described as having \"defined an age\", with Vanity Fair writing that they entered \"the pantheon of slightly notorious celebrity couples: Liz and Dick, Frank and Ava.\""}, {"text": "== Public image ==Throughout her career, she has also received a bad reputation as being a demanding and outspoken \"diva\", something which she denies, stating: \"I've always been fascinated by how much more well-behaved we have to be than men.\" Some of the backlash and fabricated tabloid stories surrounding Lopez have been attributed to her 1998 interview with Movieline, in which she was quoted as criticizing various actors and directors. Lopez, who \"cried for hours\" after the article was published, said the comments were made in jest and she was \"so misquoted and so taken out of context\". In 2003, Lawrence Donegan of The Guardian posited that \"indefensible\" misogyny and racism were to blame for her position as \"the most vilified woman in modern popular culture\". In 2021, Ben Affleck said: \"People were so fucking mean about her; sexist, racist, ugly vicious shit was written about her in ways that if you wrote it now, you would literally be fired for saying some of the things you said.\""}, {"text": "=== Entertainment industry ===Lopez is regarded as the most influential Latin entertainer of all time, credited with breaking racial barriers in the entertainment industry. She was described as \"the first Latina superstar\" by writer Ned Zeman, and the \"embodiment of the American Dream\" by Robert C. Cottrell in Icons of American Popular Culture (2009). Often dubbed the \"Queen of Dance\", she is considered a triple threat performer, and was one of few actors to successfully cross over into music. Rachel Sklar of The Huffington Post called Lopez a trailblazer, writing: \"Beyoncé, Miley, Gaga, any actress who's ever released an album — they are all standing on the shoulders of J.Lo. She was a true triple threat — actress, singer, dancer ... and packaged it sometimes outrageously but always sexily.\" Lopez is considered a pop icon, with VH1 ranking her at number 15 on their list of 200 Greatest Pop Culture Icons, number 16 on 100 Greatest Women In Music, and number 21 on 50 Greatest Women of the Video Era. "}, {"text": "=== Entertainment industry ===The highest-paid Latina actress in history, Lopez's film career has been credited with paving the way for greater representation of Latino Americans in Hollywood, which was historically a \"whites-only preserve\". Biographer Kathleen Tracy opined that \"Lopez blazed a trail no openly Latin actress had gone before\", noting that previous Latina stars cosmetically downplayed their ethnicity and changed their names. With Out of Sight (1998), she achieved \"ethnic 'blind' casting\", making her an \"anomaly in the traditionally white space\" of mainstream Hollywood. By deliberately avoiding stereotypical roles, biographer James Robert Parish said Lopez \"helped minimize racial boundaries in show business.\" Her perceived Academy Award snub for Hustlers (2019) was referenced by Los Angeles mayor Eric Garcetti when announcing a new initiative for Latino representation in Hollywood."}, {"text": "=== Entertainment industry ===With her musical debut, Lopez contributed to the 1990s \"Latin explosion\" in entertainment; The Recording Academy called her the \"breakout female star\" of the Latin pop movement in American music. Historian Roger Bruns considered her \"an influential force in driving a growing Latin cultural influence in popular music\" at the time. Her career ascent has been credited with paving the way for American-born Latina pop artists including Selena Gomez and Becky G, and for Latin American pop artists to venture into English music, including Shakira, Thalía and Paulina Rubio. Along with Ricky Martin, she helped increase the visibility of Latin music in international markets including East Asia and Canada. Due to her \"multi-tasking career\", she has been described as \"the next-generation Madonna\", and \"the first woman to demonstrate that a Madonna could be a Latina\". "}, {"text": "=== Entertainment industry ===Lopez's music has been credited with helping influence the trajectory of 2000s music, including dance music, Latin music, R&B, and pop rap collaborations. Billboard named her the \"Greatest Pop Star\" of the year 2001. Scholar Miriam Jiménez Román suggested that Lopez, who represents the \"often-suppressed\" history of Puerto Ricans in hip hop culture, was \"able to traverse the difficult racial boundaries\". In 2011, following her return to prominence, Lopez was deemed the \"world's greatest musical comeback act\", based on a study which analysed over one billion Google searches since 2004. In July 2023, Madame Tussauds New York unveiled a wax figure of Lopez inspired by her performance at the Super Bowl LIV halftime show. The figure celebrates her lasting legacy as a multifaceted entertainer."}, {"text": "=== Cultural influence ===Lopez was named one of Time's 100 most influential people in the world in 2018. In 2012, Forbes ranked her as the world's most powerful celebrity and the 38th most powerful woman. Latina magazine founder Christy Haubegger attributed Lopez's influence to her being \"the first icon that generationally fits\" young Latino Americans who followed celebrity culture. Lopez was featured on the first cover of Latina in 1996, with editor Galina Espinoza writing in 2011 that there is \"no recounting of modern Latina history without Jennifer\"."}, {"text": "=== Cultural influence ===Jonathan Van Meter of Vogue described Lopez as having \"changed the face of modern celebrity.\" Her ability to start trends has prompted the usage of the phrase \"the J.Lo effect\" in popular culture, which has been used in various different contexts, including the trend of networks hiring \"big name\" judges for reality competition programs after Lopez's successful casting on American Idol. With her moniker J.Lo, Lopez started a trend of celebrities being given abbreviated nicknames, while \"Bennifer\" began the convention of celebrity couple name blending. "}, {"text": "=== Cultural influence ===Described by scholar Helene A. Shugart of the University of Utah as \"arguably the most visible Latina in contemporary mainstream popular culture\", Lopez has been the subject of considerable academic analysis, including in relation to ethnicity, class, \"body politics\", race, Latin culture, and gender. While credited with opening \"the door to [Latino culture having a] broader appeal\", Lopez has also been a polarizing figure, generating \"often vehement disagreement about what is and isn't Latino.\""}, {"text": "=== Cultural influence ===As a result of the public emphasis on her curvaceous figure, Lopez has been credited with influencing a shift in cultural beauty standards. The surge in popularity of buttock augmentation surgery in the early 2000s was attributed to Lopez. In Latin Sensations (2001), Herón Marquez wrote: \"Because she wasn't rail thin, Lopez had broken the mold ... Suddenly, it was okay for women to have hips, curves, and a big backside.\" This has been considered a sign of Lopez's social power in \"changing cultural standards within the mainstream media as a whole\". "}, {"text": "=== Cultural influence ===In 2014, scientists named a species of aquatic mite found in Puerto Rico, Litarachna lopezae, after Lopez. In Tok Pisin, a language spoken in Papua New Guinea, the term palopa is used to describe non-heteronormative people whose identities may correlate with western definitions of homosexual men or trans women; its etymology is derived from the name Jennifer Lopez. In 2019, she was presented with keys to the city of Miami Beach, with July 24 being declared \"Jennifer Lopez Day\"."}, {"text": "=== Fashion and branding ===The Council of Fashion Designers of America presented Lopez with its Fashion Icon Award in 2019 for her \"long-standing and global impact on fashion\". Her green Versace \"Jungle Dress\" was voted the fifth most iconic red carpet dress of all time in a poll run by The Daily Telegraph. The dress had a significant impact on the fashion industry, celebrity endorsements, and the evolution of red carpet fashion. The images of Lopez wearing the dress became the most popular search query of all time at that point, and subsequently led to the creation of Google's image search. Lopez has been credited with popularizing various fashion and beauty trends throughout her career. In 2003, she inspired a trend of curvier mannequins being designed, which fuelled a rise in sales for manufacturers and retailers. Lopez's personal style and brand deals have had a considerable effect on sales in the fashion industry. The success of Louis Vuitton's fall 2003 campaign, for which Lopez was the brand's model, led to more Hollywood stars \"becoming image models of fashion and cosmetic labels\". In 2021, The Daily Telegraph reported that she was among ten celebrities whose personal style choices drove the greatest spikes in searches and news coverage for brands. Her appearance at Milan Fashion Week in 2019 generated over $31.8 million in total media impact value. "}, {"text": "=== Fashion and branding ===Described as a \"branding pioneer\", Lopez has been credited with ushering in a new era of celebrity branding. Her first fragrance, Glow by JLo, influenced the rise of celebrity fragrances in the 2000s. Her fragrance line became the most successful celebrity line in the world, with sales exceeding $2 billion as of 2012. Lopez's clothing brand was one of the first celebrity fashion lines; scholars have credited her with redefining \"how fashion is produced and entwined with other artistic endeavors\", and popularizing a trend of utilizing racial ambiguity for branding purposes in fashion and cosmetics."}, {"text": "== Achievements ==As of 2018, Lopez has sold more than 80 million records worldwide and her films have grossed a cumulative total of US$3.1 billion. She remains the only female entertainer to have a number one album and film simultaneously in the United States. With J.Lo (2001), Lopez became the first female solo recording artist under Epic Records to achieve a number one album in the United States since its inception in 1953. J to tha L-O! The Remixes (2002) was acknowledged by the Guinness World Records as the first number one remix album on the US Billboard 200. Lopez's single \"On the Floor\" is among the best-selling singles of all time, and its music video was recognized as the \"Highest Viewed Female Music Video of All Time\" by Guinness World Records in 2012. Lopez was named the top Billboard Hot 100 female artist of 2001. Billboard ranked her as the ninth greatest dance club artist of all time in 2016, having scored 18 number-one songs on its Dance Club Songs chart. She was named the top Latin touring artist of the decade by Pollstar in 2021."}, {"text": "== Achievements ==In 2010, Lopez was honored by the World Music Awards with the Legend Award for her contribution to the arts.  In 2013, she was presented with the prestigious landmark 2,500th star on the Hollywood Walk of Fame for her musical contributions, and Univision presented her with the World Icon Award in its Premios Juventud. In 2014, she became the first female recipient of the Billboard Icon Award. In 2017, she was awarded the Telemundo Star Award at the Billboard Latin Music Awards. In 2018, Lopez received the Michael Jackson Video Vanguard Award at the 2018 MTV Video Music Awards, making her the first Latin performer to receive the honor since its introduction in 1984. In 2022, she received the Generation Award at the MTV Movie & TV Awards for her contributions to film and television, and the Icon Award at the iHeart Radio Music Awards."}, {"text": "== Filmography ==Films starred"}, {"text": "== Bibliography ==Lopez has written a memoir and co-written one children's book so far."}, {"text": "== Bibliography ==Lopez, Jennifer. True Love. Celebra, 2014. ISBN 9780451468680."}, {"text": "== Bibliography ==Lopez, Jennifer and Jimmy Fallon (authors). Con Pollo: A Bilingual Playtime Adventure. Feiwel & Friends, 2022. ISBN 9781250876362."}, {"text": "== Tours and residencies ==Headlining tours"}, {"text": "== Tours and residencies ==Dance Again World Tour (2012)"}, {"text": "== Tours and residencies ==It's My Party Tour (2019)"}, {"text": "== Tours and residencies ==This Is Me... Live (2024)"}, {"text": "== Tours and residencies ==Co-headlining tours"}, {"text": "== Tours and residencies ==Jennifer Lopez & Marc Anthony en Concierto (2007)"}, {"text": "== Tours and residencies ==Enrique Iglesias & Jennifer Lopez Tour (2012)"}, {"text": "== Tours and residencies ==Residencies"}, {"text": "== Tours and residencies ==Let's Get Loud (2001)"}, {"text": "== Tours and residencies ==Jennifer Lopez: All I Have (2016–2018)"}, {"text": "== See also ==History of women in Puerto Rico"}, {"text": "== See also ==List of artists who reached number one in the United States"}, {"text": "== See also ==List of dancers"}, {"text": "== See also ==List of Puerto Ricans"}, {"text": "== See also ==Mami (hip hop)"}, {"text": "== See also ==Nuyorican"}, {"text": "== See also ==List of most-followed Instagram accounts"}, {"text": "== External links ==Jennifer Lopez – official site"}, {"text": "== External links ==JLo Beauty – official beauty site"}, {"text": "== External links ==Jennifer Lopez at AllMusic"}, {"text": "== External links ==Jennifer Lopez at AllMovie"}, {"text": "== External links ==Jennifer Lopez discography at Discogs "}, {"text": "== External links ==Jennifer Lopez at IMDb"}, {"text": "== External links ==Appearances on C-SPAN"}]