[{"text": "James Joseph \"Jim\" Parsons (born March 24, 1973) is an American actor and producer. From 2007 to 2019, he played Sheldon Cooper in the CBS sitcom The Big Bang Theory. He has received various awards, including four Primetime Emmy Awards for Outstanding Lead Actor in a Comedy Series and the Golden Globe Award for Best Actor in a Television Series Musical or Comedy. In 2018, Forbes estimated his annual salary to be $26.5 million and named him the world's highest-paid television actor.Parsons made his Broadway debut portraying Tommy Boatwright in the Larry Kramer play The Normal Heart (2011). He has since returned to Broadway acting in the plays Harvey (2012), An Act of God (2015), The Boys in the Band (2018), and Mother Play (2024)."}, {"text": "In film, Parsons has voiced the lead character in Home (2015) and played supporting roles in Hidden Figures (2016), A Kid Like Jake (2018), Extremely Wicked, Shockingly Evil and Vile (2019), The Boys in the Band (2020), and Spoiler Alert (2022). On television he was Emmy-nominated for playing Tommy Boatwright in the HBO film The Normal Heart (2011) and Henry Willson in the Netflix series Hollywood (2020)."}, {"text": "== Early life and education ==Parsons was born at St. Joseph Hospital in Houston, Texas, and was raised in one of its northern suburbs, Spring. He is the son of Milton Joseph \"Mickey/Jack\" Parsons Jr. and teacher Judy Ann (née McKnight). His sister, Julie Ann Parsons, is also a teacher.After playing the role of the Kola-Kola bird in a school production of The Elephant's Child at age six, Parsons was determined to become an actor. He attended Klein Oak High School in Spring. Parsons points to a role in Noises Off during his junior year as the first time \"I fully connected with the role I was playing and started to truly understand what it meant to be honest on stage.\" The young Parsons was heavily influenced by sitcoms, particularly Three's Company, Family Ties, and The Cosby Show.After graduating from high school, Parsons earned a BA degree in Theater from the University of Houston. He was prolific during this time, appearing in 17 plays in three years. He was a founding member of Infernal Bridegroom Productions and regularly appeared at the Stages Repertory Theatre. Parsons enrolled in graduate school at the University of San Diego in 1999. He was one of seven students accepted into a special two-year course in classical theater, taught in partnership with the Old Globe Theater. Program director Rick Seer recalled having reservations about admitting Parsons, saying, \"Jim is a very specific personality. He's thoroughly original, which is one reason he's been so successful. But we worried, 'Does that adapt itself to classical theater? Does that adapt itself to the kind of training that we're doing?' But we decided that he was so talented that we would give him a try and see how it worked out.\"Parsons enjoyed school and told an interviewer that he would have pursued a doctorate in acting if possible: \"School was so safe!.....You frequently would surprise yourself by what you were capable of, and you were not surprised by some things.\" Parsons graduated with a M.F.A. degree in acting from Old Globe Theatre/University of San Diego in 2001 and moved to New York. Parsons traced his family's history on TLC's Who Do You Think You Are? in September 2013, and discovered French heritage from his father's side. The French architect Louis-François Trouard (1729–1804) is Jim's sixth great-grandfather."}, {"text": "=== 2003–2006: Early roles ===In New York, Parsons worked in Off-Broadway productions and made several television appearances. In a 2003 Quiznos commercial, Parsons played a man who had been raised by wolves and continued to nurse from his wolf \"mother\". He had a recurring role on the television show Judging Amy and appeared on the television series Ed. Parsons also had minor roles in several movies, including Garden State and School for Scoundrels."}, {"text": "=== 2007–2019: The Big Bang Theory and theatre roles ===Parsons has estimated that he auditioned for between 15 and 30 television pilots, but on many of the occasions when he was cast, the show failed to find a television network willing to purchase it. The exception came with The Big Bang Theory. After reading the pilot script, Parsons felt that the role of Sheldon Cooper would be a very good fit for him. Although he did not feel any sort of relationship with the character, he was enchanted by the dialogue structure, the way the writers \"brilliantly use those words that most of us don't recognize to create that rhythm, and the rhythm got me. It was the chance to dance through that dialogue and in a lot of ways still is.\" In his audition, Parsons impressed series creator Chuck Lorre that Lorre insisted on a second audition to see if Parsons could replicate the performance. Parsons was cast as Sheldon Cooper, a physicist with social apathy who frequently belittles his friends. The role required Parsons to \"rattle off line after line of tightly composed, rhythmic dialogue, as well as then do something with his face or body during the silence that follows.\" Parsons credits his University of San Diego training with giving him the tools to break down Sheldon's lines.Television critic Andrew Dansby compares Parsons's physical comedy to that of Buster Keaton and other silent film stars. Lorre praises Parsons' instincts, saying that \"You can't teach that.\" Lorre describes Parsons' \"great sense of control over every part of his body, the way he walks, holds his hands, cocks his head, the facial tics as 'inspired'.\" Reviewer Lewis Beale describes Parsons' performance as \"so spot-on, it seems as if the character and the actor are the same person.\" Parsons admits that the work is \"more effort than I ever thought a sitcom would take, and that's really the fun of it.\" In August 2009, Parsons won the Television Critics Association award for individual achievement in comedy, beating Alec Baldwin, Tina Fey, Steve Carell, and Neil Patrick Harris. Parsons was nominated for Primetime Emmy Awards in 2009, 2010, 2011, 2012, 2013 and 2014 for Outstanding Lead Actor in a Comedy Series, winning in 2010, 2011, 2013 and 2014. In September 2010, Parsons and co-stars Johnny Galecki and Kaley Cuoco signed new contracts, guaranteeing each of them $200,000 per episode for the fourth season of The Big Bang Theory, with substantial raises for each of the next three seasons. The three were also promised a percentage of the show's earnings. In January 2011, Parsons won the Golden Globe award for Best Actor in a Television Series – Comedy. From August 2013, Parsons, Cuoco and Galecki each earned $325,000 per episode. In August 2014, Parsons, Galecki and Cuoco once again signed new contracts, guaranteeing each of them $1 million per episode for the eighth, ninth, and tenth seasons of The Big Bang Theory, as well as quadrupling their percentage of the show's earnings to over 1% each."}, {"text": "=== 2007–2019: The Big Bang Theory and theatre roles ===In 2011, Parsons appeared with Jack Black, Owen Wilson, Steve Martin, and Rashida Jones in the comedy film The Big Year. It was released in October. That same year, he appeared as the human alter ego of Walter, the newest Muppet introduced in The Muppets. On May 18, 2012, Parsons began appearing on Broadway as Elwood P. Dowd in a revival of Harvey. He reprised the role in the The Normal Heart (2014), and he received his seventh Emmy nomination, this time in the category of Outstanding Supporting Actor in a Miniseries or Movie. Parsons received a star on the Hollywood Walk of Fame on March 11, 2015. He voiced Oh, one of the lead roles in the DreamWorks Animation comedy film Home (2015), alongside Rihanna.Parsons and Todd Spiewak founded That's Wonderful Productions in 2015 with the intention of raising distinct voices and producing work with an underlying sense of purpose and social consciousness. Their work includes Special, Equal, Call Me Kat and A Kid Like Jake. Parsons and Spiewak are also Executive Producers of Young Sheldon. On January 29, 2015, it was announced that Parsons would star as God in the Broadway production of An Act of God, a new play by David Javerbaum and directed by Joe Mantello. The play began previews at Studio 54 on May 5, 2015 and closed August 2, 2015, to positive reviews. In 2016, Jim Parsons played a supporting role as STG (special task group) head engineer Paul Stafford in the biographical drama film Hidden Figures. The film was directed by Theodore Melfi, who had previously worked with Parsons in commercials for Intel.In 2017, Parsons started hosting his own SiriusXM talk show, Jim Parsons Is Too Stupid for Politics. The show ran for six weeks. In August 2018, Parsons announced his refusal of a contract worth $50 million for seasons 13 and 14. The producers simultaneously announced that, after 279 episodes, the most of any multi-camera series in TV history, the show would come to an \"epic, creative close\" in May 2019. Parsons was expected to remain in his role as narrator of the prequel series, Young Sheldon. In 2018, Parsons was one of the actors who voiced the audiobook A Day in the Life of Marlon Bundo. Parsons starred as party host Michael in the 50th anniversary Broadway production of The Boys in the Band, which won the 2019 Tony Award for Best Revival of a Play, reprising his performance (with the whole Broadway anniversary cast) in the 2020 film adaptation."}, {"text": "=== 2020–present: Return to theatre ===In 2020, he portrayed of Henry Willson in the Ryan Murphy limited series Hollywood on Netflix. He also served as an executive producer. For his performance he was nominated for the Primetime Emmy Award for Outstanding Supporting Actor in a Limited or Anthology Series or Movie. In 2022 he portrayed Michael Ausiello in the romantic comedy Spoiler Alert distributed by Focus Features. He acted in the revival of Terrence McNally's A Man of No Importance at the Classic Stage Company. He starred in Paula Vogel's new play Mother Play (2024) acting alongside Jessica Lange and Celia Keenan-Bolger. He is set to star as the Stage Manager in the revival of the Thorton Wilder play Our Town at the Ethel Barrymore Theatre."}, {"text": "== Personal life ==Parsons lives in the New York City neighborhood Gramercy Park while also maintaining a residence in Los Angeles.His father died in a car crash on April 29, 2001.On May 23, 2012, an article in The New York Times noted that Parsons is gay and had been in a relationship for the last ten years. His husband is art director Todd Spiewak. In October 2013, Parsons called their relationship \"an act of love, coffee in the morning, going to work, washing the clothes, taking the dogs out—a regular life, boring love\". Parsons and Spiewak wed in New York in May 2017.Parsons supported Democratic candidate Hillary Clinton in the run-up for the 2016 United States presidential election.On September 28, 2020, Parsons revealed on an episode of The Tonight Show Starring Jimmy Fallon that he and his husband had contracted COVID-19 in March 2020, and detailed their experience with it."}, {"text": "== See also ==Character actor"}, {"text": "== See also ==LGBT culture in New York City"}, {"text": "== See also ==List of LGBT people from New York City"}, {"text": "== See also ==Television sitcom"}, {"text": "== External links ==Jim Parsons at IMDb"}, {"text": "== External links ==Jim Parsons at the Internet Broadway Database "}, {"text": "== External links ==Jim Parsons at the Internet Off-Broadway Database"}, {"text": "== External links ==Jim Parsons at AllMovie"}, {"text": "== External links ==CBS Biography"}, {"text": "== External links ==Movieline interviews Big Bang Theory's Jim Parsons On Learning Lines, Emmy Nods and Cast Ping Pong Deathmatches"}, {"text": "== External links ==Fresh Air Interview: Jim Parsons On The Science Of Sheldon, 'Big Bang'"}]