[{"text": "James Douglas Morrison (December 8, 1943 – July 3, 1971) was an American singer, songwriter and poet who was the lead vocalist and primary lyricist of the rock band the Doors. Due to his energetic persona, poetic lyrics, distinctive voice, erratic and unpredictable performances, along with the dramatic circumstances surrounding his life and early death, Morrison is regarded by music critics and fans as one of the most influential frontmen in rock history. Since his death, his fame has endured as one of popular culture's top rebellious and oft-displayed icons, representing the generation gap and youth counterculture."}, {"text": "Together with keyboardist Ray Manzarek, Morrison founded the Doors in 1965 in Venice, California. The group spent two years in obscurity until shooting to prominence with their number-one hit single in the United States, \"Light My Fire\", taken from their self-titled debut album. Morrison recorded a total of six studio albums with the Doors, all of which sold well and many of which received critical acclaim. He frequently gave spoken word poetry passages while the band was playing live. Manzarek said Morrison \"embodied hippie counterculture rebellion\"."}, {"text": "Morrison developed an alcohol dependency, which at times affected his performances on stage. In 1971, Morrison died unexpectedly in a Paris apartment at the age of 27, amid several conflicting witness reports. Since no autopsy was performed, the cause of Morrison's death remains disputed."}, {"text": "Although the Doors recorded two more albums after Jim Morrison died, his death greatly affected the band's fortunes, and they split up two years later. In 1993, Morrison was inducted into the Rock and Roll Hall of Fame along with the other Doors members. Rolling Stone, NME, and Classic Rock have ranked him among the greatest rock singers of all time."}, {"text": "=== Early years and education ===James Douglas Morrison was born on December 8, 1943, in Melbourne, Florida, to Clara Virginia (née Clarke; 1919–2005) and Lt.(j.g.) George Stephen Morrison (1919–2008), a future rear admiral in the United States Navy. His ancestors were Scottish, Irish, and English. Admiral Morrison commanded U.S. naval forces during the Gulf of Tonkin incident in August 1964, which provided the pretext for the U.S. involvement in the Vietnam War in 1965. Morrison had a younger sister, Anne Robin, who was born in Albuquerque, New Mexico in 1947, and a younger brother, Andrew Lee Morrison, who was born in Los Altos, California in 1948."}, {"text": "=== Early years and education ===In 1947, when he was three to four years old, Morrison allegedly witnessed a car accident in the desert, during which a truck overturned and some Native Americans were lying injured on the side of the road. He referred to this incident in the Doors' song \"Peace Frog\" from their 1970 album Morrison Hotel, as well as in the spoken word performances \"Dawn's Highway\" and \"Ghost Song\" on the posthumous 1978 album An American Prayer. Morrison had described this incident as the most formative event of his life, and made repeated references to it in the imagery in his songs, poems, and interviews. Morrison believed the spirits or the ghosts of those \"dead Indians leaped into [his] soul,\" and that he was \"like a sponge, ready to sit there and absorb it.\""}, {"text": "=== Early years and education ===Morrison's family does not recall this traffic incident happening in the way he told it. According to the Morrison biography No One Here Gets Out Alive, his family did drive past a car accident on an Indian reservation when he was a child, and he was very upset by it. The book The Doors, written by the surviving members of the band, explains how different Morrison's account of the incident was from that of his father, who is quoted as saying, \"We went by several Indians. It did make an impression on him. He always thought about that crying Indian.\" This is contrasted sharply with Morrison's tale of \"Indians scattered all over the highway, bleeding to death.\" In another book, his sister says that his version of the event is likely exaggerated: \"He says we saw a dead Indian on the side of the road, and I don't even know if that's true.\""}, {"text": "=== Early years and education ===Raised a military brat, Morrison spent part of his childhood in San Diego, completed third grade at Fairfax County Elementary School in Virginia, and attended Charles H. Flato Elementary School in Kingsville, Texas, while his father was stationed at NAS Kingsville in 1952. He continued at St. John's Methodist School in Albuquerque, New Mexico, and then Longfellow School Sixth Grade Graduation Program in San Diego."}, {"text": "=== Early years and education ===In 1957, Morrison attended Alameda High School in Alameda, California for his freshman and first semester of his sophomore year. In 1959, his family moved back to Virginia, and he graduated from George Washington High School, now a middle school in Alexandria in June 1961. While attending George Washington, Morrison maintained a grade average of 88 and tested in the top 0.1% with an IQ of 149."}, {"text": "=== 1961–1963: Literary influences ===A voracious reader from an early age, Morrison was particularly inspired by the writings of several philosophers and poets. He was influenced by Friedrich Nietzsche, whose views on aesthetics, morality, and the Apollonian and Dionysian duality would appear in his conversation, poetry, and songs. Some of his formative influences were Plutarch's Parallel Lives and the works of the French Symbolist poet Arthur Rimbaud, whose style would later influence the form of Morrison's short prose poems. He was also influenced by William S. Burroughs, Jack Kerouac, Allen Ginsberg, Louis-Ferdinand Céline, Lawrence Ferlinghetti, Charles Baudelaire, Vladimir Nabokov, Molière, Franz Kafka, Albert Camus, Honoré de Balzac and Jean Cocteau, along with most of the French existentialist philosophers."}, {"text": "=== 1961–1963: Literary influences ===Morrison's senior year English teacher later said, \"Jim read as much and probably more than any student in class, but everything he read was so offbeat I had another teacher (who was going to the Library of Congress) check to see if the books Jim was reporting on actually existed. I suspected he was making them up, as they were English books on sixteenth- and seventeenth-century demonology. I'd never heard of them, but they existed, and I'm convinced from the paper he wrote that he read them, and the Library of Congress would've been the only source.\""}, {"text": "=== 1961–1963: Literary influences ===Morrison went to live with his paternal grandparents in Clearwater, Florida, and attended St. Petersburg Junior College. In 1962, he transferred to Florida State University in Tallahassee, and appeared in a school recruitment film. At Florida State, Morrison was arrested on September 28, 1963, for disturbing the peace and petty larceny while drunk at a home Florida State Seminoles football game at Doak Campbell Stadium."}, {"text": "=== 1964–1965: College experience in Los Angeles ===Morrison soon transferred to the film program at University of California, Los Angeles (UCLA). There he enrolled in Jack Hirschman's class on Antonin Artaud in the university's Comparative Literature program. Artaud's surrealist theater brand profoundly impacted Morrison's dark poetic sensibility of cinematic theatricality."}, {"text": "=== 1964–1965: College experience in Los Angeles ===Morrison completed his undergraduate degree at UCLA's film school within the Theater Arts department of the College of Fine Arts in 1965. Refusing to attend the graduation ceremony, he went to Venice Beach, Los Angeles and the university mailed his diploma to his mother in Coronado, California. He made several short films while attending UCLA. First Love, the first of these films, made with Morrison's classmate and roommate Max Schwartz, was released to the public when it appeared in a documentary about the film Obscura."}, {"text": "=== 1964–1965: College experience in Los Angeles ===During these years, while living in Venice Beach, Morrison befriended writers at the Los Angeles Free Press, for which he advocated until he died in 1971. He conducted a lengthy and in-depth interview with Bob Chorush and Andy Kent of the Free Press circa December 6–8, 1970, and was planning to visit the headquarters of the busy newspaper shortly before leaving for Paris."}, {"text": "=== 1965–1971: The Doors ===In the middle of 1965, after graduating with a bachelor's degree from the UCLA film school, Morrison led a bohemian lifestyle in Venice Beach. Living on the rooftop of a building inhabited by his UCLA classmate, Dennis Jakob, he wrote the lyrics of many of the early songs the Doors would later perform live and record on albums, such as \"Moonlight Drive\" and \"Hello, I Love You\". According to fellow UCLA student Ray Manzarek, he lived on canned beans and LSD for several months."}, {"text": "=== 1965–1971: The Doors ===Morrison and Manzarek, who had met months earlier as cinematography students, were the first members of the Doors, forming the group during that summer. Manzarek narrated the story that he was lying on Venice Beach one day when he coincidentally encountered Morrison. He was impressed with Morrison's poetic lyrics, claiming that they were \"rock group\" material. Subsequently, guitarist Robby Krieger and drummer John Densmore joined. All three musicians shared a common interest in the Maharishi Mahesh Yogi's meditation practices at the time, attending scheduled classes, but Morrison was not involved in these series of classes."}, {"text": "=== 1965–1971: The Doors ===Morrison was inspired to name the band after the title of Aldous Huxley's book The Doors of Perception (a reference to the unlocking of doors of perception through psychedelic drug use). Huxley's own concept was based on a quotation from William Blake's The Marriage of Heaven and Hell, in which Blake wrote: \"If the doors of perception were cleansed, everything would appear to man as it is, infinite.\""}, {"text": "=== 1965–1971: The Doors ===Although Morrison was known as the lyricist of the group, Krieger also made lyrical contributions, writing or co-writing some of the group's biggest hits, including \"Light My Fire\", \"Love Me Two Times\", \"Love Her Madly\" and \"Touch Me\". On the other hand, Morrison, who did not write most songs using an instrument, would come up with vocal melodies for his own lyrics, with the other band members contributing chords and rhythm.  Morrison did not play an instrument live (except for maracas and tambourine for most shows, and harmonica on a few occasions) or in the studio (excluding maracas, tambourine, handclaps, and whistling). However, he did play the grand piano on \"Orange County Suite\" and a Moog synthesizer on \"Strange Days\"."}, {"text": "=== 1965–1971: The Doors ===In May 1966, Morrison reportedly attended a concert by the Velvet Underground at The Trip in Los Angeles, and Andy Warhol claimed in his book Popism that his \"black leather\" look had been heavily influenced by the dancer Gerard Malanga who performed at the concert. Conversely, Krieger and Manzarek claim that Morrison was inspired to wear leather pants by Marlon Brando from his role in The Fugitive Kind. No One Here Gets Out Alive repeatedly mentions that Morrison was especially drawn to the look and posture of the ancient Greek king Alexander the Great. In June 1966, Morrison and the Doors were the opening act at the Whisky a Go Go in the last week of the residency of Van Morrison's band Them. Van's influence on Jim's developing stage performance was later noted by Brian Hinton in his book Celtic Crossroads: The Art of Van Morrison: \"Jim Morrison learned quickly from his near namesake's stagecraft, his apparent recklessness, his air of subdued menace, the way he would improvise poetry to a rock beat, even his habit of crouching down by the bass drum during instrumental breaks.\" On the final night, the two Morrisons and their two bands jammed together on \"Gloria\". Van later described Jim as being \"really raw. He knew what he was doing and could do it very well.\""}, {"text": "=== 1965–1971: The Doors ===In November 1966, Morrison and the Doors produced a promotional film for \"Break On Through (To the Other Side)\", which was their first single release. The film featured the four group members playing the song on a darkened set with alternating views and close-ups of the performers while Morrison lip-synched the lyrics. Morrison and the Doors continued to make short music films, including \"The Unknown Soldier\", \"Strange Days\" and \"People Are Strange\". Around this time, photographer Joel Brodsky took a series of black-and-white photos of a shirtless Morrison in a photo shoot known as \"The Young Lion\" photo session. These photographs are considered among the most iconic images of Jim Morrison and are frequently used as covers for compilation albums, books, and other memorabilia related to Morrison and the Doors."}, {"text": "=== 1965–1971: The Doors ===The Doors achieved national recognition in 1967 after signing with Elektra Records. The single \"Light My Fire\" spent three weeks at number one on the Billboard Hot 100 chart in July/August 1967, a far cry from the Doors opening for Simon and Garfunkel or playing at a high school as they did in Connecticut that same year. Later on, the Doors appeared on The Ed Sullivan Show, a popular Sunday night variety series that had given the Beatles and Elvis Presley national exposure. Ed Sullivan requested two songs from the Doors for the show, \"People Are Strange\" and \"Light My Fire\". Sullivan's censors insisted that the Doors change the lyrics of the song \"Light My Fire\" from \"Girl we couldn't get much higher\" to \"Girl we couldn't get much better\" for the television viewers; this was reportedly due to what was perceived as a reference to drugs in the original lyrics. After giving reluctant assurances of compliance to the producer in the dressing room, in one version of the story, an angry and defiant Morrison told the band he wasn't changing a word and sang the song with the original lyrics deliberately; in another, Morrison sang mistakenly the unaltered lyric out of anxiety from performing on live television. Either way, Sullivan was unhappy and refused to shake hands with Morrison or any other band member after their performance. He then had a producer tell the band they would never appear on his show again, and their planned six further bookings were canceled. In a defiant tone, Morrison said to the producer, \"Hey man. So what? We just did the Sullivan Show!\""}, {"text": "=== 1965–1971: The Doors ===By the release of their second album, Strange Days, the Doors had become one of the most popular rock bands in the U.S. Their blend of blues and dark psychedelic rock included a number of original songs and distinctive cover versions, such as their rendition of \"Alabama Song\" from Bertolt Brecht and Kurt Weill's opera Rise and Fall of the City of Mahagonny. The band also performed a number of extended concept works, including the songs \"The End\", \"When the Music's Over\", and \"Celebration of the Lizard\"."}, {"text": "=== 1965–1971: The Doors ===In late 1967, during a concert in New Haven, Connecticut, Morrison was arrested on stage in an incident that further added to his mystique and emphasized his rebellious image. Before the show, a police officer found Morrison and a woman in the showers backstage. Not recognizing the singer, the policeman ordered him to leave, to which Morrison mockingly replied, \"Eat me.\" He was subsequently maced by the officer, and the show was delayed. Once onstage, he told the concertgoers an obscenity-filled version of the incident. New Haven police arrested him for indecency and public obscenity, but the charges were later dropped. Morrison was the first rock performer arrested onstage."}, {"text": "=== 1965–1971: The Doors ===In 1968, the Doors released their third studio album, Waiting for the Sun. On July 5, the band performed at the Hollywood Bowl; footage from this performance was later released on the DVD Live at the Hollywood Bowl. While in Los Angeles, Morrison spent time with Mick Jagger, discussing their mutual hesitation and awkwardness about dancing in front of an audience, with Jagger asking Morrison's advice on \"how to work for a big crowd\"."}, {"text": "=== 1965–1971: The Doors ===On September 6 and 7, 1968, the Doors played in Europe for the first time, with four performances at the Roundhouse in London with Jefferson Airplane, which was filmed by Granada Television for the television documentary The Doors Are Open, directed by John Sheppard. Around this time, Morrison – who had long been a heavy drinker – started showing up for recording sessions visibly inebriated. He was also frequently appearing in live performances and studio recordings late or stoned."}, {"text": "=== 1965–1971: The Doors ===By early 1969, the formerly svelte Morrison had gained weight, grown a beard, and begun dressing more casually, abandoning the leather pants and concho belts for slacks, jeans, and T-shirts. The Soft Parade, the Doors' fourth album, was released later that year. It was the first album where each band member was given individual songwriting credit, by name, for their work. Previously, each song on their albums had been credited simply to \"The Doors\"."}, {"text": "=== 1965–1971: The Doors ===During a concert on March 1, 1969, at the Dinner Key Auditorium in Miami, Morrison attempted to spark a riot in the audience, in part by screaming, \"You wanna see my cock?\" and other obscenities. Three days later, six warrants for his arrest were issued by the Dade County Public Safety Department for indecent exposure, among other accusations. Consequently, many of the Doors' scheduled concerts were canceled. On September 20, 1970, Morrison was convicted of indecent exposure and profanity by a six-person jury in Miami after a sixteen-day trial. Morrison, who attended the October 30 sentencing \"in a wool jacket adorned with Indian designs\", silently listened as he was sentenced to six months in prison and had to pay a $500 fine. Morrison remained free on a $50,000 bond. At the sentencing, Judge Murray Goodman told Morrison that he was a \"person graced with a talent\" admired by many of his peers."}, {"text": "=== 1965–1971: The Doors ===Interviewed by Boc Chorush of the L.A. Free Press, Morrison expressed both bafflement and clarity about the Miami incident:"}, {"text": "=== 1965–1971: The Doors ===I wasted a lot of time and energy with the Miami trial. About a year and a half. But I guess it was a valuable experience because before the trial, I had a very unrealistic schoolboy attitude about the American judicial system. My eyes have been opened up a bit. There were guys down there, black guys, that would go each day before I went on. It took about five minutes and they would get twenty or twenty-five years in jail. If I hadn't had unlimited funds to continue fighting my case, I'd be in jail right now for three years. It's just if you have money you generally don't go to jail."}, {"text": "=== 1965–1971: The Doors ===On December 8, 2010 – the 67th anniversary of Morrison's birth –  Florida governor Charlie Crist and the state clemency board unanimously signed a complete posthumous pardon for Morrison. All the other members of the band, along with Doors' road manager Vince Treanor, have insisted that Morrison did not expose himself on stage that night."}, {"text": "=== 1965–1971: The Doors ===Following The Soft Parade, the Doors released Morrison Hotel. After a lengthy break, the group reconvened in October 1970 to record their final album with Morrison, titled L.A. Woman. Shortly after the recording sessions for the album began, producer Paul A. Rothchild – who had overseen all of their previous recordings – left the project, and engineer Bruce Botnick took over as producer."}, {"text": "=== Death ===After recording L.A. Woman with the Doors in Los Angeles, Morrison announced to the band his intention to go to Paris. His bandmates generally felt it was a good idea. In March 1971, he joined girlfriend Pamela Courson in Paris at an apartment she had rented at 17–19, Rue Beautreillis in Le Marais, 4th arrondissement. In letters to friends, he described going alone for long walks through the city. During this time, he shaved his beard and lost some of the weight he had gained in the previous months. He also telephoned John Densmore to ask him how L.A. Woman was doing commercially; he was the last band member to ever speak with him."}, {"text": "=== Death ===On July 3, 1971, Morrison was found dead in the bathtub of the apartment at approximately 6:00 a.m. by Courson. He was 27 years old. The official cause of death was listed as heart failure, although no autopsy was performed as it was not required by French law. Courson said that Morrison's last words, as he was bathing, were, \"Pam, are you still there?\""}, {"text": "=== Death ===Several individuals who say they were eyewitnesses, including Marianne Faithfull, claim that his death was due to an accidental heroin overdose. Sam Bernett, founder and manager of the Rock 'n' Roll Circus night club, affirmed that he had found Morrison unconscious in the club's bathrooms after a purported heroin overdose around 2:00 a.m. and that his body was taken away from the club by two men supposed to be the drug dealers. Because of the lack of an autopsy, however, these statements could never be confirmed. According to music journalist Ben Fong-Torres, it was suggested that his death was kept a secret, and the reporters who had telephoned Paris were told that Morrison was not deceased but tired and resting at a hospital. Morrison's friend, film director Agnès Varda, admitted that she was the one who was responsible for hiding the incident from becoming public. In her last media interview before her death in 2019, Varda confirmed that she was one of the only four mourners to attend Morrison's burial."}, {"text": "=== Death ===Morrison's death came two years to the day after the death of Rolling Stones guitarist Brian Jones and approximately nine months after the deaths of Jimi Hendrix and Janis Joplin. All of these popular musicians died at the age of 27, leading to the emergence of the 27 Club urban legend. Since the date of his demise, there have been a number of conspiracy theories concerning Morrison's death."}, {"text": "=== Morrison's family ===Morrison's early life was the semi-nomadic existence typical of military families. Jerry Hopkins recorded Morrison's brother, Andy, explaining that his parents had determined never to use corporal punishment such as spanking on their children. They instead instilled discipline by the military tradition known as \"dressing down\", which consisted of yelling at and berating the children until they were reduced to tears and acknowledged their failings. Once Morrison graduated from UCLA, he broke off most contact with his family. By the time his music ascended to the top of the charts (in 1967) he had not been in communication with his family for more than a year and falsely claimed that everyone in his immediate family was dead (or claimed  that he was an only child). However, Morrison told Hopkins in a 1969 interview for Rolling Stone magazine that he did this because he did not want to involve his family in his musical career. His sister similarly believed that \"he did it to protect my dad, who was moving up in the Navy, and to keep his life separate, not to shake it up on both sides.\""}, {"text": "=== Morrison's family ===Morrison's father was not supportive of his career choice in music. One day, Andy brought over a record thought to have Morrison on the cover, which was the Doors' debut album. Upon hearing the record, Morrison's father wrote him a letter telling him \"to give up any idea of singing or any connection with a music group because of what I consider to be a complete lack of talent in this direction.\" In a letter to the Florida Probation and Parole Commission District Office dated October 2, 1970, Admiral Morrison acknowledged the breakdown in family communications as the result of an argument over his assessment of his son's musical talents. He said he could not blame his son for being reluctant to initiate contact and that he was proud of him."}, {"text": "=== Morrison's family ===Morrison spoke fondly of his Irish and Scottish ancestry and was inspired by Celtic mythology in his poetry and songs. Celtic Family Magazine revealed in its 2016 Spring Issue that his Morrison clan was originally from the Isle of Lewis in Scotland, while his Irish side, the Clelland clan who married into the Morrison line, were from County Down in Northern Ireland."}, {"text": "=== Relationships ===Morrison was sought after by many as a photographer's model, confidant, romantic partner and sexual conquest. He had several serious relationships and many casual encounters. By many accounts, he could also be inconsistent with his partners, displaying what some recall as \"a dual personality\". Rothchild recalls, \"Jim really was two very distinct and different people. A Jekyll and Hyde. When he was sober, he was Jekyll, the most erudite, balanced, friendly kind of guy ... He was Mr. America. When he would start to drink, he'd be okay at first, then, suddenly, he would turn into a maniac. Turn into Hyde.\""}, {"text": "=== Relationships ===One of Morrison's early significant relationships was with Mary Werbelow, whom he met on the beach in Clearwater, Florida, when they were teenagers in the summer of 1962. In a 2005 interview with the St. Petersburg Times, she said Morrison spoke to her before a photo shoot for the Doors' fourth album and told her the first three albums were about her. She also stated in the interview that she was not a fan of the band and never attended a concert by them. Werbelow broke off the relationship in Los Angeles in the summer of 1965, a few months before Morrison began rehearsals. Manzarek said of Werbelow, \"She was Jim's first love. She held a deep place in his soul.\" Manzarek also noted that Morrison's song \"The End\" was intended originally to be \"a short goodbye love song to Mary,\" with the longer oedipal middle section a later addition."}, {"text": "=== Relationships ===Morrison spent the majority of his adult life in an open and at times very charged and intense relationship with Pamela Courson. Through to the end, Courson saw Morrison as more than a rock star, as \"a great poet\"; she constantly encouraged him and pushed him to write. Courson attended his concerts and focused on supporting his career. Like Morrison, she was described by many as fiery, determined and attractive, as someone who was tough despite appearing fragile. Manzarek called Pamela \"Jim's other half\" and said, \"I never knew another person who could so complement his bizarreness.\""}, {"text": "=== Relationships ===After her death in 1974, Courson was buried by her family as Pamela Susan Morrison, despite the two having never been married. Her parents petitioned the court for inheritance of Morrison's estate. The probate court in California decided that she and Morrison had once had what qualified as a common-law marriage, despite neither having applied for such status and the common-law marriage not being recognized in California. Morrison's will at the time of his death named Courson as the sole heir."}, {"text": "=== Relationships ===Morrison dedicated his published poetry books The Lords and New Creatures and the lost writings Wilderness to Courson. A number of writers have speculated that songs like \"Love Street\", \"Orange County Suite\" and \"Queen of the Highway\", among other songs, may have been written about her. Though the relationship was \"tumultuous\" much of the time, and both also had relationships with others, they always maintained a unique and ongoing connection with one another until the end of Morrison's life."}, {"text": "=== Relationships ===Throughout his career, Morrison had regular sexual and romantic encounters with fans (including groupies) such as Pamela Des Barres, as well as ongoing affairs with other musicians, writers, and photographers involved in the music business. They included Nico; singer Grace Slick of Jefferson Airplane; and editor Gloria Stavers of 16 Magazine, as well as an alleged alcohol-fueled encounter with Janis Joplin. David Crosby stated many years later that Morrison treated Joplin cruelly at a party at the Calabasas, California, home of John Davidson while Davidson was out of town. She reportedly hit him over the head with a bottle of whiskey during a fight in front of witnesses, and thereafter referred to Morrison as \"that asshole\" whenever his name was brought up in conversation. During her appearance on the Dick Cavett Show in 1969, when host Dick Cavett offered to light her cigarette, asking \"May I light your fire, my child?\", she jokingly replied, \"That's my favorite singer ... I guess not.\""}, {"text": "=== Relationships ===Rock critic Patricia Kennealy is described as having a relationship with Morrison in No One Here Gets Out Alive, Break On Through, and later in Kennealy's own memoir, Strange Days: My Life With and Without Jim Morrison. Kennealy said that Morrison participated in a neopagan handfasting ceremony with her. According to Kennealy, the couple signed a handwritten document, and were declared wed by a Celtic high priestess and high priest on Midsummer night in 1970, but none of the necessary paperwork for a legal marriage was filed with the state. No witness to this ceremony was ever named."}, {"text": "=== Relationships ===Kennealy met Morrison for an interview for Jazz & Pop magazine in January 1969, after which Kennealy said they developed a long-distance relationship. The handfasting ceremony is described in No One Here Gets Out Alive as a \"blending of souls on a karmic and cosmic plane\". Morrison was also still seeing Courson when he was in Los Angeles, and later moved to Paris for the summer, where Courson had acquired an apartment. In an interview for the book Rock Wives, Kennealy was asked if Morrison took the handfasting ceremony seriously. She is seen on video saying, \"Probably not too seriously\". She added, he turned \"really cold\" when she claimed she became pregnant, leading her to speculate that maybe he had not taken the wedding as seriously as she had. Kennealy showed up unexpectedly in Miami during the indecency trial, and Morrison was curt with her. She said, \"he was scared to death. They were really out to put him away. Jim was devastated that he wasn't getting any public support.\""}, {"text": "=== Relationships ===As he did with so many people, Morrison could be cruel and cold and then turn warm and loving. However, Kennealy was skeptical; he was living with Courson in Paris, he was drinking heavily and in poor health, and Kennealy, like many, feared he was dying."}, {"text": "=== Relationships ===At the time of Morrison's death, there were thirty-seven paternity actions pending against him, although no claims were made against his estate by any of the putative paternity claimants."}, {"text": "== Artistic influences ==Although Morrison's early education was routinely disrupted as he moved from school to school, he was drawn to the study of literature, poetry, religion, philosophy and psychology, among other fields. Biographers have consistently pointed to a number of writers and philosophers who influenced his thinking and, perhaps, his behavior. While still in his adolescence, Morrison discovered the works of German philosopher Friedrich Nietzsche. Densmore has mentioned that he believed Nietzsche's ideas of a world with no objective order or structure \"killed Jim Morrison\"."}, {"text": "== Artistic influences ==Morrison was drawn to the poetry of William Blake, Arthur Rimbaud, and Charles Baudelaire. Beat Generation writers such as Jack Kerouac and libertine writers such as the Marquis de Sade also had a strong influence on Morrison's outlook and manner of expression; he was eager to experience the life described in Kerouac's On the Road. He was similarly drawn to the work of French writer Louis-Ferdinand Céline. Céline's book, Voyage Au Bout de la Nuit (Journey to the End of the Night) and Blake's Auguries of Innocence both echo through one of Morrison's early songs, \"End of the Night\"."}, {"text": "== Artistic influences ==Morrison later met and befriended Michael McClure, a well-known Beat poet. McClure had enjoyed Morrison's lyrics but was even more impressed by his poetry and encouraged him to further develop his craft. Morrison's vision of performance was colored by the works of 20th-century French playwright Antonin Artaud (author of Theater and its Double) and by Judith Malina and Julian Beck's Living Theater."}, {"text": "== Artistic influences ==Other works relating to religion, mysticism, ancient myth and symbolism were of lasting interest to Morrison, particularly Joseph Campbell's The Hero with a Thousand Faces. James Frazer's The Golden Bough also became a source of inspiration and is reflected in the title and lyrics of the song \"Not to Touch the Earth\". Morrison was particularly attracted to the myths and religions of Native American cultures."}, {"text": "== Artistic influences ==While he was still at school, his family moved to New Mexico where he became familiar with the landscape and some of the iconography important to the Indigenous peoples of the American Southwest. These interests appear to be the source of many references to creatures and places such as lizards, snakes, deserts and \"ancient lakes\" that appear in his songs and poetry. His interpretations and fantasies of Native American ceremonies and ceremonial leaders (which, based on his readings, he referred to by the anthropological term \"shamans\") influenced his stage performances, notably in his seeking of trance states and vision through dancing to the point of exhaustion. In particular, Morrison's poem \"The Ghost Song\" was inspired by his readings about the Native American Ghost Dance."}, {"text": "== Artistic influences ==Morrison's vocal influences included Elvis Presley and Frank Sinatra, which can be heard in his baritone crooning style on several of the Doors' songs. In the 1981 documentary The Doors: A Tribute to Jim Morrison, Rothchild relates his first impression of Morrison as being a \"Rock and Roll Bing Crosby\". Botnick has recalled that when he first met the Doors in Sunset Sound Studios he showed them the condenser microphone, which Morrison would then use when recording his vocals for their debut album. Morrison was particularly excited about this microphone (the Telefunken U47) as it was the same model that Sinatra had used for some of his recording sessions. Sugerman has written that Morrison, as a teenager, was such a fan of Elvis that he demanded silence when Elvis was on the radio, but that Sinatra was Morrison's favorite singer. Morrison also cited Little Richard, Fats Domino, Jerry Lee Lewis and Gene Vincent as other early influences. In his Elektra Records biography, Morrison named contemporaries such as the Beach Boys, the Kinks, and Love as his favorite singing groups. According to record producer David Anderle, Morrison considered Brian Wilson \"his favorite musician\" and the Beach Boys' 1967 LP Wild Honey \"one of his favorite albums. ... he really got into it.\""}, {"text": "== Artistic influences ==Wallace Fowlie, professor emeritus of French literature at Duke University, wrote Rimbaud and Jim Morrison, subtitled \"The Rebel as Poet – A Memoir\". In this, he recounts his surprise at receiving a fan letter from Morrison who, in 1968, thanked him for his latest translation of Rimbaud's verse into English. \"I don't read French easily\", he wrote, \"... your book travels around with me.\" Fowlie went on to give lectures on numerous campuses comparing the lives, philosophies, and poetry of Morrison and Rimbaud. The book The Doors, by the remaining Doors, quotes Morrison's close friend Frank Lisciandro as saying that too many people took a remark of Morrison's that he was interested in revolt, disorder, and chaos \"to mean that he was an anarchist, a revolutionary, or, worse yet, a nihilist. Hardly anyone noticed that Jim was paraphrasing Rimbaud and the Surrealist poets\"."}, {"text": "== Poetry and film ==Morrison began writing in earnest during his adolescence. At UCLA he studied the related fields of theater, film, and cinematography. He self-published two volumes of poetry in 1969, titled The Lords / Notes on Vision and The New Creatures. The Lords consists primarily of brief descriptions of places, people, events and Morrison's thoughts on cinema. The New Creatures verses are more poetic in structure, feel and appearance. These two books were later combined into a single volume titled The Lords and The New Creatures. These were the only writings published during Morrison's lifetime. Morrison befriended Beat poet Michael McClure, who wrote the afterword for Hopkins' No One Here Gets Out Alive. McClure and Morrison reportedly collaborated on a number of unmade film projects, including a film version of McClure's infamous play The Beard, in which Morrison would have played Billy the Kid."}, {"text": "== Poetry and film ==The Lost Writings of Jim Morrison Volume I is titled Wilderness, and, upon its release in 1988, became an instant New York Times Bestseller. Volume II, The American Night, released in 1990, was also a success. Morrison recorded his own poetry in a professional sound studio on two occasions. The first was in March 1969 in Los Angeles and the second was on December 8, 1970. The latter recording session was attended by Morrison's personal friends and included a variety of sketch pieces. Some of the segments from the 1969 session were issued on the bootleg album The Lost Paris Tapes and were later used as part of the Doors' An American Prayer album, released in 1978. The album reached No. 54 on the music charts."}, {"text": "== Poetry and film ==Some poetry recorded from the December 1970 session remains unreleased to this day and is in the possession of the Courson family. Morrison's best-known but seldom seen cinematic endeavor is HWY: An American Pastoral, a project he started in 1969. Morrison financed the venture and formed his own production company in order to maintain complete control of the project. Paul Ferrara, Frank Lisciandro, and Babe Hill assisted with the project. Morrison played the main character, a hitchhiker turned killer/car thief. Morrison asked his friend, composer/pianist Fred Myrow, to select the soundtrack for the film."}, {"text": "=== Paris Journal ===After his death, a notebook of poetry written by Morrison was recovered, titled Paris Journal; amongst other personal details, it contains the allegorical foretelling of a man who will be left grieving and having to abandon his belongings, due to a police investigation into a death connected to the Chinese opium trade. \"Weeping, he left his pad on orders from police and furnishings hauled away, all records and mementos, and reporters calculating tears & curses for the press: 'I hope the Chinese junkies get you' and they will for the [opium] poppy rules the world\"."}, {"text": "=== Paris Journal ===The concluding stanzas of this poem convey disappointment in someone with whom he had had an intimate relationship, perhaps using the relationship as a metaphor as the relationship with life itself, and contain a further invocation of Billy the killer/Hitchhiker, a common character in Morrison's body of work:"}, {"text": "=== Paris Journal ===In 2013, another of Morrison's notebooks from Paris, found alongside the Paris Journal in the same box, known as the 127 Fascination box, sold for $250,000 at auction. This box of personal belongings similarly contained a home movie of Pamela Courson dancing in an unspecified cemetery in Corsica, the only film so far recovered to have been filmed by Morrison. The box also housed a number of older notebooks and journals and may initially have included the \"Steno Pad\" and the falsely titled The Lost Paris Tapes bootleg, if they had not been separated from the primary collection and sold by Philippe Dalecky with this promotional title. Those familiar with the voices of Morrison's friends and colleagues later determined that, contrary to the story advanced by Dalecky that this was Morrison's final recording made with busking Parisian musicians, the Lost Paris Tapes are in fact of \"Jomo & The Smoothies\": Morrison, friend Michael McClure and producer Paul Rothchild loose jamming in Los Angeles, well before Paris 1971."}, {"text": "== Grave site ==Morrison was buried in Père Lachaise Cemetery in Paris, one of the city's most visited tourist attractions, where Irish playwright Oscar Wilde, French cabaret singer Édith Piaf, and many other poets and artists are also buried. The grave had no official marker until French officials placed a shield over it, which was stolen in 1973. The grave was listed in the cemetery directory with Morrison's name incorrectly arranged as \"Douglas James Morrison\"."}, {"text": "== Grave site ==In 1981, Croatian sculptor Mladen Mikulin voluntarily – with the approval of the cemetery curators – placed a marble bust of his own design and a new gravestone with Morrison's name at the grave to commemorate the tenth anniversary of Morrison's death; the bust was defaced through the years by vandals and later stolen in 1988. Mikulin made another bust of Morrison in 1989 and a bronze portrait (\"death mask\") of him in 2001; neither piece is at the gravesite."}, {"text": "== Grave site ==In 1990, Morrison's father, George Stephen Morrison, after a consultation with E. Nicholas Genovese, Professor of Classics and Humanities, San Diego State University, placed a flat stone on the grave. The bronze plaque thereon bears the Greek inscription: ΚΑΤΑ ΤΟΝ ΔΑΙΜΟΝΑ ΕΑΥΤΟΥ, usually translated as \"true to his own spirit\" or \"according to his own daemon\"."}, {"text": "=== Musical ===Morrison was and continues to be one of the most popular and influential singer-songwriters and iconic frontmen in rock history. To this day, he is widely regarded as the prototypical rock star: surly, sexy, scandalous, and mysterious. The leather pants he was fond of wearing both onstage and off have since become stereotyped as rock-star apparel. The lead singer of U2, Bono, had used Morrison's leather pants for his onstage alter-ego, which he called \"Fly\". Music journalist Stephen Davis described Morrison as the single \"greatest American rock star of his era\"."}, {"text": "=== Musical ===In 1993, Morrison was inducted into the Rock and Roll Hall of Fame as a member of the Doors; the other band members dedicated their induction to Morrison. In 2011, a Rolling Stone readers' pick placed Morrison in fifth place of the magazine's \"Best Lead Singers of All Time\". In another Rolling Stone list, entitled \"The 100 Greatest Singers of All Time\", he was ranked 47th. NME named him the 13th greatest singer of all time. He was also ranked number 22 on Classic Rock magazine's \"50 Greatest Singers in Rock\"."}, {"text": "=== Musical ===Fatboy Slim's song \"Sunset\" includes Morrison's vocal interpretation of his poem \"Bird of Prey\". In 2012, electronic music producer Skrillex released \"Breakn' a Sweat\" which contained vocals from an interview with Morrison. Alice Cooper has said that his song \"Desperado\", from the 1971 Killer, was a tribute to Morrison."}, {"text": "==== Influences ====Iggy and the Stooges are said to have formed after lead singer Iggy Pop was inspired by Morrison while attending a Doors concert in Ann Arbor, Michigan. Pop later said about the concert:"}, {"text": "==== Influences ====That show was a big, big, big influence on me. They had just had their big hit, \"Light My Fire\" and the album had taken off ... So, here's this guy, out of his head on acid, dressed in leather with his hair all oiled and curled. The stage was tiny and it was really low. It got confrontational. I found it really interesting. I loved the performance ... Part of me was like, \"Wow, this is great. He's really pissing people off and he's lurching around making these guys angry.\""}, {"text": "==== Influences ====One of Pop's most popular songs, \"The Passenger\", is said to be based on one of Morrison's poems. Layne Staley, the vocalist of Alice in Chains; Eddie Vedder, the vocalist of Pearl Jam; Scott Weiland, the vocalist of Stone Temple Pilots and Velvet Revolver; Glenn Danzig, singer and founder of Danzig; Ian Astbury, the frontman of the Cult; Siouxsie Sioux, the lead singer of Siouxsie and the Banshees; Ian Curtis, the lead singer of Joy Division; Julian Casablancas, the vocalist of the Strokes; Billy Idol, and Patti Smith  have said that Morrison was their biggest influence. Music journalist Simon Reynolds noted that the \"deep, heavy alloys\" in Morrison's voice, served as a prototype for the gothic rock scene."}, {"text": "==== Biopic ====In 1991, Oliver Stone directed a biopic film about Morrison, with actor Val Kilmer portraying him. Kilmer learned over twenty of the Doors' songs to achieve Morrison's role. While the film was inspired by many real events and individuals, the film's depiction of Morrison was heavily criticized by many people who knew him personally, including Patricia Kennealy and the other Doors members. Manzarek said about the film's portrayal, \"It was ridiculous ... It was not about Jim Morrison. It was about 'Jimbo Morrison', the drunk. God, where was the sensitive poet and the funny guy? The guy I knew was not on that screen.\" Krieger agreed that the movie didn't capture \"how Jim [Morrison] was at all.\" He also noted the impact of the film's representation on numerous people he talked to: \"He's never a real guy in that movie. People find it hard to believe he could just be a normal person–a good friend and a great guy to be with.\""}, {"text": "==== Biopic ====On an album by CPR, David Crosby wrote and recorded a song about the movie with the lyric: \"And I have seen that movie – and it wasn't like that.\" In general, the film received underwhelming to poor reviews, which largely focused on the many inaccuracies and problems with the narrative. However, Kilmer received some praise for his performance, with some members of the Doors reportedly saying that at times they couldn't distinguish whether it was Kilmer or Morrison singing on some of the sequences. Overall, the group members praised Kilmer's interpretation. Regardless of the widespread acclaim surrounding Kilmer's performance, he did not claim any award."}, {"text": "==== Others ====The lead character of a 2011 Bollywood film, Rockstar starring Ranbir Kapoor, was inspired by Morrison. The 2007 film Walk Hard: The Dewey Cox Story has numerous references to Morrison. Morrison's grave is featured in The Walking Dead: Daryl Dixon Season 1, episode 3."}, {"text": "=== The Doors ===The Doors (1967)"}, {"text": "=== The Doors ===Strange Days (1967)"}, {"text": "=== The Doors ===Waiting for the Sun (1968)"}, {"text": "=== The Doors ===The Soft Parade (1969)"}, {"text": "=== The Doors ===Morrison Hotel (1970)"}, {"text": "=== The Doors ===L.A. Woman (1971)"}, {"text": "=== The Doors ===An American Prayer (1978)"}, {"text": "=== Films by Morrison ===HWY: An American Pastoral"}, {"text": "== See also ==Outline of the Doors"}, {"text": "== Bibliography ==The Lords and the New Creatures (1969). 1985 edition: ISBN 0-7119-0552-5"}, {"text": "== Bibliography ==An American Prayer (1970) privately printed by Western Lithographers. (Unauthorized edition also published in 1983, Zeppelin Publishing Company, ISBN 0-915628-46-5. The authenticity of the unauthorized edition has been disputed.)"}, {"text": "== Bibliography ==Arden lointain, edition bilingue (1988), trad. de l'américain et présenté par Sabine Prudent et Werner Reimann. [Paris]: C. Bourgois. 157 p. N.B.: Original texts in English, with French translations, on facing pages. ISBN 2-267-00560-3"}, {"text": "== Bibliography ==Wilderness: The Lost Writings Of Jim Morrison (1988). 1990 edition: ISBN 0-14-011910-8"}, {"text": "== Bibliography ==The American Night: The Writings of Jim Morrison (1990). 1991 edition: ISBN 0-670-83772-5"}, {"text": "== Bibliography ==The Collected Works of Jim Morrison: Poetry, Journals, Transcripts, and Lyrics (2021). Edited by Frank Lisciandro, Foreword by Tom Robbins: ISBN 978-0-06302897-5"}, {"text": "== Bibliography ==Stephen Davis, Jim Morrison: Life, Death, Legend, (2004) ISBN 1-59240-064-7"}, {"text": "== Bibliography ==John Densmore, Riders on the Storm: My Life With Jim Morrison and The Doors (1991) ISBN 0-385-30447-1"}, {"text": "== Further reading ==Linda Ashcroft (1997), Wild Child: Life with Jim Morrison, ISBN 1-56025-249-9"}, {"text": "== Further reading ==Lester Bangs, \"Jim Morrison: Bozo Dionysus a Decade Later\" in Main Lines, Blood Feasts, and Bad Taste: A Lester Bangs Reader, John Morthland, ed. Anchor Press (2003) ISBN 0-375-71367-0"}, {"text": "== Further reading ==Dave DiMartino, Moonlight Drive (1995) ISBN 1-886894-21-3"}, {"text": "== Further reading ==Steven Erkel, \"The Poet Behind The Doors: Jim Morrison's Poetry and the 1960s Countercultural Movement\" (2011)"}, {"text": "== Further reading ==Wallace Fowlie, Rimbaud and Jim Morrison (1994) ISBN 0-8223-1442-8"}, {"text": "== Further reading ==Jerry Hopkins, The Lizard King: The Essential Jim Morrison (1995) ISBN 0-684-81866-3"}, {"text": "== Further reading ==Jerry Hopkins and Danny Sugerman, No One Here Gets Out Alive (1980) ISBN 0-85965-138-X"}, {"text": "== Further reading ==Huddleston, Judy, Love Him Madly: An Intimate Memoir of Jim Morrison (2013) ISBN 9781613747506"}, {"text": "== Further reading ==Mike Jahn, \"Jim Morrison and The Doors\", (1969) Library of Congress Catalog Card Number 71-84745"}, {"text": "== Further reading ==Dylan Jones, Jim Morrison: Dark Star, (1990) ISBN 0-7475-0951-4"}, {"text": "== Further reading ==Patricia Kennealy, Strange Days: My Life With and Without Jim Morrison (1992) ISBN 0-525-93419-7"}, {"text": "== Further reading ==Gerry Kirstein, \"Some Are Born to Endless Night: Jim Morrison, Visions of Apocalypse and Transcendence\" (2012) ISBN 1451558066"}, {"text": "== Further reading ==Frank Lisciandro, Morrison: A Feast of Friends (1991) ISBN 0-446-39276-6, Morrison – Un festin entre amis (1996) (French)"}, {"text": "== Further reading ==Frank Lisciandro, Jim Morrison: An Hour For Magic (A Photojournal) (1982) ISBN 0-85965-246-7, James Douglas Morrison (2005) (French)"}, {"text": "== Further reading ==Ray Manzarek, Light My Fire (1998) ISBN 0-446-60228-0. First by Jerry Hopkins and Danny Sugerman (1981)"}, {"text": "== Further reading ==Peter Jan Margry, The Pilgrimage to Jim Morrison's Grave at Père Lachaise Cemetery: The Social Construction of Sacred Space. In idem (ed.), Shrines and Pilgrimage in the Modern World. New Itineraries into the Sacred. Amsterdam University Press, 2008, p. 145–173."}, {"text": "== Further reading ==Thanasis Michos, The Poetry of James Douglas Morrison (2001) ISBN 960-7748-23-9 (Greek)"}, {"text": "== Further reading ==Daveth Milton, We Want The World: Jim Morrison, The Living Theatre, and the FBI, (2012) ISBN 978-0957051188"}, {"text": "== Further reading ==Mark Opsasnick, The Lizard King Was Here: The Life and Times of Jim Morrison in Alexandria, Virginia (2006) ISBN 1-4257-1330-0"}, {"text": "== Further reading ==James Riordan and Jerry Prochnicky, Break on through: The Life and Death of Jim Morrison (1991) ISBN 0-688-11915-8"}, {"text": "== Further reading ==Adriana Rubio, Jim Morrison: Ceremony...Exploring the Shaman Possession (2005) ISBN"}, {"text": "== Further reading ==Howard Sounes. 27: A History of the 27 Club Through the Lives of Brian Jones, Jimi Hendrix, Janis Joplin, Jim Morrison, Kurt Cobain, and Amy Winehouse, Boston: Da Capo Press, 2013. ISBN 0-306-82168-0."}, {"text": "== Further reading ==The Doors (remaining members Ray Manzarek, Robby Krieger, John Densmore) with Ben Fong-Torres, The Doors (2006) ISBN 1-4013-0303-X"}, {"text": "== Further reading ==Mick Wall (2014), Love Becomes a Funeral Pyre: A Biography of The Doors"}, {"text": "== External links ==The Doors official website"}, {"text": "== External links ==Jim Morrison discography at Discogs "}, {"text": "== External links ==Jim Morrison at Curlie"}, {"text": "== External links ==Jim Morrison at IMDb"}, {"text": "== External links ==Earliest film of Jim Morrison"}, {"text": "== External links ==A lost painting collaboration with Jim Morrison intended for his An American Prayer album"}, {"text": "== External links ==George Washington High School Alumni Association, Alexandria, Va., Morrison page"}]