[{"text": "Joseph James Rogan (born August 11, 1967) is an American UFC color commentator, podcaster, comedian, actor, and former television host. He hosts The Joe Rogan Experience, a podcast in which he discusses current events, comedy, politics, philosophy, science, martial arts, and hobbies with a variety of guests."}, {"text": "Rogan was born in Newark, New Jersey, and began his career in comedy in 1988 in the Boston area. After relocating to Los Angeles in 1994, he signed an exclusive developmental deal with Disney and appeared as an actor on several television shows, including Hardball and NewsRadio. In 1997, he started working for the UFC as an interviewer and color commentator. He released his first comedy special, I'm Gonna Be Dead Someday..., in 2000 and hosted the game show Fear Factor from 2001 to 2006."}, {"text": "After leaving Fear Factor, Rogan focused on his stand-up career and hosted more comedy specials. He launched The Joe Rogan Experience in 2009; by 2015, it was one of the most popular podcasts in the world, regularly receiving millions of plays per episode. Spotify obtained exclusive distribution rights to The Joe Rogan Experience in 2020 for US$200 million. Since the COVID-19 pandemic started, the podcast has received criticism. Despite this, Rogan's audience grew significantly and in 2024, Rogan renewed his deal with Spotify for an estimated $250 million."}, {"text": "== Early life ==Joseph James Rogan was born in Newark, New Jersey, on August 11, 1967. He had one Irish grandparent, while his three other grandparents were all of Italian descent. His parents divorced when he was five, and he has not been in contact with his father since he was seven. He recalled, \"All I remember of my dad are these brief, violent flashes of domestic violence. But I don't want to complain about my childhood. Nothing bad ever really happened to me. I don't hate the guy.\" At the age of seven, he moved with his mother to San Francisco, California. When he was 11, they moved to Gainesville, Florida. They later settled in Newton Upper Falls, Massachusetts, where he graduated from Newton South High School in 1985."}, {"text": "== Early life ==Rogan participated in Little League Baseball and developed an interest in martial arts in his early teens. He recalled being \"terrified of being a loser\" as a child and said, \"Martial arts gave me not just confidence, but also a different perspective of myself and what I was capable of. I knew that I could do something I was terrified of, and that was really difficult, and that I could excel at it. It was a big deal for me.\" Martial arts were \"the first thing that ever gave me hope that I wasn't going to be a loser. So I really, really gravitated toward it.\" At age 14, he took up karate and started taekwondo a year later. When he was 19, he won the US Open Championship taekwondo tournament as a lightweight. He was a Massachusetts full-contact state champion for four consecutive years and became a taekwondo instructor. He also practiced amateur kickboxing and held a 2–1 record; he retired from competition at age 21, as he began to suffer from frequent headaches and feared he might sustain worse injuries. He attended the University of Massachusetts Boston but found it pointless and dropped out early."}, {"text": "=== 1988–1994: Early stand-up career ===Rogan had no intention of being a professional comedian, but was a fan of comedy from a young age, later saying of Richard Pryor's special Live on the Sunset Strip, \"It affected me in such a profound way. Nothing had made me laugh like that.\" His friends from gym and Taekwondo school, whom he would make laugh with impressions and jokes, convinced him to try stand-up. At 21, after six months preparing material and practicing his delivery, he performed his first stand-up routine on August 27, 1988, at an open-mic night at a Stitches comedy club in Boston."}, {"text": "=== 1988–1994: Early stand-up career ===While living in Boston and working on his stand-up, Rogan held several jobs to secure himself financially, including teaching martial arts at Boston University and in nearby Revere, delivering newspapers, driving a limousine, doing construction work, and assisting a private investigator. Meanwhile, his blue comedy style earned him gigs at bachelor parties and strip clubs. One night, he persuaded the owner of a comedy club in Boston to allow him to try a new five-minute routine. At the show was talent manager Jeff Sussman, who liked the act and offered to become his manager, which Rogan accepted."}, {"text": "=== 1988–1994: Early stand-up career ===In 1990, Rogan moved to New York City. As a full-time comedian, he was \"scratching and grinding\" for money and stayed with his grandfather in Newark for the first six months. Rogan later cited Richard Jeni, Lenny Bruce, Sam Kinison and Bill Hicks as comedy influences."}, {"text": "=== 1994–1999: Hardball and NewsRadio ===In 1994, Rogan relocated to Los Angeles, where his first national television spot followed on the MTV comedy show Half-Hour Comedy Hour. The appearance led to the network offering him a three-year exclusive contract and a role in a pilot episode of a \"dopey game show\" for $500. Rogan declined, but it prompted Sussman to send tapes of Rogan's performances to several networks, which sparked a bidding war. After a period of negotiation, Rogan accepted a development deal with the Disney network. He secured his first major acting role in the 1994 nine-episode Fox sitcom Hardball as Frank Valente, a young, egocentric star player on a professional baseball team. Rogan called the hiring process \"weird\", as the network had no idea if he could act until he was asked by Dean Valentine, then-president of Walt Disney Television, to whom he replied: \"If you can lie, you can act, and if you can lie to crazy girlfriends, you can act under pressure.\" The filming schedule was a new experience for Rogan, who started to work 12-hour days. Rogan later said: \"It was a great show on paper until a horrible executive producer with a big ego was hired by Fox to run the show and he rewrote it.\" Around this time, Rogan began performing at The Comedy Store in Hollywood and was hired as a paid regular by owner Mitzi Shore. According to Rogan, he performed at the club for the next 13 years for free and paid for the venue's new sound system."}, {"text": "=== 1994–1999: Hardball and NewsRadio ===From 1995 to 1999, Rogan starred in the NBC sitcom NewsRadio as Joe Garrelli, an electrician and handyman at the show's fictional news radio station. The role was originally set to be played by actor Ray Romano, but Romano was let go from the cast after one rehearsal and Rogan was brought in. The switch caused Rogan to work with the show's writers to help develop the character before the show was set to launch, which he later described as a \"very dumbed-down, censored version\" of himself. Rogan befriended fellow cast member Phil Hartman, who confided his marital problems to him. Rogan claimed he tried to persuade Hartman to divorce his wife five times, but \"he loved his kids and didn't want to leave.\" In 1998, Hartman was murdered by his wife. The loss affected Rogan's ability to perform stand-up, and he canceled a week of scheduled gigs. Rogan later saw acting as an easy job, but grew tired of \"playing the same character every week\", and only did so for the money. He later viewed his time on NewsRadio as \"a dream gig\" that allowed him to earn money while working on his stand-up as often as he could. During the series, he worked on a pilot for a show entitled Overseas."}, {"text": "=== 1997–2006: UFC commentator and Fear Factor ===Rogan began working for the mixed martial arts promotion Ultimate Fighting Championship as a backstage and post-fight interviewer. His first show took place at UFC 12: Judgement Day in Dothan, Alabama, on February 7, 1997. He became interested in Brazilian jiu-jitsu in 1994 after watching Royce Gracie fight at UFC 2: No Way Out, and landed the position at the organization as Sussman was friends with its co-creator and original producer, Campbell McLaren. He quit after two years as his salary could not cover the cost of traveling to the events, which were often held in rural locations."}, {"text": "=== 1997–2006: UFC commentator and Fear Factor ===After the UFC was taken over by Zuffa in 2001, Rogan attended some events and became friends with its new president Dana White, who offered him a job as a color commentator. However, Rogan initially declined as he \"just wanted to go to the fights and drink\". In 2002, White was able to hire Rogan for free in exchange for prime event tickets for him and his friends. After about 15 free gigs as a commentator, Rogan accepted pay for the job, working alongside Mike Goldberg until the end of 2016. Rogan won the Wrestling Observer Newsletter Award for Best Television Announcer twice, and was named MMA Personality of the Year four times by the World MMA Awards."}, {"text": "=== 1997–2006: UFC commentator and Fear Factor ===In 1999, Rogan secured a three-album deal with Warner Bros. Records and began tentative plans to star in his own prime-time televised sitcom on Fox named The Joe Rogan Show. The show, co-written by Seinfeld writer Bill Masters, was to feature Rogan as \"a second-string sportscaster who lands a spot as the token male on a View-style women's show\". In December 1999, he recorded his first stand-up comedy album in two shows at the Comedy Connection at Faneuil Hall in Boston, which was released as I'm Gonna Be Dead Some Day... in August 2000. It received national exposure on The Howard Stern Show and downloads from Napster. \"Voodoo Punanny\", a song Rogan wrote after Warner suggested to produce a song they could play on the radio, was subsequently released as a single. Around this time, Rogan also worked on ideas for a film and a cartoon with his comedian friend Chris McGuire, and began to operate a blog on his website, JoeRogan.net, which he used to discuss various topics that helped him develop his stand-up routines."}, {"text": "=== 1997–2006: UFC commentator and Fear Factor ===In 2001, the development of Rogan's television show was interrupted after he accepted an offer from NBC to host the American edition of Fear Factor. He declined initially as he thought the network would not air such a program due to its content, but Sussman convinced him to accept. Rogan later said that the main reason he accepted was to obtain observations and anecdotes for his stand-up comedy. The show increased Rogan's national exposure which caused turnouts at his stand-up gigs to grow. Fear Factor ran for an initial six seasons from 2001 to 2006."}, {"text": "=== 1997–2006: UFC commentator and Fear Factor ===Rogan's role as host of Fear Factor led to further television opportunities. In 2002, he appeared on the episode \"A Beautiful Mind\" of Just Shoot Me as Chris, the boyfriend of lead character Maya Gallo. In December 2002, Rogan was the emcee for the 2002 Blockbuster Hollywood Spectacular, a Christmas parade in Hollywood. In February 2003, Rogan became the new co-host of The Man Show on Comedy Central for its fifth season from August 2003, with fellow comedian Doug Stanhope, following the departure of original hosts Jimmy Kimmel and Adam Carolla. A year into the show, however, the hosts entered disagreements with Comedy Central and the show's producers over content. Rogan recalled: \"I was a little misled ... I was told: 'Show nudity, and we'll blur it out. Swear and we'll bleep it out.' That hasn't been the case\". The show ended in 2004. Around this time Rogan entered talks to host his own radio show, but they came to nothing due to his already busy schedule."}, {"text": "=== 2005–2009: Comedy specials ===In 2005, actor Wesley Snipes challenged Rogan to a cage fight. Rogan trained for the event for five months before Snipes backed out following an investigation by the IRS for alleged tax evasion. Rogan believed Snipes needed a quick payout to alleviate his debt."}, {"text": "=== 2005–2009: Comedy specials ===After Fear Factor, Rogan focused his career on his stand-up comedy, as concentrating on television had made him feel lazy and uninspired to work on new material for his act. With the money he had earned from television, Rogan hired two people full-time to film him and his comedy friends on tour, and release clips on his website for his JoeShow web series. In May 2005, Rogan signed a deal with the Endeavor Talent Agency. Two months later, he filmed his second stand-up comedy special, Joe Rogan: Live, in Phoenix, Arizona. The special premiered on Showtime in 2007."}, {"text": "=== 2005–2009: Comedy specials ===In 2005, Rogan wrote a blog entry on his website accusing comedian Carlos Mencia of joke thievery, a claim he had made since 1993. The situation culminated in February 2007 when Rogan confronted Mencia on stage at The Comedy Store in Hollywood. A video of the incident was uploaded onto YouTube and included evidence and comments from other comedians, including George Lopez, \"The Reverend\" Bob Levy, Bobby Lee, and Ari Shaffir. The incident led to Rogan's talent agent expelling him as a client of The Gersh Agency, who also managed Mencia, and his ban from The Comedy Store, causing him to relocate his regular venue to the Hollywood Improv Comedy Club. Rogan later said that every comic he had talked to was happy and thankful that he did it, and went on to sign with William Morris Agency."}, {"text": "=== 2005–2009: Comedy specials ===In April 2007, Comedy Central Records released Rogan's fourth comedy special, Shiny Happy Jihad. The set was recorded in September 2006 at Cobb's Comedy Club in San Francisco, and contains excerpts of an improvized Q&A session with the audience that was typical of Rogan's act at the time."}, {"text": "=== 2009–present: Latest endeavors and podcast ===Rogan hosted the short-lived CBS show Game Show in My Head, which aired for eight episodes in January 2009. It was produced by Ashton Kutcher. The show involved contestants who try to convince people to perform or take part in increasingly bizarre situations for money. He agreed to host the show as the idea intrigued him, calling it \"a completely mindless form of entertainment\"."}, {"text": "=== 2009–present: Latest endeavors and podcast ===In 2010, Rogan accused comedian Dane Cook of joke thievery."}, {"text": "=== 2009–present: Latest endeavors and podcast ===In 2011, Rogan resumed his role as Fear Factor host for its seventh and final season (until 2012). Rogan took the job, saying he \"would hate to see somebody else do it.\" Later in 2011, Rogan played his first major film character, Gale, in the comedy film Zookeeper. He was also working on a book around this time that he tentatively titled Irresponsible Advice from a Man with No Credibility, based on his blog entries on his website. Rogan played himself in Here Comes the Boom, another action-comedy film starring Kevin James that was released in 2012."}, {"text": "=== 2009–present: Latest endeavors and podcast ===In December 2012, Rogan released his sixth comedy special Live from the Tabernacle exclusively as a download on his website for $5, following Louis C.K.'s example."}, {"text": "=== 2009–present: Latest endeavors and podcast ===In 2013, Rogan hosted the television show Joe Rogan Questions Everything on the SyFy network, which aired for six episodes. The show covered topics discussed on his podcasts, including the existence of Bigfoot and UFOs, and featured several comedians, experts, and scientists with the aim of trying to \"put some subjects to bed ... with an open-minded perspective\". SyFy agreed to produce the show without a pilot episode. The production team gave Rogan some creative control over the program and aimed to present it in his own words where possible."}, {"text": "==== The Joe Rogan Experience ====In December 2009, Rogan launched a free podcast with his friend and fellow comedian Brian Redban. The first episode was recorded on December 24 and was to be a live weekly broadcast on Ustream, with Rogan and Redban \"sitting in front of laptops bullshitting\". By August 2010, the podcast was named The Joe Rogan Experience and entered the list of Top 100 podcasts on iTunes and in 2011, was picked up by SiriusXM Satellite Radio. The podcast features an array of guests who discuss current events, politics, philosophy, comedy, hobbies, and numerous other topics. In January 2015, the podcast was downloaded over 11 million times. By October that year, the podcast was downloaded 16 million times each month, making it one of the most popular free podcasts."}, {"text": "==== The Joe Rogan Experience ====On May 19, 2020, Rogan announced that he had signed a multiyear licensing deal with Spotify worth an estimated $200 million, making it one of the largest licensing agreements in the podcast business. The deal made The Joe Rogan Experience available on Spotify starting September 1, 2020, and exclusive on the platform from January 2021. The podcast is available with both audio and video within the Spotify app and video is no longer streamed or uploaded to YouTube. The podcasts are typically released one day after recording, to allow time for the producers to make clips of the podcast. Clips from the video version will continue to be available on YouTube. In February 2022, Spotify removed 113 episodes of The Joe Rogan Experience over the course of a few days owing in part to some of the episodes having been perceived to have racist and insensitive language."}, {"text": "==== The Joe Rogan Experience ====In February 2022, singer India Arie shared a compilation of Rogan saying the racial slur \"nigger\" on The Joe Rogan Experience on Instagram. Rogan apologized, calling his past language \"regretful and shameful\" while also saying that the clips were taken out of context and that he only quoted the slur to discuss its use by others. The footage in question was first published by the political action committee PatriotTakes, an affiliate of the liberal PAC MeidasTouch. This resulted in allegations of a defamation attempt by MeidasTouch, which the founders denied in an interview with Barstool Sports founder David Portnoy, instead attributing the source of the footage to Alex Jones who was a recurring guest on Rogan's show. Rogan described the video compilation as a \"political hit job\". A number of UFC fighters, including Israel Adesanya, Terrance McKinney, Michael Chandler, Aljamain Sterling, Frankie Edgar, Darren Till, Marlon Vera, Ben Askren, and Brendan Schaub, defended Rogan."}, {"text": "==== The Joe Rogan Experience ====Spotify had refused to carry 42 episodes of the podcast when it acquired the exclusive rights. Spotify says it spoke to Rogan about his \"history of using some racially insensitive language\", and it says (in an internal memo) that Rogan selected 70 episodes which were removed on February 4, 2022, all of which pre-date the COVID-19 pandemic."}, {"text": "==== The Joe Rogan Experience ====In early 2022, the video platform Rumble offered Rogan $100 million to switch from Spotify. Variety reported that Rogan had declined the offer."}, {"text": "==== Onnit ====Rogan is a co-founder of the supplements and fitness company Onnit, which was sold to Unilever in 2021. Rogan frequently advertises for Onnit products on his podcast."}, {"text": "==== Comedy Mothership ====Rogan is also the owner of the Comedy Mothership comedy club in Austin, Texas."}, {"text": "== Personal life ==Rogan married Jessica Ditzel, a former cocktail waitress, in 2009. They have two daughters, who were born in 2008 and 2010. Rogan is also the stepfather or adopted father of Ditzel's daughter from a previous relationship. In 2008, they moved to Gold Hill, Colorado, but returned to Southern California four months later when Ditzel became pregnant. They settled in Bell Canyon, California, where Rogan had lived on and off since 2003. In 2018, they purchased a new home in the area for almost $5 million. In 2020, the family moved into a $14 million home on Lake Austin in Austin, Texas."}, {"text": "== Personal life ==Rogan became interested in jiu-jitsu after watching Royce Gracie fight at UFC 2: No Way Out in 1994. In 1996, he began training in Brazilian jiu-jitsu under Carlson Gracie at his school in Hollywood, California. He is a black belt under Eddie Bravo's 10th Planet Jiu-Jitsu, a style of no-gi Brazilian jiu-jitsu, and a black belt in gi Brazilian jiu-jitsu under Jean Jacques Machado."}, {"text": "== Personal life ==Rogan has vitiligo on his hands and feet. He was raised Catholic, having attended Catholic school in first grade, but has since abandoned organized religion and has called himself an agnostic. In October 2019, he revealed that he is a first cousin once removed of My Chemical Romance members Gerard Way and Mikey Way, although he has never met them."}, {"text": "=== Political positions ===In 2020, CNN described Rogan as \"libertarian-leaning\". Rogan has said that he holds a wide variety of political views and does not easily fall on any particular side of the political spectrum. He has described himself as socially liberal, saying that he supports same-sex marriage, gay rights, women's rights, recreational drug use, universal health care, and universal basic income, but also supports gun rights and the Second Amendment. Rogan describes himself as a strong supporter of freedom of speech, and has criticized cancel culture and what he perceives to be suppression of those who hold right-wing views in the television and film industry. He has also criticized what he describes as an American foreign policy of military adventurism."}, {"text": "=== Political positions ===Rogan endorsed Ron Paul in the 2012 U.S. presidential campaign and voted for Libertarian candidate Gary Johnson in the 2016 U.S. presidential election. He endorsed Bernie Sanders during the 2020 Democratic Party presidential primaries, but ended up voting for Jo Jorgensen in the general election."}, {"text": "=== Political positions ===Rogan has said that Florida governor Ron DeSantis would be \"a good president\", adding that \"what he's done for Florida has been admirable.\" Rogan opposes Canadian Prime Minister Justin Trudeau, calling him \"a fucking dictator\" and called Canada \"communist\" while admitting that he has \"zero understanding\" of Canada's political system. Rogan also said that he liked Trudeau prior to the COVID-19 pandemic. Rogan also called Russian President Vladimir Putin \"evil\"."}, {"text": "==== 2020 presidential election ====Rogan publicly supported Tulsi Gabbard and encouraged her to run for the U.S. presidency in 2020. On January 21, 2020, Rogan said he would \"probably\" vote for Bernie Sanders in the 2020 Democratic primary, adding, \"He's been insanely consistent his entire life.\" Sanders was criticized by fellow Democrats for touting Rogan's endorsement during the 2020 presidential campaign, including by MoveOn, which referred to Rogan as \"someone known for promoting transphobia, homophobia, Islamophobia, racism and misogyny\". The Human Rights Campaign called on Sanders to reject Rogan's endorsement."}, {"text": "==== 2020 presidential election ====After Sanders dropped out of the race, Rogan said he would \"rather vote for Trump than Biden\" adding that \"I don't think [Biden] can handle anything.\" He claimed that he was concerned that Biden, who turned 78 shortly after Election Day, lacked the cognitive ability needed to run the United States and would not be able to handle the pressure of the presidency. Rogan criticized Biden for his verbal slip-ups, which he described as \"not a normal way to communicate, unless you're high\". He also said \"Biden, to me, is like having a flashlight with a dying battery and going for a long hike in the woods, it is not going to work out. It's not going to make it.\" Donald Trump subsequently retweeted Rogan's comments on Biden's mental fitness."}, {"text": "==== 2020 presidential election ====Rogan offered to moderate a four-hour debate with Trump and Biden in an effort to avoid what he referred to as media bias; Trump said he would be willing to do such a debate. A Change.org petition was started \"to elect Joe Rogan as the moderator for the 2020 Presidential Debate\", claiming that Rogan was qualified to handle the debates because he is nonpartisan. The petition received over 300,000 signatures."}, {"text": "==== 2020 presidential election ====Rogan later revealed during a live election night podcast that he voted for Libertarian candidate Jo Jorgensen."}, {"text": "==== 2022 midterm elections ====Rogan urged his followers and those who were angry over COVID-19 safety protocols to \"vote Republican\" in an episode of his podcast centered around lessons learned during the pandemic. He also praised Florida Governor Ron DeSantis, stating that his response to the pandemic was \"open and reasonable\"."}, {"text": "=== Drugs and spirituality ===Rogan supports the legalized use of cannabis and believes it holds numerous benefits. He hosted the documentary film The Union: The Business Behind Getting High and was featured in Marijuana: A Chronic History and The Culture High. He also supports the use of LSD, psilocybin mushrooms, and DMT toward the exploration and enhancement of consciousness, as well as introspection. He was the presenter in the 2010 documentary DMT: The Spirit Molecule."}, {"text": "=== Drugs and spirituality ===Rogan has an interest in sensory deprivation and using an isolation tank. He has stated that his personal experiences with meditation in isolation tanks have helped him explore the nature of consciousness and improve his performance in various physical and mental activities and overall well-being."}, {"text": "=== COVID-19 and vaccines ===In April 2021, Rogan made contentious remarks about COVID-19 vaccines, in particular claiming that young, healthy people do not need to be vaccinated against the virus. This view was criticized by Anthony Fauci and White House communication director Kate Bedingfield, as well as by several media outlets. Part of the objection was that there have been notable cases affecting young, healthy people. Rogan acknowledged there was \"some legitimate science\" behind Fauci's view and emphasized that he is not a doctor and should not be taken as \"a respected source of information\"."}, {"text": "=== COVID-19 and vaccines ===On September 1, 2021, Rogan tested positive for the virus. Soon after, he released an online video reporting on the status of his condition and stating that he had begun a regimen including monoclonal antibodies, prednisone, azithromycin, NAD drip, a vitamin drip, as well as ivermectin, an antiparasitic drug that is not an effective treatment for COVID-19. This drew controversy due to multiple people reportedly being hospitalized after self-medicating with an over-the-counter form of ivermectin designed to treat ailments in livestock, which typically has a significantly larger dosage. Rogan criticized CNN for describing ivermectin as a \"horse dewormer\". On Rogan's podcast, CNN Chief Medical Correspondent Sanjay Gupta said that ivermectin is used to treat diseases caused by parasites but that CNN should not have implied that Rogan was taking a veterinary drug since Rogan acquired it through a doctor. On September 3, 2021, Rogan tested negative for the virus."}, {"text": "=== COVID-19 and vaccines ===In January 2022, 270 scientists, physicians, professors, doctors, and healthcare workers wrote an open letter to Spotify expressing concern over \"false and societally harmful assertions\" on The Joe Rogan Experience and asked Spotify to \"establish a clear and public policy to moderate misinformation on its platform.\" The 270 signatories took issue with Rogan \"broadcasting misinformation, particularly regarding the COVID-19 pandemic\" and more specifically \"a highly controversial episode\" featuring guest Robert W. Malone (#1757)\", a biochemist who has promoted vaccine misinformation."}, {"text": "=== COVID-19 and vaccines ===The episode was criticized for promoting conspiracy theories, including \"an unfounded theory that societal leaders have 'hypnotized' the public\". The signatories wrote that \"Dr. Malone is one of two recent JRE guests who has compared pandemic policies to the Holocaust. These actions are not only objectionable and offensive, but also medically and culturally dangerous.\" The signatories also note that Malone was suspended from Twitter \"for spreading misinformation about COVID-19\"."}, {"text": "=== COVID-19 and vaccines ===On January 24, 2022, the songwriter Neil Young posted an open letter demanding that Spotify remove his music from their service if they would not remove The Joe Rogan Experience from their service. Young wrote that \"Spotify has a responsibility to mitigate the spread of misinformation on its platform\". On January 26, Spotify removed Young's music; a spokesperson said Spotify wanted \"all the world's music and audio content to be available to Spotify users\" and that it had a \"great responsibility in balancing both safety for listeners and freedom for creators\". On January 29, the songwriter Joni Mitchell removed her catalog from Spotify in support of Young and \"the global scientific and medical communities on this issue\"."}, {"text": "=== COVID-19 and vaccines ===Responding to the controversy, Rogan denied intentionally spreading misinformation and pledged \"to try to balance out these more controversial viewpoints with other people's perspectives\", and said that he agreed with Spotify adding a disclaimer to the beginning of his videos."}, {"text": "=== Other views, medical misinformation and advocacy ===Rogan is an avid hunter and is part of the \"Eat What You Kill\" movement, which attempts to move away from factory farming and the mistreatment of animals raised for food."}, {"text": "=== Other views, medical misinformation and advocacy ===Rogan has been a critic of transgender women competing in women's sports, including MMA matches. In April 2022, he said that transgender swimmer Lia Thomas \"might be the woke straw that breaks society's camel's back\". Rogan offered his viewpoint of transgender martial arts artist Fallon Fox, claiming that \"If you had a dick at one point in time, you also have all the bone structure that comes with having a dick. You have bigger hands, you have bigger shoulder joints. You're a fucking man\"."}, {"text": "=== Other views, medical misinformation and advocacy ===In October 2022, while interviewing Tulsi Gabbard on his show, Rogan shared the widely discredited litter boxes in schools hoax, claiming that public schools were providing litter boxes to students who dress up as cats. Rogan said several weeks later that \"it doesn't seem that there's any proof that they put a litter box in there\", but falsely claimed that there were discussions considering the idea."}, {"text": "=== Other views, medical misinformation and advocacy ===During an episode of his podcast in February 2023, Rogan stated the \"idea that Jewish people are not into money is ridiculous. That's like saying Italians aren't into pizza. It's fucking stupid.\" Rogan made the comment in defense of Congresswoman Ilhan Omar, who faced allegations of antisemitism for saying that political support for Israel was \"all about the benjamins.\" Jonathan Greenblatt, the Director of the Anti-Defamation League, condemned Rogan's comment as reflecting \"antisemitic tropes about Jews and money.\""}, {"text": "=== Other views, medical misinformation and advocacy ===In a February 2024 podcast with Bret Weinstein, Rogan said that he thought party drugs were \"a very important factor in AIDS\" and invoked the views of AIDS denialist Peter Duesberg. The American Foundation for AIDS Research reacted by saying, \"The fact is that the human immunodeficiency virus (HIV), untreated, causes AIDS\" and criticizing the podcast for \"disseminating false information\"."}, {"text": "=== Publications ===Foreword to Endure: How to Work Hard, Outlast, and Keep Hammering, by Cameron Hanes, with an afterword by David Goggins. St. Martin's Press (2022). ISBN 978-1250279293."}, {"text": "== Awards and honors ==Teen Choice Award"}, {"text": "== Awards and honors ==Choice TV Reality/Variety Host for Fear Factor (2003, Nominated)"}, {"text": "== Awards and honors ==World MMA Awards"}, {"text": "== Awards and honors ==2011 MMA Personality of the Year"}, {"text": "== Awards and honors ==2012 MMA Personality of the Year"}, {"text": "== Awards and honors ==2014 MMA Personality of the Year"}, {"text": "== Awards and honors ==2015 MMA Personality of the Year"}, {"text": "== Awards and honors ==2016 MMA Personality of the Year"}, {"text": "== Awards and honors ==2017 MMA Personality of the Year"}, {"text": "== Awards and honors ==2019 – July 2020 MMA Personality of the Year"}, {"text": "== Awards and honors ==Wrestling Observer Newsletter"}, {"text": "== Awards and honors ==Best Television Announcer (2010, 2011)"}, {"text": "== See also ==List of Brazilian jiu-jitsu practitioners"}, {"text": "== See also ==List of United States stand-up comedians"}, {"text": "== External links == Media related to Joe Rogan at Wikimedia Commons"}, {"text": "== External links == Quotations related to Joe Rogan at Wikiquote"}, {"text": "== External links ==Official website "}, {"text": "== External links ==Joe Rogan at IMDb"}]