[{"text": "Johnathan Southworth Ritter (September 17, 1948 – September 11, 2003) was an American actor. Ritter was a son of the singing cowboy star Tex Ritter and the father of actors Jason and Tyler Ritter. He is known for playing Jack Tripper on the ABC sitcom Three's Company (1977–1984), and received a Primetime Emmy Award and a Golden Globe Award for the role in 1984. Ritter briefly reprised the role on the spin-off Three's a Crowd, which aired for one season, producing 22 episodes before its cancellation in 1985."}, {"text": "He appeared in over 100 films and television series combined and performed on Broadway, with roles including adult Ben Hanscom in It (1990), Problem Child (1990), Problem Child 2 (1991), a dramatic turn in Sling Blade (1996), and Bad Santa in 2003 (his final live action film, which was dedicated to his memory). In 2002, Don Knotts called Ritter the \"greatest physical comedian on the planet\". His final roles include voicing the title character on the PBS children's program Clifford the Big Red Dog (2000–2003), for which he received four Daytime Emmy Award nominations, and as Paul Hennessy on the ABC sitcom 8 Simple Rules (2002–2003)."}, {"text": "== Early life ==Johnathan Southworth Ritter was born on September 17, 1948, at Providence Saint Joseph Medical Center in Burbank, California. Ritter had a birth defect known as a coloboma in his right eye. His father, Tex Ritter, was a singing cowboy and matinee star, and his mother, Dorothy Fay (née Southworth), was an actress. He had an older brother, Thomas \"Tom\" Ritter. Ritter attended Hollywood High School, where he was student body president. He attended the University of Southern California and majored in psychology with plans to have a career in politics. He later changed his major to theater arts and attended the USC School of Dramatic Arts (formerly School of Theatre).  Ritter was a member of Phi Gamma Delta fraternity at USC.  While still in college, Ritter traveled to the United Kingdom, the Netherlands, and West Germany to perform in plays. Ritter graduated in 1970."}, {"text": "=== Film and television ===Ritter headlined several stage performances. After his graduation from USC in 1970, his first television acting experience was as a campus revolutionary in the television series Dan August starring Burt Reynolds and future Three's Company co-star Norman Fell. Ritter made his film debut in the 1971 Disney film The Barefoot Executive. He made guest appearances on the television series Hawaii Five-O, M*A*S*H, and many others. He had a recurring role as the Reverend Matthew Fordwick on the drama series The Waltons from October 1972 to December 1976. Because he was not a weekly cast member, he had time to pursue other roles, which he did until December 1976, when he left for a starring role in the hit sitcom Three's Company (the Americanized version of the 1970s British Thames Television series Man About the House) in 1977. In 1978, Ritter played Ringo Starr's manager on the television special Ringo. In 1982, Ritter provided the voice of Peter Dickinson in the animated film The Flight of Dragons."}, {"text": "=== Film and television ===Ritter became a household name on Three's Company, portraying struggling culinary student Jack Tripper with two female roommates. Ritter co-starred opposite Joyce DeWitt and Suzanne Somers, and then later Jenilee Harrison and Priscilla Barnes. Much of the comedy centered around Jack's pretending to be gay to keep the old-fashioned landlords appeased over the co-ed living arrangements. The series spent several seasons near the top of the ratings in the United States before ending in 1984. A year-long spin-off, Three's a Crowd, ensued, as the Jack Tripper character has a live-in girlfriend and runs his own bistro. The original series has been seen continuously in reruns and is available on DVD. During the run of Three's Company, Ritter appeared in the films Hero at Large, Americathon, and They All Laughed. In 1986, he played the role of Dad in the music video for Graham Nash's song \"Innocent Eyes\" from the album of the same name. "}, {"text": "=== Film and television ===Hooperman was Ritter's first regular television role after Three's Company. Detective Harry Hooperman inherits a run-down apartment building and hires Susan Smith (Debrah Farentino) to run it. A relationship follows, and Hooperman must juggle work, love, and the antics of Bijoux the dog. In 1988, John was nominated for both an Emmy Award and a Golden Globe Award for his work on Hooperman. Ritter won a People's Choice Award for this role. From 1992 to 1995, Ritter returned to television for three seasons as John Hartman, aide to a U.S. Senator, in Hearts Afire. This series starred Markie Post as Georgie Anne Lahti and Billy Bob Thornton as Billy Bob Davis. He also played Garry Lejeune / Roger Tramplemain in the production Noises Off in 1992."}, {"text": "=== Film and television ===After his time on television, he appeared in a number of movies, most notably Problem Child and its first sequel. He co-starred with Jim Belushi in 1987's Real Men and played the lead role in Blake Edwards' 1989 film Skin Deep. He appeared in the film version of Noises Off, rejoined Billy Bob Thornton in the Oscar-winning Sling Blade (playing a kindhearted, gay, discount-store manager), and co-starred with Olivier Gruner in the 1996 action film Mercenary. "}, {"text": "=== Film and television ===Ritter starred in many made-for-TV movies, including Gramps (1995), co-starring with Andy Griffith, Rob Hedden's The Colony (1995) with Hal Linden, Stephen King's It, Danielle Steel's Heartbeat with Polly Draper, and It Came from the Sky in 1999 with Yasmine Bleeth. Ritter also made guest appearances on television shows, such as Felicity, Ally McBeal, Scrubs, Buffy the Vampire Slayer, and Law & Order: Special Victims Unit. He also provided the voice of the title character in the animated children's show Clifford the Big Red Dog and its animated film adaptation Clifford's Really Big Movie (2004), a role for which he received four Emmy nominations. His final film was Stanley's Dinosaur Round-Up (2006), an animated direct-to-DVD film based on the television series, which was dedicated to his memory. At the time of his death, he was starring in 8 Simple Rules... for Dating My Teenage Daughter."}, {"text": "=== Theater ===In 2000, Ritter co-starred with Henry Winkler in Neil Simon's The Dinner Party  at the Music Box Theatre on Broadway, portraying Claude Pichon. It ran for 364 performances. Ritter won the Theatre World Award in 2001 for his performance in that work. In 2003, Ritter made his final stage appearance in All About Eve at the Ahmanson Theatre."}, {"text": "=== Theater ===J For J at LA's Court Theatre March 14-April 21, 2002. Starring John Ritter, Jeff Kober and Jenny Sullivan. Directed by Joseph Fuqua. Written by Jenny Sullivan."}, {"text": "== Personal life ==On October 16, 1977, Ritter married actress Nancy Morgan, with whom he had three children: Jason Carly, and Tyler. They divorced on September 1, 1996. He married actress Amy Yasbeck on September 18, 1999, at the Murphy Theatre in Wilmington, Ohio. They had a child born in 1998. Yasbeck played his love interest in the first two Problem Child movies, though as two different characters. Yasbeck also played Ritter's wife in two sitcom appearances. In 1991, both were guest stars on The Cosby Show, in which Yasbeck played the in-labor wife of Ritter's basketball coach character. In 1996, Ritter guest-starred on Yasbeck's sitcom, Wings, as the estranged husband of Yasbeck's character, Casey."}, {"text": "== Death ==On September 11, 2003, Ritter was rehearsing for 8 Simple Rules... for Dating My Teenage Daughter on the Walt Disney Studios lot in Burbank, California when he suddenly fell ill and began to experience problems with his heart. Sweating profusely, vomiting, and complaining of chest pain, he was taken across the street to the Providence Saint Joseph Medical Center at 6:00 pm. Ritter was initially treated by emergency room physicians for a heart attack; however, his condition quickly worsened. Ritter was then diagnosed with aortic dissection and was taken into surgery, but was pronounced dead at 10:48 p.m., at the age of 54.A private funeral for Ritter was held in Los Angeles on September 15, 2003, after which he was interred at Forest Lawn Memorial Park in Hollywood Hills.In 2008, Ritter's widow Amy Yasbeck, on behalf of herself and Ritter's children, filed lawsuits against doctors involved in Ritter's treatment and Providence St. Joseph Medical Center. The lawsuit against Providence St. Joseph was settled out of court for $9.4 million. A $67 million wrongful-death lawsuit against two of the physicians, radiologist Matthew Lotysch and cardiologist Joseph Lee, went to trial. Yasbeck accused Lee, who treated Ritter on the day of his death, of misdiagnosing his condition as a heart attack and Lotysch, who had given him a full-body scan two years earlier, of failing at that time to detect an enlargement of Ritter's aorta. In 2008, at the Los Angeles County Superior Court, the jury concluded that the doctors who treated Ritter the day he died were not negligent and thus were not responsible for his death."}, {"text": "=== Response and legacy ===Many of Ritter's colleagues expressed sorrow following the news of his death. Zach Braff, who worked with Ritter on Scrubs, called Ritter a \"comic hero\" of his and said he had approached series creator Bill Lawrence to get Ritter to play his character J.D.'s father (which Ritter did for two episodes and was slated to return for a third the week following his death). Katey Sagal testified in the wrongful death lawsuit, calling Ritter a \"funny man who was funny like nobody's business\". His Three's Company co-star Joyce DeWitt remarked he was \"impossible to forget. Impossible not to love\".8 Simple Rules... for Dating My Teenage Daughter was later retitled 8 Simple Rules following Ritter's death and continued for one and a half more seasons before its cancellation in 2005. Ritter's character, Paul Hennessy, was said to have died after collapsing in a grocery store while buying milk. ABC aired the first three episodes of the show's second season that had been taped before his death, each of which was introduced by Katey Sagal. The remainder of the show dealt with the family trying to grapple with Paul's death. New male characters, played by James Garner and David Spade, were later added to the main cast as Ritter's replacements. Shortly before his death, Ritter had done a week-long taping with Hollywood Squares, which was aired as a tribute to him, introduced by Henry Winkler, the executive producer of the show and a very close friend of Ritter's. Four days after Ritter's death, Nick at Nite ran an all-night Three's Company marathon dedicated to his memory.In 2004, Ritter was posthumously given an Emmy nomination for playing Paul Hennessy in 8 Simple Rules... for Dating My Teenage Daughter but lost to Kelsey Grammer for playing the title character of Frasier. Upon accepting his trophy, Grammer's remarks included comments made in tribute and remembrance of Ritter. Ritter's final films, Bad Santa and Clifford's Really Big Movie, along with a Season 4 episode of Scrubs (his character in this series died, as well), the Season 8 King of the Hill episode \"Stressed for Success\" (in which he played music teacher Eugene Grandy) and Stanley's Dinosaur Round-Up (in which he played Great Uncle Stew) were all dedicated to his memory.On June 6, 2008, Hollywood High School dedicated a mural of Ritter painted by Eloy Torrez. In March 2010, the Thoracic Aortic Disease (TAD) Coalition, in partnership with Yasbeck and the John Ritter Foundation (JRF), announced the creation of the \"Ritter Rules\" which are life-saving reminders to recognize, treat and prevent thoracic aortic dissection. The purpose of the JRF is to provide accurate information to the general public about the disease and its risk factors, provide support to individuals who have thoracic aortic disease or have lost a loved one to the disease and improve the identification of individuals at risk for aortic dissections and the treatment of thoracic aortic disease through medical research. Yasbeck worked with the University of Texas Health Science Center at Houston (UTHealth) to establish the John Ritter Research Program in Aortic and Vascular Diseases with the goal of preventing premature deaths due to aortic dissection by identifying genetic mutations that predispose individuals to thoracic aortic aneurysms and dissections."}, {"text": "== Awards and honors ==1983: Star on the Walk of Fame – 6627 Hollywood Boulevard; he and Tex Ritter were the first father-and-son pair to be so honored in different categories."}, {"text": "== Further reading ==Yasbeck, Amy (2010). With Love and Laughter, John Ritter. New York: Gallery Books. ISBN 978-1-4165-9841-1."}, {"text": "== External links ==John Ritter at IMDb "}, {"text": "== External links ==John Ritter at the TCM Movie Database "}, {"text": "== External links ==John Ritter at Rotten Tomatoes "}, {"text": "== External links ==John Ritter at AllMovie"}, {"text": "== External links ==John Ritter at the Internet Broadway Database "}, {"text": "== External links ==John Ritter at Emmys.com"}, {"text": "== External links ==John Ritter's Death at Famously Dead"}, {"text": "== External links ==John Ritter Foundation"}, {"text": "== External links ==John Ritter’s Life-Saving Rules"}, {"text": "== External links ==John Ritter Research Program in Aortic and Vascular Diseases"}]