[{"text": "John Joseph Travolta (born February 18, 1954) is an American actor. Travolta began acting in television before transitioning into a leading man in films. His accolades include a Primetime Emmy Award and a Golden Globe Award, in addition to nominations for two Academy Awards and a BAFTA Award."}, {"text": "Travolta came to prominence starring in the sitcom Welcome Back, Kotter (1975–1979), followed by leading roles in Carrie (1976), Grease (1978), Urban Cowboy (1980), and Blow Out (1981). He earned nominations for the Academy Award for Best Actor for his roles in Saturday Night Fever (1977) and Pulp Fiction (1994). His other notable films include Get Shorty (1995), Broken Arrow (1996), Michael (1996), Face/Off (1997), A Civil Action (1998), Primary Colors (1998), The General's Daughter (1999), Wild Hogs (2007), Hairspray (2007), Bolt (2008), and Savages (2012)."}, {"text": "Travolta returned to television portraying lawyer Robert Shapiro in the series The People v. O. J. Simpson: American Crime Story. He received a Primetime Emmy Award as a producer as well as nominations for a Primetime Emmy Award for Outstanding Supporting Actor in a Limited or Anthology Series or Movie. He was also Emmy-nominated for his role in the comedy short Die Hart (2021). Outside of acting, Travolta is also a singer-songwriter. He has released nine albums, including four singles that have charted on the Billboard Hot 100's Top 40. His albums have typically accompanied films he has starred in, such as Grease: The Original Soundtrack from the Motion Picture (1978)–which topped the Billboard 200. Travolta is also a private pilot."}, {"text": "== Early life ==The youngest of six children, Travolta was born and raised in Englewood, New Jersey, an inner-ring suburb of New York City in Bergen County, New Jersey."}, {"text": "== Early life ==His father, Salvatore \"Sam\" Travolta, was a semiprofessional American football player turned tire salesman and partner in a tire company, Travolta Tire Exchange. His mother, Helen Cecilia (née Burke),  was an actress and singer who had appeared in The Sunshine Sisters, a radio vocal group, and acted and directed before becoming a high school drama and English teacher. His siblings Joey, Ellen, Ann, Margaret, and Sam Travolta were all inspired by their mother's love of theater and drama and became actors. His father was a second-generation Italian American with roots in Godrano, Sicily, and his mother was Irish American.He grew up in an Irish-American neighborhood and said that his household was predominantly Irish in culture. He was raised Catholic, but later converted to Scientology in 1975 at age 21. Travolta attended Dwight Morrow High School, but dropped out as a junior at age 17 in 1971."}, {"text": "=== 1971–1979: Sitcom and film stardom ===After dropping out of school, Travolta moved across the Hudson River to New York City and landed a role in the touring company of the musical Grease and on Broadway in Over Here!, singing the Sherman Brothers' song \"Dream Drummin'\". He then moved to Los Angeles for professional reasons. Travolta's first screen role in California was as a fall victim in Emergency! (Season 2, Episode 2) in September 1972, but his first significant movie role was as Billy Nolan, a bully who was goaded into playing a prank on Sissy Spacek's character in the horror film Carrie (1976) directed by Brian de Palma. Around that time, he landed his star-making role as Vinnie Barbarino in the ABC TV sitcom Welcome Back, Kotter (1975–1979), in which his sister, Ellen, also occasionally appeared (as Arnold Horshack's mother).Travolta had a hit single titled \"Let Her In\", peaking at number 10 on the Billboard Hot 100 chart in July 1976. In the next few years, he starred in the television movie The Boy in the Plastic Bubble and two of his most noted screen roles: Tony Manero in the dance drama Saturday Night Fever (1977) and Danny Zuko in the musical Grease (1978). The films were among the most commercially successful pictures of the decade and catapulted Travolta to international stardom. Saturday Night Fever earned him a nomination for the Academy Award for Best Actor, making him, at age 24, one of the youngest performers ever nominated for the Best Actor Oscar. His mother and his sister Ann appeared very briefly in Saturday Night Fever and his sister Ellen played a waitress in Grease. Travolta performed on the Grease soundtrack album. After the failure of the romance Moment by Moment (1978) in which he starred with Lily Tomlin, Travolta rebounded in 1980, riding a nationwide country music craze that followed on the heels of his hit film Urban Cowboy, in which he starred with Debra Winger."}, {"text": "=== 1980–1999: Established actor ===Travolta followed up Urban Cowboy with a starring role in Brian de Palma's 1981 film Blow Out, which was critically lauded but a box office disappointment, likely due to its bleak ending. After Blow Out came a series of commercial and critical failures which sidelined Travolta's acting career. These included Two of a Kind (1983), a romantic comedy reuniting him with Olivia Newton-John, and Perfect (1985), co-starring Jamie Lee Curtis. He also starred in Staying Alive, the 1983 sequel to Saturday Night Fever, for which he trained rigorously to portray a professional dancer and lost 20 pounds; the film was a financial success, grossing over $65 million, though it, too, was scorned by critics."}, {"text": "=== 1980–1999: Established actor ===During that time, Travolta was offered, but declined, lead roles in what would become box-office hits, including American Gigolo and An Officer and a Gentleman, both of which went to Richard Gere, as well as Splash, which went to Tom Hanks."}, {"text": "=== 1980–1999: Established actor ===In 1989, Travolta starred with Kirstie Alley in Look Who's Talking, which grossed $297 million, making it his most successful film since Grease. He subsequently starred in Look Who's Talking Too (1990) and Look Who's Talking Now (1993), but it was not until he played against type as Vincent Vega in Quentin Tarantino's hit Pulp Fiction (1994), with Samuel L. Jackson, for which he received an Academy Award nomination, that his career was revived. It was Travolta's third film alongside Bruce Willis. The movie shifted him back onto the A-list and he was inundated with many diverse offers. Notable roles following Pulp Fiction include a movie-buff loan shark in Get Shorty (1995), a factory worker in White Man's Burden (1995), a corrupt U.S. Air Force pilot in Broken Arrow (1996), an everyman with extraordinary powers in Phenomenon (1996), an archangel in Michael (1996), an FBI agent and terrorist in Face/Off (1997), a desperate attorney in A Civil Action (1998), a Bill Clinton–esque presidential candidate in Primary Colors (1998), and a military investigator in The General's Daughter (1999)."}, {"text": "=== 2000–present: Return to television ===In 2000, Travolta starred in and co-produced the science fiction film Battlefield Earth, based on the novel of the same name by L. Ron Hubbard, in which he played the villainous leading role as a leader of a group of aliens that enslaves humanity on a bleak future Earth. The film was a dream project for Travolta since the book's release in 1982, when Hubbard wrote to him to try to help make a film adaptation. The film received almost universally negative reviews and did very poorly at the box office. Travolta's performance in Battlefield Earth also earned him two Razzie Awards."}, {"text": "=== 2000–present: Return to television ===Throughout the 2000s, Travolta remained busy as an actor, starring in Swordfish (2001); Domestic Disturbance (2001); Ladder 49 (2004); Be Cool (2005); Lonely Hearts (2006); Wild Hogs (2007); the Disney computer-animated film Bolt (2008), in which Travolta voiced the title character; The Taking of Pelham 123; and Old Dogs (both 2009)."}, {"text": "=== 2000–present: Return to television ===In 2007, Travolta played Edna Turnblad in the remake of Hairspray, his first musical since Grease.Since 2010, Travolta has starred mostly in action films and thrillers, such as From Paris with Love (2010) and Savages (2012).  In 2016, he returned to television in the first season of the anthology series American Crime Story, titled The People v. O. J. Simpson, in which he played lawyer Robert Shapiro. For his performance he received a nomination for the Primetime Emmy Award for Outstanding Supporting Actor in a Limited or Anthology Series or Movie."}, {"text": "=== 2000–present: Return to television ===Following the death of his wife Kelly Preston in July 2020, Travolta hinted on his Instagram account that he would be putting his career on hold, stating \"I will be taking some time to be there for my children who have lost their mother, so forgive me in advance if you don't hear from us for a while\"."}, {"text": "=== Family ===Travolta was in a relationship with actress Diana Hyland, whom he met while filming The Boy in the Plastic Bubble (1976). They remained together until Hyland's death from breast cancer on March 27, 1977. In 1980, Travolta dated French actress Catherine Deneuve. Travolta also had an on-again/off-again relationship with actress Marilu Henner, which ended permanently in 1985. In 1988 while filming The Experts, Travolta met actress Kelly Preston, whom he married in Paris in 1991. They had three children: Jett (1992–2009), Ella Bleu (born 2000), and Benjamin (born 2010). They regularly attended marriage counseling and Travolta has stated that therapy helped the marriage. They lived near Ocala, Florida."}, {"text": "=== Family ===On January 2, 2009, Jett died at age 16 while on a Christmas vacation in The Bahamas. A Bahamian death certificate was issued, attributing the cause of death to a seizure. Jett, who had a history of seizures, reportedly had had Kawasaki disease since the age of two. Travolta confirmed that Jett was autistic and had regular seizures, and immediately made his public statements while giving testimony at the trial of two defendants (a paramedic and a former Bahamas senator) who Travolta alleged tried to blackmail him with a multimillion-dollar extortion plot involving private information in connection with the death of his son Jett. After a mistrial, Travolta dropped the charges and has credited his immediate family and Scientology with helping him to cope with Jett's death and move forward with his career. In memory of Jett, Travolta created the Jett Travolta Foundation, a nonprofit organization to help children with special needs. It has contributed to organizations such as the Oprah Winfrey Leadership Academy, Institutes for the Achievement of Human Potential, and Simon Wiesenthal Center.On July 12, 2020, Travolta's wife, Kelly Preston, died at the age of 57, at their home in Anthony, Florida, two years after she was diagnosed with breast cancer. Preston had undergone treatment at different hospitals, and at the time of her death, was receiving treatment at the MD Anderson Cancer Center in Houston, Texas."}, {"text": "=== Scientology ===Travolta joined the Church of Scientology in 1975. He converted after being given the book Dianetics from former actress Joan Prather.After the 2010 Haiti earthquake, joining other celebrities in helping with the relief efforts, Travolta reportedly flew his Boeing 707 full of supplies, doctors, and Scientologist Volunteer Ministers into the disaster area."}, {"text": "=== Aviation ===Travolta is a pilot and rated to fly Boeing 707, 737, and 747 planes. He owns four aircraft. Travolta owned an ex-Qantas Boeing 707-138B (Ex-VH-EBM) which bears an old livery of Qantas, and Travolta acted as an official goodwill ambassador for the airline wherever he flew. Travolta named his 707 \"Jett Clipper Ella\", in honor of his children. The \"Clipper\" in the name refers to the use of that word by Pan Am as the company's call sign as well as in the names of their aircraft. In 2017, Travolta donated the Boeing 707 to the Historical Aircraft Restoration Society (HARS) near Wollongong, Australia. This was expected to be flown to Australia in November 2019, but was later delayed to sometime in 2020 due to condition of the aircraft. Travolta planned to be on board when the aircraft was to be flown to Illawarra Regional Airport, where HARS is based, however was not allowed to fly it, because it was to be registered as an Australian aircraft.On November 24, 1992, Travolta was piloting his Gulfstream N728T at night above a solid undercast when he experienced a total electrical system failure while flying under instrument flight rules into Washington National Airport. During the emergency landing, he almost had a mid-air collision with a USAir Boeing 727, an event attributed to a risky decision by an air traffic controller.In 1984, Travolta was inducted into the American Academy of Achievement and presented with the Golden Plate Award by Awards Council member General Chuck Yeager, USAF. Travolta was inducted into the Living Legends of Aviation in 2007 and acts as the award show's official ambassador.On September 13, 2010, during the first episode of the final season of her talk show, Oprah Winfrey announced that she would be taking her entire studio audience on an eight-day, all-expenses-paid trip to Australia, with Travolta serving as pilot for the trip. He had helped Winfrey plan the trip for more than a year.He is the author of the book Propeller One-Way Night Coach, the story of a young boy's first flight.His estate in Ocala, Florida, is situated at Jumbolair Airport with its own runway and taxiway right to his house, with two outbuildings for covered access to planes."}, {"text": "=== Legal issues ===In May 2012, an anonymous male masseur filed a lawsuit against Travolta, citing claims of sexual assault and battery. A lawyer for Travolta said that the allegations were \"complete fiction and fabrication\". Travolta's counsel also stated that his client would be able to prove that he was not in California on the day in question and asserted that Travolta would \"sue the attorney and Plaintiff for malicious prosecution\" after getting the case thrown out. A second masseur later joined the lawsuit, making similar claims. Both lawsuits were subsequently dropped by the complainants and dismissed without prejudice.On September 27, 2012, Los Angeles Superior Court Judge Malcolm Mackey dismissed a defamation lawsuit against Travolta and his attorney Marty Singer by writer Robert Randolph because he found that a letter, written by Singer in response to allegations in a book by Randolph, was protected by free speech."}, {"text": "== Awards and nominations ==Travolta was nominated for the Academy Award for Best Actor for his performances in Saturday Night Fever and Pulp Fiction. He won a Golden Globe Award for Best Actor in a Motion Picture – Musical or Comedy for his performance in Get Shorty and has received a total of six nominations, the most recent being in 2011. In 2014, he received the IIFA Award for Outstanding Achievement in International Cinema."}, {"text": "== See also ==List of oldest and youngest Academy Award winners and nominees – Youngest Nominees for Best Actor in a Leading Role"}, {"text": "== Further reading ==Tast, Brigitte, ed. (1978). John Travolta (in German). Hildesheim, Germany: Kulleraugen. ISBN 3-88842-103-9. Pamphlet."}, {"text": "== External links ==Official website"}, {"text": "== External links ==John Travolta at IMDb "}, {"text": "== External links ==John Travolta on Charlie Rose"}, {"text": "== External links ==John Travolta at the Internet Broadway Database "}, {"text": "== External links ==John Travolta at the Internet Off-Broadway Database"}, {"text": "== External links ==John Travolta collected news and commentary at The New York Times"}, {"text": "== External links ==John Travolta at Hollywood Walk of Fame"}, {"text": "== External links ==John Travolta at AllMovie"}]