[{"text": "John Franklin Candy (October 31, 1950 – March 4, 1994) was a Canadian actor and comedian who is best known for his work in Hollywood films. Candy first rose to national prominence in the 1970s as a member of the Toronto branch of the Second City and its SCTV sketch comedy series. He rose to international fame in the 1980s with his roles in comedic films such as Stripes, Splash, Brewster's Millions, Planes, Trains and Automobiles, Spaceballs, The Great Outdoors, Uncle Buck, and Cool Runnings. He also appeared in supporting roles in The Blues Brothers, National Lampoon's Vacation, Little Shop of Horrors, and Home Alone, and featured in dramatic roles in Only the Lonely and JFK."}, {"text": "In addition to his work as an actor, Candy was a co-owner of the Toronto Argonauts of the Canadian Football League (CFL), and the team won the 1991 Grey Cup under his ownership. He died in 1994 at the age of 43. His final two film appearances, Wagons East and Canadian Bacon, are dedicated to his memory."}, {"text": "== Early life and education ==Candy was born on October 31, 1950, in Toronto and grew up in Newmarket, Ontario. The son of Sidney James Candy and Evangeline Candy, he was brought up in a working-class Catholic family. His childhood home was at 217 Woodville Avenue in East York, Ontario. According to the 1921 Canadian census records Candy's father Sidney was born to English parents who emigrated to Canada in 1913. John Candy's mother was of Polish descent.: 19  His father died of complications of heart disease at age 35 in 1955 when John was five years old.Candy attended Neil McNeil Catholic High School where he was the treasurer of the student council and played offensive tackle on the school's football team and participated in drama club. Long before considering acting, Candy aspired to become a professional football player, but a knee injury during his high school football career prevented him from fulfilling his dream. He later enrolled in Centennial College to study journalism, and then went to McMaster University. He started acting while at college."}, {"text": "=== 1971–1978: Early career and SCTV ===In 1971, Candy was cast in a small part as a Shriner in Creeps by David E. Freeman, a new Canadian play about cerebral palsy, in the inaugural season of the Tarragon Theatre in Toronto.: 22  Candy guest-starred on a Canadian children's television series, Cucumber, and made a small, uncredited appearance in Class of '44 (1973). He had a small part in The ABC Afternoon Playbreak (\"Last Bride of Salem\") and had a regular role on the TV series Dr. Zonk and the Zunkins (1974–75)."}, {"text": "=== 1971–1978: Early career and SCTV ===Candy became a member of Toronto's branch of The Second City in 1972. He gained wide North American popularity when he became a cast member on the influential Edmonton and later Toronto-based comedy-variety show Second City Television (SCTV). NBC picked the show up in 1981 and quickly became a fan favorite. It won Emmy Awards for the show's writing in 1981 and 1982. Among Candy's SCTV characters were unscrupulous street-beat TV personality Johnny LaRue, 3-D horror auteur Doctor Tongue, sycophantic and easily amused talk-show sidekick William B. Williams, and Melonville's corrupt Mayor Tommy Shanks."}, {"text": "=== 1971–1978: Early career and SCTV ===In 1975 he played Richie, an accused killer, in the episode \"Web of Guilt\" on the Canadian TV show Police Surgeon. He was in It Seemed Like a Good Idea at the Time (1975), shot in Canada, as well as the children's sitcom Coming Up Rosie (1975–78) with Dan Aykroyd. Candy had a small role in Tunnel Vision (1976)."}, {"text": "=== 1971–1978: Early career and SCTV ===During the series' run he appeared in films such as The Clown Murders (1976) and had a lead in a low-budget comedy, Find the Lady (1976).In 1976, Candy played a supporting role (with Rick Moranis) on Peter Gzowski's short-lived late-night television talk show 90 Minutes Live. In 1978, Candy had a small role as a bank employee (with Christopher Plummer and Elliott Gould) in the Canadian thriller The Silent Partner. He guest starred on such shows as The David Steinberg Show and King of Kensington."}, {"text": "=== 1979–1987: Hollywood breakthrough ===In 1979, Candy took a brief hiatus from SCTV and began a more active film career, appearing in a minor role in Lost and Found (1979) and playing a U.S. Army soldier in Steven Spielberg's big-budget comedy 1941. He returned to Canada for roles in The Courage of Kavik, the Wolf Dog (1980) and the action thriller Double Negative (1980). He had a supporting role as easygoing parole officer Burton Mercer in The Blues Brothers (1980), starring Aykroyd, and did an episode of Tales of the Klondike (1981) for Canadian TV."}, {"text": "=== 1979–1987: Hollywood breakthrough ===In 1980, Candy hosted a short-lived NBC television program, Roadshow, described by The Washington Post as \"improvisational journalism.\" Appearing as himself, Candy and a video crew traveled in a tour bus to Baton Rouge, Louisiana (home of Louisiana State University), and Carbondale, Illinois, home of Southern Illinois University Carbondale), and interviewed college students amid party atmospheres such as the latter's Halloween street celebration. He also obtained backstage access to interview Midge Ure, the lead singer of the UK electronic band Ultravox, which performed a concert on the SIU campus the evening of 10/31/80. It is unknown if more than two episodes aired."}, {"text": "=== 1979–1987: Hollywood breakthrough ===Candy played the lovable, mild-mannered Army recruit Dewey Oxberger in Stripes (1981), directed by Canadian Ivan Reitman, which was one of the most successful films of the year. He provided voices for multiple characters in the animated film Heavy Metal (1981), most notably as the title character in the \"Den\" segment, which was well-received, including by the character's creator, Richard Corben, who singled out Candy's humorously lighthearted interpretation of the title character as excellent.From 1981 to 1983, Candy appeared in SCTV Network on television. He made a cameo appearance in Harold Ramis' National Lampoon's Vacation (1983), his first collaboration with John Hughes, who wrote the script. Candy appeared on Saturday Night Live twice (hosting in 1983) while still appearing on SCTV. According to writer-comedian Bob Odenkirk, Candy was reputedly the \"most-burned potential host\" of SNL, in that he was asked to host many times, only for plans to be changed by the SNL staff at the last minute. Candy headlined in the Canadian film Going Berserk (1983). He was approached to play the character of accountant Louis Tully in Ghostbusters (1984), starring Aykroyd and directed by Reitman, but ultimately did not get the role because of his conflicting ideas of how to play the character; the part went instead to SCTV colleague Rick Moranis, whose ideas were better received. However, Candy did make a contribution to the franchise, as one of the many people chanting \"Ghostbusters\" in the video for Ray Parker Jr.'s hit single for the film."}, {"text": "=== 1979–1987: Hollywood breakthrough ===Candy played Tom Hanks's womanizing brother in the hit romantic comedy Splash, generally considered his break-out role. After the success of the film, he had signed a three-picture development and producing deal with Walt Disney Pictures, and he would develop and executive produce various theatricals as planned starring vehicles for himself.Candy went back to Canada to star in The Last Polka (1985), which he also wrote with co-star Eugene Levy. He was Richard Pryor's best friend on Brewster's Millions (1985) and had a cameo in the Sesame Street film Follow That Bird (1985). Candy's first lead role in a Hollywood film came with Summer Rental (1985), directed by Carl Reiner. He was reunited with Hanks in Volunteers (1985), though the film did not do as well as Splash. He had a cameo in The Canadian Conspiracy (1985) and appeared alongside Martin Short in Dave Thomas: The Incredible Time Travels of Henry Osgood (1985) in Canada. Candy's next starring role in a Hollywood film was the box office disappointment Armed and Dangerous (1986) with Levy and Meg Ryan. He had a cameo in Little Shop of Horrors (1986) and appeared in Really Weird Tales (1987). He also had a supporting role in Mel Brooks's Spaceballs (1987)."}, {"text": "=== 1987–1995: John Hughes films and final roles ===Candy had a hit film when he starred in Planes, Trains & Automobiles (1987) with Steve Martin, written and directed by John Hughes. He appeared in a cameo role in Hughes's She's Having a Baby (1988) and then starred in a film written by Hughes, The Great Outdoors (1988) which co-starred Aykroyd."}, {"text": "=== 1987–1995: John Hughes films and final roles ===Candy provided the voice for Don the Horse in Hot to Trot (1988) and starred in a flop comedy, considered by some to be a cult classic, Who's Harry Crumb? (1989), which he also produced. He was also in the box office flop Speed Zone aka Cannonball Fever (1989), however, he had another hit film with Hughes as writer and director in Uncle Buck (1989). Candy also produced and starred in a Saturday-morning animated series on NBC titled Camp Candy in 1989. The show was set in a fictional summer camp run by Candy, featured his two children in supporting roles, and also spawned a brief comic book series published by Marvel Comics' Star Comics imprint. During this time, he also made the television film The Rocket Boy (1989) in Canada."}, {"text": "=== 1987–1995: John Hughes films and final roles ===Candy also provided the voice of Wilbur the Albatross in Disney's animated film The Rescuers Down Under (1990) and had a cameo in two more films written by Hughes, the blockbuster hit film Home Alone (1990) and the box office flop Career Opportunities (1991). According to Candy's biography, he was in talks to play Bette Midler's working-class husband in the 1990 film Stella. However, when he was informed that Midler demanded he do a screen test, Candy became incredulous proclaiming \"Who the (expletive) does she think she is?!\" and declined. John Goodman was eventually cast in the role. From 1988 to 1990, Candy hosted \"Radio Kandy,\" a hot adult contemporary radio music countdown syndicated by Premiere Networks."}, {"text": "=== 1987–1995: John Hughes films and final roles ===In 1991, Chris Columbus wrote and directed Only the Lonely with John Hughes serving as co-producer, and starring Candy and Maureen O'Hara; it was well reviewed but not a big hit. Candy also had a supporting role in Nothing But Trouble (1991), Dan Aykroyd's notorious box office flop. Also unsuccessful were the comedies Delirious (1991) and Once Upon a Crime... (1992).  During this time, Candy played a small dramatic role as Dean Andrews Jr., a shady Southern lawyer in Oliver Stone's JFK (1991), and had a cameo in the television film Boris and Natasha: The Movie (1992). Candy starred in his first comedic hit in a number of years with Cool Runnings (1993), a story of the first Jamaican national bobsleigh team attempting to make it to the 1988 Winter Olympics. He also had a cameo in the successful Rookie of the Year (1993). He made his directorial debut in the 1994 comedy television film Hostage for a Day. His last appearances were in Wagons East (1994) and Canadian Bacon (1995) ."}, {"text": "=== Unfinished projects ===Candy was in talks to portray Ignatius J. Reilly in a now-shelved film adaptation of John Kennedy Toole's Pulitzer Prize–winning novel A Confederacy of Dunces. He had also expressed interest in portraying Atuk in a film adaptation of Mordecai Richler's The Incomparable Atuk and Roscoe \"Fatty\" Arbuckle in a biopic based on the silent film comedian's life. These three shelved projects have been alleged as cursed because Candy, John Belushi, Sam Kinison, and Chris Farley were each attached to all three roles; they all died before they could make any of these films. Candy was originally considered to play Alec Guinness's role in the remake of the 1950 film Last Holiday, with Carl Reiner directing. Eventually the role was played by Queen Latifah in a loose remake released in 2006. Candy was also slated to collaborate with John Hughes again in a comedy opposite Sylvester Stallone, titled Bartholomew vs. Neff. Candy and Stallone were to have portrayed feuding neighbors. In the animated Disney film Pocahontas, the role of Redfeather the Turkey was written for him, but was subsequently cut from the film after his death."}, {"text": "== Personal life ==Candy and his wife Rosemary Hobor had two children, Christopher Michael and Jennifer Anne. He was a Roman Catholic."}, {"text": "=== Sports ===In 1991, Bruce McNall, Wayne Gretzky, and Candy became owners of the Canadian Football League's Toronto Argonauts. The celebrity ownership group attracted attention in Canada, and the team spent a significant amount of money, even signing some highly touted National Football League prospects such as wide receiver Raghib Ismail. Under Candy's co-ownership, the Argonauts took home the 1991 Grey Cup, beating Calgary 36–21 in the final. Only McNall's name was etched onto the Grey Cup trophy as an owner of the team, but the CFL corrected the error in 2007 and added Candy's and Gretzky's names as well."}, {"text": "=== Health problems and death ===Candy publicly shared his experiences of living with severe anxiety and panic attacks.Candy died in his sleep at the age of 43, on March 4, 1994, in Durango City, Mexico, while filming Wagons East; a spokeswoman said that Candy's cause of death was a heart attack. He tended to binge eat in response to professional struggles and weighed more than 300 pounds (140 kg) at some points in his life. Candy had a number of risk factors for heart attack, including strong family history (his father had died prematurely of a heart attack, although his children say he was unaware of his genetic risk), smoking a pack of cigarettes a day, obesity, alcohol abuse, and cocaine use. However, Candy was concerned about his weight. He once lost 100 pounds (45 kg) over a summer while preparing to film Planes, Trains and Automobiles with Steve Martin. He frequently dieted and exercised with trainers because of his family history."}, {"text": "== Legacy ==Candy's funeral was held at St. Martin of Tours Catholic Church in Los Angeles. Candy was entombed in the mausoleum at Holy Cross Cemetery in Culver City. His crypt lies just above that of a fellow actor, Fred MacMurray. On March 18, 1994, a special memorial service for Candy, produced by his former improvisation troupe the Second City, was broadcast across Canada."}, {"text": "== Legacy ==Wagons East was completed using a stunt double and special effects and released five months after Candy's death. His final completed film was Canadian Bacon, a satirical comedy by Michael Moore released a year after Candy's death. Candy played American sheriff Bud Boomer, who led an \"invasion\" of Canada. Candy recorded a voice for the TV film The Magic 7 in the early 1990s. The film remained in production for years owing to animation difficulties and production delays, and it was eventually shelved."}, {"text": "== Legacy ==Candy was posthumously inducted into Canada's Walk of Fame in 1998. In May 2006, Candy became one of the first four entertainers ever honored by Canada Post by being featured on a postage stamp. On October 31, 2020, Toronto Mayor John Tory proclaimed \"John Candy Day\" in honor of what would have been John Candy's 70th birthday."}, {"text": "== Legacy ==Blues Brothers 2000 is dedicated to three people, including Candy, who played a supporting role in the original Blues Brothers. A tribute to Candy was hosted by Dan Aykroyd at the 2007 Grey Cup festivities in Toronto in November 2007.Experimental rock band Ween's album Chocolate and Cheese, released in 1994, is \"dedicated in loving memory to John Candy (1950–1994)\". At the time lead singer Gene Ween remarked, \"There was so much going on about [the suicide of] Kurt Cobain, and nobody mentioned John Candy at all. I have a special little spot in my heart for him.\"After his death, the John Candy Visual Arts Studio at Neil McNeil Catholic High School in Toronto was dedicated in his honour. Candy, one of the school's most famous alumni, said during one of his annual visits to the school, \"My success is simply rooted in the values and discipline and respect for others that I was taught at Neil McNeil.\" It has been suggested, among others, that the Canadian Screen Awards be given the official nickname \"The Candys,\" both in honour of the actor and because the name suggests Canada."}, {"text": "== External links ==JohnCandy.com – The home of everything John Candy"}, {"text": "== External links ==John Candy at IMDb"}, {"text": "== External links ==John Candy at the TCM Movie Database"}, {"text": "== External links ==John Candy at AllMovie"}]