[{"text": "John Stephen Goodman (born June 20, 1952) is an American actor. He rose to prominence in television before becoming an acclaimed and popular film actor. Goodman has received numerous accolades including a Primetime Emmy Award, Golden Globe Award, and a Screen Actors Guild Award. Vanity Fair has called him \"among our very finest actors.\""}, {"text": "He is known for his collaborations with the Coen brothers, acting in films such as Raising Arizona (1987), Barton Fink (1991), The Big Lebowski (1998), O Brother, Where Art Thou? (2000), and Inside Llewyn Davis (2013). Goodman took on leading roles in King Ralph (1991), The Babe (1992), Matinee (1993), The Flintstones (1994), and 10 Cloverfield Lane (2016), and supporting roles in Revenge of the Nerds (1984), True Stories (1986), Sea of Love (1989), Bringing Out the Dead (1999), Storytelling (2001), Speed Racer (2008), The Artist (2011), Flight (2012), Argo (2012), The Hangover Part III (2013), and  Atomic Blonde (2017). Goodman has voiced roles in The Emperor's New Groove franchise (2000–2008), the Monsters, Inc. franchise (2001–present), The Jungle Book 2 (2003), and Bee Movie (2007)."}, {"text": "On television, he gained recognition playing the family patriarch Dan Conner in the ABC comedy series Roseanne (1988–1997; 2018), and The Conners (2018–present). Goodman had regular roles in the HBO drama series Treme (2010–2011), the legal drama series Damages (2011), the political comedy series Alpha House (2013–2014), and the HBO comedy series The Righteous Gemstones (2019–present). He has been a frequent host of Saturday Night Live (1989–2013), and has guest starred in The West Wing (2003–2004), Studio 60 on the Sunset Strip (2006), and Community (2011–2012). "}, {"text": "He started his career at The Public Theatre acting numerous productions including Henry IV, Part 1 (1981), The Skin of Our Teeth (1998), and The Seagull (2001). He made his Broadway debut Big River (1985) for which he received a Drama Desk Award for Outstanding Featured Actor in a Musical nomination. He returned to Broadway in revivals of the Samuel Becket play Waiting for Godot (2009), and the newspaper comedy The Front Page (2016). He made his West End debut in a revival of David Mamet's American Buffalo (2015)."}, {"text": "== Early life ==Goodman was born in Affton, Missouri. His father, Leslie Francis Goodman, was a postal worker who died of a heart attack when John was two years old. Goodman's mother, Virginia Roos (née Loosmore), was a waitress at Jack and Phil's Bar-B-Que, a retail store worker, and also took in laundry to support the family. Goodman has an older brother, Leslie, who is 14 years his senior, and a younger sister, Elisabeth, who was born six months after his father's death. He is of English, German, and Welsh ancestry and was raised Southern Baptist."}, {"text": "== Early life ==Goodman described his childhood as alone and withdrawn after his father had died so early and his brother had left to go to college. He was bullied at school for being overweight. Until ninth grade, Goodman was in the Boy Scouts, which he said offered him the structure and camaraderie he missed; he additionally looked to Boy Scout leaders, and later, acting coaches, as father figures. His brother later returned home to help raise Goodman and his sister. As a child, Goodman spent a lot of time listening to the radio and reading comic books, initially subscribing to DC's Green Lantern and The Atom, before turning to Marvel Comics. He also read his brother's copies of Mad and later confessed to shoplifting its paperback editions. Goodman credits his brother with introducing him to comedy and bebop."}, {"text": "== Early life ==Goodman went to Affton High School, where he played football (offensive guard and defensive tackle) and dabbled in theater. After graduating in 1970, he took a gap year. He earned a football scholarship to Missouri State University (then called Southwest Missouri State University, or \"SMSU\") in Springfield, but tore his ACL before ever suiting-up to go onto the field.  Instead, Goodman channeled his energy into the school's theater program."}, {"text": "== Early life ==Goodman pledged Sigma Phi Epsilon fraternity, though he did not join until several years later. He discovered the university's drama program, and studied there with future Hollywood stars Kathleen Turner and Tess Harper. In December 2013, he stated his school friends were his closest ones. Goodman graduated with a Bachelor of Fine Arts in 1975, and in 2013, the university presented him with an honorary doctorate degree in humane letters."}, {"text": "=== 1980s ===After graduating from SMSU, Goodman relocated to New York City. With a small bankroll from his brother, Goodman found an apartment in Hell's Kitchen near the Theater District and unsuccessfully tried to make money as a bartender and waiter. However, he eventually found modest success in voice-overs, commercials, and plays. He was the person who slapped himself (uttering the tagline, \"Thanks... I needed that!\") in an iconic television ad for Skin Bracer by Mennen. Goodman also performed off-Broadway and in dinner theaters before landing character roles in film during the early 1980s."}, {"text": "=== 1980s ===In 1982, Goodman made his film debut with a small role in Eddie Macon's Run. During this period he continued to work on the stage, starring as Pap Finn in Big River from 1985 to 1987. For his role, he received a Drama Desk nomination for Best Featured Actor in a Musical; he is also featured on the Original Broadway Cast Recording. Before landing his big break into movies in 1986 with a significant comedic role in True Stories, he starred in the movie Revenge of the Nerds, and later had a brief cameo as Otis in Sweet Dreams. In the former film, his character Louis Fyne says \"I'm 6' 3\" and maintain a consistent panda bear shape\", establishing his trademark size as an important part of many characters he later played on film and stage."}, {"text": "=== 1980s ===Goodman rose to fame in acting by playing the role of Dan Conner on the ABC sitcom Roseanne from 1988 to 1997. He returned to the character in 2018 for the revived, 10th season, where he said \"Roseanne and I just went back to having a ball\", and then stayed on for the show's subsequent spin-off The Conners. Goodman had a long history of appearances on late night comedy shows and was the first guest on Late Night with Conan O'Brien, which won him the series' \"First Guest Medal\" (Goodman joked he would pawn the medal for a bottle of cheap Scotch). Goodman has hosted NBC's Saturday Night Live 13 times, while also making seven cameo appearances as Linda Tripp during the Monica Lewinsky scandal, three appearances as Rex Tillerson, and cameoing on the season 28 finale hosted by former SNL cast member Dan Aykroyd. With little to no experience in TV comedy, Goodman auditioned to be a cast member for Jean Doumanian's tumultuous 1980–1981 SNL season and was rejected, along with up-and-coming comedians Jim Carrey, Paul Reubens, and Robert Townsend."}, {"text": "=== 1990s ===Goodman first worked with the Coen Brothers on Raising Arizona (1987). He went on to appear in their films Barton Fink (1991), The Big Lebowski (1998), O Brother, Where Art Thou? (2000), and Inside Llewyn Davis (2013). Only Steve Buscemi has appeared in more Coen works (six films), though Frances McDormand and Jon Polito have also appeared in five of their films."}, {"text": "=== 1990s ===He worked with Steven Spielberg on Always (1989) and had a supporting role in Arachnophobia (1990). In 1993, he starred in Matinee opposite Cathy Moriarty, and in 1994 as Fred Flintstone in The Flintstones. Other films included King Ralph (1991), The Babe (1992), Fallen (1998), and Blues Brothers 2000 (1998)."}, {"text": "=== 2000s ===Goodman had guest roles on the Aaron Sorkin television dramas The West Wing and Studio 60 on the Sunset Strip. In the former he appeared in four episodes, playing Speaker of the House and eventual acting president Glen Allen Walken. In the latter, he appeared as Pahrump, Nevada Judge Robert Bebe, earning a 2007 Emmy for Outstanding Guest Actor – Drama Series for his performance."}, {"text": "=== 2000s ===Goodman voiced Robot Santa in the character's first appearance on Futurama. Beginning in 2007, he has been the voiceover in Dunkin' Donuts commercials. In 2000, Goodman provided the voice of Pacha in Disney's The Emperor's New Groove and, a year later, the voice of Sulley in Pixar's Monsters, Inc. He returned to the character for the film's 2013 prequel Monsters University (2013), the 2021 Disney+ series Monsters at Work, and for a 2024 update of the video game Disney Dreamlight Valley. In 2007, he voiced Layton T. Montgomery in Bee Movie. In 2009, Goodman voiced \"Big Daddy\" La Bouff in The Princess and the Frog. Goodman's voice can also be heard on an automated message system at St. Louis Lambert International Airport. He was the original voice of the yellow M&M in 1995 before being replaced by J. K. Simmons the following year."}, {"text": "=== 2000s ===In theater, Goodman played the Ghost of Christmas Present in the 2008 Kodak Theatre production of A Christmas Carol, starring Christopher Lloyd as Ebenezer Scrooge. He played the role of Pozzo in a Studio 54 revival of Samuel Beckett's play Waiting for Godot, opposite Bill Irwin and Nathan Lane. John Heilpern of Vanity Fair called it \"the greatest Pozzo I've ever seen.\" In 2009, he reprised the role of Pozzo at the Roundabout Theatre Company."}, {"text": "=== 2000s ===Goodman was cast in In the Electric Mist (2009) as Julie \"Baby Feet\" Balboni. At one time, he was slated to play the role of Ignatius Reilly, the main character of A Confederacy of Dunces by John Kennedy Toole. The story takes place almost entirely in New Orleans. However, the movie was never put into production. The Princess and the Frog where he lent his voice as Eli \"Big Daddy\" La Bouff also takes place in New Orleans. Goodman also featured in Treme, a drama series focusing on a group of interconnected people trying to rebuild their lives in post–Hurricane Katrina New Orleans. Goodman played Creighton Bernette, a Tulane English professor, in the show's first season.  Other films during this time included The Adventures of Rocky and Bullwinkle (2000), Coyote Ugly (2000), Storytelling (2001), Beyond the Sea (2004), Evan Almighty (2007), Speed Racer (2008), and Pope Joan (2009)."}, {"text": "=== 2010s ===In 2011, Goodman was a guest star on the third season of Community. He also voiced a character in the video game Rage voicing Dan Hagar, and played movie studio chief Al Zimmer in the Academy Award–winning live action film The Artist, as well as Best Picture nominee Extremely Loud & Incredibly Close the same year. Also in 2011, Goodman starred in Kevin Smith's Red State playing ATF Agent Joseph Keenan. In February 2012, it was reported that Goodman would reunite with Roseanne Barr for a new NBC pilot titled Downwardly Mobile. The series would have had Goodman portray a bachelor mechanic who resides in a trailer park, and would have used the standard multiple-camera setup traditionally found in sitcoms; however, the series' option was not picked up by the network. Other prominent roles include performances in Flight (2012), The Hangover Part III (2013), The Monuments Men (2014), Trumbo (2015), 10 Cloverfield Lane (2016), Patriots Day (2016) and Atomic Blonde (2017). Goodman also voiced Hound in Transformers: Age of Extinction (2014) and returned to the character in Transformers: The Last Knight (2017).  With his well-received supporting roles in The Artist (2011) and Argo (2012), Goodman accomplished the rare feat of appearing in back-to-back winners of the Academy Award for Best Picture."}, {"text": "=== 2010s ===On August 10, 2013, Goodman was inducted as a Disney Legend. In 2013, Goodman received positive reviews for his performance as U.S. senator from North Carolina Gil John Biggs in Amazon's Alpha House, a political comedy written by Garry Trudeau. In the show Goodman's character, a retired UNC basketball coach, and three other Republican senators share a house on Capitol Hill. The show ended after two seasons in 2014."}, {"text": "=== 2010s ===In April 2015, Goodman made his return to the stage, making his West End debut in the process while starring as Donny in American Buffalo at the Wyndham's Theatre alongside Damian Lewis and Tom Sturridge. He went on to star as Sheriff Hartman in the 2016 Broadway revival of The Front Page, alongside Nathan Lane and John Slattery."}, {"text": "=== 2010s ===On March 10, 2017, Goodman received a star on the Hollywood Walk of Fame for his work in motion pictures, located at 6767 Hollywood Boulevard."}, {"text": "=== 2010s ===On April 28, 2017, it was announced that a revival of Roseanne was in the works and that Goodman along with most of the original cast and some of the producers would return for the limited series that was being shopped around with ABC and Netflix the frontrunners to land the show. On May 16, 2017, it was confirmed that 8 episodes would air mid-season in 2018 on ABC. On May 29, 2018, in the wake of controversial remarks made by Barr on Twitter regarding Valerie Jarrett (an advisor of former president Barack Obama), ABC canceled the revival after a single season. The next month, ABC ordered a ten-episode Roseanne spin-off titled The Conners, which stars the Roseanne cast sans Roseanne Barr. The show's first season premiered on October 16, 2018."}, {"text": "=== 2010s ===In 2019, Goodman starred in the role of Southern megachurch preacher and family patriarch Eli Gemstone on the HBO comedy The Righteous Gemstones, created by and co-starring Danny McBride. Goodman accepted the role right after the revived Roseanne series had been cancelled and before its spin-off The Conners was announced, which led to Goodman doing both shows. The Righteous Gemstones was renewed for a second season in September 2019."}, {"text": "=== 2020s ===In 2023 Goodman appeared in Monarch: Legacy of Monsters, as the older Bill Randa, reprising his role from Kong: Skull Island (2017)."}, {"text": "== Philanthropy ==Since Hurricane Katrina, Goodman has appeared in several recovery commercials aired in Louisiana."}, {"text": "== Philanthropy ==In 2010, Goodman appeared in a commercial to raise awareness for the Deepwater Horizon oil spill. Also starring in the commercial were Sandra Bullock, Peyton Manning, Eli Manning, Jack Del Rio, Drew Brees, Emeril Lagasse, James Carville, and Blake Lively."}, {"text": "== Personal life ==Goodman married Annabeth Hartzog, originally of Bogalusa, Louisiana, in 1989. The two met at a Halloween party at Tipitina's when he was filming Everybody's All-American in New Orleans. They reside in the Garden District of New Orleans. Their daughter, Molly Evangeline Goodman (b. 1990), has worked as a production assistant in the film industry."}, {"text": "== Personal life ==Goodman is a lifelong fan of the St. Louis Cardinals and narrated a 2020 MLB Network documentary about the Cardinals teams of the 1980s."}, {"text": "=== Health ===In a 2009 interview, Goodman discussed his struggles with alcoholism:"}, {"text": "=== Health ===I don't know how much the old Jackie Daniel's franchise ruined my memory, which is going anyway, because of my advancing decrepitude. I had a 30-year run, and at the end I didn't care about anything. I was just fed up with myself. I didn't even want to be an actor anymore."}, {"text": "=== Health ===In October 2012, he stated: \"If I'd picture in my mind a drink—usually straight out of the bottle—I couldn't not do it,\" noting that while acting in plays he would \"have the shakes so bad I'd have to have a drink to get through the show. I'm lucky I never got fired.\" Sober since 2007, Goodman tries to attend an Alcoholics Anonymous meeting every morning."}, {"text": "=== Health ===Goodman was once known for his sizable frame, at one point weighing close to 400 lb (180 kg). However, by August 2010, he had lost 100 lb (45 kg) through a program of exercise and food journaling. His new figure attracted attention at the Toronto International Film Festival in September 2015 and the BFI London Film Festival in October 2015."}, {"text": "=== Health ===Goodman suffers from depression. He has attributed the severity of the condition to past alcohol consumption and treats his depression through physical exercise.  "}, {"text": "== External links ==John Goodman at IMDb "}, {"text": "== External links ==John Goodman at the TCM Movie Database "}, {"text": "== External links ==John Goodman at the Internet Broadway Database "}, {"text": "== External links ==John Goodman at the Internet Off-Broadway Database "}, {"text": "== External links ==John Goodman at Emmys.com"}, {"text": "== External links ==St. Louis Walk of Fame"}]