[{"text": "David Jude Heyworth Law (born 29 December 1972) is an English actor. He began his career in theatre before landing small roles in various British television productions and feature films, later gaining recognition for his role in Anthony Minghella's The Talented Mr. Ripley (1999), for which he won the BAFTA Award for Best Actor in a Supporting Role and was nominated for an Academy Award."}, {"text": "Law found further critical and commercial success in Steven Spielberg's A.I. Artificial Intelligence (2001), Sam Mendes' Road to Perdition (2002), Minghella's Cold Mountain (2003), for which he earned Academy Award and BAFTA nominations, in addition to the drama Closer (2004) and the romantic comedy The Holiday (2006). He would go on to take various roles, including Dr. Watson in Sherlock Holmes (2009) and Sherlock Holmes: A Game of Shadows (2011), a younger Albus Dumbledore in Fantastic Beasts: The Crimes of Grindelwald (2018) and Fantastic Beasts: The Secrets of Dumbledore (2022), and Yon-Rogg in Captain Marvel (2019); all of which rank among his highest-grossing releases. Other notable roles include in Contagion (2011), Hugo (2011), Side Effects (2013), The Grand Budapest Hotel (2014), and Spy (2015); and the television series The Young Pope (2016) and The New Pope (2020)."}, {"text": "In addition to his film work, Law has performed in several West End and Broadway productions including Les Parents terribles in 1994, Hamlet in 2010, and Anna Christie in 2011."}, {"text": "Law has received multiple awards and nominations, including a BAFTA Award for Best Actor in a Supporting Role and the Honorary César. He has been nominated for a BAFTA Award for Best Actor in a Leading Role, as well as a total of two Academy Awards, two Tony Awards, and four Golden Globe Awards. Additionally, Law was named a knight of the Order of Arts and Letters by the French government."}, {"text": "== Early life ==Law was born on 29 December 1972 in the Lewisham district of London, to Peter Robert Law and Margaret Anne Heyworth, both teachers who married five years prior. His father later became, according to Law, \"the youngest headmaster in London\". His mother was adopted but was later reunited with her Welsh birth mother, Meinwen Parry. He has an elder sister, Natasha. Law was named David after one of his parents' best friends, but called by his middle name since birth. The name Jude was taken from both the book Jude the Obscure and the Beatles song \"Hey Jude\". He grew up in Blackheath, an area in the borough of Greenwich, and was educated at John Ball Primary School in Blackheath and temporarily attended Kidbrooke School, before attending Alleyn's School."}, {"text": "=== 1987–1999: Early work and breakthrough ===Law began acting in 1987 with the National Youth Music Theatre. He played various roles in the Edinburgh Fringe-awarded play The Ragged Child. One of his first major stage roles was Foxtrot Darling in Philip Ridley's The Fastest Clock in the Universe. Law went on to appear as Michael in the 1994 West End rendition of Jean Cocteau's tragicomedy Les Parents terribles, directed by Sean Mathias. This performance earned him a Laurence Olivier Award nomination for Outstanding Newcomer, and he received the Ian Charleson Award for Outstanding Newcomer. Following a title change to Indiscretions, the play was reworked and transferred to Broadway in 1995, where Law acted opposite Kathleen Turner, Roger Rees and Cynthia Nixon. This role earned him a Tony Award nomination and the Theatre World Award.In 1989, Law received his first television role in a film based on the Beatrix Potter children's book, The Tailor of Gloucester. Following this, he took on minor roles in various British television series, including a two-year stint in the Granada TV produced ITV soap opera Families. He also appeared in the episode \"Shoscombe Old Place\" in ITV's Sherlock Holmes, and he played the leading role in the BFI/Channel 4 short The Crane (1992).In 1994, Law appeared in his first major leading film role with the British crime drama Shopping, which also starred his then future wife, Sadie Frost. He later gained prominence for his role in the Oscar Wilde biopic Wilde (1997), for which he won the Evening Standard British Film Award for Most Promising Newcomer as well as a London Film Critics Circle Award for his portrayal of Lord Alfred Douglas, the glamorous young lover of Stephen Fry's Wilde. The New York Times reviewer Janet Maslin noted that Law's \"voluptuous beauty and mocking, boyish petulance gives [Douglas] a rock star's presence.\" Other reviewers including William Gallagher also complimented Law's appearance as the character. In Andrew Niccol's science fiction film Gattaca (1997), Law took on the role of a disabled former magnetic swimming star living in a eugenics-obsessed dystopia. In Clint Eastwood's Midnight in the Garden of Good and Evil (1997), he played the role of Billy Hanson, a male prostitute killed by his partner, an art dealer portrayed by Kevin Spacey. Law also played Steven Grlscz, a vampire and an expert seducer, in The Wisdom of Crocodiles (1998).In 1999, Law starred alongside Matt Damon, Gwyneth Paltrow, Cate Blanchett, and Philip Seymour Hoffman in the psychological thriller film The Talented Mr. Ripley, directed by Anthony Minghella. Law learned to play the saxophone for his role in the film, and his performance earned him the BAFTA Award for Best Actor in a Supporting Role, as well as nominations for the Golden Globe Award and Academy Award for Best Supporting Actor. The Guardian film critic Peter Bradshaw commented on Law giving \"a very stylish and charismatic performance as the exquisite Dickie, all cruelty and caprice.\"At this time, Law and his then-wife Sadie Frost were members of the Primrose Hill set, which, along with other members such as Jonny Lee Miller, led to the 1996 creation of production company Natural Nylon, which he would later leave in 2003."}, {"text": "=== 2000–2008: Expansion and critical recognition ===In 2001, Law starred as Russian sniper Vasily Zaytsev in the film Enemy at the Gates, and learned ballet dancing for the film A.I. Artificial Intelligence (2001). In 2002, Law played a mob hitman in Sam Mendes's 1930s period drama Road to Perdition. In 2003, he again collaborated with director Minghella for the period war film Cold Mountain opposite Nicole Kidman and Renee Zellweger, for which he received nominations for the Golden Globe Award for Best Actor in a Motion Picture - Drama, the BAFTA Award for Best Actor in a Leading Role, and the Academy Award for Best Actor.Law, an admirer of Laurence Olivier, suggested the actor's image be included in the 2004 film Sky Captain and the World of Tomorrow. Using computer graphics technology, footage of the young Olivier was merged into the film, playing Dr. Totenkopf, a mysterious scientific genius and supervillain. Sky Captain and the World of Tomorrow would be the final film produced by Natural Nylon, which had folded with the departure of its founding members, including Law. The company did not see major successes. Also in 2004, Law portrayed the title character in Alfie, a remake of Bill Naughton's 1966 film, playing the role originated by Michael Caine; the remake received negative reviews and flopped at the box office. Law later took on another of Caine's earlier roles in the 2007 film Sleuth, adapted by Nobel Laureate in Literature Harold Pinter, while Caine played the role originated by Olivier.In 2006, he portrayed the role of a single parent in the American romantic comedy film The Holiday, written, produced and directed by Nancy Meyers. Prior to this, Law had appeared in a series of period dramas and science fiction films during the early to mid-2000s, making it, as he said, tricky for him to approach the contemporary role. According to Law, he felt more \"vulnerable\" about playing a role that featured resemblance to his own character, and did not require an accent, a costume or a relocation. In 2007, Law starred alongside Norah Jones in the romantic drama My Blueberry Nights, which premiered at the Cannes Film Festival. Additionally, he received the Honorary César at the 32nd César Awards, and was named a knight of the Order of Arts and Letters by Gerard Errera, the French ambassador. By the end of the year, Law was one of the Top Ten A-list of the most bankable film stars in Hollywood, according to the Ulmer Scale."}, {"text": "=== 2009–present: Return to theatre and other projects ===In May 2009, Law returned to the London stage to portray the title role in William Shakespeare's Hamlet at the Donmar Warehouse West End season at Wyndham's Theatre. The BBC reported \"a fine and solid performance\" but included other reviews of Law's interpretation that were mixed. There was a further run of the production at Elsinore Castle in Denmark from 25–30 August 2009. In September 2009, the production transferred to the Broadhurst Theatre in New York City. The Washington Post felt the much-anticipated performance was \"highly disappointing\". Nonetheless, he was nominated for the Tony Award for Best Performance by a Leading Actor in a Play and at the Critics' Circle Theatre Awards ceremony, he was presented with the John and Wendy Trewin Award for Best Shakespearean Performance. Also in 2009, Law became one of three actors who took over the role of actor Heath Ledger in Terry Gilliam's film The Imaginarium of Doctor Parnassus. Along with Law, actors Johnny Depp and Colin Farrell portray \"three separate dimensions in the film\".In 2010, Law appeared opposite Forest Whitaker in the dark science fiction comedy Repo Men and as Dr. Watson in Guy Ritchie's adaption of Sherlock Holmes, alongside Robert Downey, Jr. and Rachel McAdams, as well as the 2011 sequel, Sherlock Holmes: A Game of Shadows. Law starred as a celebrity supermodel in the film Rage. He portrayed blogger Alan Krumwiede in the 2011 medical thriller Contagion. The Hollywood Reporter critic Todd McCarthy called the character \"excellent\" and praised the \"compelling ferociousness\" of Law's portrayal."}, {"text": "=== 2009–present: Return to theatre and other projects ===In May 2015, it was announced that Law would portray Lenny Belardo/Pius XIII, an American cardinal who becomes the pope. A ten-episode series titled The Young Pope was jointly produced by Sky Atlantic and Canal+ with HBO, and directed by Paolo Sorrentino. The series began airing in various countries in October 2016. In their respective reviews for The Guardian and The New York Times, Rebecca Nicholson praised the \"surprising charm\" with which Law strikes a balance between the qualities of a \"vindictive authoritarian and wounded man-child\", while James Poniewozik described his role as \"saddled with stiff dialogue\". Law reprised in the role in the spin-off series The New Pope, which premiered on HBO on 13 January 2020. He also starred in the miniseries The Third Day, which premiered on HBO on 14 September 2020.Law portrayed Albus Dumbledore, a wizard, in the fantasy film Fantastic Beasts: The Crimes of Grindelwald. It was released on 16 November 2018 to mixed reviews. Law also portrayed Yon-Rogg in the 2019 Marvel Cinematic Universe superhero film Captain Marvel, which was a global box office success, grossing over $1 billion worldwide. In 2023, Law played Captain Hook in Peter Pan & Wendy, a live-action adaptation of the animated film Peter Pan, which was released directly onto Disney+. He is set to star in the limited series The Auteur.Law is set to star in Star Wars: Skeleton Crew, a Disney+ series premiering in 2024. Law was attached to play artist Roland Penrose in Lee, a World War II-era drama film directed by Ellen Kuras, but was later replaced by Alexander Skarsgård."}, {"text": "=== Activism ===In 2002, Law directed a Respect for Animals anti-fur cinema commercial, titled \"Fur and Against\". It used music composed by Gary Kemp, and included appearances by Law, Chrissie Hynde, Moby, George Michael, Danny Goffey, Rhys Ifans, Sadie Frost, Helena Christensen, Sir Paul McCartney, Melanie C, and Stella McCartney. In 2013, Law, represented by PETA, wrote a letter to the World Trade Organization in support of keeping the European Union's restrictions against the seal trade; the restriction, which had been implemented three years prior, faced opposition from the Canadian government.In 2011, Law joined street protests against Alexander Lukashenko and his brutal crackdown on the Belarusian democracy movement."}, {"text": "==== Afghanistan peace efforts ====In July 2007, Law and Jeremy Gilley were in Afghanistan over a period of ten days to document peace commitments and activities there for an upcoming film and for marking the UN International Day of Peace. Accompanied by UNICEF Representative Catherine Mbengue, they travelled and filmed in dangerous areas of eastern Afghanistan with a film crew, interviewing children, government ministers, community leaders and UN officials. They also filmed at schools and visited various UNICEF-supported programmes inside and outside the capital Kabul. The efforts of Peace One Day are coordinated in celebration of the annual International Day of Peace, on 21 September. The film, named The Day After Peace, premiered at the Cannes Film Festival. On 21 September 2008, the film was shown at a gala screening at the Royal Albert Hall.On 30 August 2008, Law and Gilley returned to Afghanistan to help keep a momentum around Peace Day. They met President Hamid Karzai, top NATO and UN officials, and members of the aid community. They also screened the new documentary about the efforts in support of peace. The documentary features activities that took place throughout Afghanistan in 2007. It also highlights support from UNICEF and the WHO for the peaceful immunisation of 1.4 million children against polio in insecure areas."}, {"text": "=== Philanthropy ===In 2004, Law launched a campaign to raise £2.5 million towards the Young Vic Theatre's £12.5 million redevelopment project, with the theatre successfully re-opening in 2006. As of 2007, Law was Chairman of the Young Vic committee, during which he expressed dignity for his contributions towards the theatre. In 2006, he joined Robbie Williams in the \"Soccer Aid\" celebrity football match to benefit UNICEF.In 2006, he starred in an anthology of Samuel Beckett readings and performances directed by Anthony Minghella. With the Beckett Gala Evening at the Reading Town Hall, more than £22,000 was donated for the Macmillan Cancer Support. Also in 2006, Frost and Law directed a Shakespeare play in a South African orphanage. He travelled to Durban with Frost and their children to help children who have lost their parents to AIDS. In July 2007, as patron of the charity, he helped kick off the month-long tour of the AIDS-themed musical Thula Sizwe by the Young Zulu Warriors. Also in 2007, he encouraged the Friends of the Earth/the Big Ask campaign, asking British government to take action against climate change.Law has done charity work for organizations such as Make Poverty History, the Rhys Daniels Trust, and the WAVE Trauma Centre. He supports the Make-A-Wish Foundation and the Pride of Britain Awards.He is the chairman of the Music For Tomorrow Foundation to help rebuild Katrina-devastated New Orleans.Law serves as an ambassador of the Prince of Wales' Children and the Arts Foundation. He supports Breast Cancer Care, and in December 2008 he supported the Willow Foundation by creating a small canvas for their campaign Stars on Canvas. In April 2009 he supported the charity Education Africa with the gift of a mask he had painted and signed himself. The campaign was launched on eBay by Education Africa.Law, alongside Judi Dench, helped save St Stephen's Church in Hampstead. They supported the campaign, which raised £4.5 million to refurbish the Victorian church in North London. The building reopened in March 2009 as an arts and community centre."}, {"text": "=== Realtime Movie ===In early 2007, Law shot the short film Realtime Movie Trailer at Borough Market, South London. Instead of promoting a film, this \"trailer\", which appeared among regular trailers in selected cinemas across London starting 19 November 2007, advertised a live event, Realtime Movie by Polish artist Paweł Althamer. Hundreds turned up for this unfilmed reenactment, in real time, of the sequence of events shown in Realtime Movie Trailer by the same actors, including Althamer as a Polish labourer, held on 30 November 2007. The performance was commissioned by Tate Modern as part of its \"The World as a Stage\" exhibition, which explored the boundaries between arts and reality."}, {"text": "=== Music ===Law is a featured artist on Vampire Weekend's 2019 album, Father of the Bride, in which he recites Thomas Campbell's poem \"Lord Ullin's Daughter\" during the song of the same name."}, {"text": "=== Modelling ===Since 2005, Law has represented Dunhill as an \"apparel ambassador\" in Asia, where in 2008 he became the international face of the brand and began appearing in worldwide advertising campaigns. That same year, Law became the face of the men's perfume, Homme Sport by Dior. In 2022, both Law and his son Raff became ambassadors for Italian luxury brand Brioni."}, {"text": "== Personal life ==In 2010, Law purchased a property in Highgate, London, moving from Primrose Hill with his then-partner Sienna Miller. His residence was at The Grove, a street known for its notable residents. Throughout the 2000s, an \"unhealthy amount of information\" about Law's life had been in the possession of the media, prompting his involvement in the News International phone hacking scandal. Additionally, a family member of his was alleged to have been bribed by News of the World to share information with them."}, {"text": "=== Family and relationships ===Law is the younger brother of Natasha, an illustrator and artist based in London. His parents live in Vaudelnay, France, where they run their own drama school and theatre.On 2 September 1997, Law married actress Sadie Frost, whom he had met in 1992 on the set of Shopping. They have three children, including Raff and Iris. On 29 October 2003, the couple divorced."}, {"text": "=== Family and relationships ===While filming Alfie (2004) in late 2003, Law and co-star Sienna Miller began a relationship and became engaged in 2004. On 8 July 2005, Law issued a public apology to Miller for having an affair with his children's nanny. Miller and Law ended their relationship in November 2006.In 2008, Law was in a brief relationship with American model Samantha Burke, who gave birth to his fourth child in September 2009. His fifth child was born in 2015, to Catherine Harding. On 1 May 2019, he married his girlfriend Phillipa Coan. In September 2020, Law announced the birth of the couple's first child together, who is also his sixth. Their second child, and his seventh, was born in February 2023."}, {"text": "== External links == "}, {"text": "== External links ==Jude Law at IMDb"}, {"text": "== External links ==Jude Law at the Internet Broadway Database"}, {"text": "== External links ==Jude Law at the BFI's Screenonline"}, {"text": "== External links ==Filmography Jude Law at the British Film Institute (BFI). Retrieved 25 May 2008."}]