[{"text": "Larry Joe Bird (born December 7, 1956) is an American former professional basketball player, coach, and executive in the National Basketball Association (NBA). Nicknamed \"the Hick from French Lick\" and \"Larry Legend\", Bird is widely regarded as one of the greatest basketball players of all time. He is the only person in NBA history to be named Rookie of the Year, Most Valuable Player, Finals MVP, All-Star MVP, Coach of the Year, and Executive of the Year."}, {"text": "Growing up in French Lick, Indiana, he was a local basketball star. Highly recruited, he initially signed to play college basketball for coach Bob Knight of the Indiana Hoosiers, but Bird dropped out after one month and returned to French Lick and attended a local college. The next year he attended Indiana State University, ultimately playing three years for the Sycamores. Selected by the Boston Celtics with the sixth overall pick in the 1978 NBA draft after his second year at Indiana State, Bird elected to stay in college and returned for the 1978–79 season. He then led his team to an undefeated regular season. The season finished with a national championship game match-up of Indiana State against Michigan State and featured a highly anticipated match-up of Bird against Michigan State great Magic Johnson, thus beginning a career-long rivalry that the two shared for over a decade. Michigan State won, ending the Sycamores' undefeated streak."}, {"text": "Bird entered the NBA for the 1979–80 season, where he made an immediate impact, starting at power forward and leading the Celtics to a 32-win improvement over the previous season before being eliminated from the playoffs in the conference finals. He played for the Celtics during his entire professional career (13 seasons), leading them to five NBA finals appearances and three NBA championships. He played most of his career with forward Kevin McHale and center Robert Parish, considered by some to be the greatest front court in NBA history. Bird was a 12-time NBA All-Star, won two NBA Finals MVP awards and received the NBA Most Valuable Player Award three consecutive times (1984–1986), making him the only forward in league history to do so. Bird was also a member of the gold medal-winning 1992 U.S. Olympic basketball team, known as the \"Dream Team\". He was inducted into the Naismith Memorial Basketball Hall of Fame twice as a player—first in 1998 as an individual, and again in 2010 as a member of the \"Dream Team\". He was voted onto the NBA's 50 Greatest Players in NBA History list in 1996, and subsequently the 75th Anniversary Team list in 2021."}, {"text": "A versatile player at both forward positions, he could play both inside and outside, being one of the first players in the league to take advantage of the newly adopted three-point line. Bird was rated the greatest NBA small forward of all time by Fox Sports in 2016. After retiring as a player, Bird served as head coach of the Indiana Pacers from 1997 to 2000. He was named NBA Coach of the Year for the 1997–98 season and later led the Pacers to a berth in the 2000 NBA Finals. In 2003, Bird was named president of basketball operations for the Pacers, holding the position until retiring in 2012. He was named NBA Executive of the Year for the 2012 season. Bird returned to the Pacers as president of basketball operations in 2013, and remained in that role until 2017. Bird continued with the Pacers as an advisor until July 2022, then after nearly a year's break returned to the organization in the role of consultant."}, {"text": "== Early life ==Bird was born in West Baden Springs, Indiana, to Georgia (née Kerns) and Claude Joseph \"Joe\" Bird, a veteran of the Korean War. Bird's parents were of Irish, Scottish and some Native American descent. He has four brothers and a sister."}, {"text": "== Early life ==He was raised in nearby French Lick, where his mother worked two jobs to support Larry and his five siblings. Bird has said that being poor as a child still motivates him \"to this day\". Georgia and Joe divorced when Larry was in high school, and Joe died by suicide about a year later."}, {"text": "== Early life ==Larry used basketball as an escape from his family troubles, starring for Springs Valley High School and averaging 31 points, 21 rebounds, and 4 assists as a senior on his way to becoming the school's all-time scoring leader. According to Bird, he grew up as a huge fan of the Indiana Pacers in the American Basketball Association (ABA) and the 6'9 center Mel Daniels, who represented his first exposure to professional basketball. Bird's youngest brother, Eddie Bird, also played basketball at Indiana State University, where Daniels would coincidentally become an assistant coach to the young Larry once he played there."}, {"text": "== College career ==Bird received a scholarship to play college basketball for the Indiana Hoosiers under head coach Bob Knight in 1974. After less than a month on the Indiana University campus he dropped out of school, finding the adjustment between his small hometown and the large student population of Bloomington to be overwhelming. He returned to French Lick, enrolling at Northwood Institute (now Northwood University) in nearby West Baden, and working municipal jobs for a year before enrolling at Indiana State University in Terre Haute in 1975. He had a successful three-year career with the Sycamores, helping them reach the NCAA tournament for the first time in school history with a 33–0 record where they played the 1979 championship game against Michigan State. Indiana State lost the game 75–64, with Bird scoring 19 points but making only 7 of 21 shots."}, {"text": "== College career ==The game achieved the highest-ever television rating for a college basketball game, in large part because of the matchup between Bird and Spartans' point guard Earvin \"Magic\" Johnson, a rivalry that lasted throughout their professional careers. Despite failing to win the championship, Bird earned numerous year-end awards and honors for his outstanding play, including the Naismith College Player of the Year Award. For his college career, he averaged 30.3 points, 13.3 rebounds, and 4.6 assists per game, leading the Sycamores to an 81–13 record during his tenure. Bird also appeared in one game for the baseball team, going 1-for-2 with 2 RBI. He graduated in 1979 with a Bachelor of Science degree in physical education."}, {"text": "==== Joining the Celtics (1978–1979) ====Bird was selected by the Boston Celtics with the sixth overall pick in the 1978 NBA draft. He did not sign with the Celtics immediately; instead, he played out his final season at Indiana State and led the Sycamores to the NCAA title game. Celtics general manager Red Auerbach publicly stated that he would not pay Bird more than any Celtic on the current roster, but Bird's agent Bob Woolf told Auerbach that Bird would reject any sub-market offers and simply enter the 1979 draft instead, where Boston's rights would expire when the draft began on June 25, and Bird would have been the likely top pick. After protracted negotiations, Bird inked a five-year, $3.25 million contract with the team on June 8, making him the highest-paid rookie in sports history. Shortly afterwards, NBA draft eligibility rules were changed to prevent teams from drafting players before they were ready to sign, a rule known as the Bird Collegiate Rule."}, {"text": "==== Early success (1979–1983) ====In his rookie season (1979–80), Bird immediately transformed the Celtics into a title contender. The team improved its win total by 32 games from the year before he was drafted and finished first in the Eastern Conference. In his career debut, Bird recorded 14 points, 10 rebounds and 5 assists in a 114–106 win over the Houston Rockets. On November 14, 1979, Bird recorded his first career triple-double with 23 points, 19 rebounds and 10 assists in a 115–111 win over the Detroit Pistons. On November 23, Bird recorded his first 30-point scoring game (along with 11 rebounds and 3 assists) in a 118–103 win over the Indiana Pacers."}, {"text": "==== Early success (1979–1983) ====With averages of 21.3 points, 10.4 rebounds, 4.5 assists, and 1.7 steals per game for the season, he was selected to the All-Star Team and named Rookie of the Year. In the Conference finals, Boston was eliminated by the Philadelphia 76ers."}, {"text": "==== Early success (1979–1983) ====Before the 1980–81 season, the Celtics selected forward Kevin McHale in the draft and acquired center Robert Parish from the Golden State Warriors, forming a Hall of Fame trio for years to come; the front-court of Bird, McHale, and Parish is regarded as one of the greatest front-courts in NBA history. Behind Bird's leadership and Boston's upgraded roster, the Celtics again advanced to the conference finals for a rematch with the 76ers. Boston fell behind 3–1 to start the series but won the next three games to advance to the Finals against the Houston Rockets, winning in six games and earning Bird his first championship. He averaged 21.9 points, 14 rebounds, 6.1 assists, and 2.3 steals per game for the postseason and 15.3 points, 15.3 rebounds, and 7 assists per game for the Finals."}, {"text": "==== Early success (1979–1983) ====At the 1982 All-Star Game, Bird scored 19 points en route to winning the All-Star Game MVP Award. At the conclusion of the season, he earned his first All-Defensive Team selection. He eventually finished runner-up in Most Valuable Player Award voting to Moses Malone. In the Conference finals, the Celtics faced the 76ers for the third consecutive year, losing in seven games. Boston's misfortunes continued into the next season, with Bird again finishing second in MVP voting to Malone and the team losing in the conference semifinals to the Milwaukee Bucks."}, {"text": "==== MVP threepeat (1983–1986) ====Bird was named MVP of the 1983–84 season with averages of 24.2 points, 10.1 rebounds, 6.6 assists, and 1.8 steals per game. In the playoffs, the Celtics avenged their loss from the year before to the Bucks, winning in five games in the conference finals to advance to the Finals against the Los Angeles Lakers. In Game Four, the Lakers—led by Bird's college rival Magic Johnson—were on the verge of taking a commanding 3–1 series lead before a flagrant foul was committed on Kurt Rambis that resulted in a brawl and caused the Lakers to lose their composure. Boston came back to win the game, eventually winning the series in seven. Bird was named Finals MVP behind 27.4 points, 14 rebounds, and 3.6 assists per game."}, {"text": "==== MVP threepeat (1983–1986) ====On December 9, 1984, Bird recorded 48 points to go along with 14 rebounds and 5 assists in a 128–127 win over the Atlanta Hawks. On March 12 of the 1984–85 season, Bird scored a career-high and franchise record 60 points in a game against the Atlanta Hawks. The performance came just nine days after Kevin McHale set the previous Celtics record for points in a game with 56. At the conclusion of the year, Bird was named MVP for the second consecutive season, behind averages of 28.7 points, 10.5 rebounds, and 6.6 assists per game. Boston advanced through the playoffs to earn a rematch with the Lakers, this time losing in six games."}, {"text": "==== MVP threepeat (1983–1986) ====During the 1985 offseason, Bird injured his back shoveling crushed rock to create a driveway at his mother's house. At least partially as a result of this, he experienced back problems for the remainder of his career."}, {"text": "==== MVP threepeat (1983–1986) ====Before the start of the 1985–86 season, the Celtics made a daring trade for Bill Walton, an All-Star center with a history of injury. The risk paid off; Walton's acquisition helped Boston win a league best 67 games. One of Bird's career highlights occurred at the 1986 NBA All-Star Weekend when he walked into the locker room at the inaugural Three-Point Shootout and asked who was going to finish second before winning the shootout."}, {"text": "==== MVP threepeat (1983–1986) ====On November 27, 1985, Bird recorded 47 points to go along with 12 rebounds, 2 assists and 2 steals in a 132–124 win over the Detroit Pistons. On March 10, 1986, Bird scored 50 points to go along with 11 rebounds and 5 assists in a 115–116 loss to the Dallas Mavericks."}, {"text": "==== MVP threepeat (1983–1986) ====With averages of 25.8 points, 9.8 rebounds, and 6.8 assists, and 2 steals per game, Bird became just the third player in NBA history to win three consecutive MVP Awards. In the playoffs, the Celtics lost only one game through the first three rounds en route to a match-up against the Rockets in the Finals. In Game 6 of the Finals series, Bird recorded a triple-double of 29 points, 11 rebounds and 12 assists as the Celtics won the Finals series 4 games to 2 against the Rockets. Bird averaged 24 points, 9.7 rebounds, and 9.5 assists per game for the championship round."}, {"text": "==== MVP threepeat (1983–1986) ====The '86 Celtics are commonly ranked as one of the greatest basketball teams of all time, with the Boston Globe's Peter May and Grantland's Bill Simmons listing them at number one."}, {"text": "==== Falling short (1986–1988) ====In 1987, the Celtics made their last Finals appearance of Bird's career, fighting through difficult series against the Milwaukee Bucks and Detroit Pistons. In Game 5 of the Eastern Conference finals against the Pistons, with five seconds remaining in the fourth quarter and Boston trailing the Pistons 107–106, Bird stole an inbound pass. Falling out of bounds, Bird turned and passed the ball to teammate Dennis Johnson, who converted a game-winning 2-point layup with less than a second left. The dramatic play saved the series for the Celtics. When they reached the NBA Finals, the Celtics lost to a dominant Lakers team that had won 65 games during the season. The Celtics ended up losing to the Lakers in six games, with Bird averaging 24.2 points on .445 shooting, 10 rebounds and 5.5 assists per game in the championship series. The Celtics fell short in 1988 losing to the Detroit Pistons in 6 games in the Eastern Conference finals as the Pistons made up from the heartbreak the previous season. Between them, Bird and Johnson captured eight NBA championships during the 1980s, with Magic getting five and Bird three. During the 1980s, either Boston or Los Angeles appeared in every NBA Finals."}, {"text": "==== Falling short (1986–1988) ====Throughout the 1980s, contests between the Celtics and the Lakers—both during the regular season and in the Finals—attracted enormous television audiences. The first regular-season game between the Celtics and the Lakers in the 1987–88 season proved to be a classic with Magic Johnson banking in an off-balance shot from near the three-point line at the buzzer for a 115–114 Lakers win at Boston Garden. The historical rift between the teams, which faced each other several times in championship series of the 1960s, fueled fan interest in the rivalry. Not since Bill Russell squared off against Wilt Chamberlain had professional basketball enjoyed such a marquee matchup. The apparent contrast between the two players and their respective teams seemed scripted for television, as they were polar opposites in nearly every way conceivable. Bird was white, Johnson was Black; Bird was an introvert from a small town playing in blue-collar Boston, while Johnson was the gregarious personification of the glitz and glamour of Los Angeles; Bird's Celtics played gritty, physical, defence-first basketball, whereas Johnson ran the Lakers' fast-paced Showtime offense. A 1980s Converse commercial for its \"Weapon\" line of basketball shoes (endorsed by both Bird and Johnson) reflected the perceived dichotomy between the two players. In the commercial, Bird is practicing alone on a rural basketball court (in reality the court was one Bird had made on the property in French Lick that he had purchased for his mother), when Johnson pulls up in a sleek limousine and challenges him to a one-on-one match."}, {"text": "==== Falling short (1986–1988) ====Despite the intensity of their rivalry, Bird and Johnson became friends off the court. Their friendship blossomed when the two players worked together to film the Converse commercial, which depicted them as archenemies. Johnson appeared at Bird's retirement ceremony on February 4, 1993, and emotionally described Bird as a \"friend forever\"."}, {"text": "==== Late career (1988–1992) ====The 1987–88 season was the highest-scoring season of Bird's career. In Game 7 of the 1988 Eastern Conference semifinals against the Atlanta Hawks, Bird shot 9 of 10 from the floor in the fourth quarter, scoring 20 points in that quarter and lifting the Celtics to a series-clinching victory over Atlanta. Bird finished with 34 points. His effort helped to overcome a 47-point performance by Atlanta's Dominique Wilkins. Wilkins remarked, \"The basket was like a well. I couldn't miss. He couldn't miss. And it went down to the last shot of the game. Who was going to make the last shot? That's the greatest game I've ever played in or seen played.\" The Celtics failed to reach the NBA Finals for the first time in five years, losing to the Pistons in six games during the Eastern Conference finals."}, {"text": "==== Late career (1988–1992) ====Bird's 1988–89 season ended after six games when he had bone spurs surgically removed from both of his heels. He returned to the Celtics in 1989, but debilitating back problems and an aging Celtic roster prevented him from regaining his mid-1980s form. Nonetheless, during the final years of his career, Bird maintained his status as one of the premier players in the game. In his final three seasons with the Celtics, Bird averaged over 20 points, 9 rebounds and 7 assists per game, shot better than 45% from the field, and led the Celtics to playoff appearances."}, {"text": "==== Late career (1988–1992) ====After leading the Celtics to a 29–5 start to the 1990–91 season, Bird missed 22 games due to a compressed nerve root in his back, a condition that eventually led to his retirement. He had off-season surgery to remove a disc from his back, but his back problems continued and he missed 37 games during the 1991–92 season. During the 1992 Eastern Conference semi-finals against the Cleveland Cavaliers, Bird missed four of the seven games due to recurring back problems."}, {"text": "==== Late career (1988–1992) ====During Bird's final two seasons when he had serious back problems, the Celtics went 71–28 when he played. Without Bird, they had a 30–29 record, further demonstrating his importance and game-changing ability while on the court."}, {"text": "==== Late career (1988–1992) ====On August 18, 1992, Bird announced his retirement. Following Bird's departure, the Celtics promptly retired his jersey number 33."}, {"text": "== Rivalry with Magic Johnson ==Larry Bird and Magic Johnson are known to be \"one of the greatest rivalries in sports\". Their rivalry began in college, when Larry Bird and Indiana State lost to Magic Johnson and Michigan State in the NCAA Championship game. Their rivalry continued on in the revived Celtics–Lakers Rivalry in the NBA. Either the Celtics, led by Bird, or the Lakers, led by Magic, were present in every NBA Finals series in the '80s, with Bird and Magic meeting three times. Magic got the upper hand against Bird, beating him in 1985 and 1987, while Bird beat Magic in 1984."}, {"text": "== Rivalry with Magic Johnson ==Journalists speculated that Bird and Magic represented different contrasts, such as clashes between Celtics and Lakers, between East and West, and between Blacks and Whites. But, as one journalist would say, “They looked different, perhaps, but take a chainsaw to their souls and they were fraternal, if not identical, friends.” Watching Bird play was like watching Magic play, as they both shared this talent that the league had never seen before. They each had charisma, deft shooting touch, extraordinary passing skills, and team-oriented mindset that ignited their team and the crowd. This style of play was starting to influence a new horde of fans as they would sit and “marvel at what they [Bird and Magic] can do” while giving younger kids “a different perspective of the game”."}, {"text": "== Rivalry with Magic Johnson ==Bird and Magic's presence on the court was only a small part of their contribution to basketball, as their rivalry changed the landscape of the NBA, transforming it from a “struggling, barely profitable league into a highly visible, financial and marketing dream for teams and players alike”. Many people realized that the emergence of these two stars were linked with the rise in popularity of the NBA, as the NBA started to market towards these two stars."}, {"text": "== National team career ==In the summer of 1992, Bird joined Magic Johnson, Michael Jordan, and other NBA stars to play for the United States men's national basketball team in that year's Olympics in Barcelona, Spain. It was the first time in the United States' Olympic history that the country sent NBA players to compete. The \"Dream Team\" won the men's basketball gold medal. In eight games, Bird averaged 8.4 points. The Naismith Memorial Basketball Hall of Fame called the team \"the greatest collection of basketball talent on the planet\"."}, {"text": "== Player profile and legacy ==Bird was voted onto the NBA's 50th Anniversary All-Time Team list in 1996, and inducted into the Naismith Memorial Basketball Hall of Fame in 1998. He was inducted into the Hall of Fame again in 2010, as a member of the \"Dream Team\". In 1999, Bird ranked No. 30 on ESPN SportsCentury's list of 50 Greatest Athletes of the 20th century. He played both the small forward and power forward positions. Universally recognized as an all-time great player, Bird was placed at the power forward position on an NBA all-time starting five roster with fellow superstars Magic Johnson (point guard), Michael Jordan (shooting guard), LeBron James (small forward), and Kareem Abdul-Jabbar (center) in 2020."}, {"text": "== Player profile and legacy ==Bird has been described as one of the greatest basketball players and greatest shooters of all time. He was selected to 12 NBA All-Star teams. Bird won three NBA championships (in 1981, 1984, and 1986) with the Celtics and won two NBA Finals MVP Awards. Bird won three consecutive regular season MVP awards; as of 2020, the only other players to accomplish this feat are Bill Russell and Wilt Chamberlain. Bird was also a four-time regular season MVP runner-up in 1981, 1982, 1983, and 1988. Bird is also remembered as one of the foremost clutch performers in the history of the NBA; he was known for his excellent play in high-stakes, high-pressure situations. In October 2021, as part of the NBA's 75th Anniversary, Bird was honored as one of the 75 greatest players of all time, by being named to the NBA's 75th Anniversary All-Time Team. To commemorate the NBA's 75th Anniversary The Athletic ranked their top 75 players of all time, and named Bird as the 7th greatest player in NBA history."}, {"text": "== Player profile and legacy ==Bird scored 24.3 points per game in his career on a .496 field goal percentage, an .886 free throw percentage, and a .376 percentage on three-point shots. Bird had an average of 10.0 rebounds per game for his career and 6.3 assists. Bird was the first player in NBA history to shoot 50% or better on field goals, 40% on three-pointers, and 90% on free-throws in a single NBA season while achieving the league minimum for makes in each category. He accomplished this feat twice. Bird won NBA three-point-shooting contests in three consecutive years. He sometimes practiced shooting three-point shots with his eyes closed."}, {"text": "== Player profile and legacy ==Bird is also remembered as an excellent passer and defender. While he was relatively slow, Bird displayed a knack for anticipating the moves of his opponent, making him a strong team defender. He had 1,556 career steals. In recognition of his defensive abilities, Bird was named to three All-Defensive Second Teams."}, {"text": "== Player profile and legacy ==Bird was widely considered one of Red Auerbach's favorite players. He considered Bird to be the greatest basketball player of all time. Bird's humble roots were the source of his most frequently used moniker, \"The Hick from French Lick\". Bird was also referred to as \"Larry Legend\"."}, {"text": "== Player profile and legacy ==Bird was known for his trash-talking on the court and is remembered as one of the most notable trash-talkers of his era. He was known for telling his opponents how and where in the court he would score against them; Xavier McDaniel recounted that Bird predicted a game-winning shot against him, then \"shot a shot right in my face and was like 'Damn, I didn't mean to leave two seconds on the clock.'\" When playing against Dennis Rodman, a player  known for his defensive abilities, in the 1987 Eastern Conference finals, Bird continually belittled Rodman's ability, at one point asking Chuck Daly, Detroit's head coach, to send in someone up to the task of guarding him."}, {"text": "== Player profile and legacy ==At the 2019 NBA Awards, Bird received the NBA Lifetime Achievement Award (shared with Magic Johnson). Since 2022, the NBA will award the MVPs for the conference finals; the Eastern Conference Finals MVP trophy is named in Bird's honor, while the Western Conference trophy is named after Johnson."}, {"text": "== Coaching and executive careers ==The Celtics employed Bird as a special assistant in the team's front office from 1992 until 1997. In 1997, Bird accepted the position of coach of the Indiana Pacers and said he would be on the job for no more than three years. Despite having no previous coaching experience, Bird led the Pacers to a 58–24 record—the franchise's best as an NBA team at the time—in the 1997–98 season, and pushed the Chicago Bulls to seven games in the Eastern Conference finals. He was named the NBA Coach of the Year for his efforts. Bird then led the Pacers to consecutive Central Division titles in 1999 and 2000 and a berth in the 2000 NBA Finals. Bird resigned his head coaching position shortly after the end of the 2000 season, following through on his initial promise to coach for only three years."}, {"text": "== Coaching and executive careers ==In 2003, Bird was hired as the Indiana Pacers' president of basketball operations. After the 2011–2012 NBA season, Bird was named NBA Executive of the Year, becoming the only man in NBA history to win the NBA MVP, Coach of the Year and Executive of the Year. On June 27, 2012, a day before the 2012 NBA draft, Bird and the Pacers announced that they would be parting ways; Bird said that health issues were among the reasons for his departure. Bird returned to the Pacers as president of basketball operations in 2013. He stepped down again in 2017, but stayed with the team in an advisory capacity.  He continued to serve as an advisor until July 2022, when he \"stepped back from maintaining an active role with the Indiana Pacers\". Nearly a year later, it was announced in June 2023 the Pacers re-hired Bird to serve as a consultant."}, {"text": "== Awards and honors ==NBA"}, {"text": "== Awards and honors ==3× NBA champion (1981, 1984, 1986)"}, {"text": "== Awards and honors ==2× NBA Finals MVP (1984, 1986)"}, {"text": "== Awards and honors ==3× NBA Most Valuable Player (1984–1986)"}, {"text": "== Awards and honors ==12× NBA All-Star (1980–1988, 1990–1992)"}, {"text": "== Awards and honors ==NBA All-Star Game MVP (1982)"}, {"text": "== Awards and honors ==9× All-NBA First Team (1980–1988)"}, {"text": "== Awards and honors ==All-NBA Second Team (1990)"}, {"text": "== Awards and honors ==3× NBA All-Defensive Second Team (1982–1984)"}, {"text": "== Awards and honors ==NBA Rookie of the Year (1980)"}, {"text": "== Awards and honors ==NBA All-Rookie First Team (1980)"}, {"text": "== Awards and honors ==3× Three-point Shootout champion (1986–1988)"}, {"text": "== Awards and honors ==2× NBA three-point field goals leader (1986, 1987)"}, {"text": "== Awards and honors ==Named one of the 50 Greatest Players in NBA History in 1996"}, {"text": "== Awards and honors ==Selected on the NBA 75th Anniversary Team in 2021"}, {"text": "== Awards and honors ==No. 33 retired by Boston Celtics"}, {"text": "== Awards and honors ==Trophy named in Bird's honor (Larry Bird Trophy) awarded to Eastern Conference finals MVP (established in 2022)"}, {"text": "== Awards and honors ==NBA All-Star Game head coach (1998)"}, {"text": "== Awards and honors ==NBA Coach of the Year (1998)"}, {"text": "== Awards and honors ==NBA Executive of the Year (2012)"}, {"text": "== Awards and honors ==USA Basketball"}, {"text": "== Awards and honors ==1992 Olympic gold medal (U.S. national team)"}, {"text": "== Awards and honors ==NCAA"}, {"text": "== Awards and honors ==John R. Wooden Award (1979)"}, {"text": "== Awards and honors ==Naismith College Player of the Year (1979)"}, {"text": "== Awards and honors ==Oscar Robertson Trophy (1979)"}, {"text": "== Awards and honors ==Adolph Rupp Trophy (1979)"}, {"text": "== Awards and honors ==NABC Player of the Year (1979)"}, {"text": "== Awards and honors ==2× MVC Player of the Year (1978–1979)"}, {"text": "== Awards and honors ==2× Consensus first team All-American (1978–1979)"}, {"text": "== Awards and honors ==No. 33 retired by Indiana State Sycamores"}, {"text": "== Awards and honors ==Media"}, {"text": "== Awards and honors ==AP National Player of the Year (1979)"}, {"text": "== Awards and honors ==Halls of Fame"}, {"text": "== Awards and honors ==Two-time Naismith Memorial Hall of Fame inductee:"}, {"text": "== Awards and honors ==1998 – individual"}, {"text": "== Awards and honors ==2010 – member of \"The Dream Team\""}, {"text": "== Awards and honors ==College Basketball Hall of Fame (class of 2006)"}, {"text": "== Awards and honors ==U.S. Olympic Hall of Fame (class of 2009 as a member of \"The Dream Team\")"}, {"text": "== Awards and honors ==FIBA Hall of Fame (class of 2017 as a member of \"The Dream Team\")"}, {"text": "== In popular culture ==Bird has appeared in three movies, each time playing himself: Blue Chips with Nick Nolte, released in 1994 by Paramount; the Warner Brothers film Space Jam with Michael Jordan and Bill Murray, in 1996; and Celtic Pride with Dan Aykroyd, Daniel Stern, and Damon Wayans, which was also released in 1996."}, {"text": "== In popular culture ==Bird's likeness has appeared in several video games. In One on One: Dr. J vs. Larry Bird, Bird plays opposite Julius Erving in a game of one-on-one. A sequel, Jordan vs Bird: One on One, was a 1988 basketball video game. In 2011, Bird was featured on the cover of NBA 2K12, alongside Magic Johnson and Michael Jordan. Bird is also a playable character in the revamped NBA Jam."}, {"text": "== In popular culture ==In a McDonald's commercial from 1991 (first aired during the Super Bowl), Bird and Michael Jordan have a trick shot contest, in which the winner got Jordan's lunch and the loser had to watch the winner eat. In a commercial during Super Bowl XLIV, Dwight Howard and LeBron James challenge each other at trick shots for a McDonald's lunch. After they finish, clapping is heard, then the camera pans to the crowd, and Bird says \"Great show, guys. Thanks for lunch.\" Howard and James share a confused look. Howard asks, \"Who was that?\" James replies, \"I have no idea.\""}, {"text": "== In popular culture ==Until July 2023, Twitter's logo was named Larry in honor of Larry Bird."}, {"text": "== In popular culture ==Larry Bird is a character in the HBO series Winning Time: The Rise of the Lakers Dynasty."}, {"text": "== Personal life ==In 1975, Bird married Janet Condra. They remained married for less than a year. Following an attempted reconciliation, Bird and Condra had a daughter, Corrie, in 1977."}, {"text": "== Personal life ==Bird married Dinah Mattingly in 1989. They have two adopted children, Conner and Mariah."}, {"text": "== Personal life ==During his professional career with the Celtics, Bird lived in the Boston suburb of Brookline, Massachusetts."}, {"text": "== Publications ==Bird, Larry; Johnson, Earvin; MacMullan, Jackie (2009). When the Game Was Ours. Houghton Mifflin Harcourt. ISBN 978-0547225470."}, {"text": "== See also ==Indiana Basketball Hall of Fame"}, {"text": "== See also ==List of career achievements by Larry Bird"}, {"text": "== See also ==List of NBA career scoring leaders"}, {"text": "== See also ==List of NBA career assists leaders"}, {"text": "== See also ==List of NBA career steals leaders"}, {"text": "== See also ==List of NBA career turnovers leaders"}, {"text": "== See also ==List of NBA career free throw percentage leaders"}, {"text": "== See also ==List of NBA career triple-double leaders"}, {"text": "== See also ==List of NBA career playoff scoring leaders"}, {"text": "== See also ==List of NBA career playoff assists leaders"}, {"text": "== See also ==List of NBA career playoff rebounding leaders"}, {"text": "== See also ==List of NBA career playoff steals leaders"}, {"text": "== See also ==List of NBA career playoff turnovers leaders"}, {"text": "== See also ==List of NBA career playoff free throw scoring leaders"}, {"text": "== See also ==List of NBA career playoff triple-double leaders"}, {"text": "== See also ==List of NBA single-game scoring leaders"}, {"text": "== See also ==List of NBA single-game steals leaders"}, {"text": "== See also ==List of NBA annual minutes leaders"}, {"text": "== See also ==List of NBA rookie single-season rebounding leaders"}, {"text": "== See also ==List of NBA players who have spent their entire career with one franchise"}, {"text": "== See also ==List of NCAA Division I men's basketball career scoring leaders"}, {"text": "== See also ==List of NCAA Division I men's basketball players with 2000 points and 1000 rebounds"}, {"text": "== See also ==\"Saturday Morning Fun Pit\", a 2013 episode of Futurama featuring Bird voice acting as a cartoon clone version of himself"}, {"text": "== Further reading ==MacCambridge, Michael, ed. (1999). \"Larry Bird: Bird of Prey\". ESPN SportsCentury. New York: Hyperion-ESPN Books. pp. 253–254. ISBN 978-0786864713."}, {"text": "== Further reading ==May, Peter (2007) [1994]. The Big Three: Larry Bird, Kevin McHale, and Robert Parish: The Best Frontcourt in the History of Basketball. New York: Simon and Schuster. ISBN 978-1-4165-5207-9. OCLC 86221987. Retrieved March 21, 2013."}, {"text": "== External links ==Career statistics and player information from NBA.com  and Basketball-Reference.com"}, {"text": "== External links ==Larry Bird at the Naismith Memorial Basketball Hall of Fame"}, {"text": "== External links ==NBA profile"}]