[{"text": "William John Neeson  (born 7 June 1952) is an actor from Northern Ireland. He has received several accolades, including nominations for an Academy Award, a BAFTA Award, three Golden Globe Awards, and two Tony Awards. In 2020, he was placed seventh on The Irish Times list of Ireland's 50 Greatest Film Actors. Neeson was appointed Officer of the Order of the British Empire (OBE) in 2000.Neeson made his film debut with  Pilgrim's Progress followed by early roles in Excalibur (1981), The Bounty (1984), The Mission (1986), The Dead Pool (1988), and Husbands and Wives (1992). He rose to prominence portraying Oskar Schindler in Steven Spielberg's holocaust drama Schindler's List (1993) for which he earned an Academy Award for Best Actor nomination. He played leading man roles in drama films such as Nell (1994), Rob Roy (1995), Michael Collins (1996), and Les Misérables (1998). He took blockbuster roles portraying Qui-Gon Jinn in Star Wars: Episode I – The Phantom Menace (1999), Ra's al Ghul in Batman Begins (2005) and Aslan in  The Chronicles of Narnia trilogy (2005–2010)."}, {"text": "He acted in films such as the historical drama Gangs of New York (2002), the romantic comedy Love Actually (2003), the biographical drama Kinsey (2004), the erotic thriller Chloe (2009), the religious drama Silence (2016), the fantasy film A Monster Calls (2016), the crime thriller Widows (2018), the anthology film The Ballad of Buster Scruggs (2018), and the romantic drama Ordinary Love (2019). Beginning in 2009, Neeson cemented himself as an action star with the action thriller series Taken (2008–2014), The A-Team (2010), The Grey (2011), Wrath of the Titans (2012), and A Walk Among the Tombstones (2014), and Cold Pursuit (2019). He is known for his collaborations in the genre with director Jaume Collet-Serra, and starred in four of his films: Unknown (2011), Non-Stop (2014), Run All Night (2015), and The Commuter (2018). "}, {"text": "On stage, Neeson joined the Lyric Players' Theatre in Belfast in 1976 for two years. On Broadway he earned two Tony Award for Best Actor in a Play nominations for his performances as Matt Burke in the revival of Eugene O'Neill's Anna Christie (1992) and John Proctor in the Arthur Miller revival The Crucible (2002). He portrayed Oscar Wilde in David Hare's The Judas Kiss (1998). "}, {"text": "== Early life ==Neeson was born in Ballymena, County Antrim, the son of primary school caretaker Bernard \"Barney\" Neeson and cook Katherine \"Kitty\" Neeson (née Brown). His mother was born and raised in Waterford in the south-east of Ireland. Brought up Catholic, he was named Liam after a local priest. He has three sisters, Elizabeth, Bernadette, and Rosaleen. He attended St Patrick's College, Ballymena, from 1963 to 1967, and later recalled that his love of drama began there.He said that growing up as a Catholic in a predominantly Protestant town made him cautious, and once said he felt like a \"second-class citizen\" there, but has also said he was never made to feel \"inferior or even different\" at the town's predominantly Protestant technical college. \"It would be colourful to imagine I had a rebellious, uproarious Irish background,\" he has said, \"but the facts were much greyer. Irish, yes. But all that nationalistic stuff, crying into your Guinness and singing rebel songs—that was never my scene.\" He has described himself as \"out of touch\" with the politics and history of Northern Ireland until becoming aware of protests by fellow students after Bloody Sunday, a massacre in Derry in 1972 during the Troubles, which encouraged him to learn more local history. In a 2009 interview, he said, \"I never stop thinking about [the Troubles]. I've known guys and girls who have been perpetrators of violence and victims. Protestants and Catholics. It's part of my DNA.\"At age nine, Neeson began boxing lessons at the All Saints Youth Club, and went on to win a number of regional titles before quitting at 17. He acted in school productions during his teens. His interest in acting and decision to become an actor were also influenced by Ian Paisley, founder of the Democratic Unionist Party (DUP), into whose Free Presbyterian Church of Ulster he sneaked. He said, \"[Paisley] had a magnificent presence and it was incredible to watch him just Bible-thumping away... it was acting, but it was also great acting and stirring too.\" In 1971, he joined a physics and computer science course at Queen's University Belfast before leaving to work for the Guinness Brewery. At Queen's, he discovered a talent for football and was spotted by Seán Thomas at Bohemian FC. There was a club trial in Dublin and Neeson played one game as a substitute against Shamrock Rovers FC, but was not offered a contract."}, {"text": "=== 1976–1993: Rise to prominence ===After leaving university, Neeson returned to Ballymena, where he worked in a variety of casual jobs, such as a forklift operator at Guinness and a lorry driver. He also attended teacher training college for two years in Newcastle upon Tyne before again returning to his hometown. In 1976, he joined the Lyric Players' Theatre in Belfast, where he performed for two years. He got his first film experience in 1977, playing Jesus Christ and The Evangelist in the religious film Pilgrim's Progress (1978). He moved to Dublin in 1978 when he was offered a part in Ron Hutchinson's Says I, Says He, a drama about The Troubles, at the Project Arts Centre. He acted in several other Project productions and joined the Abbey Theatre (the National Theatre of Ireland). In 1980, he performed with Stephen Rea, Ray McAnally and Mick Lally, playing Doalty in Brian Friel's play Translations, the first production of Friel's and Rea's Field Day Theatre Company, first presented in the Guildhall in Derry on 23 September 1980.In 1980, filmmaker John Boorman saw him on stage as Lennie Small in Of Mice and Men and offered him the role of Sir Gawain in the Arthurian film Excalibur. After the role, Neeson moved to London, where he continued working on stage, and in small-budget films and television. He lived with actress Helen Mirren, whom he met working on Excalibur. Between 1982 and 1987, he starred in five films, most notably with Mel Gibson and Anthony Hopkins in 1984's The Bounty and Robert De Niro and Jeremy Irons in 1986's The Mission. Neeson guest-starred in the third season of the television series Miami Vice in 1986, and moved to Hollywood the next year to take higher-profile roles. He starred with Cher and Dennis Quaid in Suspect, which brought him critical acclaim. In 1988, he starred with Clint Eastwood in the fifth Dirty Harry film, The Dead Pool, as Peter Swan, a horror film director. In 1990, he had a starring role in Sam Raimi's Darkman. Although the film was successful, Neeson's subsequent years did not bring him the same recognition."}, {"text": "=== 1993–2000: Breakthrough and acclaim ===Steven Spielberg offered Neeson the role of Oskar Schindler in his holocaust film Schindler's List after seeing him in Anna Christie on Broadway. Kevin Costner, Mel Gibson and Warren Beatty all expressed interest in the part (Beatty even auditioned), but Neeson was cast in December 1992 after auditioning for the role. He read the Keneally book and concluded that his character \"enjoyed fookin' [sic] with the Nazis. In Keneally's book, it says he was regarded as a kind of a buffoon by them... if the Nazis were New Yorkers, he was from Arkansas. They don't quite take him seriously, and he used that to full effect.\" His critically acclaimed performance earned him a nomination for a Best Actor Oscar, and helped the film earn Best Picture of 1993. He also received BAFTA and Golden Globes nominations for the performance. He soon became an in-demand leading actor. "}, {"text": "=== 1993–2000: Breakthrough and acclaim ===In 1993, Neeson made his Broadway debut playing Mat Burke in the revival of the Eugene O'Neill play Anna Christie starring opposite his Ellis Island co-star and future wife Natasha Richardson. For his performance he was nominated for the Tony Award for Best Actor in a Play The following year they also worked together in Nell (1994) starring Jodie Foster. He then took leading roles in the period piece drama films including playing the lead role of Rob Roy MacGregor in the historical drama  Rob Roy (1995) opposite Jessica Lange, Brian Cox, and Tim Roth. Critic Roger Ebert of The Chicago Sun-Times praised his ability to be a leading man writing, \"Neeson, tall and grand, makes an effortless hero as Rob Roy\".The following year he acted in Neil Jordan's historical drama Michael Collins (1996) acting alongside Julia Roberts, and Alan Rickman. Neeson portrayed the title role as the Irish revolutionary leading the fight for Irish independence. The film premiered at the Venice Film Festival where it received the Golden Lion with Neeson earning the Volpi Cup for Best Actor. He later earning nominations for the Golden Globe Award for Best Actor – Motion Picture Drama. Todd McCarthy of Variety praised his performance writing, \"Neeson is a compulsive dynamo as Collins, with the actor seizing his part with a passion and boldness utterly in keeping with the character’s approach to life and his cause\".Neeson portrayed Jean Valjean in the 1998 adaptation of Victor Hugo's Les Misérables directed by Bille August. He starred alongside Uma Thurman, Geoffrey Rush, and Claire Danes. Writing of Neeson's performance, Janet Maslin of The New York Times wrote, \"[He] plays the role with the sure physical authority and profound decency that are fundamental to Valjean's character\" adding, \"With a first-rate cast and a venerable storytelling style, it fluently condenses Victor Hugo's epic novel and retrieves some of its suspenseful momentum.\" That same year he returned to the stage in the David Hare play The Judas Kiss (1998) portraying Oscar Wilde which ran at both the Almeida Theatre in the West End and the Broadhurst Theatre on Broadway. He acted alongside Tom Hollander and Peter Capaldi. In 1999 he acted in the supernatural horror film The Haunting (1999) opposite Catherine Zeta-Jones."}, {"text": "=== 1999–2007: Blockbuster roles ===In 1999, Neeson starred as Jedi Master Qui-Gon Jinn in Star Wars: Episode I – The Phantom Menace. Director George Lucas cast Neeson because he considered him a \"master actor, who the other actors will look up to, who has got the qualities of strength that the character demands.\" As the first Star Wars film to be released in 16 years, it was surrounded by media anticipation. Neeson's connection to Star Wars started in the Crown Bar, Belfast. He told Ricki Lake, \"I probably wouldn't have taken the role if it wasn't for the advice of Peter King in the Crown during a Lyric reunion.\" Despite mixed reviews from critics and fans, The Phantom Menace was an enormous box-office success and remained the most financially successful Star Wars film (unadjusted for inflation) until Star Wars: The Force Awakens (2015).Neeson's performance as Qui-Gon received positive reviews and a Saturn Award nomination. A stock recording of his voice from The Phantom Menace can be heard during a scene in Star Wars: Episode II – Attack of the Clones (2002). Neeson was later reported to be appearing in Star Wars: Episode III – Revenge of the Sith (2005), but ultimately did not. In the animated television series Star Wars: The Clone Wars (2008–20), he voiced Qui-Gon in two episodes of the third season and one episode of the sixth season, and he also made a voice cameo as Qui-Gon in Star Wars: The Rise of Skywalker (2019). Neeson appeared as Qui-Gon in the final episode of Obi-Wan Kenobi (2022), appearing as a force ghost to Obi-Wan, in an uncredited cameo, marking his first live-action portrayal of Qui-Gon since The Phantom Menace. He later voiced Qui-Gon again for an episode of the animated Star Wars: Tales of the Jedi (2022)."}, {"text": "=== 1999–2007: Blockbuster roles ===Neeson narrated the 2001 documentaries Journey into Amazing Caves, a short film about two scientists who travel around the world to search for material for potential cures; and The Endurance: Shackleton's Legendary Antarctic Adventure. The latter won awards at a number of film festivals including Best Documentary from both the Chicago Film Critics Association and the National Board of Review. Neeson returned to Broadway in the revival of the Arthur Miller play The Crucible acting opposite Laura Linney. For his performance as John Proctor he received a nomination for the Tony Award for Best Actor in a Play. Charles Isherwood of Variety praised Neeson writing, \"In his thoughtful performance as Proctor, the effortlessly charismatic Neeson subtly delineates a man’s moral evolution as Proctor moves from casual scorn for the proceedings to outrage to soul-stricken despair\" adding, \"Perhaps the finest aspect of Neeson’s performance is its admirable restraint\". That same year Neeson acted with Harrison Ford in Kathryn Bigelow's 2002 submarine thriller K-19: The Widowmaker as Captain Mikhail Polenin. He was also on the cast of Martin Scorsese's historical drama Gangs of New York with Daniel Day-Lewis, Leonardo DiCaprio, and Cameron Diaz.In 2003 he played a recently widowed writer in Richard Curtis's romantic comedy ensemble Love Actually (2003) acting alongside Hugh Grant, Colin Firth, Emma Thompson, Alan Rickman, and Laura Linney. The film was a commercial success and has since become a cult classic and holiday favorite. The following year he portrayed Alfred Kinsey in the biographicald drama Kinsey reuniting with Laura Linney and Peter Sarsgaard and John Lithgow. Neeson received a nomination for the Golden Globe Award for Best Actor – Motion Picture Drama losing to Leonardo DiCaprio for The Aviator (2004). That year Neeson hosted an episode of the NBC sketch show Saturday Night Live. He starred as a redneck trucker, Marlon Weaver, in an \"Appalachian Emergency Room\" sketch and as a hippie in a one-off sketch about two stoners (the other played by Amy Poehler) who attempt to borrow a police dog to find their lost stash of marijuana. Despite vowing not to play any Irish stereotypes, Neeson did play an Irish man named Lorcan McArdle in the home makeover show parody \"You Call This A House, Do Ya?\""}, {"text": "=== 1999–2007: Blockbuster roles ===In 2005, Neeson took multiple roles in mainstream blockbuster films. He portrayed Godfrey of Ibelin in Ridley Scott's epic adventure Kingdom of Heaven, Ra's al Ghul, one of the main villains in Christopher Nolan's action film Batman Begins; and Father Bernard in Neil Jordan's adaptation of Patrick McCabe's novel Breakfast on Pluto. That same year he replaced Brian Cox playing Aslan the Lion in the fantasy adventure film The Chronicles of Narnia: The Lion, the Witch and the Wardrobe (2005) an adpatation of the C.S. Lewis book of the same name. In The Simpsons episode \"The Father, the Son, and the Holy Guest Star\" (2005), he voiced the kindly priest who (briefly) converts Bart and Homer to Catholicism. That same year, he gave his voice to the lion Aslan in the blockbuster fantasy film The Chronicles of Narnia: The Lion, the Witch and the Wardrobe.In 2007, he starred in the American Civil War epic Seraphim Falls. Neeson voiced the main character's father, James, in the video game Fallout 3. Executive producer Todd Howard said, \"This role was written with Liam in mind, and provides the dramatic tone for the entire game\". Fallout 3, the third game in the Fallout series, was extremely well received by critics and shipped 4.7 million copies by the end of 2008, the year it was released. In the director's commentary of the 2007 Transformers DVD, Michael Bay said he had told the animators to seek inspiration from Neeson in creating Optimus Prime's body language. Neeson appeared as Alistair Little in the BBC Northern Ireland/Big Fish Films television drama Five Minutes of Heaven, which tells the true story of a young Protestant man convicted of murdering a Catholic boy during The Troubles."}, {"text": "=== 2008–present: Action stardom ===In 2008, Neeson starred in the action film Taken, a French-produced film also starring Famke Janssen and Maggie Grace, based on a script by Luc Besson and Robert Mark Kamen and directed by Pierre Morel. Neeson plays a retired CIA operative from the elite Special Activities Division who sets about tracking down his teenage daughter after she is kidnapped. Taken was a worldwide box-office hit, grossing $223.9 million worldwide, making almost $200 million more than its production budget. Neeson has said in interviews that he believed that Taken had put some people off the idea of actually travelling to Europe. Taken brought Neeson back into the centre of the public eye and resulted in his being cast in many more big-budget Hollywood movies. That year he also narrated the documentary Black Holes: The Other Side of Infinity and again lent his voice to Aslan in The Chronicles of Narnia: Prince Caspian (2008). He also provided a voice for Hayao Miyazaki's anime film Ponyo on the Cliff by the Sea, which received an August 2009 release.In 2010, Neeson played Zeus in the remake of the 1981 film, Clash of the Titans. The film was a huge box-office hit, grossing $475 million worldwide. Neeson also starred in Atom Egoyan's erotic thriller Chloe, theatrically released by Sony Pictures Classics on 26 March 2010. Chloe had enjoyed commercial success and became the Canadian director's biggest money maker ever. Later the same year, he played John \"Hannibal\" Smith in the spin-off movie from the television series The A-Team. Neeson voiced Aslan once more in the 2010 sequel The Chronicles of Narnia: The Voyage of the Dawn Treader. That same year he made a guest-star appearance on the Showtime series The Big C with Laura Linney. In 2011, Neeson starred in the action-thriller Unknown, a German-British-American co-production of a French book filmed in Berlin in early 2010, and directed by Jaume Collet-Serra.  This film led to a collaboration between Neeson and Collet-Serra (as director and/or producer) on a series of similar action films including Non-Stop (2014), Run All Night (2015), The Commuter (2018) and Retribution (2023). Neeson reunited with Steven Spielberg with plans to star as Abraham Lincoln in the 2012 film Lincoln, based on the book Team of Rivals by Doris Kearns Goodwin. In preparation for the role, Neeson visited the District of Columbia and Springfield, Illinois, where Lincoln lived before being elected, and read Lincoln's personal letters. Neeson eventually declined the role, claiming he was \"past his sell date\" and had grown too old for the role and was replaced by Daniel Day-Lewis (who won his third Academy Award for Best Actor for playing Lincoln)."}, {"text": "=== 2008–present: Action stardom ===In 2011, he played himself in BBC2's series Life's Too Short starring Ricky Gervais, Stephen Merchant and Warwick Davis. In late 2011, Neeson was cast to play the lead character, a journalist, in a new album recording and arena production of Jeff Wayne's War of the Worlds. He replaced Richard Burton, who had posthumously appeared in the arena production through CGI animation. Neeson did not physically appear on the stage, instead playing the role through the use of 3D holography. In 2012, Neeson starred in Joe Carnahan's The Grey. The film received mostly positive reviews and Neeson's performance received critical acclaim. He also starred in Taken 2 (2012), a successful sequel to his 2008 blockbuster. That year, he once again appeared as Ra's al Ghul in a cameo appearance in The Dark Knight Rises (2012), the third and final film in Christopher Nolan's The Dark Knight Trilogy. Dialogue from his role as Ra's al Ghul in Batman Begins was featured in the first trailer for the film."}, {"text": "=== 2008–present: Action stardom ===Neeson had a supporting role as the henchman Bad Cop/Good Cop in the animated film The Lego Movie, which was a critical and commercial success. Neeson later played Bill Marks in the 2014 action film Non-Stop. The film was released on 28 February 2014. He also appeared, uncredited, as God in the BBC2 series Rev.. Neeson stars in the 2014 film A Walk Among the Tombstones, an adaption of the best-selling novel of the same name, in which he plays former cop Matthew Scudder, a detective hired to hunt the killers of a drug dealer's wife. During Super Bowl XLIX, Supercell did a Clash of Clans commercial with Neeson playing the game as \"AngryNeeson52\" and vowing revenge on his opponent \"BigBuffetBoy85\" while waiting for his scone at a bakery. The appearance was a parody of his role in Taken. In 2016, Neeson narrated the RTÉ One three-part documentary on the Easter Rising, 1916. Following the success of the Taken films, Neeson has become increasingly known as a star of action thriller films.  Besides The A-Team, Unknown, The Grey, Non-Stop, A Walk Among the Tombstones, Run All Night, The Commuter and Retribution, other recent action films starring Neeson have included Cold Pursuit (2019), Honest Thief (2020), The Marksman (2021), The Ice Road (2021), Blacklight (2022), Memory (2022) and In the Land of Saints and Sinners (2024).  Neeson has indicated a desire to retire from the action genre though the films have taken his acting career in a new direction."}, {"text": "=== 2008–present: Action stardom ===In 2016 Neeson reunited with director Martin Scorsese with the drama an adaptation of the novel Silence starring alongside Andrew Garfield and Adam Driver. That same year, he did the voice and motion capture for the Monster in the Spanish film A Monster Calls. In 2018 he acted in the Coen brothers western anthology film The Ballad of Buster Scruggs and the Steve McQueen crime thriller Widows acting opposite Viola Davis. He portrayed Mark Felt in Mark Felt: The Man Who Brought Down the White House (2017) directed by Peter Landesman and Philip Marlowe in Marlowe (2022) directed by Neil Jordan. He acted in the romantic drama Ordinary Love (2019) with Lesley Manville and the biographical drama Wildcat starring Maya Hawke. On television he played Chief Constable Byers\t in Derry Girls (2022), and portrayed a fictional version of himself in Atlanta (2022)."}, {"text": "== Activism ==Neeson opposes what he sees as the unrestricted right to own firearms in the U.S. and has made calls for gun control. In January 2015, he repeated his views, calling U.S. gun laws a \"disgrace\" in an interview with Emirati newspaper Gulf News when replying to a question about the Charlie Hebdo shootings earlier that month. In response, U.S gun manufacturer Para USA, which provided the prop weapons used by Neeson in the Taken film series, stated: \"We will no longer provide firearms for use in films starring Liam Neeson and ask that our friends and partners in Hollywood refrain from associating our brand and products with his projects.\"In 2014, Neeson protested against the anti-carriage horse campaign of New York City Mayor Bill de Blasio, who said he would outlaw horse-drawn carriages in Central Park once he took office. He wrote an opinion page published in The New York Times citing the carriage trade as a safe one for employees, horses, and tourists, and noted it was a livelihood for many immigrants.Neeson narrated a video for Amnesty International in favour of the legalisation of abortion in Ireland, which some conservative and pro-life commentators claimed was \"anti-Catholic\".Neeson was opposed to Brexit, stating in 2016 that it would be truly \"a shame to sacrifice all the progress that has been made by the peace process regarding border controls\".In September 2017, Neeson compared the U.S. presidency of Donald Trump to the Watergate scandal of Richard Nixon: \"Democracy works and no man—and certainly not the president—is above the law. He has to be accountable.\""}, {"text": "=== Marriage and relationships ===Neeson lived with actress Helen Mirren during the early 1980s. They met while working on Excalibur (1981). Interviewed by James Lipton for Inside the Actors Studio, Neeson said Mirren was instrumental in him getting an agent. "}, {"text": "=== Marriage and relationships ===He dated Barbra Streisand for about nine months in 1991–1992.Neeson then met actress Natasha Richardson while performing in a revival of the play Anna Christie on Broadway in 1993. They were married on 3 July 1994 and had two sons together, Micheál (b. 1995) and Daniel (b. 1996). In October 1998, they won £50,000 ($85,370) in libel damages after the Daily Mirror wrongly claimed that their marriage was suffering. They donated the money to victims of the August 1998 Omagh bombing. In August 2004, they purchased an estate in Millbrook, New York. On 18 March 2009, Richardson died when she suffered a severe head injury in a skiing accident at the Mont Tremblant Resort, northwest of Montreal. Neeson donated her organs following her death."}, {"text": "=== Citizenship ===Neeson holds Irish, British, and American citizenship, having been naturalised as an American citizen in 2009. He primarily identifies as Irish. After taking up American citizenship, he was adamant he was not turning his back on his Irish roots. In 2009, nearly four decades after he was an undergraduate in physics and computer science at Queen's University, Belfast, it awarded him an honorary doctorate, presented to him in New York by Vice-Chancellor Professor Peter Gregson. In March 2011, he was appointed a Goodwill Ambassador for UNICEF. He is a patron of Belfast-based charity and film festival CineMagic, which helps young people get involved in the movie industry.A heavy smoker earlier in his career, Neeson quit smoking in 2003 while working on Love Actually. When he took the role of Hannibal for the 2010 film adaptation of The A-Team, he had reservations about smoking cigars (a signature trait of the character), but agreed to do it for the film.In June 2012, Neeson's publicist denied reports that Neeson was converting to Islam. Neeson has expressed an affection for the adhan, the Islamic call to prayer, that he grew accustomed to while filming Taken 2 in Istanbul: \"By the third week, it was like I couldn't live without it. It really became hypnotic and very moving for me in a very special way. Very beautiful.\" He also expressed admiration for the Spiritual Exercises of Saint Ignatius of Loyola.Neeson's mother, Kitty, died in June 2020. He was unable to return to his hometown for her funeral due to travel restrictions caused by the COVID-19 pandemic."}, {"text": "=== Social views ===Neeson is a long-term supporter of the need for more integrated education in Northern Ireland; that is, educating Catholics and Protestants together. In 2017 he said,  \"As Northern Ireland moves forward from division, who do we look to for a future we can share? Our children - so why do we continue to educate them apart? Different religions, different backgrounds, different schools. There is another way. Protestants and Catholics, other beliefs and none, learning and working together every day.\" He has praised schools where parents have voted to transform segregated schools into integrated schools, and fronted television adverts to encourage more parents to integrate their children's schools.Neeson was criticised for his comments on Ireland's Late Late Show in January 2018, during which he described the Me Too movement as a \"witch hunt\" and cited Garrison Keillor's dismissal from Minnesota Public Radio as an example.In February 2019, Neeson gained public and media controversy after a press junket interview he conducted with The Independent while promoting Cold Pursuit, a film about a father seeking revenge for his son's murder. He said that he generated his character's \"primal\" anger by recounting an experience he had 40 years ago, in which a female friend of his had been raped by a stranger. After learning the attacker was a black man, Neeson said that he spent a week going \"up and down areas with a cosh, hoping some 'black bastard' would come out of a pub and have a go\" so that he \"could kill him\". In the interview, he also said he was ashamed of the experience and that the things he did and said were \"horrible\". He said, \"It's awful [...] but I did learn a lesson from it, when I eventually thought, 'What the fuck are you doing?'\"In an appearance on Good Morning America, Neeson elaborated on his comments while denying being a racist, stating that he asked for physical attributes of the rapist other than his race and that he would have done the same if the rapist was \"a Scot or a Brit or a Lithuanian\". He also said that he had purposely gone into \"black areas of the city\" but that he \"did seek help\" and counselling from his friends and a priest after coming to his senses. He said that the lesson of his experience was \"to open up [and] to talk about these things\", including toxic masculinity and the underlying \"racism and bigotry\" in both the U.S. and Northern Ireland. The controversy following his comments led to cancellation of the red carpet event for the premiere of Cold Pursuit. Neeson was publicly defended by Michelle Rodriguez, Whoopi Goldberg, John Barnes, Trevor Noah, and Ralph Fiennes. Donald Glover later convinced him to appear in his FX series Atlanta episode \"New Jazz\" as a fictionalised version of himself, to examine the controversy."}, {"text": "== Acting credits and accolades ==In 2000, Neeson was offered the \"Freedom of the Town of Ballymena\" by the Ballymena Borough Council, but because of objections made by members of the Democratic Unionist Party regarding his comments that he had felt like a \"second-class citizen\" growing up as a Catholic in the town, he declined the award, citing tensions. Following the controversy, Neeson wrote a letter to the council, stating; \"I will always remain very proud of my upbringing in, and association with, the town and my country of birth, which I will continue to promote at every opportunity. Indeed, I regard the enduring support over the years from all sections of the community in Ballymena as being more than sufficient recognition for any success which I may have achieved as an actor.\" Subsequently, on 28 January 2013, Neeson received the Freedom of the Borough from Ballymena Borough Council at a ceremony in the town.Neeson was appointed Officer of the Order of the British Empire (OBE) by Queen Elizabeth II in her 2000 New Year Honours. The American Ireland Fund honoured Neeson with their Performing Arts Award for the great distinction he has brought to Ireland at their 2008 Dinner Gala in New York City. In 2009, at a ceremony in New York, Neeson was awarded an honorary doctorate by Queen's University, Belfast. On 9 April 2016, he was honoured with the Outstanding Contribution to Cinema Award by the Irish Film and Television Academy (IFTA) at the Mansion House, Dublin, with Irish President Michael D. Higgins presenting the award. In 2017, Neeson was listed by UK-based company Richtopia at number 74 in the list of 200 Most Influential Philanthropists and Social Entrepreneurs Worldwide. In January 2018, he was awarded the Distinguished Service for the Irish Abroad Award by Irish President Michael D. Higgins, who described it as an award \"for Irish people abroad who are making a contribution to humanity\"."}, {"text": "== See also ==List of British Academy Award nominees and winners"}, {"text": "== See also ==List of Irish Academy Award winners and nominees"}, {"text": "== See also ==List of actors with Academy Award nominations"}, {"text": "== External links ==Liam Neeson at IMDb"}, {"text": "== External links ==Liam Neeson at the Internet Broadway Database "}, {"text": "== External links ==Liam Neeson at the TCM Movie Database "}, {"text": "== External links ==Liam Neeson at AllMovie"}, {"text": "== External links ==Liam Neeson at the BFI's Screenonline"}, {"text": "== External links ==Liam Neeson on GQ's Actually Me"}]