[{"text": "Lindsay Dee Lohan ( LOH-ən; born July 2, 1986) is an American actress and singer. Born in New York City and raised on Long Island, Lohan was signed to Ford Models at age three. She appeared as a regular on the soap opera Another World at the age of 10, and her breakthrough came in the 1998 Walt Disney Pictures film The Parent Trap. The film's success led to appearances in subsequent Disney projects; the television films Life-Size (2000) and Get a Clue (2002) and the big-screen productions Freaky Friday (2003) and Confessions of a Teenage Drama Queen (2004). Lohan's early work won her childhood stardom, while the teen comedy sleeper hit Mean Girls (2004) affirmed her status as a teen idol and established her as a leading Hollywood actress.Lohan signed with Casablanca Records and released two studio albums, the platinum-certified Speak (2004) and gold-certified A Little More Personal (Raw) (2005). She also starred in the comedies Herbie: Fully Loaded (2005) and Just My Luck (2006). To show her range, Lohan began choosing roles in independent films such as A Prairie Home Companion and Bobby (both 2006) and Chapter 27 (2007). Her reported behavior during the filming of the 2006 dramedy Georgia Rule marked the start of a series of personal struggles that plagued her life and career for most of the next decade. She became a fixture in the tabloid press for her frequent legal issues, court appearances, and stints in rehabilitation facilities. This period saw her lose several roles, adversely affecting her career and public image. In an attempt to return to acting, she appeared in Liz & Dick (2012) and The Canyons (2013)."}, {"text": "In 2013, under the guidance of Oprah Winfrey, Lohan filmed the docu-series Lindsay (2014), which depicted her returning to work. She subsequently made her stage debut in the London West End production of Speed-the-Plow (2014), starred in the second season of the comedy series Sick Note (2018), and served as a panelist in the first season of Masked Singer Australia (2019). Between 2016 and 2018, she opened three beach clubs in Greece, which were the focus of the MTV reality television series Lindsay Lohan's Beach Club (2019). After signing a multi-picture deal with Netflix, Lohan starred in the romantic comedies Falling for Christmas (2022) and Irish Wish (2024)."}, {"text": "== Early life ==Lohan was born on July 2, 1986, in the Bronx, one of the five boroughs of New York City, and grew up in Merrick and Cold Spring Harbor on Long Island, New York. She is the eldest child of Dina (née Sullivan) and Michael Lohan. Her father, a former Wall Street trader, has been in trouble with the law on several occasions. Her mother is a former singer and dancer. Lohan has three younger siblings, all of whom have been models or actors: Michael Jr., who appeared with Lohan in The Parent Trap in 1998, Aliana, known as \"Ali\", and Dakota \"Cody\" Lohan. Lohan is of Irish and Italian heritage, and she was raised as a Roman Catholic. Her maternal antecedents were \"well known Irish Catholic stalwarts\" and her great-grandfather, John L. Sullivan, was a co-founder of the Pro-life Party on Long Island. She began home-schooling in grade 11.Lohan's parents married in 1985, separated when Lindsay was three, and later reunited. They separated again in 2005 and finalized their divorce in 2007."}, {"text": "=== Beginnings (1989–2002) ===Lohan began her career as a child model with Ford Models at the age of three. She modeled for Calvin Klein Kids and Abercrombie, and appeared in over 60 television commercials for brands like Pizza Hut and Wendy's, as well as a Jell-O spot with Bill Cosby. By the age of 10, when Lohan played Alexandra \"Alli\" Fowler in the television soap opera Another World, Soap Opera Magazine said she was already considered a show-business veteran.Lohan remained in her role on Another World for a year, before leaving to star in Disney's 1998 family comedy The Parent Trap, a remake of the 1961 movie. She played dual roles of twins, separated in infancy, who try to reunite their long-divorced parents, played by Dennis Quaid and Natasha Richardson. The film earned $92 million worldwide, and received largely positive reviews. Lohan received unanimous acclaim for her debut performance. Critic Kenneth Turan called Lohan \"the soul of this film as much as Hayley Mills was of the original\", going on to say that \"she is more adept than her predecessor at creating two distinct personalities.\" The film won Lohan a Young Artist Award for best performance in a feature film as well as a three-film contract with Disney."}, {"text": "=== Beginnings (1989–2002) ===At the age of 14, Lohan played Bette Midler's daughter in the pilot episode of the short-lived series Bette, but she resigned her role when the production moved from New York to Los Angeles. Lohan starred in two made-for-TV movies: Life-Size alongside Tyra Banks in 2000, and Get a Clue in 2002.Emilio Estefan and his wife, Gloria Estefan, signed Lohan to a five-album production deal in September 2002."}, {"text": "=== Worldwide recognition (2003–2005) ===In 2003, Lohan starred alongside Jamie Lee Curtis in the remake of Disney's family comedy Freaky Friday, playing a mother and daughter who switch bodies and have to take on each other's roles. At Lohan's initiative, her character was rewritten and changed from a Goth style to be more mainstream. Her performance was met with significant praise. Critic Roger Ebert wrote that Lohan \"has that Jodie Foster sort of seriousness and intent focus beneath her teenage persona.\" Freaky Friday earned Lohan the award for Breakthrough Performance at the 2004 MTV Movie Awards and, as of 2015, it remained her most commercially successful film, earning $160 million worldwide as well as an 87 percent approval rating on Rotten Tomatoes. Her role required her to learn how to play the guitar and to sing. She recorded a song for the film, \"Ultimate\", which was released to Radio Disney to help promote the film. The song peaked at number 18 on Radio Disney's Top 30."}, {"text": "=== Worldwide recognition (2003–2005) ===In 2004, Lohan had lead roles in two major motion pictures. The first film, Disney's teen comedy Confessions of a Teenage Drama Queen, earned a domestic box office total of $29 million, with Brandon Gray of Box Office Mojo commenting that it was \"well above expectations as it was strictly for young girls.\" But the film was not met with critical acclaim. Robert K. Elder of the Chicago Tribune wrote that \"though still a promising star, Lohan will have to do a little penance before she's forgiven for Confessions.\" Her second lead role that year, in the teen comedy Mean Girls, marked Lohan's first movie independent of Disney. The film was a critical and commercial success, grossing $129 million worldwide and, according to Brandon Gray, \"cementing her status as the new teen movie queen.\" Mick LaSalle from the San Francisco Chronicle wrote that \"Lohan is sensitive and appealing, a solid locus for audience sympathy.\" David Rooney from Variety said that \"Lohan displays plenty of charm, verve and deft comic timing.\" Lohan received four awards at the 2004 Teen Choice Awards for Freaky Friday and Mean Girls, including Breakout Movie Star. Mean Girls also earned her two awards at the 2005 MTV Movie Awards. In 2021, The New Yorker critic Richard Brody placed Lohan's performance in Mean Girls at number eleven in his list of \"The Best Movie Performances of the Century So Far\".With Mean Girls, Lohan's public profile was raised significantly. Vanity Fair described how she became a household name. Paparazzi began following her and her love life and partying became frequent targets of gossip sites and the tabloid media. Following the film, which was scripted by former Saturday Night Live writer-actress Tina Fey and featured several Saturday Night Live performers, Lohan hosted the show three times between 2004 and 2006. In 2004, when Lohan was 17, she became the youngest host of the MTV Movie Awards.Lohan's debut album, Speak, was released in the United States on December 7, 2004. The album was the first high-seller from Casablanca Records in several years, selling 1 million units in the United States. The album received mostly negative reviews, with critics commenting that Lohan \"isn't a bad singer, but not an extraordinary singer either.\" In the United States, the album peaked at number four on the Billboard 200, selling 261,762 copies in its first week. In Germany the album debuted at number 53 and took four weeks to complete its chart run. The first two singles from Speak, \"Rumors\" and \"Over\", were both successes, with \"Over\" topping the Bubbling Under Hot 100 Singles, where it stayed for three weeks. The song also did well internationally in countries such as Australia, Ireland, and the United Kingdom. \"Rumors\" peaked at number six on the Bubbling Under Hot 100 chart and also did well in Australia and Germany, where it reached number 14. The music video for \"Rumors\" was nominated for Best Pop Video at the 2005 MTV Video Music Awards. Both songs received heavy airplay on MTV's Total Request Live."}, {"text": "=== Worldwide recognition (2003–2005) ===Lohan returned to Disney in 2005, starring in the comedy Herbie: Fully Loaded, the fifth film in the series with the anthropomorphic Volkswagen Beetle Herbie; she played a college graduate who finds Herbie, the living car, at a junk yard. The film earned $144 million worldwide, but it received mixed reviews. Stephen Holden of The New York Times called Lohan \"a genuine star who ... seems completely at home on the screen\", while James Berardinelli wrote that \"as bright a starlet as she may be, Lohan ends up playing second fiddle to the car.\" In 2005, Lohan became the first person to have a My Scene celebrity doll released by Mattel. She also voiced herself in the animated direct-to-DVD film My Scene Goes Hollywood: The Movie, based on the series of dolls.Lohan's second album, A Little More Personal (Raw), was released in December 2005. It peaked at number 20 on the Billboard 200 chart, and was eventually certified Gold. Lohan co-wrote most of the songs on the album, which received a mixed critical response. Slant Magazine called it \"contrived ... for all the so-called weighty subject matter, there's not much meat on these bones.\" Lohan herself directed the music video for the album's only single, \"Confessions of a Broken Heart (Daughter to Father)\", which features her sister Aliana Lohan. The video is a dramatization of the pain Lohan said her family suffered at the hands of her father. It was her first song to chart on the Billboard Hot 100, peaking at number 57."}, {"text": "=== Mature film roles and career setbacks (2006–2011) ===Lohan's next widely released film, the romantic comedy Just My Luck, opened in May 2006 and, according to Variety, earned her over $7 million. The opening weekend box office takings of $5.7 million \"broke lead actress Lindsay Lohan's winning streak\" according to Brandon Gray. The film received poor reviews and earned Lohan her first Golden Raspberry nomination for Worst Actress. Following Just My Luck, Lohan focused on smaller roles in more mature, independent movies. Robert Altman's ensemble comedy A Prairie Home Companion, based on humorist Garrison Keillor's works, in which Lohan co-stars with Meryl Streep and Lily Tomlin, had a limited release in June 2006. Peter Travers wrote for Rolling Stone that \"Lohan rises to the occasion, delivering a rock-the-house version of 'Frankie and Johnny.'\" Co-star Streep said of Lohan's acting: \"She's in command of the art form\" and \"completely, visibly living in front of the camera.\" The Emilio Estevez ensemble drama Bobby, about the hours leading up to the Robert F. Kennedy assassination, was released in theaters in November 2006. Lohan received favorable comments for her performance, particularly a scene alongside Sharon Stone. As part of the Bobby ensemble cast, Lohan was nominated for a Screen Actors Guild Award."}, {"text": "=== Mature film roles and career setbacks (2006–2011) ===Lohan's next appearance was in Chapter 27 as a John Lennon fan who befriends Mark David Chapman, played by Jared Leto, on the day he murders Lennon. Filming finished in early 2006, but the film was not released until March 2008 due to difficulties in finding a distributor. In May 2007, the drama Georgia Rule was released. In the film, Lohan portrays an out-of-control teenager whose mother (Felicity Huffman) brings her to the house of her own estranged mother (Jane Fonda). Owen Gleiberman of Entertainment Weekly wrote that \"Lohan hits a true note of spiteful princess narcissism.\" During filming in 2006, Lohan was hospitalized, her representative saying \"she was overheated and dehydrated.\" In a letter that was made public, studio executive James G. Robinson called Lohan \"irresponsible and unprofessional.\" He mentioned \"various late arrivals and absences from the set\" and said that \"we are well aware that your ongoing all night heavy partying is the real reason for your so-called 'exhaustion.'\" In 2007, Lohan was cast in the film Poor Things, which she ultimately lost.In January 2007, production on the film I Know Who Killed Me was put on hold when Lohan underwent appendix surgery. While Lohan was in rehab, she continued shooting the film, returning to the facility at night. Shortly thereafter, Lohan withdrew from a film adaptation of Oscar Wilde's A Woman of No Importance, her publicist stating that Lohan needed to \"focus on getting better.\" Lohan was replaced in The Edge of Love in April 2007, shortly before filming was to begin, with the director citing \"insurance reasons\" and Lohan later explaining that she \"was going through a really bad time then.\" Lohan withdrew from a scheduled appearance on The Tonight Show with Jay Leno in which she had been due to promote I Know Who Killed Me, a psychological horror-thriller in which she stars as a stripper with a dual personality. The film premiered in July 2007 to what Entertainment Weekly called \"an abysmal $3.5 million.\" It earned Lohan dual Golden Raspberry awards for Worst Actress, with Lohan coming first and second, tying with herself. Hollywood executives and industry insiders commented that it would be difficult for Lohan to find employment until she could prove that she was sober and reliable, citing possible issues with securing insurance.In May 2008, Lohan's single \"Bossy\" was released onto digital outlets, and reached number one on the US Billboard Hot Dance Club Play chart. That month, she made her first screen appearance since I Know Who Killed Me, on ABC's television series Ugly Betty. She guest starred in four episodes as Kimmie Keegan, an old schoolmate of the protagonist Betty Suarez. In the comedy Labor Pains, Lohan plays a woman who pretends to be pregnant. During the shoot, Lohan's manager worked with the paparazzi to encourage the media to show her work, as opposed to partying. It was originally planned for a theatrical release, but instead appeared as a TV movie on the ABC Family cable channel in July 2009, another \"setback for the star\" according to Variety. The premiere received 2.1 million viewers, \"better-than-average\" for the channel according to E! Online. Alessandra Stanley of The New York Times wrote that \"this is not a triumphant return of a prodigal child star. ... [Labor Pains] never shakes free of the heavy baggage Ms. Lohan brings to the role.\" Lohan was a guest judge on US TV style contest Project Runway sixth-season premiere episode, which aired in August 2009."}, {"text": "=== Mature film roles and career setbacks (2006–2011) ===Lohan narrated and presented the British television documentary Lindsay Lohan's Indian Journey, about human trafficking in India. It was filmed during a week in India in December 2009, and transmitted on BBC Three in April 2010. The BBC was criticized for having hired Lohan, and while reviewers called the documentary compelling, they also found Lohan's presence to be odd and distracting. Lohan said: \"I hope my presence in India will bring awareness to the really important issues raised in making this film.\" In April 2010, Lohan was let go from the film The Other Side where she had been set to star, with the director saying she was \"not bankable.\"In June 2010, Lohan was the subject of a fashion shoot in the photographer docu-series Double Exposure on Bravo. Robert Rodriguez's action exploitation film Machete opened in September 2010. In the film, Lohan's character takes drugs, is naked in much of her appearance, and later dons a nun's habit while toting a machine gun. Its critical reviews were mixed. The Washington Post described her character as \"a campier, trampier version of herself – or at least her tabloid image.\" Premiere.com said she was \"terrible\" while Variety called it \"her best work in some time.\" Because of her rehabilitation and legal engagements, Lohan did not participate in promotion of the movie. Lohan filmed a sketch where she is dressed as Marilyn Monroe for Inappropriate Comedy in 2010. The film had issues finding a distributor and was not released until 2013, when it was met with poor box office and critical reception. Lohan appeared on the October 2010 cover of Vanity Fair. She told the magazine: \"I want my career back\" and \"I know that I'm a damn good actress.\""}, {"text": "=== Television work and stage debut (2012–2020) ===Lohan had not appeared on Saturday Night Live since 2006 until she hosted the show for the fourth time in March 2012. Her appearance received mixed to negative reviews. Critics appreciated the self-deprecating references to her personal troubles, but also commented that she largely played a supporting role. The episode had the second highest ratings of the season with 7.4 million viewers. In May 2012, Lohan appeared briefly, as a celebrity judge, on the television series Glee, in the episode \"Nationals\". Lohan stars as a surfer in the art film First Point by artist Richard Phillips. It debuted at Art Basel in June 2012 and features a score by Thomas Bangalter from Daft Punk. Comments from critics on Lohan's work were mixed. Lohan starred as Elizabeth Taylor in the biographical made-for-TV movie Liz & Dick, which premiered on the Lifetime cable channel in November 2012. Reviews of Lohan's performance were largely, but not unanimously, negative. The Hollywood Reporter said she was \"woeful\" while Variety called her \"adequate.\" Entertainment Weekly described the premiere ratings of 3.5 millions as \"a little soft.\" During the production, paramedics were called to Lohan's hotel room, treating her for exhaustion and dehydration. In April 2013, the horror comedy Scary Movie 5 was released, where Lohan appears as herself alongside Charlie Sheen in the opening sketch. While the movie itself was panned by critics, a few reviewers found Lohan's and Sheen's to be one of the better scenes. Lohan also guest-starred as herself in an April 2013 episode of Sheen's comedy series Anger Management.In August 2013, The Canyons was released, an independent erotic thriller directed by Paul Schrader and written by Bret Easton Ellis. It was made on a low budget, most of which was gathered through online fund raiser Kickstarter. Lohan received $100 a day and a share of the profits, and she was also credited as a co-producer. The New York Times Magazine described Lohan as difficult to work with, and the shoot as fraught with conflict between Lohan and Schrader. Lohan and her co-star, adult-film actor James Deen, portray an actress and a producer in a volatile relationship. Reviews for the film were generally poor, but several critics praised Lohan's performance. The New Yorker said she was \"overwrought and unfocused\" while Variety called her \"very affecting\" and Salon described her as \"almost incandescent.\" The same month Lohan filled in for Chelsea Handler as host of the cable talk show Chelsea Lately. She received mostly positive reviews for her appearance and the show garnered its best ratings of the year.The 8-part docu-series Lindsay was transmitted in March and April 2014 on Oprah Winfrey's OWN cable network. The series followed Lohan's life and work as she moved to New York City after leaving rehab. In the final episode, Lohan said that she had had a miscarriage which had interrupted filming of the series. The premiere had 693,000 viewers, described as \"so-so\" by The Hollywood Reporter. The ratings then slipped and the finale only had 406,000 viewers. New York Daily News called the series \"surprisingly routine\", Variety described it as boring, while Liz Smith said it was \"compelling\" and \"usually painful to watch.\" In December 2013, Lohan introduced Miley Cyrus before her set at Dick Clark's New Year's Rockin' Eve. In April 2014, Lohan guest-starred in an episode of the CBS sitcom 2 Broke Girls. Around this time, Lohan had also announced and began promoting a film she was set to star in titled Inconceivable, which was never produced for unknown reasons.Lohan made her stage debut in October 2014, starring in the London West End production of David Mamet's Speed-the-Plow, a satire about the movie business. She portrayed Karen, the secretary of a Hollywood executive, in a role originally played by Madonna. Reviews of Lohan's performance were mixed, with the Associated Press describing critical reception overall as \"lukewarm.\" The Stage said she was \"out of her league\" while The Times wrote that she \"can act a bit\" and The Guardian said she \"holds the stage with ease.\"In 2015, English band Duran Duran announced that Lohan was featured on the song \"Danceophobia\" from their fourteenth studio album, Paper Gods. That year, she filmed an independent supernatural thriller, Among the Shadows, in Belgium. The project saw a series of delays with its release and was eventually listed for sale at the European Film Market at the Berlin International Film Festival in February 2018. It was released on March 5, 2019, by Momentum Pictures. In July 2018, the second season of Sick Note —in which Lohan had a recurring role— premiered on Sky One. Lohan  signed on to star in an MTV reality series, Lindsay Lohan's Beach Club (2019) focusing on her business ventures in Greece, which aired on MTV for one season. In July 2019, it was announced that Lohan would be one of the panelists on the Australian edition of Masked Singer. The reality singing competition series premiered in September 2019, and concluded in October that year. On July 7, 2020, it was revealed that Lohan would be unable to return to the judging panel for the second season, as she could not travel from Dubai to Melbourne due to the COVID-19 pandemic and the implementation of travel restrictions.In June 2019, Lohan re-signed with Casablanca Records, a subsidiary of Republic Records, to release new music. On April 1, 2020, Lohan announced she would be releasing \"Back to Me\", her first single in twelve years. The song was released on April 3 and received positive reviews from critics."}, {"text": "=== Return to film and resurgence (2021–present) ===In May 2021, Netflix announced that Lohan would return to acting by starring in a Christmas romantic comedy in which she would play a hotel heiress suffering from amnesia after a skiing accident. Falling for Christmas was released on November 10, 2022, marking her first role in a major production in over a decade. Lohan performed original songs for the film's soundtrack, and a cover of \"Jingle Bell Rock\", which was released as a promotional single. \"Falling for Christmas\" was the most-watched holiday movie released in 2022 in the United States, that year. Lohan's performance in the film received generally positive reviews. In 2022, she also served as the narrator for Amazon Prime Video's reality dating show Lovestruck High.In March 2022, Netflix revealed that Lohan had signed a deal to star in two more films. In September 2022, it was announced Lohan was set to star in the romantic comedy Irish Wish, which was released in March 2024. The second film under the deal, Our Little Secret, began production in January 2024.In May 2023, it was reported that Lohan would reprise her as role as Anna Coleman in a sequel to Freaky Friday, making it her fifth feature-film with Walt Disney Pictures.In March 2024, it was reported that Lohan was in talks to play a \"vixen superhero\" in the Marvel Cinematic Universe. Lohan also expressed interest in portraying actress, singer, and dancer Ann-Margaret in a biographical film about her life and career, while confirming that a script was pending."}, {"text": "=== Fashion ===Lohan has been the face of Jill Stuart, Miu Miu, and the 2008 Visa Swap British fashion campaign. She was also the face of Italian clothing company Fornarina for its Spring–Summer 2009 campaign. Lohan has a fascination with Marilyn Monroe dating to when she saw Niagara during The Parent Trap shoot. In the 2008 Spring Fashion edition of New York magazine, Lohan re-created Monroe's final photo shoot, known as The Last Sitting, including nudity, and called the shoot \"an honor.\"In 2008, Lohan launched a clothing line, 6126, whose name represents Monroe's birthdate (June 1, 1926). The line started with leggings before expanding to a full collection, covering 280 pieces as of April 2010. In January 2009, Lohan appeared as a guest judge on Project Runway. In September 2009, she became an artistic adviser for the French fashion house Emanuel Ungaro. A collection by designer Estrella Archs with Lohan as adviser was presented in October, receiving a \"disastrous\" reception, according to Entertainment Weekly and New York. Lohan left the company in March 2010. She appeared in the January–February 2012 issue of Playboy magazine, in a shoot inspired by a nude pictorial of Marilyn Monroe from the magazine's first issue. Editor Hugh Hefner said Lohan's issue was \"breaking sales records.\"In 2020, Lohan designed and released a jewelry line in collaboration with UK-based boutique brand Lily Baker. In 2022, she launched a limited-edition sneaker collection in collaboration with activewear brand Allbirds. In 2023, Lohan designed a line of ocean-themed nursery accessories in collaboration with Nestig."}, {"text": "=== Hospitality ===In 2016, in collaboration with Dennis Papageorgiou, Lohan opened her first nightclub, Lohan Nightclub, in Athens, Greece. In 2018, she opened a beach resort on the Greek island Mykonos and later her second resort in Ialisos Beach, Rhodes."}, {"text": "=== Digital ===In 2014, the free-to-play video game app Lindsay Lohan's The Price of Fame was released for the iOS and Android operating systems. In 2017, Lohan launched a lifestyle site, Preemium, which subscribers could access for $2.99 a month.In 2021, Red Arrow's Studio71 revealed it had signed Lohan to host and launch a new podcast. It was then announced the podcast would be titled The Lohdown with Lindsay Lohan. It premiered in April 2022."}, {"text": "== Personal life ==Lohan's personal life has received much media attention since her teenage years, particularly after a series of legal problems and arrests, which continued until 2013, the first time she had been probation-free in over eight years. She had a turbulent childhood that she spoke about in 2007, the year her parents finalized their divorce: \"I feel like a second parent in the sense that I helped raise my family ... I was put between my mother and father a lot\". Despite the conflicts, Lohan spoke very fondly of her family. But in the late 2000s, she said she had cut off contact with her father, calling his behavior unpredictable and hard to deal with. In 2023, Lohan said she was on good terms with both her parents as the family gathered in April, which reportedly marked the first time they were all together in at least seven years.Lohan has had many high-profile relationships, most notably with actor Wilmer Valderrama in 2004, Hard Rock Cafe heir Harry Morton in 2006, DJ Samantha Ronson in 2008, and London-based Russian business heir Egor Tarabasov in 2016. On November 28, 2021, Lohan announced her engagement to financier Bader Shammas after three years of dating. On July 2, 2022, a representative confirmed Lohan and Shammas were married after she called him her \"husband\" on her Instagram birthday post. Lohan later revealed they had wed on April 3, 2022. In July 2023, she gave birth to their son in Dubai, where she has resided since 2014."}, {"text": "== Filmography ==After beginning her acting career as a child actor in the early 1990s, Lohan, at age 11, made her film debut in Disney's successful remake of The Parent Trap (1998). Freaky Friday (2003) remains her highest-grossing film, while Mean Girls (2004), both a critical and commercial success, became a cult classic. Though her career was often interrupted by legal and personal troubles during the late 2000s and early 2010s, she has appeared in over 30 films and has multiple other acting credits as of 2024."}, {"text": "== Discography ==Speak (2004)"}, {"text": "== Discography ==A Little More Personal (Raw) (2005)"}, {"text": "== See also ==List of awards and nominations received by Lindsay Lohan"}, {"text": "== See also ==List of artists who reached number one on the U.S. Dance Club Songs chart"}, {"text": "== External links ==Official website "}, {"text": "== External links ==Lindsay Lohan at IMDb"}]