[{"text": "Linda Carroll Hamilton (born September 26, 1956) is an American actress. Known for portraying tough, resilient characters, she made her film debut in 1979 before achieving fame with her starring role as Sarah Connor in The Terminator (1984) and two of its sequels, Terminator 2: Judgment Day (1991) and Terminator: Dark Fate (2019). She is the recipient of various accolades, including two Saturn Awards, two MTV Movie Awards, a Satellite Award and a Romy Award, as well as nominations for three Golden Globes and one Primetime Emmy."}, {"text": "Hamilton's other film credits include Children of the Corn (1984), Black Moon Rising, King Kong Lives (both 1986), Mr. Destiny (1990), Dante's Peak (1997), and The Kid & I (2005). On television, she starred as Catherine Chandler in Beauty and the Beast (1987–1989) and played the recurring role of Mary Elizabeth Bartowski on NBC's Chuck (2010–2012). Her theatre work includes Laura (Tiffany Theater, 2000) and The Night of the Iguana (Berkshire Theatre, 2006). Divorced from actor Bruce Abbott and director James Cameron, Hamilton has a child from each marriage."}, {"text": "== Early life ==Hamilton was born in Salisbury, Maryland, on September 26, 1956. Hamilton's father died when she was five, and her mother later married a police chief. Hamilton had an identical twin sister, Leslie Hamilton Freas (1956–2020), as well as one older sister, a younger brother and a stepbrother. She has said that she was raised in a \"very boring, white Anglo-Saxon\" household, and that she \"voraciously read books\" in her spare time. Hamilton went to Wicomico Junior High and Wicomico High School in Salisbury.She studied for two years at Washington College in Chestertown, Maryland, before moving on to acting studies in New York City. Hamilton has said that her acting professor at Washington College told her she had no hope of earning a living as an actress. In New York, she attended acting workshops given by Lee Strasberg."}, {"text": "=== 1979–1983: Film debut and early roles ===Hamilton made her professional debut at age 23 with a small part in the 1979 drama Night-Flowers. Her first major role came the following year when she appeared as Lisa Rogers on the short-lived CBS soap opera Secrets of Midland Heights (December 1980–January 1981). Next, she appeared in her first starring film role in the low-budget thriller TAG: The Assassination Game (1982), and co-starred that same year in the made-for-television movie Country Gold. She was listed as one of twelve \"Promising New Actors of 1982\" in John A. Willis' Screen World, Vol. 34."}, {"text": "=== 1984–1997: The Terminator franchise and television work ===Hamilton made two prominent film appearances in 1984: firstly, a starring role in Children of the Corn, a horror film based on the short story by Stephen King. Hamilton played Vicky Baxter, a motorist who runs into trouble while travelling with her boyfriend through rural Nebraska. The film was financially profitable, making US$14 million at the domestic box office against a budget of US$3 million, but received generally negative reviews. In a more positive assessment by The New York Times, Hamilton's performance was praised. Next, she co-starred in James Cameron's science fiction action-thriller The Terminator (1984). Hamilton played Sarah Connor, a young waitress—and soon-to-be mother of a valiant resistance leader—who finds herself at the center of a nightmarish ordeal when a soldier travels back in time to help her defeat a cyborg assassin, sent from the future to execute her. The film was a surprise commercial hit, topping the U.S. box office for two weeks. Critics believed it to be a perfect example of its genre, with some attributing its strength to Hamilton's performance; The Hollywood Reporter wrote that she displayed \"tremendous resiliency\" as Connor, while Janet Maslin felt she played the part \"engrossingly\" in her review for The New York Times. That same year, she guest-starred in four episodes of the NBC police drama Hill Street Blues."}, {"text": "=== 1984–1997: The Terminator franchise and television work ===Following the success of The Terminator, Hamilton starred as car thief Nina in the action thriller Black Moon Rising (1986). In an effusive review for the Los Angeles Times, Michael Wilmington praised \"the clean thrust of the plot, the furiously lucid action and the canny, almost stylized, minimalist performances of the actors (Jones, Hamilton, [et al.])\". Also that year, she guest-starred in an episode of Murder, She Wrote and headlined the big-budget adventure film King Kong Lives, a sequel to the 1976 remake of King Kong. The film was a moderate financial success but was universally panned by critics.Hamilton's next major role was that of savvy district attorney Catherine Chandler in the television series Beauty and the Beast. A modern re-telling of the classic fairy tale, the show ran for three seasons on CBS between 1987 and 1990, though Hamilton requested to be written out during its third season when she fell pregnant. For her portrayal of Chandler, she won Austria's Romy Award for Favorite Actress in a Series in 1990, as well as receiving Golden Globe and Emmy Award nominations in 1988 and 1989, respectively."}, {"text": "=== 1984–1997: The Terminator franchise and television work ===Hamilton returned to film with a starring role opposite in the 1990 fantasy-comedy Mr. Destiny. In her review for the Los Angeles Times, Sheila Benson believed that the film only worked because of \"Hamilton's intrinsic warmth\". The following year, she re-teamed with James Cameron to star in Terminator 2: Judgment Day. Reported at the time to be the most expensive motion picture ever made, it went on to gross over US$500 million worldwide; more than any other film that year. Of his decision to present a more troubled version of the Sarah Connor character, Cameron later reflected, \"It was all inspired by Linda really. I called her and said, 'Hey, we're [doing] another Terminator'. And she [replied], 'I want to be crazy'. I said, 'I can do that — I'll put you in a mental hospital'. She said, 'Perfect. That's what I want'\". Hamilton underwent intense physical training to emphasize the character's transformation during the seven years since the first film. \"I hated [my trainer] most of the time\", she later said; \"He would yell at me and throw tennis balls while I was shooting weapons blindfolded. I'd go off to the bathroom to cry for a minute, then I'd wipe away my tears and go back\". Critics were impressed by Hamilton's \"wild-eyed\" performance, with Derek Malcolm of The Guardian singling out her \"formidable sweaty intensity\". She went on to receive two MTV Movie Awards and the 1991 Saturn Award for Best Actress for her portrayal of Connor, which has since been recognised as one of the most iconic female roles in cinematic history. Following the success of T2, she was invited to host an episode of Saturday Night Live on November 16, 1991.Hamilton's subsequent film appearances were in the psychological thrillers Silent Fall (1994) and Separate Lives (1995). For her performance in the television movie A Mother's Prayer (1995), where she played a widow diagnosed with AIDS, Hamilton received a CableACE Award and a Golden Globe nomination for Best Actress. On her decision to take the part, she said, \"So many people think I'm just this incredibly ferocious, fierce woman. Sarah Connor has sort of etched herself into my psyche and will never go away. So I chose [to play] this woman because she was a great balance of strength and frailty\". She put herself on a strict diet in preparation for the role, saying, \"I had to know what it was like … I knew that I had to sort of sink in on myself. So I got very, very thin\".After guest-starring in an episode of Frasier, Hamilton played leading roles in two features that were released one week apart in 1997: political thriller Shadow Conspiracy and the big-budget action-adventure film Dante's Peak. The latter proved to be one of the biggest commercial hits of the year, grossing US$180 million. Critics were mostly unimpressed by the film's derivative narrative, but some praised the effects and performances, with Roger Ebert writing in his review for the Chicago Sun-Times, \"In Brosnan and Hamilton [the filmmakers] have actors who play for realism and don't go over the top\". For her portrayal of small-town mayor Rachel Wando, Hamilton was named Best Actress at the following year's Blockbuster Entertainment Awards. Speaking of her casting, she said, \"Police officers, military officers and lesbians. That was pretty much what I [used to get offered] and nothing else. [When I auditioned for director] Roger Donaldson, he literally said to me: 'You've never played a part like this before' … And [I said], 'What do you mean?' [He replied] 'Normal.' He thought I couldn't play normal! Jesus! It was just the way people thought [about me]\"."}, {"text": "=== 1998–2018: Stage, television, and film roles ===Between 1998 and 1999, Hamilton appeared in a succession of voice roles in episodes of The New Batman Adventures, Hercules, and Batman Beyond. Her next project was the Lifetime movie Sex & Mrs. X (2000), where she played a magazine writer who experiences a sexual reawakening when she is assigned to interview an upper-class Parisian madam. The Los Angeles Times called it an \"[intriguing] character study that passes muster on the strength of good performances by [its leads]\", adding that Hamilton was both \"tough\" and \"tender\" in the part. Later that year, she received a Satellite Award for Best Actress for her performance in the television film The Color of Courage, which Variety called \"excellent\". She also headlined a production of Laura, an adaptation of the 1944 film noir of the same name, at California's Tiffany Theater in December 2000. Hamilton received praise for her portrayal of the title character, with Jay Reiner of The Hollywood Reporter commenting:"}, {"text": "=== 1998–2018: Stage, television, and film roles ===There's an inherent risk in reviving a film classic like Laura … [original star] Gene Tierney … left such an indelible impression that any [actress] trying to fill [her] shoes [is] probably going to suffer by comparison. Linda Hamilton accepts this risk, and even turns it to her advantage, in [this] sparkling production … Where [Tierney] gave us Laura Hunt as a ravishing femme fatale shrouded in mystery, Hamilton gives us a genuine charmer — a woman intriguing enough to invite attention, elusive enough to ensure pursuit and smart enough to make it all seem worthwhile … after a few minutes in her company, you don't want to be anywhere else."}, {"text": "=== 1998–2018: Stage, television, and film roles ===The following year, Hamilton starred in the small-scale mystery thriller Skeletons in the Closet (2001), subsequently winning a DVD Exclusive Award for Best Supporting Actress. She then portrayed the real-life Ethel Rosenberg in Worse Than Murder: Ethel and Julius Rosenberg, admitting that her decision to \"transform myself into a tenement Jew from the Lower East Side\" had been a daunting one: \"I'm already prepared for the critics to be unkind to me, like, 'Why is she playing a Jewish character' or 'What's she trying to do, prove she's an actress?' But the fear is just part of the process\". The play opened in May 2002—at the Ventura Theatre in California—to a rave review from Variety, who felt that Hamilton played her part with \"sumptuous veracity\". Next, she had supporting roles in two films: the post-Vietnam war drama Missing in America (2005) and the Penelope Spheeris-directed comedy The Kid & I (2005)."}, {"text": "=== 1998–2018: Stage, television, and film roles ===Hamilton's portrayal of Maxine Faulk in the 2006 stage adaptation of The Night of the Iguana by Tennessee Williams was met with acclaim. Writing for Variety, Frank Rizzo said, \"[She is] well cast as the recently widowed but hardly mourning proprietress … She takes over the stage with natural assurance and plays this overripe survivor with lusty humor and cunning\". The production ran between August 1–12 at the Berkshire Theatre in Stockbridge, Massachusetts.Hamilton reprised the role of Sarah Connor for a second time with a voice cameo in 2009's Terminator Salvation, which grossed US$371 million at the worldwide box office. In 2010, she joined the cast of NBC's espionage-style comedy series Chuck, playing the recurring role of CIA agent Mary Elizabeth Bartowski. That same year, she guest-starred in three episodes of the Showtime dark comedy Weeds—as the marijuana supplier for the series' protagonist—and appeared as a \"cartoon American cop\" in the poorly received Irish film Holy Water.In 2011, Hamilton narrated the Chiller network's The Future of Fear, a documentary on the history of horror films. She then played a fictional U.S. president in the television miniseries Air Force One Is Down (2013), and had recurring roles as a bounty hunter on the Showcase series Lost Girl (2013) and a mentally ill mother on Syfy's Defiance (2014–2015). Her next projects were the television pilot Shoot Me Nicely (2016), which was later released as a short film, and the small-scale science fiction film Curvature (2017). In his evaluation of the latter for The Hollywood Reporter, Frank Scheck described it as \"awfully loopy\", adding, \"it's always a pleasure to see Hamilton, even if it's painfully obvious that she's been cast [here] because of the genre resonance she brings to the table\"."}, {"text": "=== 2019–present: Return to mainstream projects ===Hamilton returned once more to the Terminator franchise and the character of Sarah Connor when she headlined the Tim Miller-directed Terminator: Dark Fate, set 25 years after the events of T2. She admitted to being reluctant to sign on to the project, having spent the previous few years away from the spotlight: \"I love my alone time like no one you've ever met … That was my hesitation: Do I want to trade this lovely, authentic life [that I've built] for that? I didn't want my neighbours looking at me differently. We're neighbors because of who we are, not what we do, and I don't want that to creep into my life again\"."}, {"text": "=== 2019–present: Return to mainstream projects ===Filming on Dark Fate took place in Hungary, Spain and the U.S. between May and November 2018. Though a financial disappointment,  it received generally positive reviews upon its 2019 release, particularly for Hamilton's performance. Writing for Rolling Stone, David Fear felt that she provided the film's \"sinew, heart, and soul\", and said of her introduction:"}, {"text": "=== 2019–present: Return to mainstream projects ===A truck pulls up, we see boots hit the ground, and there she is: Sarah Connor 1.0, sunglasses on, stoic and iconic as fuck, gunning down a sprinting shape-shifter and employing a rocket launcher for a finishing move. It's the sort of movie entrance that the character (and the actor) deserves, the kind that prompts spontaneous, uncontrollable cheering in theaters … Her weathered survivor will charitably share the screen with newcomers and old co-stars alike, but from this moment on, Dark Fate is Hamilton's property. She calmly slips the superior sequel into the back pocket of her faded work pants and walks away with it. Everyone else is acting in her movie."}, {"text": "=== 2019–present: Return to mainstream projects ===Later that year, Hamilton was named Best Actress at the Los Angeles Crime and Horror Film Festival for her portrayal of \"King George\"—a ruthless crime boss—in Easy Does It, which Film Threat described as \"excellent … a throwback to grindhouse adventure films [and westerns]\". She began appearing as General McCallister on Syfy's Resident Alien in 2021, which IndieWire called a  \"genre-bending … spry half-hour comedy [series]\". Also that year, she guest-starred as a hippie life coach in six episodes of the TNT dark comedy Claws during its final season.It was announced in June 2023 that Hamilton would join the ensemble of the Netflix mystery-horror series Stranger Things for its fifth and final season—due to air in 2025—as an unspecified character. A self-proclaimed fan of the show, she said of her casting, \"I don't know how to be a fangirl and an actress at the same time. I'm going to work on that\"."}, {"text": "== Personal life ==Hamilton has been married and divorced twice. Her first marriage, from 1982 to 1989, was to actor Bruce Abbott, who left her when she was pregnant with their son, Dalton, born in 1989. She stated it was because of the way she treated him during their marriage and made a public apology to him in 2004. In 1991, Hamilton began a relationship and moved in with film director James Cameron after filming Terminator 2: Judgment Day. They had a daughter, born in 1993. Hamilton said she experienced postpartum depression after the birth of her second child. Hamilton and Cameron briefly separated when Cameron was filming Titanic (1997) and he began a relationship with actress Suzy Amis, who played a small role in the film. Hamilton and Cameron later got back together and married in 1997; this ended in a $50 million divorce settlement in 1999. In a 2019 interview for The New York Times, Hamilton said she had been celibate for \"at least 15 years\". \"One loses track, because it just doesn't matter — or at least it doesn't matter to me. I have a very romantic relationship with my world every day and the people who are in it\", she said.Hamilton started to binge eat when she entered high school. After seeing a psychologist for the first time at the age of 22, she thought acting would help her feel better, but she ended up having a breakdown in the beginning of her acting career and turned to drugs and alcohol use and self-medicated with cocaine in order to get her confidence up. In an October 2005 appearance on Larry King Live, Hamilton discussed her depression and bipolar disorder, which led to violent mood swings and suicidal thoughts during her marriage to Abbott and, in her view, caused the failure of both her marriages. She also discussed how she eventually received therapy and medication to manage the condition.Hamilton's twin sister, Leslie, died on August 22, 2020, at the age of 63. Hamilton has described herself politically as a Democrat, but she voted for Republican candidate Arnold Schwarzenegger—her Terminator co-star—in the 2003 California election after his campaign convinced her he was suitable for the job. While filming Terminator 2: Judgment Day, Hamilton suffered permanent hearing damage in one ear when Schwarzenegger fired a shotgun inside an elevator after she had removed her ear plugs."}, {"text": "== External links ==Linda Hamilton at IMDb "}, {"text": "== External links ==Linda Hamilton at the TCM Movie Database"}, {"text": "== External links ==Linda Hamilton at AllMovie"}]