[{"text": "Lisa Marie Presley (February 1, 1968 – January 12, 2023) was an American singer-songwriter. She was the only child of singer and actor Elvis Presley and actress Priscilla Presley, as well as the sole heir to her father's estate after her grandfather and her great-grandmother died. Her musical career consisted of three studio albums: To Whom It May Concern (2003), Now What (2005) and Storm & Grace (2012), with To Whom It May Concern being certified gold by the Recording Industry Association of America. Presley also released non-album singles, including duets with her father using archival recordings."}, {"text": "== Early life ==Presley was born on February 1, 1968, the only daughter of Elvis and Priscilla Presley at Baptist Memorial Hospital-Memphis in Memphis, Tennessee, nine months to the day after her parents' wedding. After her parents divorced, she lived with her mother in Los Angeles, and frequently stayed with her father at Graceland in Memphis."}, {"text": "== Early life ==Presley's parents separated when she was four years old. When her father died in August 1977, nine-year-old Presley became joint heiress to his estate with her 61-year-old grandfather, Vernon Presley, and Vernon's 87-year-old mother Minnie Mae Presley (née Hood). Through Vernon, Lisa Marie was a descendant of the Harrison family of Virginia. Upon the deaths of her grandfather in 1979 and her great-grandmother in 1980, she became Elvis' sole heir; on her 25th birthday in 1993, she inherited the estate, which had grown to an estimated $100 million. Presley sold 85 percent of her father's estate in 2004."}, {"text": "== Early life ==In the late 1970s, a year or two after her father's death, she attended her first rock concert when she saw Queen at The Forum in Inglewood, California. She gave Freddie Mercury a scarf of her father's after the show, and expressed her love of theatrics."}, {"text": "== Early life ==Shortly after her father's death, her mother began dating the actor Michael Edwards. In an interview with Playboy in 2003, Presley said Edwards would enter her room intoxicated and was sexually inappropriate with her. She has a half-brother, Navarone Garibaldi, from her mother's 22-year relationship with Marco Garibaldi."}, {"text": "== Early life ==Presley made a video of \"Don't Cry Daddy\" as a posthumous duet with her father in 1997. This video was presented on August 16, 1997, at the tribute concert that marked the 20th anniversary of Elvis' death. The video contains Elvis' original vocal to which new instrumentation and Lisa Marie's vocals were added."}, {"text": "=== 2003–2005: To Whom It May Concern ===Presley released her debut album, To Whom It May Concern, on April 8, 2003. It reached No. 5 on the Billboard 200 albums chart and was certified gold in June 2003. Presley wrote all the lyrics (except \"The Road Between\", which was co-written with Gus Black) and co-wrote every melody. To promote it, she presented a concert in the UK. The album's first single, \"Lights Out\", reached No. 18 on the Billboard Hot Adult Top 40 chart and No. 16 on the UK charts. Presley collaborated with Billy Corgan for a co-written track called \"Savior\", which was included as the B-side. In his review of the album, the Los Angeles Times critic Robert Hilburn wrote that it had a \"a stark, uncompromising tone\" and that \"Presley's gutsy blues-edged voice has a distinctive flair\"."}, {"text": "=== 2003–2005: To Whom It May Concern ===Pat Benatar and Presley performed at VH1 Divas Duets, a concert to benefit the VH1 Save the Music Foundation held at the MGM Grand Garden Arena on May 22, 2003, in Las Vegas. Together they sang Benatar's hit \"Heartbreaker\", which Presley frequently performed at her own concerts on tours afterward. Also in 2003, Presley contributed a recording of \"Silent Night\" for the NBC Holiday Collection, Sounds of the Season."}, {"text": "=== 2005–2012: Now What and further singles ===Presley's second album, Now What, was released on April 5, 2005, and reached No. 9 on the Billboard 200 albums chart. Presley co-wrote 10 songs and recorded covers of Don Henley's \"Dirty Laundry\" (the album's first single, which hit No. 36 on the Billboard 100 AC singles chart), and the Ramones' \"Here Today and Gone Tomorrow\". The song \"Idiot\" is a jab towards different men in her life. Unlike her first album, Now What included a Parental Advisory sticker. Presley covered Blue Öyster Cult's \"Burnin' for You\" as a B-side. Pink made a guest appearance on the track \"Shine\". The video for \"Dirty Laundry\" was directed by Patrick Hoelck and singer George Michael made a cameo appearance in it."}, {"text": "=== 2005–2012: Now What and further singles ===Too Tough to Die: A Tribute to Johnny Ramone, a documentary about Johnny Ramone of the rock group the Ramones, was released in 2006. Directed by Mandy Stein, the film shows Deborah Harry, the Dickies, X, Eddie Vedder, Presley, and Red Hot Chili Peppers as they stage a benefit concert to celebrate the Ramones' 30th anniversary and raise money for cancer research."}, {"text": "=== 2005–2012: Now What and further singles ===Presley appeared in the music video for Johnny Cash's \"God's Gonna Cut You Down\" in 2006. Rick Rubin produced the record and Tony Kaye directed the video which featured multiple celebrities and won a 2008 Grammy Award for Best Short Form Music Video."}, {"text": "=== 2005–2012: Now What and further singles ===The single \"In the Ghetto\" was released in August 2007. Elvis Presley had originally released the single in 1969. In the new version, Lisa \"duets\" with her father. The video, simultaneously released with the single, reached No. 1 on the iTunes sales and No. 16 on Billboard's Bubbling Under Hot 100 singles chart. The song was recorded to commemorate the 30th anniversary of her father's death. Presley said she decided not only to sing, but to sing with him. \"I wanted to use this for something good\", she told Spinner; proceeds from the single benefited a new Presley Place Transitional Housing Campus in New Orleans. Presley appeared on The Oprah Winfrey Show to perform the song with the Harlem Gospel Choir, using vintage footage of her father."}, {"text": "=== 2005–2012: Now What and further singles ===Presley joined singer Richard Hawley on stage in London in October 2009. She sang vocals on a song the pair had been working on called \"Weary\". Hawley wanted to help Presley relaunch her music career, and the two embarked on a songwriting partnership in which she wrote the lyrics and Hawley the music. In an interview with Oprah Winfrey, Presley said that she was currently recording a new album in London, which was due to be released in 2011."}, {"text": "=== 2012–2018: Storm & Grace and final releases ===Her third album, Storm & Grace, was released on May 15, 2012. She said: \"It's much more of a rootsy record, organic record, than my previous work.\" It is produced by Oscar and Grammy winner T Bone Burnett. AllMusic described the album as \"a stronger, more mature, and more effective work than one might have expected\" and noted \"Presley is finally developing a musical personality that truly suits her\". Spinner.com described it as \"the strongest album of her career\" and Entertainment Weekly praised the \"smoky, spooky\" single \"You Ain't Seen Nothing Yet\". T-Bone Burnett said of collaborating with Presley on Storm & Grace (2012): \"When songs from Lisa Marie Presley showed up at my door, I was curious. I wondered what the daughter of an American revolutionary music artist had to say. What I heard was honest, raw, unaffected and soulful. I thought her father would be proud of her. The more I listened to the songs, the deeper an artist I found her to be. Listening beyond the media static, Lisa Marie Presley is a Southern American folk music artist of great value.\""}, {"text": "=== 2012–2018: Storm & Grace and final releases ===In 2018, Presley was featured on the title track of the compilation \"Where No One Stands Alone\", a collection of her father's gospel songs. The song was reworked into a duet between Presley and her father. A music video for the song was released in which Presley is incorporated into scenes of her and her father."}, {"text": "=== Memoir ===In January 2024, Presley's daughter Riley Keough revealed that prior to her death, Presley recorded audio tapes for a memoir. Keough also revealed that she completed writing the details on the tapes in book form following her mother's death. President of Random House Group Sanyu Dillon also confirmed that Random House plans to publish Presley's memoir. The memoir, which is presently untitled, is scheduled to be released on October 15, 2024. In addition to preparing the memoir, Riley narrated its audiobook version, which will also include “never-before-heard recollections” through Presley's voice."}, {"text": "== Charity work and humanitarian efforts ==Presley Charitable Foundation (PCF) was formed by Presley in 2007. It was reincorporated from Presley Charitable Foundation to The Presley Foundation Inc. on November 10, 2022, and registered as a public benefit and grantmaking foundation on February 13, 2023. In 2001, Presley Place opened to its first residents. Presley Place provides homeless families with up to one year of rent-free housing, child day care, career and financial counseling, family management guidance, and other tools to help them break the cycle of poverty and regain self-esteem and independence. It is also funded by the PCF the Elvis Presley Music Room, where the children of Presley Place and others enjoy access to musical instruments and instruction and participate in special related programs. Her father's foundation The EPCF created the Elvis Presley Endowed Scholarship Fund at the College of Communication & Fine Arts at the University of Memphis to assist students majoring in areas of the arts."}, {"text": "== Charity work and humanitarian efforts ==Presley joined Oprah Winfrey and her Angel Network and was active in the relief efforts after Hurricane Katrina devastated New Orleans and surrounding areas. Presley gave a helping hand in Memphis, Tennessee. \"I'm here\", she said, \"because I definitely needed to do something, and it just so happens this is where I'm from. I'm going to do everything I can. People need help—this is a huge catastrophe and everyone needs to stand up.\" Her first stop was a food bank, where, with the help of FedEx and Kroger, Presley loaded a truck with groceries. Then it was time for a pit stop at Target for toiletries and clothes. \"I thought I was going to grab a couple things at the store\", Presley said, \"and I ended up filling up a truck. I went a little crazy.\""}, {"text": "== Charity work and humanitarian efforts ==Presley's final destination was the Grand Casino Convention Center in Mississippi to distribute the supplies to people who had lost everything. One evacuee said, \"I really appreciate everything Ms. Presley is doing for us. We have nothing, so we're very grateful for everything she's doing.\""}, {"text": "== Charity work and humanitarian efforts ==In 2011, Presley became a patron of the Dream Factory, a charity based in Hainault, London. Presley was one of the celebrity guests at the Snowball held at the Prince Regent in Chigwell in aid of the Dream Factory. Actors Ray Winstone and Sid Owen, who are both patrons of the charity, and Amanda Redman were also among guests at the star-studded event, which raised $59,000 towards granting the wishes of terminally ill children and those with life-threatening illnesses or disabilities. Organizer Avril Mills said: \"We have granted 83 dreams in under three years, so the money is going to go towards a lot more dreams. It costs between $500 and $5,000 for a dream. Lisa Marie Presley was very nice and she now wants to become a patron of the charity. We talked about the charity and she brought a big framed picture of Elvis, which she got flown over for the Dream Factory from Graceland, and that raised $5,000.\""}, {"text": "=== Grammy Foundation ===Presley was involved with the Grammy Foundation's Gold Grammy Signature Schools program, which recognizes top US public high schools that are making an outstanding commitment to music education during an academic school year. On October 22, 2005, Presley presented a special award to Isaac Hayes at the Memphis Recording Academy Honors. A host of hometown stars gathered to see Presley, Justin Timberlake, Isaac Hayes, and David Porter honored by the Memphis chapter of the Recording Academy. Presley and music producer Jimmy Jam presented the award to Hayes."}, {"text": "=== Grammy Foundation ===On November 11, 2005, Presley participated in a Grammy SoundCheck at LA's House of Blues, during which she and other industry professionals met with a group of music students to discuss career opportunities available to them within the music industry."}, {"text": "== Awards and honors ==On June 24, 2011, Presley was officially honored by the governor of Tennessee, Bill Haslam, who proclaimed a day of recognition for her charitable efforts. Two days later, she was issued a Certificate of Proclamation by the mayor of New Orleans, Mitchell J. Landrieu, in recognition of her dedication and contributions to the city. She also received a proclamation from the city of Memphis on June 28, 2011, for her philanthropy there."}, {"text": "== Personal life ==In 2005, Presley allowed the public a brief look into her personal life, appearing in the TV movie Elvis by the Presleys."}, {"text": "== Personal life ==Between 2010 and 2016, Presley lived in a 15th-century manor house in Rotherfield, East Sussex, England, 15 miles east of Saint Hill Manor, the British headquarters of the Church of Scientology."}, {"text": "== Personal life ==Presley publicly acknowledged her struggle with opioid addiction. She penned a foreword for a book entitled United States of Opioids: A Prescription for Liberating a Nation in Pain (2019); in the foreword, she stated that she was prescribed opioids following the birth of her twin daughters in 2008 and became dependent upon them. She had been using opioids again in the weeks prior to her death on January 12, 2023."}, {"text": "=== Relationships and children ===On October 3, 1988, Presley married Chicago-born musician Danny Keough at the Scientology Celebrity Centre in Los Angeles. "}, {"text": "=== Relationships and children ===They had two children: a daughter, Riley Keough (born May 29, 1989, at Saint John's Health Center in Santa Monica, California), an actress and model, and a son, Benjamin Storm Keough (born October 21, 1992, at Humana Women's Hospital in Tampa, Florida). Presley obtained a quickie divorce in the Dominican Republic on May 6, 1994. Benjamin Keough died on July 12, 2020, at the age of 27 in Calabasas, California, from a self-inflicted gunshot wound. The Los Angeles County Medical Examiner's Office listed his death as a suicide."}, {"text": "=== Relationships and children ===On May 26, 1994, 20 days after her divorce from Keough, Presley married singer Michael Jackson. Keough's younger brother Thomas Keough was an official witness at Presley's wedding to Michael Jackson. They had first met in 1974 when a six-year-old Presley attended his concert at the Sahara Tahoe. According to a friend of Presley's, \"their adult friendship began in November 1992 in L.A.\". As child molestation accusations against him became public, Jackson became dependent on Presley for emotional support. She was concerned about his faltering health and his drug addiction. Presley explained, \"I believed he didn't do anything wrong, and that he was wrongly accused and, yes, I started falling for him. I wanted to save him. I felt that I could do it.\" Shortly afterwards, she successfully persuaded Jackson to settle the allegations out of court and go into rehabilitation to recover. Presley appeared in Jackson's \"You Are Not Alone\" video in June 1995, directed by Wayne Isham. In January 1996, citing irreconcilable differences, Presley filed for divorce, according to legal papers. Jackson's make-up artist, Karen Faye, later claimed that Jackson had originally planned to file for divorce first and had relented after Presley begged him not to. The following day, Jackson discovered that Presley had filed for divorce herself. In an October 2010 interview with Oprah Winfrey, Presley revealed that she and Jackson had attempted to reconcile intermittently for four years following their divorce and that she had traveled to different parts of the world to be with him. After Jackson's death in 2009, Presley was reported to have \"felt shattered\"."}, {"text": "=== Relationships and children ===In May 1999, Presley met musician John Oszajca and got engaged to him two days before Christmas. She broke off the engagement in March 2001, some five months after meeting Nicolas Cage at a party. Presley's third marriage was to Cage. They were married in Kamuela, Hawaii, on August 10, 2002. Cage filed for divorce on November 25, 2002, and the divorce was finalized on May 24, 2004."}, {"text": "=== Relationships and children ===In a 2003 interview with The Commercial Appeal, Presley commented on reports that she and Keough were planning to remarry: \"Danny is my best friend, always has been, always will be. I love him unconditionally, but we are not together. It's not like that.\" Keough and Presley became closer again after Presley divorced Michael Jackson. "}, {"text": "=== Relationships and children ===In 2005, Danny Keough was a bass guitar player in Presley's band, and also served as her musical mentor. Presley still regarded him as a close friend, and he lived in the guest house on Presley's property. Presley described her relationship with Keough after they separated: \"I don't know how, but we've managed to stay close. There's others that I have pain or betrayal associated with that I won't have anything to do with. But he and I had a special thing. Unconditional.\""}, {"text": "=== Relationships and children ===On January 22, 2006, in Kyoto, Japan, Presley married for a fourth time, to Michael Lockwood, her guitarist, music producer, and director. Danny Keough served as best man at the wedding. In March 2008, Presley announced that she was pregnant. Her husband was a first-time father. On October 7, 2008, Presley gave birth to fraternal twin girls, via Caesarean section, at Los Robles Hospital & Medical Center in Thousand Oaks, California. The couple had a home in England at Coes Manor, Rotherfield, East Sussex, where Presley enjoyed life out of the limelight."}, {"text": "=== Relationships and children ===In 2016, Presley filed for divorce from Lockwood after ten years of marriage. In February 2017, the couple's children were placed in the temporary care of Priscilla Presley after Lisa alleged she found inappropriate images of children on Lockwood's personal computer in a divorce court filing challenging Lockwood's request for spousal support. The Beverly Hills Police Department investigated the allegations, examining over 80 electronic devices, and found no criminal activity and referred the matter to investigators in Tennessee. Later in 2017, the Tennessee Bureau of Investigations closed its investigation of the allegations made by Presley, citing no evidence of a crime. The divorce was finalized on May 26, 2021."}, {"text": "=== Scientology ===Presley, along with friend and fellow Memphian and Scientologist Isaac Hayes, opened the Literacy, Education and Ability Program (LEAP) in October 1997. LEAP is run by Applied Scholastics, a group run by Scientologists."}, {"text": "=== Scientology ===For her efforts to help US children learn study skills, Presley received the Humanitarian Award from the Church of Scientology-supported World Literacy Crusade on January 5, 2002. Presley received her award from Isaac Hayes, Chaka Khan, and Yolanda King, daughter of Martin Luther King Jr. World Literacy Crusade is regarded by critics as a front group for the Church of Scientology. On September 26 of that same year, Presley addressed a US congressional hearing in opposition to the use of medication in treating ADHD, stating: \"I have spoken to children who have been forced to take a cocaine-like stimulant to control their behavior. I have shared their sense of sheer desperation. Children have been wrenched from their family's care simply because their parents favored an alternative, drug-free approach to addressing educational and behavioral problems. The psychotropic drugging of millions of children has to stop.\" Addressing the committee as the International Spokesperson for Children's Rights, for the Citizens Commission on Human Rights (CCHR), a group run by Scientologists, Presley expressed her view that parents should be informed about alternatives to drugs so they may \"make an informed choice about their child's educational and medical needs\"."}, {"text": "=== Scientology ===Presley left Scientology in 2014, though she had been experiencing growing discontent with the organization as early as 2008."}, {"text": "== Elvis Presley estate ==After Elvis Presley's death at Graceland on August 16, 1977, his will appointed his father, Vernon Presley, executor and trustee. The beneficiaries of the trust were Vernon, Elvis' grandmother Minnie Mae Presley, and Lisa Marie, whose inheritance was to be held in trust until her 25th birthday. After Vernon Presley's death in 1979, Elvis' former wife Priscilla Presley was named as one of three trustees in his will; the others were the National Bank of Commerce in Memphis and Joseph Hanks, who had been the Presleys' accountant. With Minnie Mae Presley's death in 1980, Lisa Marie became the only surviving beneficiary."}, {"text": "== Elvis Presley estate ==In 1993, Presley inherited her father's estate on her 25th birthday, which, thanks largely to the stewardship of her mother, had grown to an estimated $100 million."}, {"text": "== Elvis Presley estate ==In 1998, Presley became more closely involved in the management of the Elvis Presley Trust and its business entity, Elvis Presley Enterprises, Inc.  and until February 2005 she was owner and chairman of the board, when she sold 85 percent of the estate's business holdings to CKX, Inc., excluding Graceland itself and the property within it."}, {"text": "== Elvis Presley estate ==Following Presley's death, her three daughters were expected to inherit Graceland. However, her mother Priscilla challenged a 2016 amendment that Presley had made to her estate, removing Priscilla as trustee and naming her two oldest children. One of these two, Presley's son Benjamin, died by suicide in 2020, leaving Riley as sole trustee."}, {"text": "=== \"Elvis Through His Daughter's Eyes\" exhibit ===In February 2012, Presley opened a new exhibit, \"Elvis ... Through His Daughter's Eyes\". It is included in the Graceland VIP Tour and features 200 items assembled by Presley and the Graceland Archives staff."}, {"text": "=== \"Elvis Through His Daughter's Eyes\" exhibit ===The personal exhibit looks at Presley's experience of growing up with a famous father. Home movies, toys, and rarely seen family mementos are among the items on display."}, {"text": "=== Aircraft Lisa Marie ===In November 1975, her father named one of his private aircraft, a converted Convair 880 jet, after her. He spent more than $1 million refurbishing it to use as his main transport while on tour. The Lisa Marie and one of his other planes, Hound Dog II, are on exhibit at Graceland."}, {"text": "== Death ==On January 12, 2023, at around 10:30 a.m., Presley suffered a cardiac arrest at her home in Calabasas, California. Her heart was restarted after CPR was administered en route to West Hills Hospital in Los Angeles, but she died later that day at the age of 54. According to her autopsy report, Presley died of \"small bowel obstruction\" caused by a bariatric surgery she had undergone. The autopsy stated that the opioids in her system did not contribute to her death."}, {"text": "== Death ==Her last public appearance had been two days earlier at the 80th Golden Globe Awards, which she had attended with her mother. Hundreds attended Presley's public memorial service that was held at Graceland on January 22, and more than 1.5 million people watched the service via live stream. Presley was interred in the Graceland Meditation Garden, next to her son Benjamin and adjacent to her father Elvis."}, {"text": "== Death ==Among those in attendance (some of whom paid spoken and/or musical tribute) included her mother; surviving children; family friend Jerry Schilling; former Memphis mayor A. C. Wharton; Guns N' Roses lead singer Axl Rose; The Smashing Pumpkins lead singer Billy Corgan; Sarah, Duchess of York; gospel quartet The Blackwood Brothers; singer Alanis Morissette; and both the director and star of Elvis, respectively, Baz Luhrmann and Austin Butler."}, {"text": "== Tours ==S.O.B. Tour (2003–2004)"}, {"text": "== Tours ==Now What Tour (2005–2006)"}, {"text": "== Tours ==Storm & Grace Tour (2012–2014)"}, {"text": "== Further reading ==Taraborrelli, J. Randy (2004). The Magic and the Madness. Terra Alta, WV: Headline. ISBN 0-330-42005-4."}, {"text": "== Further reading ==Finstad, Suzanne (2006). Child Bride: The Untold Story of Priscilla Beaulieu Presley. Terra Alta, WV: Headline. ISBN 978-0-307-33695-8."}, {"text": "== External links ==Official website  (last archive)"}, {"text": "== External links ==Lisa Marie Presley at AllMusic "}, {"text": "== External links ==Lisa Marie Presley discography at Discogs "}, {"text": "== External links ==Lisa Marie Presley at IMDb"}]