[{"text": "Olive Marie Osmond (born October 13, 1959) is an American singer, actress, television personality, author and businesswoman. She is known for her girl next door image and her decades-long career in many different areas. As a singer, she has had several chart-topping country music songs such as \"Paper Roses\" and \"Meet Me in Montana\". As a television personality, she has been a host of Donny & Marie (alongside brother Donny Osmond) and more recently on The Talk. As an actress, she had appeared in television films and Broadway musicals. As a businesswoman and author, she has written several books and helped found the Children's Miracle Network."}, {"text": "The eighth of nine children in the Osmond entertainment family, she made her television debut on The Andy Williams Show. At age 13, she established a career as a country recording artist and with her debut single \"Paper Roses\" (1973). She began recording alongside Donny Osmond, which ultimately turned into the siblings having their own syndicated variety show through 1979. In the early 1980s, the Osmond family lost a majority of their fortune and Marie performed alongside her siblings. She also attempted an acting career, experimenting with the variety show Marie. She then refocused her attention towards the country genre and signed a contract with Capitol Records in 1985. Between 1985 and 1990, she had three number one singles and released several albums including There's No Stopping Your Heart (1985)."}, {"text": "In the 1990s, Osmond established her own collection of dolls which were sold on the QVC network. In 1994 she made her Broadway debut in The King and I and then in 1997 in The Sound of Music. Between 1998 and 2000, she reunited with Donny Osmond for the network talk show Donny & Marie. During this period, she publicly spoke about her struggles with postpartum depression, which were later recorded in her book Behind the Smile: My Journey Out of Postpartum Depression. In 2004, she hosted her own radio series titled Marie & Friends and in 2008 appeared in a season of Dancing with the Stars."}, {"text": "Between 2008 and 2019, she reunited again with Donny Osmond for a residency at the Flamingo hotel in Las Vegas. The show was given critical acclaim and later spawned an album of duets between the pair in 2009. In 2010, she returned to recording as a solo artist with the studio album I Can Do This.  It was followed in 2016 by the country album Music Is Medicine and then in 2021 by the classical album Unexpected. Osmond also co-hosted The Talk between 2019 and 2020. She also appeared in several Lifetime television films such as The Christmas Edition in 2020."}, {"text": "== Childhood ==Osmond was born in Ogden, Utah. She was the eighth of nine children (and only daughter) born to Olive May and George Virl Osmond. Her brothers are Virl, Tom, Alan, Wayne, Merrill, Jay, Donny, and Jimmy Osmond. She was raised as a member of the Church of Jesus Christ of Latter-day Saints. Virl and Tom were both born deaf. Her remaining brothers began performing from an early age as a barbershop quartet and eventually found success on The Andy Williams Show in the 1960s. Her brothers' success prompted the family to move to Los Angeles. In 1964, Marie made her first televised appearance on The Andy Williams Show at four years old.A majority of Marie's childhood was spent at home with her mother Olive, her two eldest brothers (Virl and Tom) and her two youngest brothers (Donny and Jimmy). In her childhood, Marie was closest to Donny and the pair often played together. \"Donny and I were rambunctious playmates who never gave our mother a moment to rest,\" Osmond recounted in her book Behind the Smile: My Journey Out of Postpartum Depression. She also accompanied her brothers to concerts in her early childhood, often helping organize stage equipment and wardrobes. When the family was home, they spent a lot of their free time singing and harmonizing with each other. \"I never knew a day of my childhood life where music wasn't being played, practiced, written or sung,\" she recalled in 2009."}, {"text": "=== 1973–1979: Teenage country music success and collaborations with Donny ===In 1970, The Osmonds rose to commercial stardom with a series of successful pop singles. It was then suggested that Marie would embark on her own music career. Marie chose to be marketed as a country music artist, later citing that it was the only musical genre that allowed women to have a family and career. She recorded a demonstration tape singing Dolly Parton's \"Coat of Many Colors\" that was heard by Don Ovens of MGM Records. Despite being a preteen, Ovens was impressed by her singing and signed her to a solo recording contract with MGM's Nashville division."}, {"text": "=== 1973–1979: Teenage country music success and collaborations with Donny ===Ovens convinced country artist Sonny James to produce Osmond's first recording session. In June 1973, Osmond and her mother flew to Nashville, Tennessee where Osmond recorded nine songs which she had memorized prior to the session. Among the songs was \"Paper Roses\", which was chosen by James himself. It was decided that \"Paper Roses\" would be released as Osmond's debut single in August 1973. The song later reached the number one spot on both the US country songs chart and the Canadian country tracks chart. The song also crossed over to the US Hot 100, peaking at number five and went to number two in the United Kingdom. Osmond's debut studio album was released in September 1973 and topped the US country albums chart. Despite only being 13 years old Osmond became the youngest female country artist to have a debut single reach the number one spot in the US.In 1974, Osmond's solo single \"In My Little Corner of the World\" became a top 40 US country single. It was followed in 1975 by \"Who's Sorry Now\", which reached the top 40 on the US and Canadian country charts. It was a top 40 pop single in the US and Canada. Two corresponding studio albums named after Osmond's follow-up singles charted on the US country chart in 1974 and 1975 respectively.By the early 1970s, Donny Osmond had established his own recording career apart from The Osmonds. During this period, Donny was in the studio recording a song called \"I'm Leaving It All Up to You\". Because he was having difficulty hitting the song's high notes, Marie was brought in to sing harmony. Released as \"Donny and Marie Osmond\", the song reached number four on the US Hot 100, while also reaching the top five in Canada, The Netherlands, Ireland and the UK. An album of the same name sold over 500,000 copies in the US and spawned another international top ten single: \"Morning Side of the Mountain\". As a duo, Donny and Marie had five more US top 40 singles through 1978: \"Deep Purple\", \"Ain't Nothing Like the Real Thing\", \"(You're My) Soul and Inspiration\" and \"On the Shelf\".From 1976 to 1979, the siblings hosted their own network variety show called Donny & Marie. During the show's production, the duo released three more studio albums on the MGM label: Featuring Songs from Their Television Show (1976), New Season (1976) and Winning Combination. All three reached top 100 album positions in the US. Both their 1976 studio albums certified gold in the US after selling 500,000 copies. In 1977, Rick Hall produced Marie's next solo album titled This Is the Way That I Feel. Released on Polydor Records, This Is the Way That I Feel peaked at number 152 in the US. The title track was issued as its lead single and reached number 39 in the US."}, {"text": "=== 1985–1995: Country music comeback in adulthood ===As an adult, Osmond returned to country music in the 1980s. She was signed to Capitol Records by Nashville label-head Jim Foglesong. Foglesong brought Osmond together with Dan Seals to record the duet \"Meet Me in Montana\". Released as a single in 1985, the duet became Osmond's second number one single on the US country chart and reached number 19 on Canada's country chart. The song later won the Vocal Duo of the Year accolade at the Country Music Association Awards. \"Meet Me in Montana\" was included on Osmond's first Capitol album There's No Stopping Your Heart (1985). The album was praised by critics who found Osmond was well-suited to singing country pop material. The disc's title track became Osmond's first chart-topping solo single since \"Paper Roses\" on both the US and Canadian country chart. It was followed by the 1986 top five country single \"Read My Lips\"."}, {"text": "=== 1985–1995: Country music comeback in adulthood ===In 1986, Osmond was nominated by the Academy of Country Music for Top Female Vocalist and by the Grammy Awards for her her duet with Dan Seals. Osmond, her husband and children moved to Nashville to further her country career. Along with her four children, Osmond traveled the United States on a tour bus doing hundreds of shows a year. \"It was a pretty good life, as long as you didn't mind scraping cow pie off your shoes once in a while,\" she later wrote in her 2009.Capitol released Osmond's next album in August 1986 I Only Wanted You. The disc was her second produced with Paul Worley in Nashville. Billboard praised its country pop production calling it \"glowing\". Along with her previous project, I Only Wanted You made the top 20 of the US country albums chart. The album featured a duet with Paul Davis called \"You're Still New to Me\". Although Davis had pitched her the song, it was Osmond's idea to record the song as a duet with him. Released as a single in 1986, the duet topped the US and Canadian country charts. The album's title track reached the top 20 on both nation's country charts in 1987.In July 1988, Osmond's next studio album All in Love was released. The disc's production was described by critics as \"excessively sweet\" and \"slick\". It reached the top 30 of the US country albums chart. Its three singles reached positions outside the US and Canadian country top 40: \"Without a Trace\", \"Sweet Life\" (a duet with Paul Davis) and \"I'm in Love and He's in Dallas\". Her final Capitol studio album was 1989's Steppin' Stone, which reached the US country albums top 70. Critics took notice of the album's traditional country production compared to her previous projects. Similar to her previous release, all three of its singles (the title track, \"Slowly But Surely\", \"Let Me Be the First\") failed to peak in positions inside the US and Canadian country top 40.In 1990, Curb Records released Osmond's first album of greatest hits under the title The Best of Marie Osmond. The album contained some new recordings, one of which was the single \"Like a Hurricane\". It reached number 57 on the US country songs chart the same year. Another new track was a re-recording of \"Paper Roses\", which Osmond cut again due to copyright challenges with including the original on the disc. Osmond brought in the song's original producer (Sonny James) and several of the original studio musicians to re-make the track. In 1995, Osmond returned to the US country charts with the new Curb single \"What Kind of Man (Walks on a Woman)\". Two previews of songs from an anticipated album were included in the single release. However, Osmond ultimately chose to make a career change finding it challenging to balance family life with touring."}, {"text": "=== 2008–present: Las Vegas residency and return to music ===In 2008, Donny and Marie agreed to a six-week run at the Flamingo hotel in Las Vegas. The success of the show led to several extensions which ultimately turned into an 11-year residency through 2019. The show had a total of 1730 performances, the most of any singing act in Las Vegas history. The duo earned three of the Las Vegas Review-Journal's Best of Las Vegas Awards in 2012 including \"Best Show\", \"Best All-Around Performer\" (Donny & Marie), and \"Best Singer\". The Vegas show was briefly  moved to Caesars Atlantic City for a residency in August 2014.  The show ran for two weeks in August 2014. The actual showroom was updated in 2014 and renamed the \"Donny and Marie Showroom\". The Osmond duo were backed by eight dancers and a nine-piece band. The format of the show consisted of Donny and Marie singing together at the beginning and end of the show, with solo segments in between. On the final performance they ended the show with the traditional singing of \"May Tomorrow Be a Perfect Day\" followed by saying \"Goodnight everybody!\" A new studio album titled Donny & Marie was released by MPCA in May 2011 featuring covers and new material. The album reached the top 30 in the US and number 41 in the UK.As solo artist, Osmond's first studio album in nearly 20 years was released in 2007 titled Magic of Christmas. It was followed by I Can Do This in 2010. The project featured hymns and spiritual material. It reached number 71 in the US. Following this, Osmond decided that she no longer wanted to record music. However, she decided to return to music after listening to her intuition: \"There was this voice saying ‘Marie, you should never let age define your music',\" she told Sounds Like Nashville. In 2016, Osmond released her tenth studio album Music Is Medicine. It was her first studio album of country music since 1989's Steppin' Stone. Produced by Jason Deere, the project featured collaborations with Olivia Newton-John, Sisqo and Marty Ro (of Diamond Rio). Music Is Medicine reached number ten on the US country chart, becoming Osmond's first solo album since Paper Roses to make the top ten list. AllMusic's Stephen Thomas Erlewine rated the album three out of five stars and concluded, \"Despite the ambitious cast of characters, it's music that's meant to soothe and comfort old friends, and it certainly succeeds in that regard.\"In 2021, Osmond's next studio album was released titled Unexpected. The project was a collection of operatic and traditional pop music. Although fearful about recording an album of material outside her traditional comfort zone, Osmond decided to \"not be afraid of a new door opening\". The album featured the Prague Symphony Orchestra and included a cover of \"Nessun Dorma\", a song she had been performing on stage for years. Other tracks included show tunes like \"Climb Ev'ry Mountain\" and \"On My Own\". Upon its release, Unexpected peaked at number six on the US classical albums chart and number one on the US classical crossover albums chart."}, {"text": "=== Voice and musical style ===Osmond identifies her self with having a soprano vocal range. When performing on Broadway in the 1990s, a vocal coach discovered that she could sing higher than she was aware of. Osmond's music has been classified in the genres of country pop, pop, classical and opera. In describing her wide range of musical styles, The Blade wrote, \"To hear Marie Osmond’s voice is to hear more than a half century of American pop culture history.\" In describing the country pop era of her career, writers Robert K. Oermann and Mary A. Bufwack wrote, \"Like the other country-pop crossover queens of her era, Marie had a patriotic, high-energy fashion conscious concert act that matched her upbeat pop-flavored tunes.\" When explaining her own musical styles, Osmond said, \"Yes, I’m country; that’s what I chose to be, but it was very easy for me to sing pop because my brothers did. But as I have grown and I did Broadway and all different kinds of things, I fell in love with that style.\""}, {"text": "=== 1976–1986: Donny & Marie and television breakthrough ===In 1976, television programmer Fred Silverman offered Donny and Marie their own television variety show after seeing them perform on The Mike Douglas Show. The resulting program titled Donny & Marie aired on ABC beginning the same year. The show was produced by Sid and Marty Krofft. The show brought in an estimated 14 million viewers. On the program, the sibling duo sang and performed comedy sketches. Along with doing so together, they also performed separately and with guest performers. Notably, the show also featured the Osmond brothers. The pair became known for the show's opening song which featured the line, \"I'm a little bit country [in reference to Marie] and I'm a little bit rock and roll [in reference to Donny]\".The Donny & Marie show was considered by writers to showcase the siblings' \"squeaky clean\" and \"family friendly\" image. The siblings often worked 18-hour days learning scripts, changing into costumes and practicing choreography. Marie also attended to domestic and school responsibilities. She was tutored on-set for three hours daily and was expected to complete chores while she was home. Weighing 110 pounds, Marie was told by a producer to lose ten pounds or \"the entire show would be canceled\". Following the statement, her weight dropped to 93 pounds and she struggled to stay awake during rehearsals. Osmond continued to perform on the show, citing her responsibility to her family and the her audience. Donny and & Marie was later re-titled to The Osmond Family Hour and was canceled in May 1979.In 1978, Donny and Marie debuted in their first feature film titled Goin' Coconuts. The film told the story of two siblings who are put in the center of criminal activity between two gangs while at a concert in Hawaii. The film was considered a commercial failure at the box office when it was released in 1978. Later that year, Osmond appeared in the ABC television film The Gift of Love, which was based on the O. Henry story The Gift of the Magi. The film told the story of a newlywed couple and starred opposite Timothy Bottoms.In the late 1970s, Osmond turned down the role of Sandy in the film version of Grease, later explaining that the original character was \"not a nice girl\" and \"a lot edgier\". In 1978, Osmond starred in a sitcom pilot titled Marie. Although originally made for ABC, it did not make the new season schedule. Between 1980 and 1981, Osmond briefly had her own variety show titled Marie.In the early 1980s, Osmond made acting appearances in more television films including I Married Wyatt Earp and Rooster. In 1984, Osmond voiced the role of The Nursery Magic Fairy/Velveteen Rabbit in The Velveteen Rabbit. Osmond then played her mother, Olive, in the television movie Side by Side: The True Story of the Osmond Family. In 1985, Osmond hosted the television program Ripley's Believe It or Not!."}, {"text": "=== 1994–2009: Broadway and return to television ===When Osmond's music career began interfering with her family life, she refocused her attention towards acting. \"I knew that I never wanted to have to choose between a child who needed me and a concert performance ever again. It was all the motivation I needed to make a life and a career change,\" she wrote in 2009. Manager Karl Engemann arranged for Osmond to meet with the creators of a new touring production of The Sound of Music. The creators gave her more freedom to balance her family life and her career. Ultimately, Osmond agreed to the role. She worked alongside vocal coach Barbara Smith Davis to retrain her voice for the role. Between 1994 and 1995, Osmond starred as Maria von Trapp in the show's traveling production. Variety praised her performance, commenting, \"Forget the misleadingly sappy posters: she is a more interesting Maria than that.\" In 1997, Osmond starred as Anna Leonowens in The King and I. It was her debut performance on Broadway. The Los Angeles Times found Osmond's to be an \"adequate Anna\" but found \"she falters in important ways\". Meanwhile Variety praised her vocal performance, writing, \"Osmond’s soprano has developed into a fine instrument\"."}, {"text": "=== 1994–2009: Broadway and return to television ===In the middle 1990s, Osmond returned to television. In 1995, she in the ABC sitcom Maybe This Time. She played the role of Julia Wallace, divorced mother who also had an entertainment career. The show also featured Betty White playing the role of her mother. After 18 episodes, the show was cancelled in February 1996. She was then approached by Dick Clark to re-launch the original Donny & Marie television program as a talk show. Although hesitant to work with her brother Donny again, Osmond ultimately agreed. She and her family subsequently moved to Los Angeles and she began filming the program. In September 1998, Donny & Marie was launched on daytime television. \"Donny and Marie Osmond don’t seem much different from their days as the clean-cut teenage siblings on the ‘70s ABC musical-variety series, 'Donny and Marie',\" wrote Susan King of the Los Angeles Times. The duo taped one-hour programs six times a week, with six segments in each program. After two seasons, the talk show was canceled due to \"poor ratings\".In 1999, Donny and Marie co-hosted the Miss America pageant in Atlantic City, New Jersey. From co-hosting, she became the first female host to announce the winner of the pageant. In 2004, Osmond began hosting a five-hour radio show on the weekdays titled Marie and Friends. The show included conversations with others, while also playing current adult contemporary music. Primarily the show was geared towards women, with Osmond commenting, \"I'm looking forward to healthy adult conversation with women my own age!\" The show was aired in the mid-western and western United States, primarily in Utah, Idaho, Washington state and California.In 2006, Osmond was cast as a judge on the Simon Cowell-created television competition Celebrity Duets. The show paired non-singing celebrities with professional musicians for duet performances. \"Marie Osmond acting as a cogent adviser is about the most impressive element in 'Celebrity Duets,\" wrote Phil Gallo of Variety. The same year it was reported by Entertainment Tonight magazine that Osmond would join the cast of The Bold and the Beautiful soap opera but scheduling conflicts prevented this from happening at the time.In August 2007, Osmond was cast on Dancing with the Stars alongside Jane Seymour and Wayne Newton. The ballroom dancing program paired celebrities with professional dancers for competitions aired weekly. In her 2009 autobiography, Osmond wrote that she \"didn't know how to dance\" and at one point had to \"crawl up the stairs\" to her bedroom because her muscles were so sore. Two months into the show, Osmond was experiencing breathing difficulties and fainted on air during an episode. She was medically evaluated and was reportedly \"fine\" following the collapse. Osmond continued performing on the show through November 2007 when she was eliminated, placing in third that season. In 2009, Osmond was given the opportunity to host her own talk show but due to current economic challenges in the US, the show was not aired."}, {"text": "=== 2010–present: Marie, The Talk and further television roles ===Marie and brother Donny produced a holiday musical called Donny & Marie – A Broadway Christmas, which was originally scheduled to play on Broadway at the Marquis Theatre from December 9–19, 2010. The show was then extended through December 30, 2010, and again to January 2, 2011.In the early 2010s, Emmy Awards producer David McKenzie re-approached Osmond about hosting her own talk show. She agreed and in 2012, it was announced that Osmond would have her own talk show on the Hallmark Channel titled Marie. The program replaced The Martha Stewart Show which ran during the same time of the day. Osmond's program featured guests who discussed social issues and provided lifestyle advice. Specifically, the talk show also featured Osmond performing, along with specific advice on cooking and fashion. The show debuted in late 2012 featuring Betty White as her first guest. \"She’s nothing but a cordial host, as if she was speaking and entertaining her guests – and her viewers – in the intimacy of her own home,\" wrote Media Village. In 2013, Hallmark cancelled the show after one season of being aired, stating that the channel already had too many talk show offerings. A proposal to air the talk show on another network was in the works.After leaving the Hallmark Channel, Osmond became regular fill-in co-host on the CBS daytime show The Talk. She guest-hosted for a total of 40 times. She was then approached by the head of CBS daytime television to become an official co-host. In 2019, Osmond was announced as the official replacement for Sara Gilbert on the daytime talk program. That year, she became an official co-host of The Talk alongside Sheryl Underwood, Carrie Ann Inaba, Sharon Osbourne and Eve. \"I am thrilled to now call this my day job,\" she told People magazine. In September 2020, Osmond departed the show after one season, citing a focus on family and other television opportunities. Osmond left at the same time that producer John Redmann departed the show and it was announced that the pair would collaborate in other television opportunities.Following her departure, Osmond acted in several television films. In 2019, she played Cassie, a Nashville singer, in the Lifetime film The Road Home for Christmas. She starred alongside Rob Mayes and Marla Sokoloff. In 2020, Osmond co-starred in a second Lifetime television film with Carly Hughes called The Christmas Edition. In 2021, Osmond co-starred in a third Lifetime television film titled A Fiancé for Christmas, which told the story of a single woman who makes a fake wedding registry and ultimately finds love in unexpected places. The Digital Journal praised Osmond's performance as the character of Margaret, calling her \"fabulous\". The same year, Osmond appeared on an episode of Fantasy Island as Shaye Fury, a fictional country singer. In 2023, she made an appearance on the show The Bold and the Beautiful."}, {"text": "=== Children's Miracle Network ===Osmond was inspired to help children with diseases after watching how her deaf siblings struggled learning to speak and communicate. Her parents also encouraged her to help support individuals in need \"My parents strongly believed that philanthropy was not only something we could do in our spare time but something that was to be part of our weekly schedule,\" she recalled. In 1981, Osmond and her brothers were hosting actor John Schneider at their home when they were discussing how they can better support sick children. The result was the pair co-founding the Children's Miracle Network Hospitals. The organization provides funds to sick children and their donations are given to hospitals across the country. Since its creation, the organization has been said to have raise $7 billion dollars for children. Osmond has collaborated and met with hundreds of families since its creation and its part of the program's annual broadcast to raise funds. \"I’m grateful that Children’s Miracle Network has given families access to financial and emotional support, technology, and the best research available, so they don’t have to figure it out on their own the way my mother did,\" she wrote in 2009."}, {"text": "=== Doll business ===Osmond and her mother started collecting dolls as a young child. In each city her family would tour in, they would purchase a doll as a souvenir from the place they were visiting. During her free time, Osmond started sculpting her own dolls in adulthood. Ultimately, it turned into a business in 1990 titled Marie Osmond Fine Porcelain Dolls. Osmond's dolls were also sold at Wal-Mart retailers starting at $29 dollars. Other dolls were sold in prices between $65 and $2000. Osmond also debuted her doll collection on the QVC network during this period. Among her first dolls was the Olive May doll, based on her own mother. The doll later set a collectible record on QVC, selling three million dolls in less than 15 minutes. A total of 40 dolls in six different series comprised the original porcelain collection. They were titled: Victoriana Collection, Classic Reproductions, Children of the World, Children of All Ages and Miracle Children (in reference to Children's Miracle Network). By 2001, Osmond was quoted as saying she had made an estimated 550 dolls. According to her official website, Osmond is now \"retired\" from the doll-making industry."}, {"text": "=== Nutrisystem ===In the 2000s, Osmond had gained roughly 40 pounds. When her mother suffered a stroke, she told her daughter, \"Marie, don't do what I did. Take care of yourself.\" By 2007, Osmond chose to make a change to her lifestyle and physical wellness after her children became increasingly worried about her weight. \"If I didn't feel a sense of urgency to do something for myself, I need to do it for my own children,\" she wrote in her autobiography. The same year, Osmond found the Nutrisystem program and she lost a total of 50 pounds. She reportedly went from being a size 14 to a size four. Osmond then became a spokesperson for the brand shortly after losing the weight. On Nutrisystems's official website, Osmond is listed under their category labeled \"success stories\" where she explains her journey with the program. She has since created a program through the company called \"Complete 50\" for women age 50 and older."}, {"text": "== Writing career ==Osmond is the author of four books, three of which have made The New York Times Best Seller list. Her first was 2001's Behind the Smile: My Journey Out of Postpartum Depression. It was co-written with Marcia Wilkie and Osmond's physician Dr. Judith Moore. The book described how Osmond suffered from postpartum depression following the birth of her child in the late 1990s. Her hope was that by giving a voice to the mental illness that other women would be inspired to take action. Ability magazine positively remarked that the book \"candidly discloses her experience\" with postpartum depression. The book made Osmond the first celebrity to speak openly about postpartum depression.Osmond then co-authored a second book in 2009 with Marcia Wilkie titled Might as Well Laugh About It Now. The memoir discussed highlights and memories from her life up. \"I really wanted to put some things down that were really meaningful to me. It’s really about attitude ... you can either let life get you down or you can laugh about it,\" she told the San Diego Union-Tribune. Osmond also described some challenging points in her life as well. Deseret News called the book both \"funny\" and \"moving\". \"The book is easy to read and is written in a conversational tone that makes the reader feel as though Osmond is a friend retelling stories from her life instead of a distant celebrity,\" highlighted Emiley Morgan.Osmond wrote two books in the 2010s decade. In 2010, she penned a book of handcrafted project designs, Marie Osmond's Heartfelt Giving: Sew and Quilt for Family and Friends, (Martingale & Company). The \"how-to\" book described different gifts people can make using a sewing machine. In 2013, Osmond wrote her next book The Key Is Love. The book consisted of anecdotes from her personal life, many of which circled back to her own mother. Osmond notably talked about her son's death in the book."}, {"text": "== Public image ==Along with her siblings, Osmond has been described as being \"squeaky clean\". Osmond herself has been described as the \"girl next door\". When describing her image, the News & Record wrote, \"Maybe Marie Osmond needs to get in a brawl in a cool L.A. club, snatch up a Sharon Stone-type film role or start hanging out with Madonna in Miami.\" The Washington Post explained that the Osmond family were \"squeaky-clean Mormons who, by all accounts, never indulged in the better-known temptations of showbiz.\" To shed her image, Osmond was offered 5 million dollars to appear in Playboy magazine. However, she later declined, saying, \"I could have used [the money]. I wouldn't want to see my mom like that, and I really wanted to be a mom.\" In describing her own public image, Osmond commented, \"Those people [reviewers] probably still see a naive little girl in their minds. I have to laugh at people like that because you cannot grow up in the business and not see everything and then some. The reviewers can stay back in that time, but I'm moving forward.\""}, {"text": "=== Relationships, marriages and children ===Before marrying, she was engaged in May 1979 to Jeff Crayton, an acting student, but in July of that year, they broke their engagement. She also dated the singer Andy Gibb around the same time. In 1981, she briefly dated actor and fellow Children's Miracle Network founder John Schneider.Osmond has been married three times, including twice to the same spouse. In 1982, she wed husband Steve Craig. Craig was a basketball player for Brigham Young University at the time of their dating. The couple had Osmond's first child, Stephen James Craig Jr. in 1983. The couple divorced in 1985. \"Steve and I had made several attempts to go back and make our very young marriage work, but it failed. I was being scrutinized in the tabloids and the paparazzi seemed to show up wherever I went. I was emotionally exhausted,\" she wrote in her autobiography. In 1986, she remarried record producer Brian Blosil in a private ceremony with her family in attendance. Osmond was drawn to Blosil's \"dry sense of humor\" after meeting at a family party. Osmond and Blosil had seven children, five of whom were adopted. Their two biological children are Rachael and Matthew. Their five adopted children are Jessica, Michael, Brandon, Brianna, and Abigail. After 21 years of marriage, the couple divorced in 2007. Both parties released a joint statement stating that neither one assigned fault for the divorce.Following her second divorce, Osmond said she \"never wanted to be married again\". Osmond and her former husband Steve Craig then saw each other again with the assistance of their son. They rekindled their relationship and secretly dated for two years before revealing it publicly. \"I didn't want anybody to get hurt, you know if it didn't work out. And gosh, it just worked out,\" Osmond said. The couple then remarried on May 5, 2011 in a private ceremony at the Las Vegas Mormon Temple. For the ceremony, Osmond wore her dress from their original 1982 wedding. The couple remarried a few months before attending their son's wedding. \"The thing about a second marriage is that you realize things you thought were so important, aren't. I love being with my husband. He is the sweetest man I know. He lives to serve and really listens to people's needs,\" she told People magazine.It was also revealed that Osmond's daughter identifies as a lesbian. In a later interview, Osmond commented, \"I know how I love my children and I know God loves all of his children as a father. I pray for everyone to use their lives to be happy and feel accomplished. That is what this life is for.\"In March 2020, she stated that she will leave her fortune to charity upon her death, stating that it would be a disservice to her children to leave the money to them, and noting that they need to make their own money."}, {"text": "=== Personal setbacks and challenges ===In 1976, Karl Engemann began managing the recording careers of Donny, Marie, Jimmy Osmond and the Osmond Brothers group. In 1979 Engemann was appointed personal manager at various career stages of all the Osmond children, and eventually only of Marie Osmond. In December 2009, Marie Osmond parted company with Karl Engemann. Osmond and her law firm wrote that Engemann made \"repeated defamatory and derogatory comments to third parties, multiple breaches of fiduciary duties, entering into unauthorized commitments, seeking to obtain monies outside the purview of the management agreement and other violations of his obligations.\""}, {"text": "=== Personal setbacks and challenges ===In 1999, Osmond publicly spoke about her battle with postpartum depression after giving birth to her last child. She spoke in detail about her challenges in her 2001 book Behind the Smile. In the book, she explained that it felt \"much darker\" than the baby blues and that she was \"fading away minute by minute\". Osmond started experiencing panic attacks, fatigue, neck pain (which resulted in a hospital visit) and suicidal ideations. In one instance, she drove miles up California's Pacific Coast Highway leaving her children in the care of two nannies who did not know where she was going. Osmond then received a call from her second husband who convinced her to pull off the highway and check into a hotel. She then began receiving natural healing treatments through physician Dr. Judith Moore. Osmond found that both medication and work on healing her own childhood trauma ultimately lifted her depression. After discussing postpartum depression on The Oprah Winfrey Show, Osmond said that she received \"thousands of emails and handwritten letters\" from people about their own struggles with the disease.Osmond also revealed in her 2001 book that she had been sexually abused in her youth. Her abuser was not publicly revealed. She believed that the abuse resulted her in her struggles with postpartum depression. \"In my life, the normally positive quality of putting others first resulted in long-term negative effects because it was out of balance,\" she wrote. She later revealed that her childhood abuse also resulted in developing body dysmorphia.In August 2006, several U.S. tabloids suggested that she had attempted suicide. Those reports were denied by her publicity team, which claimed she had suffered an adverse reaction to a medication she was taking.On February 26, 2010, Osmond adopted son Michael took his own life after jumping off an eighth-floor balcony. He reportedly battled depression and addiction and had been in rehabilitation at the age of 12. He was also bullied from a young age. Osmond wrote in her 2013 book The Key Is Love that he had been \"emotionally down\" in the weeks prior to his suicide. Shortly before taking his own life, Osmond had missed a phone call from her son because she was onstage in Las Vegas. An autopsy found no drugs in his system. Osmond returned to work two weeks following her son's death. \"The stage is my safe place. It doesn't scare me like it scares people. And I knew if I didn't get back onstage I may never get back onstage.\""}, {"text": "== Filmography ==FilmsHugo the Hippo (1975)"}, {"text": "== Filmography ==Goin' Coconuts (1978)"}, {"text": "== Filmography ==The Velveteen Rabbit (1984)"}, {"text": "== Filmography ==Buster & Chauncey's Silent Night (1998)"}, {"text": "== Filmography ==O Christmas Tree (1999)"}, {"text": "== Books ==Behind the Smile: My Journey Out of Postpartum Depression (2001) (with Marcia Wilkie and Dr. Judith Moore)"}, {"text": "== Books ==Might as Well Laugh About It Now (2009) (with Marcia Wilkie)"}, {"text": "== Books ==Marie Osmond's Heartfelt Giving: Sew and Quilt for Family and Friends (2010)"}, {"text": "== Books ==The Key Is Love: My Mother's Wisdom, A Daughter's Gratitude (2013) (with Marcia Wilkie)"}, {"text": "== Awards and nominations ==Marie Osmond has received several awards and nominations, notably from the Academy of Country Music, Country Music Association, Grammy Awards and Daytime Emmy Awards."}, {"text": "== External links ==Marie Osmond Official website"}, {"text": "== External links ==Marie Osmond at IMDb"}, {"text": "== External links ==Marie Osmond at the Internet Broadway Database "}, {"text": "== External links ==Marie Osmond Getting Divorced – People magazine, March 30, 2007"}, {"text": "== External links ==BBC News, Marie Osmond sings Paper Roses for Kilmarnock fans, 1 February 2013"}]