[{"text": "Marie Antoinette (; French: [maʁi ɑ̃twanɛt] ; Marie Antoinette Josèphe Jeanne; 2 November 1755 – 16 October 1793) was the last queen of France prior to the French Revolution. She was born an archduchess of Austria, and was the penultimate child and youngest daughter of Empress Maria Theresa and Emperor Francis I. She became dauphine of France in May 1770 at age 14 upon her marriage to Louis-Auguste, heir apparent to the French throne. On 10 May 1774, her husband ascended the throne as Louis XVI and she became queen."}, {"text": "As queen, Marie Antoinette became increasingly unpopular among the people; the French libelles accused her of being profligate, promiscuous, having illegitimate children, and harboring sympathies for France's perceived enemies, including her native Austria. She was falsely accused in the Affair of the Diamond Necklace, but the accusations damaged her reputation further. During the French Revolution, she became known as Madame Déficit because the country's financial crisis was blamed on her lavish spending and her opposition to social and financial reforms proposed by Anne Robert Jacques Turgot and Jacques Necker."}, {"text": "Several events were linked to Marie Antoinette during the Revolution after the government placed the royal family under house arrest in the Tuileries Palace in October 1789. The June 1791 attempted flight to Varennes and her role in the War of the First Coalition were immensely damaging to her image among French citizens. On 10 August 1792, the attack on the Tuileries forced the royal family to take refuge at the Assembly, and they were imprisoned in the Temple Prison on 13 August. On 21 September 1792, the monarchy was abolished. Louis XVI was executed by guillotine on 21 January 1793. Marie Antoinette's trial began on 14 October 1793; she was convicted two days later by the Revolutionary Tribunal of high treason and executed, also by guillotine, at the Place de la Révolution."}, {"text": "== Early life (1755–1770) ==Maria Antonia was born on 2 November 1755 at the Hofburg Palace in Vienna, Archduchy of Austria, at 20:30. She was the youngest daughter of Empress Maria Theresa, ruler of the Habsburg Empire, and her husband Francis I, Holy Roman Emperor. Her godparents were Joseph I and Mariana Victoria, King and Queen of Portugal; Archduke Joseph and Archduchess Maria Anna acted as proxies for their newborn sister. Maria Antonia was born on All Souls' Day, a Catholic day of mourning, and during her childhood her birthday was instead celebrated the day before, on All Saints' Day, due to the connotations of the date. Shortly after her birth she was placed under the care of the governess of the imperial children, Countess von Brandeis. Maria Antonia was raised together with her sister, Maria Carolina of Austria, who was three years older, and with whom she had a lifelong close relationship. Maria Antonia had a difficult but ultimately loving relationship with her mother, who referred to her as \"the little Madame Antoine\"."}, {"text": "== Early life (1755–1770) ==Maria Antonia spent her formative years between the Hofburg Palace and Schönbrunn, the imperial summer residence in Vienna, where on 13 October 1762, when she was seven, she met Wolfgang Amadeus Mozart, two months her junior and a child prodigy. Despite the private tutoring she received, the results of her schooling were less than satisfactory. At the age of 10 she could not write correctly in German or in any language commonly used at court, such as French or Italian, and conversations with her were stilted. Under the teaching of Christoph Willibald Gluck, Maria Antonia developed into a good musician. She learned to play the harp, the harpsichord and the flute. She sang during the family's evening gatherings, as she was known to have had a beautiful voice. She also excelled at dancing, had \"exquisite\" poise, and loved dolls."}, {"text": "== Early life (1755–1770) ==The death of her older sister Maria Josepha from smallpox during the epidemic in Vienna in October 1767 made an everlasting impression on the young Maria Antonia. Maria Antonia, in her later life, recalled the ailing Maria Josepha taking her in her arms. She told her that she would not be traveling to Naples to marry King Ferdinand IV of Naples, to whom she was betrothed, but for the family vault.Later in 1768, Mathieu-Jacques de Vermond was dispatched by Louis XV to tutor Maria Antonia as she became the future wife to Louis XVI. Serving as an educator, Abbe de Vermond found her to be unsatisfactorily educated and lacking in, at the age of 13, important writing skills. Nonetheless, he also complimented her stating \"her character, her heart, are excellent\". He found her \"more intelligent than has been generally supposed,\" but since \"she is rather lazy and extremely frivolous, she is hard to teach\".Under the recommendation of the Duc de Choiseul, a strong supporter of her prospective marriage, Maria Antonia also received a makeover to bring her more in line with the fashion of French royalty. This included the straightening of her teeth by a French dentist, the diversification of her wardrobe, and hairstyles reminiscent of Madame de Pompadour. She was also instructed by Jean-Georges Noverre, who taught her to walk in the gliding fashion characteristic of the court of Versailles."}, {"text": "== Dauphine of France (1770–1774) ==Following the Seven Years' War and the Diplomatic Revolution of 1756, Empress Maria Theresa decided to end hostilities with her longtime enemy, King Louis XV of France. Their common desire to destroy the ambitions of Prussia and Great Britain, and to secure a definitive peace between their respective countries led them to seal their alliance with a marriage: on 7 February 1770, Louis XV formally requested the hand of Maria Antonia for his eldest surviving grandson and heir, Louis-Auguste, Duc de Berry and Dauphin of France.Maria Antonia formally renounced her rights to Habsburg domains, and on 19 April she was married by proxy to the Dauphin of France at the Augustinian Church, Vienna, with her brother Archduke Ferdinand standing in for the dauphin. On 14 May she met her husband at the edge of the forest of Compiègne. Upon her arrival in France, she adopted the French version of her name: Marie Antoinette. A further ceremonial wedding took place on 16 May 1770 in the Palace of Versailles and, after the festivities, the day ended with the ritual bedding. The couple's longtime failure to consummate the marriage plagued the reputations of both Louis-Auguste and Marie Antoinette for the next seven years.The initial reaction to the marriage between Marie Antoinette and Louis-Auguste was mixed. On the one hand, the dauphine was beautiful, personable and well-liked by the common people. Her first official appearance in Paris on 8 June 1773 was a resounding success. On the other hand, those opposed to the alliance with Austria had a difficult relationship with Marie Antoinette, as did others who disliked her for more personal or petty reasons.Madame du Barry proved a troublesome foe to the new dauphine. She was Louis XV's mistress and had considerable political influence over him. In 1770 she was instrumental in ousting Étienne François, duc de Choiseul, who had helped orchestrate the Franco-Austrian Alliance and Marie Antoinette's marriage, and in exiling his sister, the Duchess de Gramont, one of Marie Antoinette's ladies-in-waiting. Marie Antoinette was persuaded by her husband's aunts to refuse to acknowledge du Barry, which some saw as a political blunder that jeopardized Austria's interests at the French court. Marie Antoinette's mother and the Austrian ambassador to France, Comte de Mercy-Argenteau, who sent the empress secret reports on Marie Antoinette's behaviour, pressured Marie Antoinette to speak to Madame du Barry, which she grudgingly agreed to do on New Year's Day 1772. She merely commented to her, \"There are a lot of people at Versailles today\", but it was enough for Madame du Barry, who was satisfied with this recognition, and the crisis passed.Two days after the death of Louis XV in 1774, Louis XVI exiled du Barry to the Abbaye de Pont-aux-Dames in Meaux, pleasing both his wife and aunts. Two and a half years later, at the end of October 1776, Madame du Barry's exile ended and she was allowed to return to her beloved château at Louveciennes, but she was never permitted to return to Versailles."}, {"text": "=== Early years (1774–1778) ===Upon the death of Louis XV on 10 May 1774 the dauphin ascended the throne as King Louis XVI of France and Navarre with Marie Antoinette as his queen consort. At the outset, the new queen had limited political influence with her husband, who, with the support of his two most important ministers, Chief Minister Maurepas and Foreign Minister Vergennes, blocked several of her candidates from assuming important positions, including Choiseul. The queen did play a decisive role in the disgrace and exile of the most powerful of Louis XV's ministers, the Duc d'Aiguillon.On 24 May 1774, two weeks after the death of Louis XV, the king gave his wife the Petit Trianon, a small château on the grounds of Versailles that had been built by Louis XV for his mistress, Madame de Pompadour. Louis XVI allowed Marie Antoinette to renovate it to suit her own tastes; soon rumours circulated that she had plastered the walls with gold and diamonds."}, {"text": "=== Early years (1774–1778) ===The queen spent heavily on fashion, luxuries, and gambling, though the country was facing a grave financial crisis and the population was suffering. Rose Bertin created dresses for her, and hairstyles such as poufs, up to three feet (90 cm) high, and the panache—a spray of feather plumes. She and her court also adopted the English fashion of dresses made of indienne (a material banned in France from 1686 until 1759 to protect local French woolen and silk industries), percale and muslin. As a result of all these fashion activities, Marie Antoinette presided over one of the most important and fashionable courts in history and she was dominant over all of the other ladies of the court; as for her bearing and appearance the queen was very majestic and charismatic in spite of the fact that she gained a lot of weight over the years due to her many pregnancies."}, {"text": "=== Early years (1774–1778) ===By the time of the Flour War of 1775, a series of riots (due to the high price of flour and bread) had damaged her reputation among the general public. Eventually, Marie Antoinette's reputation was no better than that of the favourites of previous kings. Many French people were beginning to blame her for the degrading economic situation, suggesting the country's inability to pay off its debt was the result of her wasting the crown's money. In her correspondence, Marie Antoinette's mother, Maria Theresa, expressed concern over her daughter's spending habits, citing the civil unrest it was beginning to cause.As early as 1774, Marie Antoinette had begun to befriend some of her male admirers, such as the Baron de Besenval, the Duc de Coigny, and Count Valentin Esterházy, and also formed deep friendships with various ladies at court. Most noted was Marie-Louise, Princesse de Lamballe, related to the royal family through her marriage into the Penthièvre family. On 19 September 1774 she appointed her superintendent of her household, an appointment she soon transferred to her new favourite, the Duchesse de Polignac."}, {"text": "=== Early years (1774–1778) ===In 1774, she took under her patronage her former music teacher, the German opera composer Christoph Willibald Gluck, who remained in France until 1779."}, {"text": "=== Motherhood, changes at court and intervention in politics (1778–1781) ===Amidst the atmosphere of a wave of libelles, the Holy Roman Emperor Joseph II came to France incognito, using the name Comte de Falkenstein, for a six-week visit during which he toured Paris extensively and was a guest at Versailles. He met his sister and her husband on 18 April 1777 at the Château de la Muette, and spoke frankly to his brother-in-law, curious as to why the royal marriage had not been consummated, arriving at the conclusion that no obstacle to the couple's conjugal relations existed save the queen's lack of interest and the king's unwillingness to exert himself. In a letter to his brother Leopold, Grand Duke of Tuscany, Joseph II described them as \"a couple of complete blunderers.\" He disclosed to Leopold that the inexperienced—then still only 22-year-old—Louis XVI had confided in him the course of action he had been undertaking in their marital bed; saying Louis XVI \"introduces the member,\" but then \"stays there without moving for about two minutes,\" withdraws without having completed the act and \"bids goodnight.\"Suggestions that Louis suffered from phimosis, which was relieved by circumcision, have been discredited. Nevertheless, following Joseph's intervention, the marriage was finally consummated in August 1777. Eight months later, in April 1778, it was suspected that the queen was pregnant, which was officially announced on 16 May. Marie Antoinette's daughter, Marie-Thérèse Charlotte, Madame Royale, was born at Versailles on 19 December 1778. The child's paternity was contested in the libelles, as were all her children's.In the middle of the queen's pregnancy, two events occurred which had a profound effect on her later life: the return of her friend, the Swedish diplomat Count Axel von Fersen the Younger to Versailles for two years, and her brother's claim to the throne of Bavaria, contested by the Habsburg monarchy and Prussia. Marie Antoinette pleaded with her husband for the French to intercede on behalf of Austria. The Peace of Teschen, signed on 13 May 1779, ended the brief conflict, with the queen imposing French mediation at her mother's insistence and Austria's gaining the Innviertel territory of at least 100,000 inhabitants—a strong retreat from the early French position which was hostile towards Austria. This gave the impression, partially justified, that the queen had sided with Austria against France.Meanwhile, the queen began to institute changes in court customs. Some of them met with the disapproval of the older generation, such as the abandonment of heavy make-up and the popular wide-hooped panniers. The new fashion called for a simpler feminine look, typified first by the rustic robe à la polonaise style and later by the gaulle, a layered muslin dress Marie Antoinette wore in a 1783 Vigée-Le Brun portrait. In 1780 she began to participate in amateur plays and musicals in the Théâtre de la Reine built for her by Richard Mique."}, {"text": "=== Motherhood, changes at court and intervention in politics (1778–1781) ===Repayment of the French debt remained a difficult problem, further exacerbated by Vergennes and also by Marie Antoinette's prodding Louis XVI to involve France in the American Revolutionary War. The primary motive for the queen's involvement in political affairs in this period may arguably have had more to do with court factionalism than any true interest on her part in politics themselves, but she played an important role in aiding the American Revolution by securing Austrian and Russian support for France, which resulted in the establishment of the First League of Armed Neutrality that stopped Britain's attack, and by weighing in decisively for the nomination of Philippe Henri, Marquis de Ségur, as Minister of War and Charles Eugène Gabriel de La Croix as Secretary of the Navy in 1780, who helped George Washington defeat the British in the American Revolutionary War, which ended in 1783.Marie Antoinette's second pregnancy ended in a miscarriage early in July 1779, as confirmed by letters between the queen and her mother, although some historians believed that she may have experienced bleeding related to an irregular menstrual cycle, which she mistook for a lost pregnancy.Her third pregnancy was affirmed in March 1781, and on 22 October she gave birth to Louis Joseph Xavier François, Dauphin of France.Empress Maria Theresa died on 29 November 1780 in Vienna. Marie Antoinette feared that the death of her mother would jeopardise the Franco-Austrian alliance (as well as, ultimately, herself), but her brother, Joseph II, Holy Roman Emperor, wrote to her that he had no intention of breaking the alliance.A second visit from Joseph II, which took place in July 1781 to reaffirm the Franco-Austrian alliance and also to see his sister, was tainted by false rumours that Marie Antoinette was sending money to him from the French treasury."}, {"text": "=== Declining popularity (1782–1785) ===Despite the general celebration over the birth of an heir, Marie Antoinette's political influence, such as it was, was perceived to greatly benefit Austria. During the Kettle War, in which her brother Joseph attempted to open the Scheldt river for naval passage, Marie Antoinette succeeded in obliging Vergennes to pay huge financial compensation to Austria. Finally, the queen was able to obtain her brother's support against Great Britain in the American Revolution and she neutralized French hostility to his alliance with Russia.In 1782, after the governess of the royal children, the Princesse de Guéméné, went bankrupt and resigned, Marie Antoinette appointed her favourite, the Duchesse de Polignac, to the position. This decision met with disapproval from the court as the duchess was considered to be of too modest origins to occupy such an exalted position. In contrast, both the king and the queen trusted Madame de Polignac completely, gave her a thirteen-room apartment in Versailles and paid her well. The entire Polignac family benefited greatly from royal favour in titles and positions, but its sudden wealth and lavish lifestyle outraged most aristocratic families, who resented the Polignacs' dominance at court, and also fueled the increasing popular disapproval of Marie Antoinette, mostly in Paris. De Mercy wrote to the empress: \"It is almost unexampled that in so short a time, the royal favour should have brought such overwhelming advantages to a family\".In June 1783 Marie Antoinette's new pregnancy was announced, but on the night of 1–2 November, her 28th birthday, she suffered a miscarriage.In 1783 the queen played a decisive role in the nomination of Charles Alexandre de Calonne, a close friend of the Polignacs, as Controller-General of Finances, and of the Baron de Breteuil as the Minister of the Royal Household, making him perhaps the strongest and most conservative minister of the reign. The result of these two nominations was that Marie Antoinette's influence became paramount in government, and the new ministers rejected any major change to the structure of the old regime. More than that, the decree by de Ségur, the minister of war, requiring four quarterings of nobility as a condition for the appointment of officers, mainly served the interest of older noble families including poorer provincial ones, who were widely seen as a reactionary interest group by ambitious members of the middle and professional classes, by some more recent nobility, and even by the Parisian populace and press. The measure also blocked the access of 'commoners', mainly sons of members of the professional classes, and of more recently elevated nobility to important positions in the armed forces. As such, the decree became an important grievance for social classes that had been habitually supportive of the monarchy and established order, and which went on to supply the bulk of the early leadership of the French Revolution.Count Axel von Fersen, after his return from America in June 1783, was accepted into the queen's private society. There were claims that the two were romantically involved, but since most of their correspondence has been lost, destroyed, or redacted, for many years there was no conclusive evidence. However, in 2016, the Telegraph's Henry Samuel announced that researchers at France's Research Centre for the Conservation of Collections (CRCC), \"using cutting-edge x-ray and different infrared scanners\" had deciphered letters from her that proved the affair.Around this time, pamphlets describing farcical sexual deviance including the queen and her friends in the court were growing in popularity around the country. The Portefeuille d’un talon rouge was one of the earliest, including the queen and a variety of other nobles in a political statement decrying the immoral practices of the court. As time went on, these came to focus more on the queen. They described amorous encounters with a wide range of figures, from the Duchesse de Polignac to Louis XV. As these attacks increased, they were connected with the public's dislike of her association with the rival nation of Austria. It was publicly suggested that her supposed behaviour was learned at the court of the rival nation, particularly lesbianism, which was known as the \"German vice\". Her mother again expressed concern for the safety of her daughter, and she began to use Austria's ambassador to France, Comte de Mercy, to provide information on Marie Antoinette's safety and movements.In 1783 the queen was busy with the creation of her \"hamlet\", a rustic retreat built by her favoured architect, Richard Mique, according to the designs of the painter Hubert Robert. Its creation, however, caused another uproar when its cost became widely known. However, the hamlet was not an eccentricity of Marie Antoinette's. It was en vogue at the time for nobles to have recreations of small villages on their properties. In fact, the design was copied from that of the Prince de Condé. It was also significantly smaller and less intricate than many other nobles'. Around this time she accumulated a library of 5,000 books. Those on music, often dedicated to her, were the most read, though she also liked to read history. She sponsored the arts, in particular music. Marie-Antoinette preferred to hold her musicales in the salon of her Petit appartement de la reine in the Palace of Versailles, or in the Théâtre de la Reine. She limited the audience to her intimate circle and a few musicians, among them the Chevalier de Saint-Georges. \"Admitted to perform music with the Queen,\" Saint-Georges probably played his violin sonatas for two instruments, with Her Majesty playing the fortepiano. She also supported some scientific endeavours, encouraging and witnessing the first launch of a Montgolfière, a hot air balloon for the first time in human history; this extraordinary feat which represented a turning point in human civilization was done by Jean-François Pilâtre de Rozier.On 27 April 1784 Beaumarchais's play The Marriage of Figaro premiered in Paris. Initially banned by the king due to its negative portrayal of the nobility, the play was finally allowed to be publicly performed because of the queen's support and its overwhelming popularity at court, where secret readings of it had been given by Marie Antoinette. The play was a disaster for the image of the monarchy and aristocracy. It inspired Mozart's Le Nozze di Figaro, which premiered in Vienna on 1 May 1786.On 24 October 1784 putting the Baron de Breteuil in charge of its acquisition, Louis XVI bought the Château de Saint-Cloud from the Duc d'Orléans in the name of his wife, which she wanted due to their expanding family. She wanted to be able to own her own property, one that was actually hers, to then have the authority to bequeath it to \"whichever of my children I wish,\" choosing the child she thought could use it rather than it going through patriarchal inheritance laws or whims. It was proposed that the cost could be covered by other sales, such as that of the château Trompette in Bordeaux. This was unpopular, particularly with those factions of the nobility who disliked the queen, but also with a growing percentage of the population, who disapproved of a Queen of France independently owning a private residence. The purchase of Saint-Cloud thus damaged the public's image of the queen even further. The château's high price, almost 6 million livres, plus the substantial extra cost of redecorating, ensured that much less money was going towards repaying France's substantial debt."}, {"text": "=== Declining popularity (1782–1785) ===On 27 March 1785 Marie Antoinette gave birth to a second son, Louis Charles, who bore the title of Duc de Normandie. The fact that the birth occurred exactly nine months after Fersen's return did not escape the attention of many, leading to doubt as to the parentage of the child and to a noticeable decline of the queen's reputation in public opinion. The majority of Marie Antoinette's and Louis XVII's biographers believe that the young prince was the biological son of Louis XVI, including Stefan Zweig and Antonia Fraser, who believe that Fersen and Marie Antoinette were indeed romantically involved. Fraser has also noted that the birthdate matches up perfectly with a known conjugal visit from the king. Courtiers at Versailles noted in their diaries that the date of the child's conception in fact corresponded perfectly with a period when the King and the queen had spent much time together, but these details were ignored amid attacks on the queen's character. These suspicions of illegitimacy, along with the continued publication of the libelles and never-ending cavalcades of court intrigues, the actions of Joseph II in the Kettle War, the purchase of Saint-Cloud and the Affair of the Diamond Necklace combined to turn popular opinion sharply against the queen, and the image of a licentious, spendthrift, empty-headed foreign queen was quickly taking root in the French psyche.A second daughter, her last child, Marie Sophie Hélène Béatrix, Madame Sophie, was born on 9 July 1786 and lived only eleven months until 19 June 1787. She was named after the king's aunt, Princess Sophie of France."}, {"text": "==== Diamond necklace scandal ====Marie Antoinette began to abandon her more carefree activities to become increasingly involved in politics in her role as Queen of France. By publicly showing her attention to the education and care of her children, the queen sought to improve the dissolute image she had acquired in 1785 from the \"Diamond Necklace Affair\", in which public opinion had falsely accused her of criminal participation in defrauding the jewelers Boehmer and Bassenge of the price of an expensive diamond necklace they had originally created for Madame du Barry. The main actors in the scandal were Cardinal de Rohan, Prince de Rohan-Guéméné, Grand Almoner of France, and Jeanne de Valois-Saint-Rémy, Comtesse de La Motte, a descendant of an illegitimate child of Henry II of France of the House of Valois. Marie Antoinette had profoundly disliked Rohan since the time he had been the French ambassador to Vienna when she was a child. Despite his high clerical position at the Court, she never addressed a word to him. Others involved were Nicole Lequay, alias Baronne d'Oliva, a prostitute who happened to look like Marie Antoinette; Rétaux de Villette, a forger; Alessandro Cagliostro, an Italian adventurer; and the Comte de La Motte, Jeanne de Valois' husband. Madame de La Motte tricked Rohan into buying the necklace as a gift to Marie Antoinette, for him to gain the queen's favour."}, {"text": "==== Diamond necklace scandal ====When the affair was discovered those involved (except de La Motte and Rétaux de Villette, who both managed to flee) were arrested, tried, convicted, and either imprisoned or exiled. Madame de La Motte was sentenced for life to confinement in the Pitié-Salpêtrière Hospital, which also served as a prison for women. Judged by the Parlement, Rohan was found innocent of any wrongdoing and allowed to leave the Bastille. Marie Antoinette, who had insisted on the arrest of the Cardinal, was dealt a heavy personal blow, as was the monarchy, and despite the fact that the guilty parties were tried and convicted, the affair proved to be extremely damaging to her reputation, which never recovered from it."}, {"text": "==== Failure of political and financial reforms ====Suffering from an acute case of depression the king began to seek the advice of his wife. In her new role and with increasing political power, the queen tried to improve the awkward situation brewing between the Parlement and the king. This change of the queen's position signaled the end of the Polignacs' influence and their impact on the finances of the Crown."}, {"text": "==== Failure of political and financial reforms ====Continuing deterioration of the financial situation despite cutbacks to the royal retinue and court expenses ultimately forced the king, the queen and the Minister of Finance, Calonne, at the urging of Vergennes, to call a session of the Assembly of Notables, after a hiatus of 160 years. The assembly was held for the purpose of initiating necessary financial reforms, but the Assembly refused to cooperate. The first meeting took place on 22 February 1787, nine days after the death of Vergennes on 13 February. Marie Antoinette did not attend the meeting and her absence resulted in accusations that the queen was trying to undermine its purpose. The Assembly was a failure. It did not pass any reforms and, instead, fell into a pattern of defying the king. On the urging of the queen, Louis XVI dismissed Calonne on 8 April 1787.On 1 May 1787 Étienne Charles de Loménie de Brienne, Archbishop of Toulouse and one of the queen's political allies was appointed by the king at her urging to replace Calonne, first as Controller-General of Finances and then as Chief Minister. He began to institute more cutbacks at court while trying to restore the royal absolute power weakened by parliament. Brienne was unable to improve the financial situation, and since he was the queen's ally, this failure adversely affected her political position. The continued poor financial climate of the country resulted in the 25 May dissolution of the Assembly of Notables because of its inability to function, and the lack of solutions was blamed on the queen.France's financial problems were the result of a combination of factors: several expensive wars; a large royal family whose expenditures were paid for by the state; and an unwillingness on the part of most members of the privileged classes, aristocracy, and clergy, to help defray the costs of the government out of their own pockets by relinquishing some of their financial privileges. As a result of the public perception that she had single-handedly ruined the national finances, Marie Antoinette was given the nickname of \"Madame Déficit\" in the summer of 1787. While the sole fault for the financial crisis did not lie with her, Marie Antoinette was the biggest obstacle to any major reform effort. She had played a decisive role in the disgrace of the reformer ministers of finance, Turgot (in 1776), and Jacques Necker (first dismissal in 1781). If the secret expenses of the queen were taken into account, court expenses were much higher than the official estimate of 7% of the state budget."}, {"text": "==== Failure of political and financial reforms ====The queen attempted to fight back with propaganda portraying her as a caring mother, most notably in the painting by Élisabeth Vigée Le Brun exhibited at the Royal Académie Salon de Paris in August 1787, showing her with her children. Around the same time, Jeanne de Valois-Saint-Rémy escaped from prison and fled to London, where she published damaging slander concerning her supposed amorous affair with the queen.The political situation in 1787 worsened when, at Marie Antoinette's urging, the Parlement was exiled to Troyes on 15 August. It further deteriorated when Louis XVI tried to use a lit de justice on 11 November to impose legislation. The new Duc d'Orléans publicly protested the king's actions, and was subsequently exiled to his estate at Villers-Cotterêts. The May Edicts issued on 8 May 1788 were also opposed by the public and parliament. Finally, on 8 August, Louis XVI announced his intention to bring back the Estates General, the traditional elected legislature of the country, which had not been convened since 1614.While from late 1787 up to his death in June 1789 Marie Antoinette's primary concern was the continued deterioration of the health of the dauphin, who suffered from tuberculosis, she was directly involved in the exile of the Parlement, the May Edicts, and the announcement regarding the Estates-General. She did participate in the King Council, the first queen to do this in over 175 years (since Marie de' Medici had been named Chef du Conseil du Roi, between 1614 and 1617), and she was making the major decisions behind the scene and in the Royal Council."}, {"text": "==== Failure of political and financial reforms ====Marie Antoinette was instrumental in the reinstatement of Jacques Necker as Finance Minister on 26 August 1788, a popular move, even though she herself was worried that it would go against her if Necker proved unsuccessful in reforming the country's finances. She accepted Necker's proposition to double the representation of the Third Estate (tiers état) in an attempt to check the power of the aristocracy.On the eve of the opening of the Estates General the queen attended the mass celebrating its return. As soon as it opened on 5 May 1789, the fracture between the democratic Third Estate (consisting of bourgeois and radical aristocrats) and the conservative nobility of the Second Estate widened, and Marie Antoinette knew that her rival, the Duc d'Orléans, who had given money and bread to the people during the winter, would be acclaimed by the crowd, much to her detriment.The death of the dauphin on 4 June, which deeply affected his parents, was virtually ignored by the French people, who were instead preparing for the next meeting of the Estates-General and hoping for a resolution to the bread crisis. As the Third Estate declared itself a National Assembly and took the Tennis Court Oath, and as people either spread or believed rumours that the queen wished to bathe in their blood, Marie Antoinette went into mourning for her eldest son. Her role was decisive in urging the king to remain firm and not concede to popular demands for reforms. In addition, she showed her determination to use force to crush the forthcoming revolution."}, {"text": "== French Revolution before Varennes (1789–1791) ==The situation escalated on 20 June as the Third Estate, which had been joined by several members of the clergy and radical nobility, found the door to its appointed meeting place closed by order of the king. It thus met at the tennis court in Versailles and took the Tennis Court Oath not to separate before it had given a constitution to the nation."}, {"text": "== French Revolution before Varennes (1789–1791) ==On 11 July at Marie Antoinette's urging, Necker was dismissed and replaced by Breteuil, the queen's choice to crush the Revolution with mercenary Swiss troops under the command of one of her favorites, Pierre Victor, Baron de Besenval de Brünstatt. At the news, Paris was besieged by riots that culminated in the storming of the Bastille on 14 July. On 15 July Gilbert du Motier, Marquis de Lafayette was named commander-in-chief of the newly formed Garde nationale."}, {"text": "== French Revolution before Varennes (1789–1791) ==In the days following the storming of the Bastille, for fear of assassination, and ordered by the king, the emigration of members of the high aristocracy began on 17 July with the departure of the Comte d'Artois, the Condés, cousins of the king, and the unpopular Polignacs. Marie Antoinette, whose life was as much in danger, remained with the king, whose power was gradually being taken away by the National Constituent Assembly.The abolition of feudal privileges by the National Constituent Assembly on 4 August 1789 and the Declaration of the Rights of Man and of the Citizen (La Déclaration des Droits de l'Homme et du Citoyen), drafted by Lafayette with the help of Thomas Jefferson and adopted on 26 August, paved the way to a Constitutional Monarchy (4 September 1791 – 21 September 1792). Despite these dramatic changes, life at the court continued, while the situation in Paris was becoming critical because of bread shortages in September. On 5 October, a crowd from Paris descended upon Versailles and forced the royal family to move to the Tuileries Palace in Paris, where they lived under a form of house arrest under the watch of Lafayette's Garde Nationale, while the Comte de Provence and his wife were allowed to reside in the Petit Luxembourg, where they remained until they went into exile on 20 June 1791.Marie Antoinette continued to perform charitable functions and attend religious ceremonies, but dedicated most of her time to her children. She also played an important political, albeit not public, role between 1789 and 1791 when she had a complex set of relationships with several key actors of the early period of the French Revolution. One of the most important was Necker, the Prime Minister of Finances (Premier ministre des finances). Despite her dislike of him, she played a decisive role in his return to the office. She blamed him for his support of the Revolution and did not regret his resignation in 1790.Lafayette, one of the former military leaders in the American War of Independence (1775–1783), served as the warden of the royal family in his position as commander-in-chief of the Garde Nationale. Despite his dislike of the queen—he detested her as much as she detested him and at one time had even threatened to send her to a convent—he was persuaded by the mayor of Paris, Jean Sylvain Bailly, to work and collaborate with her, and allowed her to see Fersen a number of times. He even went as far as exiling the Duke of Orléans, who was accused by the queen of fomenting trouble. His relationship with the king was more cordial. As a liberal aristocrat, he did not want the fall of the monarchy but rather the establishment of a liberal one, similar to that of Great Britain, based on cooperation between the king and the people, as was to be defined in the Constitution of 1791."}, {"text": "== French Revolution before Varennes (1789–1791) ==Despite her attempts to remain out of the public eye, Marie Antoinette was falsely accused in the libelles of having an affair with Lafayette, whom she loathed, and, as was published in Le Godmiché Royal (\"The Royal Dildo\"), and of having a sexual relationship with the English baroness Lady Sophie Farrell of Bournemouth, a well-known lesbian of the time. Publication of such calumnies continued to the end, climaxing at her trial with an accusation of incest with her son. There is no evidence to support the accusations."}, {"text": "=== Mirabeau ===A significant achievement of Marie Antoinette in that period was the establishment of an alliance with Honoré Gabriel Riqueti, Comte de Mirabeau, the most important lawmaker in the assembly. Like Lafayette, Mirabeau was a liberal aristocrat. He had joined the Third Estate and was not against the monarchy, but wanted to reconcile it with the Revolution. He also wanted to be a minister and was not immune to corruption. On the advice of Mercy, Marie Antoinette opened secret negotiations with him and both agreed to meet privately at the château de Saint-Cloud on 3 July 1790, where the royal family was allowed to spend the summer, free of the radical elements who watched their every move in Paris. At the meeting, Mirabeau was much impressed by the queen, and remarked in a letter to Auguste Marie Raymond d'Arenberg, Comte de la Marck, that she was the only person the king had by him: La Reine est le seul homme que le Roi ait auprès de Lui. An agreement was reached turning Mirabeau into one of her political allies: Marie Antoinette promised to pay him 6000 livres per month and one million if he succeeded in his mission to restore the king's authority.The only time the royal couple returned to Paris in that period was on 14 July to attend the Fête de la Fédération, an official ceremony held at the Champ de Mars in commemoration of the fall of the Bastille one year earlier. At least 300,000 persons participated from all over France, including 18,000 national guards, with Talleyrand, bishop of Autun, celebrating a mass at the autel de la Patrie (\"altar of the fatherland\"). The king was greeted at the event with loud cheers of \"Long live the King!\", especially when he took the oath to protect the nation and to enforce the laws voted by the Constitutional Assembly. There were even cheers for the queen, particularly when she presented the dauphin to the public.Mirabeau sincerely wanted to reconcile the queen with the people, and she was happy to see him restoring much of the king's powers, such as his authority over foreign policy, and the right to declare war. Over the objections of Lafayette and his allies, the king was given a suspensive veto allowing him to veto any laws for a period of four years. With time, Mirabeau would support the queen, even more, going as far as to suggest that Louis XVI \"adjourn\" to Rouen or Compiègne. This leverage with the Assembly ended with the death of Mirabeau in April 1791, despite the attempt of several moderate leaders of the Revolution to contact the queen to establish some basis of cooperation with her."}, {"text": "=== Civil Constitution of the Clergy ===In March 1791 Pope Pius VI had condemned the Civil Constitution of the Clergy, reluctantly signed by Louis XVI, which reduced the number of bishops from 132 to 93, imposed the election of bishops and all members of the clergy by departmental or district assemblies of electors, and reduced the pope's authority over the Church. Religion played an important role in the life of Marie Antoinette and Louis XVI, both raised in the Roman Catholic faith. The queen's political ideas and her belief in the absolute power of monarchs were based on France's long-established tradition of the divine right of kings. On 18 April, as the royal family prepared to leave for Saint-Cloud to attend Easter mass celebrated by a refractory priest, a crowd, soon joined by the Garde Nationale (disobeying Lafayette's orders), prevented their departure from Paris, prompting Marie Antoinette to declare to Lafayette that she and her family were no longer free. This incident fortified her in her determination to leave Paris for personal and political reasons, not alone, but with her family. Even the king, who had been hesitant, accepted his wife's decision to flee with the help of foreign powers and counter-revolutionary forces. Fersen and Breteuil, who represented her in the courts of Europe, were put in charge of the escape plan, while Marie Antoinette continued her negotiations with some of the moderate leaders of the French Revolution."}, {"text": "== Flight, arrest at Varennes and return to Paris (21–25 June 1791) ==There had been several plots designed to help the royal family escape, which the Queen had rejected because she would not leave without the king, or which had ceased to be viable because of the king's indecision. Once Louis XVI finally did commit to a plan, its poor execution was the cause of its failure. In an elaborate attempt known as the Flight to Varennes to reach the royalist stronghold of Montmédy, some members of the royal family were to pose as the servants of an imaginary \"Mme de Korff\", a wealthy Russian baroness, a role played by Louise-Élisabeth de Croÿ de Tourzel, governess of the royal children."}, {"text": "== Flight, arrest at Varennes and return to Paris (21–25 June 1791) ==After many delays, the escape was ultimately attempted on 21 June 1791, but the entire family was arrested less than 24 hours later at Varennes and taken back to Paris within a week. The escape attempt destroyed much of the remaining support of the population for the king.Upon learning of the capture of the royal family, the National Constituent Assembly sent three representatives, Antoine Barnave, Jérôme Pétion de Villeneuve and Charles César de Fay de La Tour-Maubourg to Varennes to escort Marie Antoinette and her family back to Paris. On the way to the capital they were jeered and insulted by the people as never before. The prestige of the French monarchy had never been at such a low level. During the trip, Barnave, the representative of the moderate party in the Assembly, protected Marie Antoinette from the crowds, and even Pétion took pity on the royal family. Brought safely back to Paris, they were met with total silence by the crowd. Thanks to Barnave, the royal couple was not brought to trial and was publicly exonerated of any crime in relation with the attempted escape.Marie Antoinette's first Lady of the Bedchamber, Mme Campan, wrote about what happened to the queen's hair on the night of 21–22 June, \"...in a single night, it had turned white as that of a seventy-year-old woman.\" (En une seule nuit ils étaient devenus blancs comme ceux d'une femme de soixante-dix ans.)"}, {"text": "== Radicalization of the Revolution after Varennes (1791–92) ==After their return from Varennes and until the storming of the Tuileries on 10 August 1792, the queen, her family and entourage were held under tight surveillance by the Garde Nationale in the Tuileries, where the royal couple was guarded night and day. Four guards accompanied the queen wherever she went, and her bedroom door had to be left open at night. Her health also began to deteriorate, thus further reducing her physical activities.On 17 July 1791, with the support of Barnave and his friends, Lafayette's Garde Nationale opened fire on the crowd that had assembled on the Champ de Mars to sign a petition demanding the deposition of the king. The estimated number of those killed varies between 12 and 50. Lafayette's reputation never recovered from the event and, on 8 October, he resigned as commander of the Garde Nationale. Their enmity continuing, Marie Antoinette played a decisive role in defeating him in his aims to become the mayor of Paris in November 1791.As her correspondence shows, while Barnave was taking great political risks in the belief that the queen was his political ally and had managed, despite her unpopularity, to secure a moderate majority ready to work with her, Marie Antoinette was not considered sincere in her cooperation with the moderate leaders of the French Revolution, which ultimately ended any chance to establish a moderate government. Moreover, the view that the unpopular queen was controlling the king further degraded the royal couple's standing with the people, which the Jacobins successfully exploited after their return from Varennes to advance their radical agenda to abolish the monarchy. This situation lasted until the spring of 1792.Marie Antoinette continued to hope that the military coalition of European kingdoms would succeed in crushing the Revolution. She counted most on the support of her Austrian family. After the death of her brother Joseph in 1790, his successor, Leopold, was willing to support her to a limited degree. It was her hope that the threat of Austria's advancing military would deter further escalation of revolutionary violence. In a letter to her brother, penned in September of 1791, Marie Antoinette expressed how she expected the revolution to react: \"...it will be effected by the approach of the war and not by the war itself. The King, his powers restored, will be entrusted with negotiations with the foreign powers, and the princes will return, in the general tranquillity, to reassume their ranks at his court and in the nation.\" In the same letter, she wrote that the fall of France's monarchy and the subsequent rise of revolutionary principles would be \"destructive to all governments.\""}, {"text": "== Radicalization of the Revolution after Varennes (1791–92) ==Upon Leopold's death in 1792, his son, Francis, a conservative ruler, was ready to support the cause of the French royal couple more vigorously because he feared the consequences of the French Revolution and its ideas for the monarchies of Europe, particularly, for Austria's influence in the continent.Barnave had advised the Queen to call back Mercy, who had played such an important role in her life before the Revolution, but Mercy had been appointed to another foreign diplomatic position  and could not return to France. At the end of 1791, ignoring the danger she faced, the Princesse de Lamballe, who was in London, returned to the Tuileries. As for Fersen, despite the strong restrictions imposed on the Queen, he was able to see her a final time in February 1792."}, {"text": "== Events leading to the abolition of the monarchy on 10 August 1792 ==Leopold's and Francis II's strong action on behalf of Marie Antoinette led to France's declaration of war on Austria on 20 April 1792. This resulted in the queen being viewed as an enemy, although she was personally against Austrian claims to French territories on European soil. That summer, the situation was compounded by multiple defeats of the French armies by the Austrians, in part because Marie Antoinette passed on military secrets to them. In addition, at the insistence of his wife, Louis XVI vetoed several measures that would have further restricted his power, earning the royal couple the nicknames \"Monsieur Veto\" and \"Madame Veto\", nicknames then prominently featured in different contexts, including La Carmagnole."}, {"text": "== Events leading to the abolition of the monarchy on 10 August 1792 ==Barnave remained the most important advisor and supporter of the queen, who was willing to work with him as long as he met her demands, which he did to a large extent. Barnave and the moderates comprised about 260 lawmakers in the new Legislative Assembly; the radicals numbered around 136, and the rest around 350. Initially, the majority was with Barnave, but the queen's policies led to the radicalization of the Assembly and the moderates lost control of the legislative process. The moderate government collapsed in April 1792 to be replaced by a radical majority headed by the Girondins. The Assembly then passed a series of laws concerning the Church, the aristocracy and the formation of new national guard units; all were vetoed by Louis XVI. While Barnave's faction had dropped to 120 members, the new Girondin majority controlled the legislative assembly with 330 members. The two strongest members of that government were Jean Marie Roland, who was minister of interior, and General Charles François Dumouriez, the minister of foreign affairs. Dumouriez sympathized with the royal couple and wanted to save them but he was rebuffed by the Queen.Marie Antoinette's actions in refusing to collaborate with the Girondins, in power between April and June 1792, led them to denounce the treason of the Austrian comity, a direct allusion to the Queen. After Madame Roland sent a letter to the King denouncing the Queen's role in these matters, urged by the Queen, Louis XVI disbanded  the government, thus losing his majority in the Assembly. Dumouriez resigned and refused a post in any new government. At this point, the tide against royal authority intensified in the population and political parties, while Marie Antoinette encouraged the king to veto the new laws voted by the Legislative Assembly in 1792. In August 1791, the Declaration of Pillnitz threatened an invasion of France. This led in turn to a French declaration of war in April 1792, which led to the French Revolutionary Wars and to the events of August 1792, which ended the monarchy."}, {"text": "== Events leading to the abolition of the monarchy on 10 August 1792 ==On 20 June 1792, \"a mob of terrifying aspect\" broke into the Tuileries, made the King wear the bonnet rouge (red Phrygian cap) to show his loyalty to the Revolution, insulted Marie Antoinette, accusing her of betraying France, and threatened her life. In consequence, the Queen asked Fersen to urge the foreign powers to carry out their plans to invade France and to issue a manifesto in which they threatened to destroy Paris if anything happened to the royal family. The Brunswick Manifesto, issued on 25 July 1792, triggered the events of 10 August when the approach of an armed mob on its way to the Tuileries Palace forced the royal family to seek refuge at the Legislative Assembly. Ninety minutes later, the palace was invaded by the mob, who massacred the Swiss Guards. On 13 August the royal family was imprisoned in the tower of the Temple in the Marais under conditions considerably harsher than those of their previous confinement in the Tuileries.A week later, several of the royal family's attendants, among them the Princesse de Lamballe, were taken for interrogation by the Paris Commune. Transferred to the La Force prison, after a rapid judgment, Marie Louise de Lamballe was savagely killed on 3 September. Her head was affixed on a pike and paraded through the city to the Temple for the Queen to see. Marie Antoinette was prevented from seeing it, but fainted upon learning of it.On 21 September 1792, the fall of the monarchy was officially declared and the National Convention became the governing body of the French Republic. The royal family name was downgraded to the non-royal \"Capets\". Preparations began for the trial of the former King in a court of law."}, {"text": "=== Louis XVI's trial and execution ===Charged with treason against the French Republic, Louis XVI was separated from his family and tried in December. He was found guilty by the Convention, led by the Jacobins who rejected the idea of keeping him as a hostage. On 15 January 1793, by a majority of six votes, he was condemned to death by guillotine and executed on 21 January 1793."}, {"text": "== Marie Antoinette in the Temple ==The former queen, now called \"Widow Capet\", plunged into deep mourning. She still hoped her son Louis-Charles, whom the exiled Comte de Provence, Louis XVI's brother, had recognized as Louis XVI's successor, would one day rule France. The royalists and the refractory clergy, including those preparing the insurrection in Vendée, supported Marie Antoinette and the return to the monarchy. Throughout her imprisonment and up to her execution, Marie Antoinette could count on the sympathy of conservative factions and social-religious groups which had turned against the Revolution, and also on wealthy individuals ready to bribe republican officials to facilitate her escape; these plots all failed. While imprisoned in the Tower of the Temple, Marie Antoinette, her children and Élisabeth were insulted, some of the guards going as far as blowing smoke in the former queen's face. Strict security measures were taken to assure that Marie Antoinette was not able to communicate with the outside world. Despite these measures, several of her guards were open to bribery and a line of communication was kept with the outside world.After Louis's execution, Marie Antoinette's fate became a central question of the National Convention. While some advocated her death, others proposed exchanging her for French prisoners of war or for a ransom from the Holy Roman Emperor. Thomas Paine advocated exile to America. In April 1793, during the Reign of Terror, a Committee of Public Safety, dominated by Robespierre, was formed, and men such as Jacques Hébert began to call for Marie Antoinette's trial. By the end of May, the Girondins had been chased from power. Calls were also made to \"retrain\" the eight-year-old Louis XVII, to make him pliant to revolutionary ideas. To carry this out, Louis Charles was separated from his mother on 3 July after a struggle during which his mother fought in vain to retain her son, who was handed over to Antoine Simon, a cobbler and representative of the Paris Commune. Until her removal from the Temple, Marie Antoinette spent hours trying to catch a glimpse of her son, who, within weeks, had been made to turn against her, accusing his mother of wrongdoing."}, {"text": "=== Conciergerie ===On the night of 1 August, at 1:00 in the morning, Marie Antoinette was transferred from the Temple to an isolated cell in the Conciergerie as 'Prisoner nº 280'. Leaving the Tower she bumped her head against the lintel of a door, which prompted one of her guards to ask her if she was hurt, to which she answered, \"No! Nothing now can hurt me.\" This was the most difficult period of her captivity. She was under constant surveillance with no privacy. The \"Carnation Plot\" (Le complot de l'œillet), an attempt to help her escape at the end of August, was foiled due to the inability to corrupt all the guards. She was attended by Rosalie Lamorlière, who took care of her as much as she could. At least once she received a visit by a Catholic priest."}, {"text": "== Trial and execution (14–16 October 1793) ==Marie Antoinette was tried by the Revolutionary Tribunal on 14 October 1793. Some historians believe the outcome of the trial had been decided in advance by the Committee of Public Safety around the time the Carnation Plot was uncovered. She and her lawyers were given less than one day to prepare her defense. Among the accusations, many previously published in the libelles, were: orchestrating orgies in Versailles, sending millions of livres of treasury money to Austria, planning the massacre of the gardes françaises (National Guards) in 1792, declaring her son to be the new King of France, and incest, a charge made by her son Louis Charles, pressured into doing so by the radical Jacques Hébert who controlled him. "}, {"text": "== Trial and execution (14–16 October 1793) ==This last accusation drew an emotional response from Marie Antoinette, who refused to respond to this charge, instead appealing to all mothers present in the room. Their reaction comforted her since these women were not otherwise sympathetic to her. Upon being pressed further by a juror to address the accusations of incest, the queen replied, \"If I did not respond, it was because it would be against nature for a mother to reply to such an accusation. On this I appeal to all mothers who may be here.\" When a juror, Joachim Vilate, told Robespierre of this over dinner, Robespierre broke his plate in anger, declaring \"That imbecile Hébert!\""}, {"text": "== Trial and execution (14–16 October 1793) ==Early on 16 October, Marie Antoinette was declared guilty of the three main charges against her: depletion of the national treasury, conspiracy against the internal and external security of the State, and high treason because of her intelligence activities in the interest of the enemy; the latter charge alone was enough to condemn her to death. At worst, she and her lawyers had expected life imprisonment. In the hours left to her, she composed a letter to her sister-in-law Madame Élisabeth, affirming her clear conscience, her Catholic faith, and her love and concern for her children. The letter did not reach Élisabeth. Her will was part of the collection of papers of Robespierre found under his bed and was published by Edme-Bonaventure Courtois.Preparing for her execution, she had to change clothes in front of her guards. She wanted to wear a black dress but was forced to wear a plain white dress, white being the colour worn by widowed queens of France. Her hair was shorn, her hands bound painfully behind her back and she was put on a rope leash. Unlike her husband, who had been taken to his execution in a carriage (carrosse), she had to sit in an open cart (charrette) for the hour it took to convey her from the Conciergerie via the rue Saint-Honoré thoroughfare to reach the guillotine erected in the Place de la Révolution (the present-day Place de la Concorde). She maintained her composure, despite the insults of the jeering crowd. A constitutional priest was assigned to hear her final confession. He sat by her in the cart, but she ignored him all the way to the scaffold as he had pledged his allegiance to the republic.Marie Antoinette was guillotined at 12:15 p.m. on 16 October 1793. Her last words are recorded as, \"Pardonnez-moi, monsieur. Je ne l'ai pas fait exprès\" or \"Pardon me, sir, I did not do it on purpose\", after accidentally stepping on her executioner's shoe. Marie Tussaud was employed to make a death mask of her head. Her body was thrown into an unmarked grave in the Madeleine cemetery, located close by in rue d'Anjou. Because its capacity was exhausted the cemetery was closed the following year, on 25 March 1794."}, {"text": "=== Foreign response ===After her execution, Marie Antoinette became a symbol abroad, and a controversial figure of the French Revolution. Some used her as a scapegoat to blame for the events of the Revolution. Thomas Jefferson, writing in 1821, claimed that \"Her inordinate gambling and dissipations, with those of the Count d’Artois, and others of her clique, had been a sensible item in the exhaustion of the treasury, which called into action the reforming hand of the nation; and her opposition to it, her inflexible perverseness, and dauntless spirit, led herself to the Guillotine,\" adding that \"I have ever believed that, had there been no Queen, there would have been no revolution.\""}, {"text": "=== Foreign response ===Others were shocked by her fate and viewed it as evidence of the dangers of Revolution. In his 1790 treatise, Reflections on the Revolution in France, which was written during Marie Antoinette's imprisonment in Paris, but prior to her execution, Edmund Burke lamented that \"the age of chivalry is gone. That of sophisters, economists, and calculators has succeeded, and the glory of Europe is extinguished forever\" and now \"Never, never more, shall we behold that generous loyalty to rank and sex.\" After receiving the news, Maria Carolina, Queen of Naples and close sister to Marie Antoinette, spiraled into a state of mourning and an anger against the revolutionaries. She quickly suspended protections of reformers and intellectuals in Naples, allowed Neapolitan bishops wide latitude to halt the secularization of the country, and offered succor to the overflowing number of émigrés fleeing from revolutionary France, many of whom were granted pensions."}, {"text": "=== Bourbon Restoration ===Both Marie Antoinette's and Louis XVI's bodies were exhumed on 18 January 1815, during the Bourbon Restoration, when the Comte de Provence ascended the newly reestablished throne as Louis XVIII, King of France and of Navarre. Christian burial of the royal remains took place three days later, on 21 January, in the necropolis of French kings at the Basilica of Saint-Denis."}, {"text": "== Legacy ==For many revolutionary figures, Marie Antoinette was the symbol of what was wrong with the old regime in France. The onus of having caused the financial difficulties of the nation was placed on her shoulders by the revolutionary tribunal, and under the new republican ideas of what it meant to be a member of a nation, her Austrian descent and continued correspondence with the competing nation made her a traitor. The people of France saw her death as a necessary step toward completing the revolution. Furthermore, her execution was seen as a sign that the revolution had done its work.Marie Antoinette is also known for her taste for fine things, and her commissions from famous craftsmen, such as Jean Henri Riesener, suggest more about her enduring legacy as a woman of taste and patronage. For instance, a writing table attributed to Riesener, now located at Waddesdon Manor, bears witness to Marie Antoinette's desire to escape the oppressive formality of court life, when she decided to move the table from the queen's boudoir, de la Meridienne, at Versailles to her humble interior, the Petit Trianon. Her favourite objects filled her small, private chateau and reveal aspects of Marie Antoinette's character that have been obscured by satirical political prints, such as those in Les Tableaux de la Révolution. She owned several instruments. In 1788 she bought a piano made by Sébastien Érard.A catalog of Marie Antoinette's personal library of 736 volumes was published by Paul Lacroix in 1863, using his pseudonym P.L. Jacob. The listed books were from her library at the Petit Trianon, including many found in her boudoir, and mostly consist of novels and plays. A random selection of her books includes Histoire de Mademoiselle de Terville by dame de. Madeleine d'Arsant Puisieux, Le Philosophe parvenu ou Lettres et pièces originales contenant les aventures d'Eugène Sans-Pair by Robert-Martin Lesuire, and Oeuvres mêlées... contenant des tragédies et différents ouvrages en vers et en prose by dame Gabriel de. Madeleine-Angélique Poisson Gomez. A larger and more official library belonging to Marie Antoinette was kept at the Tuileries Palace in Paris.Long after her death, Marie Antoinette remains a major historical figure linked with conservatism, the Catholic Church, wealth and fashion. She has been the subject of a number of books, films, and other media. Politically engaged authors have deemed her the quintessential representative of class conflict, western aristocracy and absolutism. Some of her contemporaries, such as Thomas Jefferson, attributed to her the start of the French Revolution."}, {"text": "=== In popular culture ===The phrase \"Let them eat cake\" is often attributed to Marie Antoinette, but there is no evidence that she ever uttered it, and it is now generally regarded as a journalistic cliché. This phrase originally appeared in Book VI of the first part of Jean-Jacques Rousseau's autobiographical work Les Confessions, finished in 1767 and published in 1782: \"Enfin Je me rappelai le pis-aller d'une grande Princesse à qui l'on disait que les paysans n'avaient pas de pain, et qui répondit: Qu'ils mangent de la brioche\" (\"Finally I recalled the stopgap solution of a great princess who was told that the peasants had no bread, and who responded: 'Let them eat brioche'\"). Rousseau ascribes these words to a \"great princess\", but the purported writing date precedes Marie Antoinette's arrival in France. Some think that he invented it altogether.In the United States, expressions of gratitude to France for its help in the American Revolution included naming a city Marietta, Ohio, in 1788. Her life has been the subject of many films, such as Marie Antoinette (1938) and Marie Antoinette (2006).In 2020, a silk shoe that belonged to her was sold in an auction in the Palace of Versailles for 43,750 euros ($51,780).In 2022, her story was dramatised by a Canal+ and BBC English-language television series."}, {"text": "== Children ==In addition to her biological children, Marie Antoinette adopted four children: \"Armand\" Francois-Michel Gagné, a poor orphan adopted in 1776; Jean Amilcar, a Senegalese slave boy given to the queen as a present by Chevalier de Boufflers in 1787, but whom she instead freed, baptized, adopted and placed in a pension; Ernestine Lambriquet, daughter of two servants at the palace, who was raised as the playmate of her daughter Marie-Thérèse and whom she adopted after the death of her mother in 1788; and finally \"Zoe\" Jeanne Louise Victoire, who was adopted in 1790 along with her two older sisters when her parents, an usher and his wife in service of the King, had died. Of these, only Armand, Ernestine, and Zoe actually lived with the royal family: Jean Amilcar, along with the elder siblings of Zoe and Armand who were also formally foster children of the royal couple, simply lived at the queen's expense until her imprisonment, which proved fatal for at least Amilcar, as he was evicted from the boarding school when the fee was no longer paid, and reportedly starved to death on the street. Armand and Zoe had a position which was more similar to that of Ernestine; Armand lived at court with the king and queen until he left them at the outbreak of the Revolution because of his republican sympathies, and Zoe was chosen to be the playmate of the dauphin, just as Ernestine had once been selected as the playmate of Marie-Thérèse, and later sent away to her sisters in a convent boarding school before the Flight to Varennes in 1791."}, {"text": "== External links ==Marie Antoinette's official Versailles profile on en.chateauversailles.fr"}, {"text": "== External links ==The marais of Marie-Antoinette on parismarais.com"}, {"text": "== External links ==Celebrating Marie-Antoinette blog article on waddesdon.org.uk"}, {"text": "== External links ==Marie Antoinette: a childhood overshadowed by politics on habsburger.net"}]