[{"text": "Thomas Mark Harmon (born September 2, 1951) is an American actor and former football player. He is perhaps best known for playing the lead role of Leroy Jethro Gibbs on NCIS. He has appeared in a wide variety of television roles since the early 1970s, including Dr. Robert Caldwell on St. Elsewhere, Detective Dicky Cobb on Reasonable Doubts, and Dr. Jack McNeil on Chicago Hope. He also starred in such films as Summer School, Prince of Bel Air, Stealing Home, Wyatt Earp, Fear and Loathing in Las Vegas, Freaky Friday, and Chasing Liberty."}, {"text": "Harmon played Secret Service special agent Simon Donovan in a four-episode story arc in The West Wing in 2002, receiving an Emmy Award nomination for the role."}, {"text": "Harmon's character of NCIS special agent Leroy Jethro Gibbs was introduced in a guest starring role in two episodes of JAG. From 2003 to 2021, Harmon starred in the spinoff NCIS as the same character."}, {"text": "== Early life ==Harmon was born in Burbank, California, the youngest of three children. His parents were Heisman Trophy–winning football player and broadcaster Tom Harmon and actress, model, and artist Elyse Knox (née Elsie Lillian Kornbrath)."}, {"text": "== Early life ==Harmon had two older sisters, the late actress and painter Kristin Nelson, who was divorced from the late singer Rick Nelson, and actress and model Kelly Harmon, formerly married to car magnate John DeLorean. His maternal grandparents were Austrian immigrants."}, {"text": "=== College football ===After his high school graduation from Harvard-Westlake School in 1970, Harmon completed a two-year associate degree at Pierce College in Los Angeles. After his second season at Pierce, 1971, Harmon received offers from major college football programs, ultimately choosing UCLA over Oklahoma, even though in the previous season, 1971, the Sooners finished second in the nation, while the Bruins had stumbled to a 2–7–1 record, placing last in the Pac-8."}, {"text": "=== College football ===After transferring to the University of California, Los Angeles, he started at quarterback for the 1972 and 1973 Bruins."}, {"text": "=== College football ===During his first game, his UCLA team produced a stunning upset of the two-time defending national champion Nebraska Cornhuskers. The Bruins were an eighteen-point home underdog to the top-ranked Huskers but won 20–17 on a late field goal by Efren Herrera at L.A. Coliseum."}, {"text": "=== College football ===In his senior year, Harmon received the National Football Foundation Award for All-Round Excellence. During his two years as quarterback in coach Pepper Rodgers's wishbone offense, UCLA compiled a 17–5 record (.773). Harmon was UCLA's starting quarterback for two seasons, but he was not picked in the 1974 NFL Draft."}, {"text": "=== College football ===Harmon graduated cum laude from UCLA in 1974 with a B.A. in Communications."}, {"text": "=== College football ===He was inducted into the inaugural class of the Pierce College Athletic Hall of Fame in 2010."}, {"text": "=== Early career ===After college, Harmon considered pursuing a career in advertising or law. Harmon started his career in business as a merchandising director, but soon decided to switch to acting. He spent much of his career portraying law enforcement and medical personnel. One of his first national TV appearances (other than as an athlete) was in a commercial for Kellogg's Product 19 cereal with his father, Tom Harmon, its longstanding TV spokesman. Thanks to his sister Kristin's in-laws, Ozzie Nelson and Harriet Nelson, he landed his first job as an actor in an episode of Ozzie's Girls. This was followed by guest roles in episodes of Adam-12, Police Woman, and Emergency! in mid-1975. He also performed in \"905-Wild\", a backdoor pilot episode for a series about two L.A. County Animal Control Officers which did not sell. Producer/creator Jack Webb, who was the packager of both series, later cast Harmon in Sam, a short-lived 1978 series about an LAPD officer and his K-9 partner. Before this, Harmon received an Emmy nomination for Outstanding Supporting Actor in a Miniseries or a Movie for his performance as Robert Dunlap in the TV movie Eleanor and Franklin: The White House Years. In 1978, he appeared in three episodes of the mini-series, Centennial, as Captain John MacIntosh, an honorable Union cavalry officer."}, {"text": "=== Early career ===During the mid- to late-1970s,  Harmon made guest appearances on TV series, including Laverne & Shirley, Delvecchio, The Hardy Boys/Nancy Drew Mysteries, and had supporting roles in the feature films Comes a Horseman (1978) and Beyond the Poseidon Adventure (1979). He then landed a co-starring role on the 1979 action series 240-Robert as Deputy Dwayne Thibideaux. The series centered around the missions of the Los Angeles County Sheriff's Department Emergency Services Detail, but was also short-lived."}, {"text": "=== Early career ===In 1980, Harmon gained a regular role in the prime time soap opera Flamingo Road, in which he played Fielding Carlisle, the husband of Morgan Fairchild's character. Despite initially good ratings, the series was canceled after two seasons. Following its cancellation, he landed the role of Dr. Robert Caldwell on the series St. Elsewhere in 1983. Harmon appeared in the show for almost three seasons before leaving in early 1986 when his character contracted HIV through unprotected intercourse, one of the first instances where a major recurring television character contracted the virus (the character's subsequent off-screen death from AIDS would be mentioned two years later). In the mid-1980s, Harmon also became the spokesperson for Coors Regular beer, appearing in television commercials for them."}, {"text": "=== Early career ===Harmon's career reached several other high points in 1986. In January, he was named People magazine's Sexiest Man Alive. Following his departure from St. Elsewhere in February, he played the lead in the TV movies Prince of Bel Air, co-starring with Kirstie Alley, and The Deliberate Stranger, in which he portrayed the real-life serial killer Ted Bundy. With his career blossoming, he played a role in the 1986 theatrical film Let's Get Harry and the lead role in the 1987 comedy Summer School, again co-starring with Kirstie Alley and alongside future JAG and NCIS alum Patrick Labyorteaux. Returning briefly to episodic television in 1987, Harmon had a limited engagement on the series Moonlighting, playing Cybill Shepherd's love interest Sam Crawford for four episodes. He then starred in the 1987 TV movie After the Promise. In 1988, he co-starred with Sean Connery and Meg Ryan in the 1988 feature film The Presidio, and also opposite Jodie Foster in the film Stealing Home. After his 1989 comedy Worth Winning, he returned to television, appearing in various television movies."}, {"text": "=== Early career ===Harmon's next regular television role would be as Chicago police detective Dickie Cobb for two seasons (1991–1993) on the NBC series Reasonable Doubts. In 1993, he appeared in one episode in the role of a rodeo clown on the CBS comedy/western series Harts of the West with future NCIS castmate Sean Murray."}, {"text": "=== Early career ===In 1995, Harmon starred in the ABC series Charlie Grace, in which he portrayed a private investigator. The series lasted only one season, after which he returned to ensemble medical shows on the series Chicago Hope, in which he played Dr. Jack McNeil from 1996 to 2000. He also portrayed astronaut Wally Schirra in one episode of the 1998 mini-series From the Earth to the Moon."}, {"text": "=== NCIS ===In May 2002, Harmon portrayed Secret Service special agent Simon Donovan on The West Wing in a four-episode story arc. The role gained him his second Emmy Award nomination, exactly 25 years after his first. Donald P. Bellisario, the creator of JAG and NCIS saw him on The West Wing and had Harmon appear in a guest starring role in two episodes of JAG in April 2003, where Harmon was introduced as the character of NCIS agent Leroy Jethro Gibbs. Starting that September, Harmon has starred as Gibbs in the CBS drama NCIS, a role which has earned him six nominations at the People's Choice Awards including a win for Favorite TV Crime Drama Actor in 2017. During his time on the show, he was reunited with three of his former Chicago Hope co-stars, Rocky Carroll, Lauren Holly, and Jayne Brook. Since 2008, he has also been a producer and executive producer."}, {"text": "=== NCIS ===In the fourth episode of the show's nineteenth season, Harmon's Gibbs exited the series as a regular, an exit set in motion by the events of the previous season finale."}, {"text": "=== Other activities ===In 2003, Harmon had a supporting role in the remake of the comedy film Freaky Friday. Harmon has also starred in several stage productions in Los Angeles and Toronto. At the Cast Theatre in Los Angeles, he performed in Wrestlers and The Wager. In the late Eighties he was part of the cast of the Canadian premiere of Key Exchange. Several productions of Love Letters provided him the opportunity to play alongside his wife Pam Dawber."}, {"text": "=== Other activities ===Harmon received the 2,482nd star of the Hollywood Walk of Fame on October 1, 2012. In 2014, Harmon started a production company called Wings Productions to produce NCIS: New Orleans. As of 2018, Harmon works as a producer for a new CBS series, based on author John Sandford's best-selling Prey novels, which have sold more than 30 million copies worldwide. The last 10 have reached No. 1 on The New York Times best-seller list."}, {"text": "=== Other activities ===Harmon also directed two episodes of Chicago Hope in 1999 and 2000, and two episodes of Boston Public in 2002."}, {"text": "=== Other activities ===In 2023 Harmon, with retired NCIS Special Agent Leon Carroll Jr., released Ghosts of Honolulu: A Japanese spy, a Japanese American spy hunter, and the untold story of Pearl Harbor. Harmon also narrates the audio book."}, {"text": "== Personal life ==Harmon is the son of football player Tom Harmon and actress Elyse Knox. His sisters are Kelly, an actress and model, and Kristin, an actress and painter. Kristin died of a heart attack on April 27, 2018."}, {"text": "== Personal life ==Harmon has been married to actress Pam Dawber since March 21, 1987. The couple has two sons. His son Sean played a young Gibbs in several NCIS episodes. They maintain a low profile and rarely appear in public with their children. Harmon was the brother-in-law of Ricky Nelson and John DeLorean and is the uncle of actress Tracy Nelson and singers Matthew and Gunnar Nelson of the rock duo Nelson."}, {"text": "== Personal life ==In 1987, Harmon filed for custody of his nephew Sam, Kristin's son, on the grounds that she was incapable of good parenting. Sam's psychiatrist testified that the thirteen-year-old boy depicted his mother as a dragon and complained about her mood swings and how she prevented him from being with his siblings. Harmon later dropped the custody bid."}, {"text": "== Personal life ==In 1988, Harmon was part owner of a minor league baseball team, the San Bernardino Spirit, the same season Ken Griffey Jr. played for the team before his major league call-up to the Seattle Mariners the next season. Harmon used the team and their home field, Fiscalini Field, for the opening and closing scenes of the film in which he was starring, Stealing Home."}, {"text": "== Personal life ==In 1996, Harmon saved a teenage boy involved in a car accident outside his Brentwood home. The driver had been able to escape, but the passenger was trapped in the burning car. Dawber telephoned emergency services, while Harmon used a sledgehammer from his garage to break the window of the car and pulled the passenger from the vehicle. The passenger suffered severe burns but survived his injuries."}, {"text": "== Further reading ==Coyne, Kate (March 4, 2019). \"Mark Harmon: Built to Last\". People. Vol. 91, no. 10. pp. 40–46."}, {"text": "== External links ==Mark Harmon at IMDb "}, {"text": "== External links ==Mark Harmon at the TCM Movie Database"}, {"text": "== External links ==Mark Harmon at Emmys.com"}, {"text": "== External links ==Mark Harmon at TV Guide"}]