[{"text": "Mark Cuban (born July 31, 1958) is an American businessman and television personality. He is the former principal owner and current minority owner of the Dallas Mavericks of the National Basketball Association (NBA), co-owner of 2929 Entertainment, and one of the main \"sharks\" on the ABC reality television series Shark Tank."}, {"text": "Born in Pittsburgh, Pennsylvania, Cuban's entrepreneurial actions manifested early with ventures ranging from selling garbage bags to running newspapers during a strike. He graduated from the Kelley School of Business at Indiana University and embarked on a diverse business career that included founding MicroSolutions and Broadcast.com, both of which he sold at substantial profits. Cuban's investments span various industries, from technology and media to sports and entertainment. He has been a prominent figure in the NBA, known for his active involvement with the Mavericks (with which he won the 2011 NBA Championship as owner) and frequent disputes with the league's management. Outside of business, Cuban has been involved in philanthropy, political commentary, and involvement in reality television."}, {"text": "== Early life and education ==Cuban was born in Pittsburgh, Pennsylvania, on July 31, 1958. His father, Norton Cuban, was an automobile upholsterer. Cuban described his mother, Shirley (née Feldman), as someone with \"a different job or different career goal every other week.\""}, {"text": "== Early life and education ==Cuban is Jewish, and grew up in Mount Lebanon, a suburb of Pittsburgh, in a Jewish working-class family. His paternal grandfather changed the surname from \"Chabenisky\" to \"Cuban\" after his family emigrated from Russia through Ellis Island. His maternal grandparents were Romanian Jewish immigrants, according to Mark's brother Brian, though Mark has claimed his maternal grandmother was from Lithuania."}, {"text": "== Early life and education ==Cuban first ventured into business at age 12. He sold garbage bags to pay for a pair of expensive sneakers. A few years later, he earned money by selling stamps and coins. At age 16, Cuban took advantage of a Pittsburgh Post-Gazette strike by running newspapers from Cleveland to Pittsburgh."}, {"text": "== Early life and education ==Instead of attending high school for his senior year, he enrolled as a full-time student at the University of Pittsburgh, where he joined the Pi Lambda Phi fraternity. After one year at the University of Pittsburgh, Cuban transferred to Indiana University in Bloomington, Indiana, where he graduated from the Kelley School of Business in 1981 with a Bachelor of Science degree in management. He chose Indiana's Kelley School of Business without even visiting the campus because it \"had the least expensive tuition of all the business schools on the top 10 list\". He had various business ventures during college, including a bar, disco lessons, and a chain letter."}, {"text": "== Early life and education ==After graduating, Cuban returned to Pittsburgh and took a job with Mellon Bank, where he immersed himself in the study of machines and networking."}, {"text": "== Business career ==On July 7, 1982, Cuban moved to Dallas, Texas, where he first found a job as a bartender for a Greenville Avenue bar called Elan and then as a salesperson for Your Business Software, one of the earliest PC software retailers in Dallas. He was fired less than a year later after meeting with a client to procure new business instead of opening the store."}, {"text": "== Business career ==Cuban co-founded MicroSolutions with help from his previous customers from Your Business Software. MicroSolutions was initially a system integrator and software reseller. The company was an early proponent of technologies such as Carbon Copy, Lotus Notes, and CompuServe. One of the company's largest clients was Perot Systems. The company grew to more than $30 million in revenue, and in 1990, Cuban sold MicroSolutions to CompuServe—then a subsidiary of H&R Block—for $6 million "}, {"text": "== Business career ==(over $14.7 million  today). He made approximately $2 million after taxes on the deal."}, {"text": "=== Audionet and Broadcast.com ===In 1995, Cuban and fellow Indiana University alumnus Todd Wagner joined Audionet (founded in 1989 by Chris Jaeb, who retained 10% of the company), combining their mutual interest in Indiana Hoosier college basketball and webcasting. With a single server and an ISDN line, Audionet became Broadcast.com in 1998. By 1999, Broadcast.com had grown to 330 employees and $13.5 million in revenue for the second quarter. In 1999, Broadcast.com helped launch the first live-streamed Victoria's Secret Fashion Show. That year, during the dot com boom, Broadcast.com was acquired by Yahoo! for $5.7 billion in Yahoo! stock. After the sale of Broadcast.com, Cuban hedged against the risk of a decline in the value of the Yahoo! shares he received in the deal. "}, {"text": "=== Audionet and Broadcast.com ===The Guinness Book of Records credits Cuban with the \"largest single e-commerce transaction\" after purchasing a Gulfstream V jet for $40 million over the internet in October 1999."}, {"text": "=== Audionet and Broadcast.com ===Yahoo!'s costly purchase of Broadcast.com is now regarded as one of the worst internet acquisitions of all time. Broadcast.com and Yahoo!'s other broadcasting services were discontinued within a few years after the acquisition. Cuban has repeatedly described himself as very lucky to have sold the company before the dot-com bubble burst. However, he also emphasized that he hedged against the Yahoo! shares he received from the sale and would have lost most of his fortune if he had not done so."}, {"text": "=== Audionet and Broadcast.com ===Cuban continues to work with Wagner in another venture, 2929 Entertainment, which provides vertically integrated production and distribution of films and video."}, {"text": "=== Audionet and Broadcast.com ===On September 24, 2003, the firm purchased Landmark Theatres, a chain of 58 arthouse movie theaters. The company is also responsible for the updated version of the TV show Star Search, which was broadcast on CBS. 2929 Entertainment released Bubble, a movie directed by Steven Soderbergh, in 2006."}, {"text": "=== Audionet and Broadcast.com ===Cuban was featured on the cover of Best magazine's November 2003 premiere issue, announcing the arrival of high-definition television. Cuban also was co-founder (with Philip Garvin) of AXS TV (formerly HDNet), the first high-definition satellite television network."}, {"text": "=== Audionet and Broadcast.com ===In February 2004, Cuban announced that he would be working with ABC television to produce a reality television series, The Benefactor. The premise of the six-episode series involved 16 contestants trying to win $1 million by participating in various contests, with their performances being judged by Cuban. It premiered on September 13, 2004, but the series was canceled before the full season aired due to poor ratings."}, {"text": "=== Audionet and Broadcast.com ===In 2018, Cuban was no. 190 on Forbes' list of \"World's Richest People\", with a net worth of $3.9 billion."}, {"text": "=== Audionet and Broadcast.com ===Cuban financially supported Grokster in the Supreme Court case MGM v. Grokster. He is also a partner in Synergy Sports Technology, a web-based basketball scouting and video delivery tool used by many NBA teams."}, {"text": "=== Investments in startups ===Cuban has also assisted ventures in the social software and distributed networking industries. He was an owner of IceRocket, a search engine that scours the blogosphere for content. "}, {"text": "=== Investments in startups ===In 2005, Cuban invested $1.7 million in file-sharing company RedSwoosh, co-founded by Travis Kalanick, providing much-needed capital to the company after the early 2000s recession. Red Swoosh was acquired by Akamai for $19 million in 2007. Kalanick later approached Cuban in 2009 to invest in his next venture Uber at a $10 million valuation. Cuban proposed a $5 million valuation, but never heard back from Kalanick."}, {"text": "=== Investments in startups ===He was also an investor in Weblogs, Inc., which was acquired by AOL."}, {"text": "=== Investments in startups ===In 2005, Cuban invested in Brondell Inc., a San Francisco startup making a high-tech toilet seat called a Swash that works like a bidet but mounts on a standard toilet. \"People tend to approach technology the same way, whether it's in front of them, or behind them\", Cuban joked. He also invested in Goowy Media Inc., a San Diego Internet software startup. In April 2006, Sirius Satellite Radio announced that Cuban would host his own weekly radio talk show, Mark Cuban's Radio Maverick. However, the show has not materialized."}, {"text": "=== Investments in startups ===In July 2006, Cuban financed Sharesleuth.com, a website created by former St. Louis Post-Dispatch investigative reporter Christopher Carey to uncover fraud and misinformation in publicly traded companies. Experimenting with a new business model for making online journalism financially viable, Cuban disclosed that he would take positions in the shares of companies mentioned in Sharesleuth.com in advance of publication. Business and legal analysts questioned the appropriateness of shorting a stock before making public pronouncements which are likely to result in losses in that stock's value. Cuban insisted that the practice is legal in view of full disclosure."}, {"text": "=== Investments in startups ===In April 2007, Cuban partnered with Mascot Books to publish his first children's book, Let's Go, Mavs!. In November 2011, he wrote a 30,000-word e-book, How to Win at the Sport of Business: If I Can Do It, You Can Do It, which he described as \"a way to get motivated\"."}, {"text": "=== Investments in startups ===In October 2008, Cuban started Bailoutsleuth.com as a grassroots, online portal for oversight over the U.S. government's $700 billion \"bailout\" of financial institutions."}, {"text": "=== Investments in startups ===In September 2010, Cuban provided an undisclosed amount of venture capital to store-front analytics company Motionloft. According to the company's CEO Jon Mills, he cold-emailed Cuban on a whim with the business proposition and claimed Cuban quickly responded that he would like to hear more. Mills credited that sentence for launching the company. In November 2013, several investors questioned Cuban about Mills' representation of a pending acquisition of Motionloft. Cuban denied an acquisition was in place. Mills was terminated as CEO of Motionloft by stockholders on December 1, 2013, and in February 2014 was arrested by the FBI and charged with wire fraud; it was alleged that Mills misrepresented to investors that Motionloft was going to be acquired by Cisco. Cuban has gone on record to state that the technology, which at least in part is meant to serve the commercial real estate industry, is \"game changing\" for tenants."}, {"text": "=== Investments in startups ===In 2019, Cuban, Ashton Kutcher, Steve Watts and Watts' wife Angela, acquired a 50% stake in Veldskoen Shoes  USA business. In 2021, Cuban, Pantera Capital, BlockTower, Hashed, Cadenza Ventures (backed by 100x Group), CMS and QCP Capital backed a layer-2 decentralized exchange protocol, Injective Protocol and their CEO Eric Chen. Also in late 2021, Cuban purchased the entire town of Mustang, Texas, a 77-acre town in Navarro County. He told the Dallas Morning News that a buddy needed to sell it and, \"I don't know what if anything I will do with it.\""}, {"text": "=== Shark Tank ===Cuban has been a \"shark\" investor on the ABC reality program Shark Tank since season two in 2011."}, {"text": "=== Shark Tank ===As of May 2015, he has invested in 85 deals across 111 Shark Tank episodes, for a total of $19.9 million invested. The actual numbers may vary because the investment happens after the handshake deal on live television, after the due diligence is performed to ensure the accuracy of the information presented in the pitch room. For instance, Hy-Conn, a manufacturer of fire hose adapters, after agreeing to a deal of $1.25 million for 100% of the company with Cuban, did not go through with the deal."}, {"text": "=== Shark Tank ===Cuban's top three deals, all with at least $1 million invested, are Ten Thirty One Productions, Rugged Maniac Obstacle Race, and BeatBox Beverages."}, {"text": "=== Shark Tank ===Since Cuban joined the show in 2011, the ratings for Shark Tank have increased, and also during his tenure, the show has won four Primetime Emmy Awards for Outstanding Structured Reality Program (from 2014 to 2017). Before the category came into existence it won the award for outstanding reality program for two years in a row (2012 to 2013), all of these awards came after he joined. As of 2023, Cuban is the richest of all Sharks to appear on the show. He announced in November 2023 that the show's 16th season will be his last."}, {"text": "=== Magnolia Pictures ===Cuban owns film distributor Magnolia Pictures. Through Magnolia, he financed Redacted, a fictional dramatization based on the 2006 Mahmudiyah killings, written and directed by Brian De Palma. In September 2007, Cuban, in his capacity as owner of Magnolia Pictures, removed disturbing photographs from the concluding moments of the Redacted, citing copyrights/permissions issues."}, {"text": "=== Magnolia Pictures ===In April 2011, Cuban put Magnolia Pictures and Landmark Theatres up for sale, but said, \"If we don't get the price and premium we want, we are happy to continue to make money from the properties.\""}, {"text": "=== Cryptocurrency ===Cuban has invested in the cryptocurrency Dogecoin, as well as accepting the particular cryptocurrency as a method of payment for Dallas Mavericks merchandise and tickets since at least early 2021. After being asked by CNBC for his thoughts on the payment method, Cuban responded, \"It’s a medium that can be used for the acquisition of goods and services. The community for doge is the strongest when it comes to using it as a medium of exchange.\""}, {"text": "=== Cryptocurrency ===After Voyager Digital, a cryptocurrency lender, filed for Chapter 11 bankruptcy protection in July 2022, Cuban and the Dallas Mavericks were named in a class-action lawsuit that alleged that Voyager Digital was a Ponzi scheme the following month due to Cuban's promotion of Voyager and Voyager's sponsorship with the team. In February 2022, the U.S. 11th Circuit Court of Appeals ruled in a lawsuit against Bitconnect that the Securities Act of 1933 extends to targeted solicitation using social media."}, {"text": "=== Cryptocurrency ===In September 2023, Cuban's MetaMask cryptocurrency wallet was drained by scammers. As a result he had lost about $870,000 worth of tokens."}, {"text": "=== Cost Plus Drug Company ===In January 2022, Mark Cuban launched the Mark Cuban Cost Plus Drug Company, with the aim of lowering generic drug prices for end consumers in the U.S."}, {"text": "=== Dallas Mavericks ===On January 4, 2000, Cuban purchased a majority stake in the NBA's Dallas Mavericks for $285 million from H. Ross Perot Jr."}, {"text": "=== Dallas Mavericks ===In the 20 years before Cuban bought the team, the Mavericks won only 40% of their games and had a playoff record of 21–32. In the 10 years following, the team won 69% of their regular season games and reached the playoffs in each of those seasons except for one. The Mavericks' playoff record with Cuban is 49–57, including their first trip to the NBA Finals in 2006, where they lost to the Miami Heat."}, {"text": "=== Dallas Mavericks ===NBA team owners historically play more passive roles and watch basketball games from skyboxes; Cuban, however, sits alongside fans while donning team jerseys. Cuban travels in his private airplane—a Gulfstream V—to attend road games."}, {"text": "=== Dallas Mavericks ===In May 2010, H. Ross Perot Jr., who retained 5% ownership, filed a lawsuit against Cuban, alleging the franchise was insolvent or in imminent danger of insolvency. In June 2010, Cuban responded in a court filing maintaining Perot is wrongly seeking money to offset some $100 million in losses on the Victory Park real estate development. The lawsuit was dismissed in 2011, due in part to Cuban asserting proper management of the team due to its recent victory in the 2011 NBA Finals. In 2014, the 5th Circuit Court affirmed that decision on appeal. Following his initial defeat, Perot attempted to shut out Mavericks fans from use of the parking lots he controlled near the American Airlines Center."}, {"text": "=== Dallas Mavericks ===In January 2018, Cuban announced the Mavericks would be accepting Bitcoin as payment for tickets in the following season. On March 4, 2021, Cuban announced the Mavericks would begin accepting Dogecoin as payment for both merchandise as well as tickets to games."}, {"text": "=== Dallas Mavericks ===In early 2021, he decided to stop playing the National Anthem at Dallas Mavericks games in order to \"respect those whose believed the anthem did not represent them.\" He also supported the movement as far back as late 2020. The NBA responded by requiring every team to play it, citing it as their \"long-standing policy\". Cuban did not complain, and ended up playing the anthem."}, {"text": "=== Dallas Mavericks ===On November 28, 2023, The Dallas Morning News reported that Cuban was in the process of selling his share in the Dallas Mavericks to Miriam Adelson."}, {"text": "=== Dallas Mavericks ===On December 27, 2023, the NBA approved the sale of a controlling interest of 73% in the Dallas Mavericks to the Adelson and Dumont families."}, {"text": "=== Major League Baseball ===Cuban has repeatedly expressed interest in owning a Major League Baseball franchise and has unsuccessfully attempted to purchase at least three franchises. In 2008, he submitted an initial bid of $1.3 billion to buy the Chicago Cubs and was invited to participate in a second round of bidding along with several other potential ownership groups. Cuban was not selected to participate in the final bidding process in January 2009. In August 2010, Cuban actively bid to buy the Texas Rangers with Jeffrey L. Beck. Cuban stopped bids after 1 a.m., having placed bids totaling almost $600 million. He had outbid a competing ownership group led by ex-pitcher and Rangers executive Nolan Ryan, but lost the deal before the Rangers played the San Francisco Giants in the 2010 World Series."}, {"text": "=== Major League Baseball ===In January 2012, Cuban placed an initial bid for the Los Angeles Dodgers, but was eliminated before the second round of bidding. Cuban felt that the value of the Dodgers' TV rights deal drove the price of the franchise too high. He had previously said that he would not be interested in buying the franchise at $1 billion, telling the Los Angeles Times in November 2011 \"I don't think the Dodgers franchise is worth twice what the Rangers are worth.\" However, as the bidding process drew near many speculated that the sale would surpass $1.5 billion, with Jon Heyman of CBS Sports reporting on Twitter that at least one bid in the $1–1.5 billion range was placed in the initial round of the bidding process. Ultimately, the Dodgers sold for $2.15 billion to Guggenheim Baseball Management."}, {"text": "=== Major League Baseball ===Cuban also previously expressed interest in becoming a minority owner of the New York Mets after owner Fred Wilpon announced in 2011 that he was planning to sell up to a 25% stake in the team."}, {"text": "=== Major League Baseball ===Cuban has wanted to purchase his hometown Pittsburgh Pirates, but was rebuffed by then owner Kevin McClatchy in 2005."}, {"text": "=== Other sports businesses ===In 2005, Cuban expressed interest in buying the NHL's Pittsburgh Penguins. In 2006, Cuban joined an investment group along with Dan Marino, Kevin Millevoi, Andy Murstein, and Walnut Capital principals Gregg Perelman and Todd Reidbord to attempt to acquire the Penguins. The franchise ultimately rejected the group's bid when team owners Mario Lemieux and Ronald Burkle took the team off the market."}, {"text": "=== Other sports businesses ===At WWE's Survivor Series in 2003, Cuban was involved in a staged altercation with Raw General Manager Eric Bischoff and Raw wrestler Randy Orton. On December 7, 2009, Cuban acted as the guest host of Raw, getting revenge on Orton when he was the guest referee in Orton's match against Kofi Kingston, giving Kingston a fast count victory. He then announced that Orton would face Kingston at TLC: Tables, Ladders & Chairs. At the end of the show, Cuban was slammed through a table by the number one contender for the WWE Championship, Sheamus."}, {"text": "=== Other sports businesses ===On September 12, 2007, Cuban said that he was in talks with WWE Chairman Vince McMahon to create a mixed martial arts company that would compete with UFC. He is now a bondholder of Zuffa, which was formerly UFC's parent company."}, {"text": "=== Other sports businesses ===Cuban followed up his intentions by organizing \"HDNet Fights\", a mixed martial arts promotion which airs exclusively on HDNet and premiered on October 13, 2007, with a card headlined by a fight between Erik Paulson and Jeff Ford as well as fights featuring veterans Drew Fickett and Justin Eilers."}, {"text": "=== Other sports businesses ===Since 2009, Cuban has been a panelist at the annual MIT Sloan Sports Analytics Conference."}, {"text": "=== Other sports businesses ===In April 2010, Cuban loaned the newly formed United Football League (UFL) $5 million. He did not own a franchise, and he was not involved in day-to-day operations of the league nor of any of its teams. In January 2011, he filed a federal lawsuit against the UFL for their failure to repay the loan by the October 6, 2010, deadline."}, {"text": "=== Other sports businesses ===In June 2015, Cuban invested in the esports betting platform Unikrn."}, {"text": "=== Other sports businesses ===In February 2016, Cuban purchased a principal ownership stake in the Professional Futsal League."}, {"text": "== Political activity ==Cuban is an admirer of author Ayn Rand. About Rand's novel The Fountainhead, he said, that it \"was incredibly motivating to me. It encouraged me to think as an individual, take risks to reach my goals, and responsibility for my successes and failures. I loved it.\" His political views have leaned toward libertarianism. He held a position on the centrist Unity08 political organization's advisory council. Despite leaning towards libertarianism, Cuban posted an entry on his blog claiming paying more taxes to be the most patriotic thing someone can do."}, {"text": "== Political activity ==In 2012, Cuban donated $7,000 to political campaigns, with $6,000 going to Republican Senator Orrin Hatch of Utah and $1,000 to Democratic California Congresswoman Zoe Lofgren."}, {"text": "== Political activity ==On February 8, 2008, Cuban voiced his support for the draft Bloomberg movement attempting to convince New York City Mayor Michael Bloomberg to run in the U.S. presidential election of 2008 on his blog. Cuban concluded a post lamenting the current state of U.S. politics: \"Are you listening, Mayor Bloomberg? For less than the cost of opening a tent pole movie, you can change the status quo.\" He eventually voted for Barack Obama in the 2008 election."}, {"text": "== Political activity ==In November 2012, in response to Donald Trump offering President Obama $5 million to a charity of President Obama's choosing if he released passport applications and college transcripts to the public, Cuban offered Trump $1 million to a charity of Trump's choosing if Trump shaved his head."}, {"text": "== Political activity ==On December 19, 2012, Cuban donated $250,000 to the Electronic Frontier Foundation to support its work on patent reform. Part of his donation funded a new title for EFF's staff attorney Julie Samuels: The Mark Cuban Chair to Eliminate Stupid Patents."}, {"text": "== Political activity ==At the Code/Media conference in February 2015, Cuban said of net neutrality that \"having [the FCC] overseeing the Internet scares the shit out of me\"."}, {"text": "== Political activity ==Cuban formally endorsed Hillary Clinton for president at a July 30, 2016, rally in Pittsburgh, Pennsylvania. During that campaign stop, Cuban said of Republican nominee Donald Trump, \"You know what we call a person like that in Pittsburgh? A jagoff ... Is there any bigger jagoff in the world than Donald Trump?\""}, {"text": "== Political activity ==On November 22, 2016, Cuban met with the then President-elect Trump's key advisor Steve Bannon."}, {"text": "== Political activity ==During an appearance on an episode of Hannity in May 2020, Cuban voiced his support for former Vice President Joe Biden in the 2020 U.S. presidential election."}, {"text": "== Political activity ==On February 2, 2021, Cuban joined Reddit's WallStreetBets \"Ask Me Anything\" forum with millions of members and fielded user questions related to the battle between retail traders and Wall Street short sellers over GameStop shares. In the previous days, GameStop shares experienced a rise to as much as $489 on January 28, 2021, up from $17.15 on January 4, 2021. The growth was mainly brought on by an organized group of Reddit users named \"WallStreetBets\" that noticed GameStop stock was heavily shorted by Wall Street hedge firms and launched a campaign to buy enough shares to raise share value and produce a GameStop short squeeze. In the aftermath, the stock became heavily volatile as hedge firms repositioned themselves in the market. Firms like Melvin Capital required bailouts exceeding $2B and retail traders experienced excessive but temporary gains, whereas GameStop share value dropped to below $100 within a few days of closing at over $300. The consistent decline into February raised questions about next steps for retail traders and prompted Cuban to step in and provide advice to the Reddit community. Cuban had been a supporter of the WallStreetBets community alongside other financial figureheads like Chamath Palihapitiya, Cameron Winklevoss and Tyler Winklevoss. In the AMA session, Cuban publicly called the trust of the U.S. Securities & Exchange Commission into question as well as the capabilities of zero commission brokerage firms, like Robinhood, that restricted retail traders from purchasing GameStop shares and other shorted stocks which he said crippled demand. Cuban's advice to Reddit users was to hold GameStop shares if they could afford it in anticipation of additional short sales by Wall Street firms, but ultimately acknowledged that the odds were stacked against them and to use it as a learning experience. He offered insight into his trading technique suggesting that traders know why they are buying something and to \"HODL\"(hold on for dear life) until they learn that something has changed. Cuban noted a need for policy change to better support retail traders, credited the WallStreetBets community for leading the charge, and expressed optimism about blockchain trading as a more efficient, transparent and trustworthy form of trading for retail traders in the future."}, {"text": "=== Fallen Patriot Fund ===Cuban started the Fallen Patriot Fund to help families of U.S. military personnel killed or injured during the Iraq War, personally matching the first $1 million in contributions with funds from the Mark Cuban Foundation, which is run by his brother Brian Cuban."}, {"text": "=== Speculation of a presidential run ===In September 2015, Cuban stated in an interview that running for president was \"a fun idea to toss around\", and that, if he was running in the 2016 U.S. presidential election, he \"could beat both Trump and Clinton\". This was interpreted by many media outlets as indication that Cuban was considering running, but he clarified soon afterward that he had no intention to do so."}, {"text": "=== Speculation of a presidential run ===In October 2015, Cuban posted on Twitter, \"Maybe I'll run for Speaker of the House.\" At the time, there was no clear front-runner to replace the outgoing John Boehner (the Speaker of the House does not have to be a member of Congress)."}, {"text": "=== Speculation of a presidential run ===Cuban told Meet the Press in May 2016 that he would be open to being Clinton's running mate in the election, though he would seek to alter some of her positions in order to do so. In the same interview, the self-described \"fiercely independent\" Cuban also said that he would consider running as Republican nominee Trump's running mate after having a meeting with Trump about Trump's positions on the issues and suggesting solutions. Cuban also described Trump as \"that friend that you just shake your head at. He's that guy who'd get drunk and fall over all the time, or just says dumb shit all the time, but he's your friend.\" On July 21, 2016, Cuban appeared on a live segment on The Late Show with Stephen Colbert entitled \"Gloves Off: Mark Cuban Edition\" in which he mocked Trump, including referencing the Trump companies' multiple bankruptcies, the failed Trump University program, and questioning the size of Trump's actual net worth."}, {"text": "=== Speculation of a presidential run ===In a September 2016 interview with NPR, Cuban effectively positioned himself to support Clinton. He posited that the best strategy to beat Trump was to attack his insecurities, especially that of his intellect. He also added that Trump is the least qualified to be president and is not informed about policies."}, {"text": "=== Speculation of a presidential run ===In September 2016, during a post-presidential debate interview, Cuban criticized Trump's characterization that paying the minimum required taxes 'is smart' and criticized Trump for not paying back into the system that allowed him to amass such wealth."}, {"text": "=== Speculation of a presidential run ===In October 2017, Cuban said that he would \"definitely\" run for president if he was single. Later that month, Cuban claimed that if he ran for president in 2020, it would be as a Republican, and described himself as \"socially a centrist ... but very fiscally conservative\". It had also been speculated that he could have challenged president Donald Trump in 2020 as a Democrat. However, in a March 2019 interview with the New York Daily News, Cuban stated that he was \"strongly considering running\" for president as an independent candidate. In May 2019, Cuban said: \"It would take the perfect storm for me to do it. There's some things that could open the door, but I'm not projecting or predicting it right now.\""}, {"text": "=== Speculation of a presidential run ===In a June 2020 interview with CNN and former Obama advisor David Axelrod, Cuban revealed that he had seriously considered running for president that year as an independent candidate. He went so far as to commission a national poll, which, according to Cuban, showed he would only receive 25 percent of the vote in a hypothetical matchup with President Donald Trump and former Vice President Joe Biden. Cuban also said that the poll showed his candidacy would have pulled votes from both Trump and Biden."}, {"text": "=== NBA fines ===Cuban's ownership has been the source of extensive media attention and controversy involving league policies."}, {"text": "=== NBA fines ===Cuban has been fined by the NBA, mostly for critical statements about the league and referees, at least $1.665 million for 13 incidents. In a June 30, 2006, interview, Mavericks player Dirk Nowitzki said about Cuban:"}, {"text": "=== NBA fines ===He's got to learn how to control himself as well as the players do. We can't lose our temper all the time on the court or off the court, and I think he's got to learn that, too. He's got to improve in that area and not yell at the officials the whole game. I don't think that helps us ... He sits right there by our bench. I think it's a bit much. But we all told him this before. It's nothing new. The game starts, and he's already yelling at them. So he needs to know how to control himself a little."}, {"text": "=== NBA fines ===In an interview with the Associated Press, Cuban said that he matches NBA fines with charitable donations of equal amounts. In a nationally publicized incident in 2002, he criticized the league's manager of officials, Ed T. Rush, saying that he \"wouldn't be able to manage a Dairy Queen.\" Dairy Queen management took offense to Cuban's comments and invited him to manage a Dairy Queen restaurant for a day. Cuban accepted the company's invitation and worked for a day at a Dairy Queen in Coppell, Texas, where fans lined up in the street to get a Blizzard from the owner of the Mavericks."}, {"text": "=== NBA fines ===During the 2005–06 NBA season, Cuban started a booing campaign when former Mavericks player Michael Finley returned to play against the Mavericks as a member of the San Antonio Spurs. In a playoff series between the Mavericks and Spurs, Cuban cursed Spurs forward Bruce Bowen and was fined $25,000 by the NBA for rushing onto the court and criticizing NBA officials. After the 2006 NBA Finals, Cuban was fined $250,000 by the NBA for repeated misconduct following the Mavericks' loss to the Miami Heat in Game Five of the 2006 NBA Finals."}, {"text": "=== NBA fines ===In February 2007, Cuban publicly criticized NBA Finals MVP Dwyane Wade and declared that he would get fined if he made any comments about what he thought really happened in the 2006 NBA Finals."}, {"text": "=== NBA fines ===On January 16, 2009, the league fined Cuban $25,000 for yelling at Denver Nuggets player J. R. Smith at the end of the first half on a Mavericks-at-Nuggets game played on January 13. Cuban was apparently incensed that Smith had thrown an elbow that barely missed Mavericks forward Antoine Wright. Cuban offered to match the fine with a donation to a charity of Smith's choosing. Cuban stated that if he doesn't hear from Smith, then he will donate the money to the NHL Players' Association Goals and Dreams Fund in the names of Todd Bertuzzi and Steve Moore. In May 2009, Cuban made a reference to the Denver Nuggets being \"thugs\" after a loss to the Nuggets in game 3 of the Western Conference Semifinals. The statement was geared towards the Nuggets and their fans. As he passed Kenyon Martin's mother, who was seated near Cuban as he left the arena, he pointed at her and said, \"that includes your son.\" This controversial comment revisited media attention on Cuban yet again. Cuban issued an apology the next day referencing the poor treatment of away fans in arenas around the league. The league issued a statement stating that they would not fine him."}, {"text": "=== NBA fines ===On May 22, 2010, Cuban was fined $100,000 for comments he made during a television interview about trying to sign LeBron James."}, {"text": "=== NBA fines ===Despite his history, he was notably silent during the Mavericks' 2011 championship playoff run."}, {"text": "=== NBA fines ===Despite Cuban's history with David Stern, he believed the NBA Commissioner would leave a lasting legacy \"of a focus on growth and recognizing that the NBA is in the entertainment business and that it's a global product, not just a local product. Whatever platforms that took us to, he was ready to go. He wasn't protective at all. He was wide open. I think that was great.\""}, {"text": "=== NBA fines ===On January 18, 2014, Cuban was once again fined $100,000 for confronting referees and using inappropriate language toward them. As with previous fines, Cuban confirmed that he would match the fine with a donation to charity, however, with the condition that he reaches two million followers on his Twitter account. Cuban also jokingly commented that he could not let Stern leave without a proper farewell."}, {"text": "=== NBA fines ===On February 21, 2018, Cuban was fined $600,000 by the NBA for stating that the Dallas Mavericks should \"tank for the rest of the season.\" Commissioner Adam Silver stated that the fine was \"for public statements detrimental to the NBA.\""}, {"text": "=== NBA fines ===On March 6, 2020, Cuban was fined $500,000 by the NBA for \"public criticism and detrimental conduct regarding NBA officiating\", according to the league."}, {"text": "=== SEC insider trading allegation ===On November 17, 2008, it was reported that the U.S. Securities and Exchange Commission (SEC) filed a civil suit against Cuban relating to alleged insider trading in the shares of Mamma.com, now known as Copernic. A stock dilution occurred shortly after a trade in June 2004, giving hints of inside knowledge at the time of the trade, and Cuban allegedly was saved from a loss of $750,000. The SEC claimed that Cuban ordered the sale of his holdings in Mamma.com after he had been confidentially approached by the company to participate in a transaction likely to dilute shares of current shareholders. Cuban disputed the charges, saying he had not agreed to keep the information secret. On his blog, Cuban contended the allegations were false and that the investigation was \"a product of gross abuse of prosecutorial discretion\". DealBook, a section of The New York Times, reported through an anonymous source that Cuban believed the investigation was motivated by an SEC employee having taken offense to his interest in possibly distributing the film Loose Change."}, {"text": "=== SEC insider trading allegation ===In July 2009, the U.S. District Court dismissed the charges against Cuban, and the SEC appealed. In September 2010, an appeals court said that the district court had erred and that further proceedings would be necessary to address the merits of the suit."}, {"text": "=== SEC insider trading allegation ===A federal jury in Texas found in favor of Cuban on October 16, 2013. The nine-member jury issued the verdict after deliberating 3 hours and 35 minutes."}, {"text": "=== SEC insider trading allegation ===In March 2014, Cuban was on air at CNBC criticizing high-frequency trading (HFT). Those against HFT, such as Cuban, believe the technology is equivalent to automated insider trading."}, {"text": "=== Sexual harassment allegation ===In a March 6, 2018, article, Willamette Week reported on an alleged April 2011 incident between Cuban and a female patron of a Portland, Oregon bar called the Barrel Room. The woman told Portland police that Cuban sexually groped her while she posed for pictures with him. She submitted seven photographs, two of which Portland Police Detective Brendan McGuire referred to as \"significant\".  Cuban denied the allegations, and his attorney provided the results of a polygraph test taken by Cuban and written statements from two medical doctors stating that the actions described were anatomically improbable.  The Portland District Attorney's office declined to prosecute, citing a lack of concrete evidence to support the claim and the woman's preference not to proceed with charges, and concluding that \"no crime can be proven beyond a reasonable doubt\". The NBA announced on March 8, 2018, that it was reviewing the matter."}, {"text": "== Personal life ==Cuban has two brothers, Brian and Jeff."}, {"text": "== Personal life ==In September 2002, Cuban married Tiffany Stewart in a private ceremony in Barbados. They have two daughters, born in 2003 and 2006, and a son born in 2009. They live in a 24,000-square-foot (2,200 m2) mansion in the Preston Hollow area of Dallas, Texas."}, {"text": "== Personal life ==Cuban is a vegetarian. He is a fan of the Pittsburgh Steelers of the National Football League."}, {"text": "=== Philanthropy ===In 2003, Cuban founded the Fallen Patriot Fund to help families of U.S. military personnel killed or injured during the Iraq War."}, {"text": "=== Philanthropy ===In June 2015, Cuban made a $5 million donation to Indiana University Bloomington for the \"Mark Cuban Center for Sports Media and Technology\", which was built inside Assembly Hall, the school's basketball arena."}, {"text": "=== Philanthropy ===In 2020, Cuban picked up homeless former NBA player Delonte West from a gas station in Dallas. He paid for a hotel room for West along with his treatment at a drug rehabilitation center."}, {"text": "=== Business ===1998 Kelley School of Business Alumni Award – Distinguished Entrepreneur: 1998"}, {"text": "=== Business ===2011 D Magazine CEO of the Year"}, {"text": "=== Media ===2011 Outstanding Team ESPY Award as owner of the Dallas Mavericks"}, {"text": "=== NBA ===2011 NBA Champion as owner of the Dallas Mavericks"}, {"text": "== Bibliography ==How to Win at the Sport of Business: If I Can Do It, You Can Do It. Diversion Publishing. 2011. ISBN 978-1626810914"}, {"text": "== Bibliography ==Let's Go, Mavs!. Mascot Books. 2007. ISBN 978-1932888720"}, {"text": "== External links ==Blog"}, {"text": "== External links ==Appearances on C-SPAN"}, {"text": "== External links ==Mark Cuban at IMDb"}, {"text": "== External links ==Mark Cuban collected news and commentary at The New York Times"}, {"text": "== External links ==Mark Cuban collected news and commentary at The Guardian"}]