[{"text": "Martin Hayter Short  (born March 26, 1950) is a Canadian and American actor, comedian, and writer. Short is known as an energetic comedian who gained prominence for his roles in sketch comedy. He has also acted in numerous films and television shows. He has received various awards including two Primetime Emmy Awards, and a Tony Award. Short was awarded as an Officer of the Order of Canada in 2019."}, {"text": "He is known for his work on the television programs SCTV and Saturday Night Live. Short created the characters Jiminy Glick and Ed Grimley. He also acted in the sitcom Mulaney (2014–2015), the variety series Maya & Marty (2016), and The Morning Show (2019). He has also had an active career on stage, starring in Broadway productions including Neil Simon's musicals The Goodbye Girl (1993) and Little Me (1998–1999). The latter earned him a Tony Award for Best Actor in a Musical and the former a nomination in the same category."}, {"text": "He has starred in comedy films such as Three Amigos (1986), Innerspace (1987), Three Fugitives (1989), Father of the Bride (1991), Captain Ron (1992), Clifford (1994), Mars Attacks! (1996), Jungle 2 Jungle (1997), and The Santa Clause 3: The Escape Clause (2006). Short also provided voice-work for films like The Pebble and the Penguin (1995), The Prince of Egypt (1998), Jimmy Neutron: Boy Genius (2001), Treasure Planet (2002), 101 Dalmatians II: Patch's London Adventure (2003), Barbie as the Princess and the Pauper (2004), The Spiderwick Chronicles (2008), Madagascar 3: Europe's Most Wanted, Frankenweenie (both 2012), and The Wind Rises (2013)."}, {"text": "In 2015, Short started touring nationally with fellow comedian Steve Martin. In 2018, they released their Netflix special An Evening You Will Forget for the Rest of Your Life for which they received four Primetime Emmy Award nominations. Since 2021, he has co-starred in the Hulu comedy series Only Murders in the Building alongside Martin and Selena Gomez. For his performance he has earned nominations for the Primetime Emmy Award, the Golden Globe Award, the Screen Actors Guild Award and a Critics' Choice Television Award."}, {"text": "== Early life and education ==Short was born on March 26, 1950, in Hamilton, Ontario, the youngest of five children of Olive Grace (née Hayter; 1913–1968), a Canadian-born (of English and Irish descent) concertmistress at the Hamilton Symphony Orchestra, and Charles Patrick Short (1909–1970), a corporate executive at the Canadian steel company Stelco who had immigrated from Crossmaglen, South Armagh, Ireland as a stowaway during the Irish War of Independence.Short and his siblings—three older brothers, David, Michael, and Brian, and one older sister, Nora—were raised as Catholics. His eldest brother, David, was killed in a car accident in Montréal in 1962 when Short was 12. "}, {"text": "== Early life and education ==Encouraged by his mother in his early creative endeavours, Short attended Westdale Secondary School and then graduated from McMaster University with a Bachelor of Arts degree in Social Work in 1971. In the meantime, his mother died of cancer in 1968; his father died two years later, of complications from a stroke.His brother, Michael, would go on to become a comedy writer: also spending time at Second City Television (SCTV) and is 17 times nominee and three times winner of an Emmy Award for comedy sketch writing."}, {"text": "=== 1972–1976: Early theatrical and television work in Canada ===As Short was about to graduate from McMaster University, rather than immediately pursuing a career in social work, he moved to Toronto with intention of temporarily giving acting a shot. Right away, in March 1972, he landed his first piece of paid work as an actor: playing a plastic credit card inside a woman's purse in a Chargex television commercial. He was then cast by Stephen Schwartz for the new 1972 production of the Broadway hit Godspell being prepared at Toronto's Royal Alexandra Theatre. Among other members of that production's cast were Victor Garber, Gilda Radner, Eugene Levy, Dave Thomas, Andrea Martin, Jayne Eastwood, and Gerry Salsberg; Paul Shaffer was the musical director. As stated by Short in his 2014 memoir as well as in the 2018 documentary Love, Gilda, he and Gilda Radner dated each other on and off during that time.Short subsequently found work in several Canadian television shows and theatrical productions. These included being cast for the role of a tough, sexually predatory prison inmate in the 1972 staging of John Herbert's drama Fortune and Men's Eyes that had the upstart twenty-two-year-old actor commuting back to his hometown Hamilton, Ontario. With the success of Godspell at the Royal Alexandra Theatre in downtown Toronto, by late 1972, the production moved uptown to the Bayview Playhouse where it ran for 488 performances. Young Short's increased stage profile led to a guest spot on Right On, a teen-focused live program airing weekly in the after-school timeslot on the government-funded CBC TV. He also played the role of Smokey the Hare on the TVOntario daytime kids' program Cucumber."}, {"text": "=== 1972–1976: Early theatrical and television work in Canada ===In June 1973, with Godspell winding down and Chicago's Second City improv comedy theatre starting up a sister company in Toronto, many of Short's Godspell peers (his girlfriend Radner, in addition to Levy, Eastwood, and Salsberg) as well as the rest of his social circle (Valri Bromfield and Dan Aykroyd) successfully joined the new troupe's first cast. Short, on the other hand, resisted auditioning due to feeling a \"phobia of being funny on demand\" and considering himself a \"traditional song-and-dance performer\".In 1974, Short was hired as a writer on Everything Goes, a nightly variety show hosted by Norm Crosby, Mike Darow, and Catherine McKinnon. Produced by and aired on Global Television Network, broadcasting only to Southern Ontario as a newly launched regional grouping of television stations, the show lasted less than six months before being cancelled."}, {"text": "==== The Second City improv in Toronto ====Short was encouraged to pursue comedy by McMaster classmates Eugene Levy and Dave Thomas, whom he joined in the improvisation group The Second City in Toronto, Ontario, in 1977.In early 1978, Short secured his feature film debut via a supporting role in the Melvin Frank-directed British romantic comedy Lost and Found starring George Segal and Glenda Jackson. Filmed throughout late winter and early spring 1978 in Banff National Park and Toronto, the film saw limited North American release in June 1979 and was met with lukewarm reviews and poor box office returns."}, {"text": "==== U.S. sitcoms ====After working solely in Canada for the preceding seven years, in 1979, Short landed a starring role in the US sitcom The Associates about a group of young novice lawyers working at a Wall Street law firm.In 1980, he joined the cast of I'm a Big Girl Now, a sitcom starring Diana Canova and Danny Thomas. Canova was offered the sitcom because of her success playing Corinne Tate Flotsky on ABC's Soap and left Soap shortly before Short's newlywed wife Nancy Dolman joined it."}, {"text": "==== SCTV ====Short achieved wider public notice when the Second City group produced a show for television, Second City Television (SCTV), which ran for several years in Canada, then the United States. Short appeared on SCTV in 1982–83. At SCTV, Short developed several characters before moving on to Saturday Night Live for the 1984–85 season:"}, {"text": "==== SCTV ====Aged songwriter Irving Cohen, commonly thought to be loosely based on American composers Irving Caesar and/or Irving Berlin and perhaps Canadian songwriter Leonard Cohen, but actually (according to Short in his autobiography) inspired by Sophie Tucker"}, {"text": "==== SCTV ====Defense attorney Nathan Thurm"}, {"text": "==== SCTV ====Albino Vegas singer, Jackie Rogers Jr. and his father, Jackie Rogers Sr., the latter of which was mauled to death by a mountain lion during a comeback special that took place in the woods."}, {"text": "==== SCTV ====Oddball man-child Ed Grimley, later featured on SNL and in his own short-lived animated television series entitled The Completely Mental Misadventures of Ed Grimley. The show, which was produced by Hanna-Barbera and aired for a single season in fall 1988, is the only animated series adapted from an SCTV character and a Saturday Night Live character to date."}, {"text": "==== Saturday Night Live ====Short joined Saturday Night Live (SNL) for the 1984–85 season. He helped revive the show with his many characters for season ten (the last one produced by Dick Ebersol). \"Short's appearance on SNL helped to revive the show's fanbase, which had flagged after the departure of Eddie Murphy, and in turn, would launch his successful career in films and television.\" His SNL characters included numerous holdovers from his SCTV days, most notably, his Ed Grimley character, depicted on Saturday Night Live as a geeky everyman who is obsessed with Wheel of Fortune, plays the triangle, and often finds himself in bizarre situations rather than a miscast bad actor in several film and TV show parodies (The Completely Mental Misadventures of Ed Grimley used the SNL characterization of him rather than the SCTV take on him). He also did impressions of such celebrities as Jerry Lewis and Katharine Hepburn."}, {"text": "==== Saturday Night Live ====Since then he has made multiple appearances on the show including on the SNL Christmas special in 2012 and Saturday Night Live 40th Anniversary Special in 2015."}, {"text": "=== 1986–1999: Film roles and Broadway debut ===In addition to his work on SCTV and SNL, Short has starred in several television specials and series of his own. In 1985, Short starred in the one-hour Showtime special Martin Short: Concert for the North Americas. This was Short's first live concert, interspersed with studio sketches and a wraparound featuring Jackie Rogers Jr. Co-produced by the CBC, this aired as The Martin Short Comedy Special in Canada in March 1986. In 1989, Short headlined another one-hour comedy special, this time for HBO, I, Martin Short, Goes Hollywood, Short's classic send-up of all things Hollywood. It featured many of his characters including Ed Grimley and Jackie Rogers Jr.After doing sketch comedy for several years, Short starred in Three Amigos, Innerspace, The Big Picture, Captain Ron, Clifford, Three Fugitives (1989), directed by Francis Veber, with Nick Nolte and James Earl Jones; he was the memorable scene-stealing character \"Franck\" in the 1991 remake of Father of the Bride and its sequel; and in Pure Luck (1991), directed by Nadia Tass, with Danny Glover and Sheila Kelley.Short resumed work in the theatre, playing a lead role in the 1993 musical version of the Neil Simon film The Goodbye Girl, on Broadway, receiving a Tony Award nomination and an Outer Critics Circle Award. He had the lead role in the 1999 Broadway revival of the musical Little Me, for which he received a Tony Award and another Outer Critics Circle Award.In 1996, he appeared in Tim Burton's sci-fi comedy Mars Attacks! as lascivious Press Secretary Jerry Ross. In 1997, he appeared as Wall Street broker Richard Kempster in Jungle 2 Jungle, with Tim Allen. Short has had three television shows called The Martin Short Show, including a sitcom, The Martin Short Show, 1994; a sketch comedy show, The Show Formerly Known as the Martin Short Show, 1995; and a syndicated talk show The Martin Short Show, which ran from 1999 to 2000."}, {"text": "=== 2000–2011: Primetime Glick === Short starred as Jiminy Glick on Comedy Central's Primetime Glick (2001–2003). He interviewed performers and celebrities as the character Jiminy Glick. The New York Times in 2002 referred to the character as \"the most unpredictable and hilariously uninhibited comic creation to hit TV since Bart Simpson was in diapers.\" In 2004, he wrote and starred in Jiminy Glick in Lalawood with Jan Hooks as his wife, Dixie Glick. In 2003, Short took to the stage once again in the critically acclaimed Los Angeles run of The Producers. Short played the role of the accountant, Leo Bloom, opposite Jason Alexander's Max Bialystock. Although the role of Leo Bloom was originated on Broadway by Matthew Broderick, Mel Brooks first approached Short about doing the part opposite Nathan Lane. On the subject, Short has stated in numerous interviews that, while he was thrilled by the opportunity, the idea of having to move his family from their Los Angeles home to New York for a year was less than ideal and ultimately proved a deal-breaker."}, {"text": "=== 2000–2011: Primetime Glick ===In 2006, he starred in another film with Tim Allen, The Santa Clause 3: The Escape Clause. In addition to his own series, Short has guest starred on several shows including Arrested Development (episode titled \"Ready, Aim, Marry Me\", 2005), Muppets Tonight (1996), Law & Order: Special Victims Unit, and Weeds. He joined the FX drama Damages as lawyer Leonard Winstone in 2010. Short also provided the voices of several animated film characters, such as Stubbs in We're Back! A Dinosaur's Story, Hubie in The Pebble and the Penguin, Huy in The Prince of Egypt, Ooblar in Jimmy Neutron: Boy Genius, B.E.N. in Treasure Planet, Preminger in Barbie as the Princess and the Pauper, Thimbletack the Brownie in The Spiderwick Chronicles, Stefano the sea lion in Madagascar 3: Europe's Most Wanted, Kurokawa in the English dub of Hayao Miyazaki's The Wind Rises, and The Jester in Legends of Oz: Dorothy's Return.Short was the host of the defunct Walt Disney World attractions O Canada!, a Circle-Vision 360° film in the Epcot theme park's Canada pavilion, and \"The Making of Me\" at Epcot's Wonders of Life pavilion, a 15-minute film about how pregnancy occurs. Short performed in his satirical one-man show, with a cast of six, Martin Short: Fame Becomes Me, at the Bernard B. Jacobs Theatre on Broadway. The show toured several cities in the spring of 2006, prior to opening on Broadway in August 2006; the show closed in January 2007. In it, he performed his classic characters Grimley, Cohen, and Glick. As Glick, Short brought a member of the audience (usually a celebrity) on stage and interviewed him or her. Jerry Seinfeld was the guest on opening night. The show also featured parodies of many celebrities including Celine Dion, Katharine Hepburn, Elizabeth Taylor and Richard Burton, Tommy Tune, Joan Rivers, Britney Spears, Ellen DeGeneres, Renée Zellweger, Jodie Foster, Rachael Ray, and Short's wife, actress Nancy Dolman. The cast album was released on April 10, 2007, and is available from Ghostlight Records, an imprint of Sh-K-Boom Records."}, {"text": "=== 2013–2019: Stand-up tour with Steve Martin ===Short voiced the Cat in the Hat in the animated TV series The Cat in the Hat Knows a Lot About That!, which aired from 2010 to 2013. He later voiced the character in a number of related TV specials in 2014 and 2016. He shot a new comedy special for television in Toronto in September 2011. The special, I, Martin Short, Goes Home follows his return to his native Hamilton, Ontario and has a cast that includes Eugene Levy, Andrea Martin, Joe Flaherty, and Fred Willard. The special aired on CBC Television on April 3, 2012, and garnered Short a nomination for Best Lead Actor in a Comedy Program or Series at the 1st Canadian Screen Awards. In 2011, Short joined the cast of How I Met Your Mother for its seventh season, playing Marshall's manic boss and was a judge on the first season of Canada's Got Talent (2012).He, along with Steve Martin and Chevy Chase appeared on an episode of Saturday Night Live as part of the \"Five-Timers Club\", on March 9, 2013, which included those actors who had hosted the show five or more times. However, Short appeared as a waiter, as he had only hosted three times.Short has continued to tour in his one-man show, which features many of his best-loved characters and sketches. In addition to Fame Becomes Me, some titles that Short has used for his one-man show include Stroke Me Lady Fame, If I'd Saved, I Wouldn't Be Here, and Sunday in the Park with George Michael. Short's memoir, covering his 40-year career in show business, I Must Say: My Life as a Humble Comedy Legend, was released on November 4, 2014."}, {"text": "=== 2013–2019: Stand-up tour with Steve Martin ===From 2014 to 2015, he starred in the Fox sitcom Mulaney, as Lou Cannon, the boss and the game show host of the title character John Mulaney. In 2015 he returned to Broadway replacing Nathan Lane in the Terrence McNally comedic play It's Only a Play. On May 31, 2016, Short debuted a new variety show on NBC, Maya & Marty, which also starred Maya Rudolph. Since 2015, Short has toured with fellow comedian Steve Martin. Together their tours have included A Very Stupid Conversation in 2015, An Evening You Will Forget for the Rest of Your Life in 2017, and The Funniest Show in Town at the Moment in 2021. With their 2017 tour, it was filmed for Netflix as a special and was nominated for four Primetime Emmy Awards and a Directors Guild of America Award nomination."}, {"text": "=== 2019–present ===In 2019 Short appeared on Comedians in Cars Getting Coffee alongside Jerry Seinfeld in the episode \"Martin Short: A Dream World Of Residuals\". From 2019 to 2021 he portrayed Dick Lundy in the Apple TV+ series The Morning Show. He also appeared as a Leprechaun in another Apple TV+ series Schmigadoon! from 2021 to now. Short voiced the roles of Grandpa Frump\tin The Addams Family (2019) and Father Willoughby in the Netflix animated film The Willoughbys (2020) as the impolite father. He also reprised the role of Franck Eggelhoffer\tin the Nancy Meyers directed short film Father of the Bride Part 3(ish) (2020)."}, {"text": "=== 2019–present ===His most recent credit is Only Murders in the Building, a Hulu comedy series, in which he stars and executive produces alongside Steve Martin and Selena Gomez. The show was nominated for a 2021 Peabody Award, and in July 2022, he received his 13th Emmy nomination for his role in Only Murders in the Building. He received nominations for the Primetime Emmy Awards for Outstanding Comedy Series and Outstanding Lead Actor in a Comedy Series."}, {"text": "=== Family ===Short met Canadian comic actress Nancy Dolman in 1972 during the run of Godspell. The couple married in 1980. Dolman retired from show business in 1985 to be a stay-at-home mother and raise their family. Short and Dolman adopted three children: Katherine, Oliver, and Henry. Dolman died of ovarian cancer on August 21, 2010.Short and his family make their home in Pacific Palisades, Los Angeles. He also has a home on Lake Rosseau in Ontario. He is a naturalized U.S. citizen.Nancy Dolman's brother, screenwriter/director Bob Dolman (who served as a part of Second City Television (SCTV)'s Emmy-winning writing team alongside Short), married their close friend and colleague Andrea Martin, also in 1980. Short is uncle to the couple's two sons, Jack and Joe. Bob Dolman and Andrea Martin have since divorced (2004). Short is a first cousin of Clare Short, a former member of the British Parliament and former British cabinet minister."}, {"text": "=== Philanthropy ===Short appeared in a 2001 episode on the Celebrity Who Wants to Be a Millionaire hosted by Regis Philbin, winning $32,000 for his charity, Loyola High School. Short has actively campaigned for the Women's Research Cancer Fund, and he accepted a \"Courage Award\" on behalf of his late wife at a 2011 gala by the group. Short is also a member of the Canadian charity Artists Against Racism. Short is an avid fan of his hometown team, the Hamilton Tiger-Cats of the Canadian Football League."}, {"text": "== Awards and honours ==Over the course of Short's prolific career in film, television and theatre, Short has received various nominations. He received two Tony Award nominations, winning for Little Me in 1999. Short also has received sixteen Primetime Emmy Award nominations, winning twice for Outstanding Writing for a Variety Series for SCTV (1983), and AFI Life Achievement award: Mel Brooks (2014). In 2014 Short "}, {"text": "== Awards and honours ==received the Robert Altman Award from Independent Spirit Awards alongside the cast of Paul Thomas Anderson's Inherent Vice."}, {"text": "== Awards and honours ==Short has received various honours from his birthplace of Canada. In 1995, Short received the Earl Grey Lifetime Achievement Award. In 1999, he earned the Sir Peter Ustinov Award at the Banff Television Festival."}, {"text": "== Awards and honours ==Short was honoured with a star on Canada's Walk of Fame in 2000 and received a second star there in 2002 as part of the comedic group Second City Television (SCTV). In 2001, Short was awarded an honorary Doctor of Literature from his hometown Hamilton based McMaster University. Short has also received Medals from Queen Elizabeth II, including in 2002 the Queen Elizabeth II Golden Jubilee Medal and in 2012 the Queen Elizabeth II Diamond Jubilee Medal.  In 2015, a stamp of Short was issued by Canada Post. In 2016, he received the Canadian Screen Awards Lifetime Achievement Award. In 2019, Short became an Officer of the Order of Canada."}, {"text": "== Bibliography ==I Must Say: My Life as a Humble Comedy Legend (2014, autobiography)"}, {"text": "== External links ==Martin Short on National Public Radio in 2004"}, {"text": "== External links ==Martin Short at the Internet Broadway Database "}, {"text": "== External links ==Martin Short at IMDb"}, {"text": "== External links ==Martin Short at the Internet Off-Broadway Database"}, {"text": "== External links ==Martin Short on Charlie Rose"}, {"text": "== External links ==Martin Short, Steve Martin, Chevy Chase interviewed in Austin about The Three Amigos in 1986 from Texas Archive of the Moving Image"}, {"text": "== External links ==Martin Short interviewed by Roy Faires KVUE Austin about his new movie Innerspace (1987) from Texas Archive of the Moving Image."}]