[{"text": "Michael Bakari Jordan ( bah-KAR-ee; born February 9, 1987) is an American actor and producer. He is best known for his film roles as shooting victim Oscar Grant in the drama Fruitvale Station (2013), boxer Adonis Creed in Creed (2015), and Erik Killmonger in Black Panther (2018), all of which were written and directed by Ryan Coogler. Jordan reprised his role of Creed in Creed II (2018) and Creed III (2023); the latter also marked his directorial debut."}, {"text": "Jordan initially broke out in television, playing Wallace in the first season of the HBO crime drama series The Wire (2002). He went on to play Reggie Montgomery on the ABC soap opera All My Children (2003–2006) and Vince Howard in the NBC sports drama series Friday Night Lights (2009–2011). His other films include Chronicle (2012), That Awkward Moment (2014), Fantastic Four (2015), and Just Mercy (2019), in which he portrayed Bryan Stevenson. He has also starred in and produced the HBO film Fahrenheit 451 (2018), for which he was nominated for the Primetime Emmy Award for Outstanding Television Movie."}, {"text": "Jordan was named one of the 100 most influential people in the world by Time magazine in 2020 and 2023. Also in 2020, he was named People's Sexiest Man Alive, and The New York Times ranked him 15th on its list of the 25 greatest actors of the 21st century. Jordan is also a co-owner of English Premier League football club AFC Bournemouth."}, {"text": "== Early life ==Michael Bakari Jordan was born on February 9, 1987, in Santa Ana, California,  to Donna and Michael A. Jordan. He has an older sister and a younger brother. His family lived in Santa Ana, CA for two years before moving to Newark, NJ where Jordan grew up.  He attended Newark Arts High School, where his mother worked as a teacher, and where he also played basketball."}, {"text": "=== 1999–2008: Beginnings ===Jordan worked as a child model for several companies and brands, including Modell's Sporting Goods and Toys \"R\" Us, before deciding to embark on a career as an actor. He launched his career as a professional actor in 1999, when he appeared briefly in single episodes of the television series Cosby and The Sopranos. His first principal film role followed in 2001 when he was featured in Hardball, which starred Keanu Reeves. In 2002, he gained more attention by playing the small but pivotal role of Wallace in the first season of HBO's The Wire."}, {"text": "=== 1999–2008: Beginnings ===In March 2003, he joined the cast of All My Children, replacing Chadwick Boseman, playing Reggie Montgomery, a troubled teenager, until June 2006 when Jordan was released from his contract. Jordan's other credits include guest starring appearances on CSI: Crime Scene Investigation, Without a Trace and Cold Case. Thereafter, he had a lead role in the independent film Blackout and starred in The Assistants on The-N. In 2008, Jordan appeared in the music video \"Did You Wrong\" by R&B artist Pleasure P."}, {"text": "=== 2009–2012: Friday Night Lights and Parenthood ===In 2009, Jordan began starring in the NBC drama Friday Night Lights as quarterback Vince Howard, and lived in an apartment in Austin where the show was filmed. He played the character for two seasons until the show ended in 2011. In 2009, he guest-starred on Burn Notice in the episode \"Hot Spot\", playing a high school football player who got into a fight and is being hunted by a local gangster. In 2010, he was considered one of the 55 faces of the future by Nylon Magazine's Young Hollywood Issue.In 2010, he guest-starred in the Law & Order: Criminal Intent episode \"Inhumane Society\" as a boxer involved in a Michael Vick-inspired dog fighting scandal. That year, he landed a recurring role on the NBC show Parenthood playing Alex (Haddie Braverman's love interest). This marked his second collaboration with showrunner Jason Katims, who was in charge of Friday Night Lights. BuddyTV ranked him #80 on its list of \"TV's Sexiest Men of 2011\". Jordan voiced Jace in the Xbox 360 game Gears of War 3. In 2012, Jordan appeared in the George Lucas-produced film Red Tails and played lead character Steve Montgomery in Chronicle, a film about three teenaged boys who develop superhuman abilities. He also guest-starred in an episode of House's final season, playing a blind patient."}, {"text": "=== 2013–present: Breakthrough ===In 2013, Jordan starred as shooting victim Oscar Grant in Fruitvale Station, directed by Ryan Coogler. His performance garnered critical acclaim, with Todd McCarthy of The Hollywood Reporter stating that Jordan reminded him of \"a young Denzel Washington\". Following his role in Fruitvale Station, Jordan was named an \"actor to watch\" by People and Variety. Time magazine named him with Coogler one of 30 people under 30 who are changing the world, and he was also named one of 2013's breakout stars by Entertainment Weekly and GQ."}, {"text": "=== 2013–present: Breakthrough ===In 2015, he starred as Johnny Storm, the Human Torch, in Fantastic Four. The film was universally panned by critics, holding a 9% approval rating on Rotten Tomatoes, and was a bust at the box office. However, later in 2015, Jordan rebounded with critical acclaim when he starred as Donnie Creed, the son of boxer Apollo Creed in the seventh Rocky film, Creed, his second collaboration with Coogler, which co-starred Sylvester Stallone. Jordan prepared for his role as a boxer in Creed by undertaking one year of rigorous physical training and a stringent low-fat diet. He did not have a body double during filming and was \"routinely bloodied, bruised, and dizzy\" when fighting scenes were being filmed.In 2016, Jordan featured in the popular sports game NBA 2K17, portraying Justice Young, a teammate of the player in the game's MyCareer mode. In October 2017, it was announced that Jordan was cast in a supporting role as Mark Reese in the upcoming Netflix superhero series Raising Dion. In February 2018, Jordan starred as the villain Erik Killmonger in the Marvel Cinematic Universe (MCU) film Black Panther; this marked Jordan's third collaboration with Coogler. His performance in Black Panther received critical acclaim, with Dani Di Placido of Forbes stating that Jordan \"steals the show\", while Jason Guerrasio of Business Insider wrote that the actor \"plays a Killmonger fueled with hate and emptiness – we won't give away why – but he also delivers it with a swagger that's just a joy to watch ... the movie takes off more in story and viewing enjoyment whenever Jordan is on screen.\"Later in 2018, Jordan starred in Fahrenheit 451 with Michael Shannon and Sofia Boutella. The television film was distributed on HBO by HBO Films. That same year, Jordan reprised his role as boxer Donnie Creed in Creed II, a sequel to Creed (2015) and the eighth installment in the Rocky film series. Creed II was released in the United States by Metro-Goldwyn-Mayer on November 21, 2018. The film received generally positive reviews from critics and it went on to debut to $35.3 million in its opening weekend (a five-day total of $55.8 million), marking the biggest debut ever for a live-action release over Thanksgiving.He also voices the character Julian Chase in Rooster Teeth's animated series Gen:Lock, which he also co-produces through his production company, Outlier Society Productions since January 2019. Jordan portrayed attorney Bryan Stevenson in a legal drama, Just Mercy, which he also co-produced. The film, based on a real-life story, was released in December 2019 to critical acclaim. Jordan stars in Without Remorse, based on the book by Tom Clancy, as John Clark, a former Navy SEAL and director of the elite counterterrorism unit Rainbow Six. Originally planned for release on September 18, 2020, it was released on April 30, 2021 due to the COVID-19 pandemic.Jordan reprised his MCU role as Erik \"Killmonger\" Stevens in two episodes of the first season of What If...? (2021), and in Black Panther: Wakanda Forever (2022), and made a cameo appearance in Space Jam: A New Legacy (2021). He also starred in A Journal for Jordan (2021), directed by Denzel Washington, as a soldier who \"kept a journal full of poignant life lessons for their newborn son, Jordan, while deployed overseas.\""}, {"text": "=== 2013–present: Breakthrough ===Jordan made his directorial debut with Creed III, a sequel to Creed II, in addition to producing and reprising his starring role as boxer Adonis Creed. It was released on March 3, 2023."}, {"text": "==== Upcoming projects ====He is slated to reteam with Coogler for the fourth time in Wrong Answer, a film based on the Atlanta Public Schools cheating scandal. Jordan is also set to appear in a second remake of The Thomas Crown Affair. Jordan is also set to appear in the vampire film Blood Brothers. His production company Outlier Society signed a first look deal with Amazon, and is also developing Val-Zod, an HBO Max series featuring a Black version of the DC Comics character Superman.As of March 2022, Jordan will produce and star in the sequel of I Am Legend with Will Smith."}, {"text": "== Personal life ==Jordan has resided in Los Angeles since 2006. He grew up in a religious household and considers himself to be spiritual. As of 2018, he lives with his parents in a Sherman Oaks home that he purchased. Jordan is also a fan of anime, particularly Naruto: Shippuden and the Dragon Ball franchise. Jordan grew up in Newark, New Jersey and is a lifelong fan of the New York Giants.In November 2020, the actor began dating model Lori Harvey, daughter of comedian Steve Harvey. In June 2022, it was announced that the couple had ended their relationship."}, {"text": "=== Sports ownership ===In December 2022, Jordan was announced as part-owner of English football club AFC Bournemouth. The club was taken over by the consortium group the Black Knights Football Club led by fellow American Businessman William Foley. Jordan led the minority ownership group with Kosmos Founder Nullah Sarker."}, {"text": "== External links ==Michael B. Jordan at IMDb"}]