[{"text": "Michelle Marie Pfeiffer ( FY-fər; born April 29, 1958) is an American actress. Prolific in film for over four decades, she became one of Hollywood's most bankable stars during the 1980s and 1990s, as well as one of the era's defining sex symbols. She is known for pursuing a wide range of characters that span multiple genres, which have earned her various accolades, including a Golden Globe Award and a British Academy Film Award, in addition to nominations for three Academy Awards and a Primetime Emmy Award."}, {"text": "Beginning her acting career with minor television and film appearances, Pfeiffer attained her first leading role in the critically and commercially unsuccessful Grease 2 (1982). Disillusioned with being typecast in nondescript parts as attractive women, she achieved her breakout role as Elvira Hancock in Scarface (1983). Pfeiffer's mainstream success grew with performances in The Witches of Eastwick (1987) and Tequila Sunrise (1988), and she received her first of six consecutive Golden Globe Award nominations for Married to the Mob (1988). Her performances in Dangerous Liaisons (1988) and The Fabulous Baker Boys (1989) earned her two consecutive Academy Award nominations, for Best Supporting Actress and Best Actress respectively, winning a Golden Globe Award for the latter."}, {"text": "Pfeiffer went on to star in The Russia House (1990) and Frankie and Johnny (1991), making her one of the highest-paid actresses of the 1990s. In 1992, she played Catwoman in Batman Returns and received her third Academy Award nomination for Love Field, which were succeeded by performances in The Age of Innocence (1993) and Wolf (1994). She also produced several of her own star vehicles under her company Via Rosa Productions, including Dangerous Minds (1995). Opting to prioritize her family, she acted sporadically throughout the 2000s, appearing in What Lies Beneath (2000), White Oleander (2002), Hairspray, and Stardust (both 2007)."}, {"text": "Following another hiatus, Pfeiffer returned to prominence in 2017 with performances in Where Is Kyra?, Mother!, and Murder on the Orient Express, and received her first Primetime Emmy Award nomination for playing Ruth Madoff in The Wizard of Lies. In 2020, she received her eighth Golden Globe Award nomination for French Exit. Pfeiffer has played Janet van Dyne in the Marvel Cinematic Universe since 2018, beginning with Ant-Man and the Wasp."}, {"text": "== Early life ==Michelle Marie Pfeiffer was born on April 29, 1958, in Santa Ana, California, the second of four children of Donna Jean (née Taverna), a housewife, and Richard Pfeiffer, an air-conditioning contractor. She has an older brother, Rick, and two younger sisters, Dedee and Lori. Her parents were both originally from North Dakota. Her paternal grandfather was of German ancestry and her paternal grandmother was of English, Welsh, French, Irish, and Dutch descent, while her maternal grandfather was of Swiss-German-Italian descent and her maternal grandmother of Swedish ancestry. The family moved to Midway City, another Orange County community around seven miles (11 km) away, where Pfeiffer spent her early years."}, {"text": "== Early life ==Pfeiffer attended Fountain Valley High School, graduating in 1976. She worked as a check-out girl at Vons supermarket, and attended Golden West College where she was a member of Alpha Delta Pi sorority. After a short stint training to be a court stenographer, she pursued an acting career. Pfeiffer won the Miss Orange County beauty pageant in 1978 and finished sixth in the Miss California contest the same year. After her appearances in these pageants, Pfeiffer acquired an agent and began to audition for television and film roles."}, {"text": "=== Late 1970s and 1980s ===Pfeiffer made her acting debut in 1978, in a one-episode appearance of Fantasy Island. Other roles on television series followed, including Delta House, CHiPs, Enos and B.A.D. Cats, as well as in the made-for-CBS film The Solitary Man (1979). Pfeiffer transitioned to film with the comedy The Hollywood Knights (1980), with Tony Danza, appearing as high school sweethearts. She subsequently played supporting roles in Falling in Love Again (1980) with Susannah York and Charlie Chan and the Curse of the Dragon Queen (1981), none of which met with much critical or box office success. She appeared in a television commercial for Lux soap, and took acting lessons at the Beverly Hills Playhouse, before appearing in three 1981 television movies – Callie and Son, with Lindsay Wagner, The Children Nobody Wanted and Splendor in the Grass."}, {"text": "=== Late 1970s and 1980s ===Pfeiffer obtained her first major film role as the female lead in Grease 2 (1982), the sequel to the smash-hit musical film Grease (1978). With only a few television roles and small film appearances, the 23-year-old Pfeiffer was an unknown actress when she attended the casting call audition for the role, but according to director Patricia Birch, she won the part because she \"has a quirky quality you don't expect\". The film was a critical and commercial failure but Pfeiffer's performance was noted as a standout. The New York Times remarked: \"[A]lthough she is a relative screen newcomer, Miss Pfeiffer manages to look much more insouciant and comfortable than anyone else in the cast.\" Despite escaping the critical mauling, her agent later admitted that her association with the film meant that \"she couldn't get any jobs. Nobody wanted to hire her.\" On her early screen roles, she asserted: \"I needed to learn how to act ... in the meantime, I was playing bimbos and cashing in on my looks.\""}, {"text": "=== Late 1970s and 1980s ===Director Brian De Palma, having seen Grease 2, refused to audition Pfeiffer for Scarface (1983), but relented at the insistence of Martin Bregman, the film's producer. She was cast as cocaine-addicted trophy wife Elvira Hancock. The film was considered excessively violent by most critics, but became a commercial hit and gained a large cult following in subsequent years. Pfeiffer received positive reviews for her supporting turn; Richard Corliss of Time Magazine wrote, \"most of the large cast is fine: Michelle Pfeiffer is better ...\" while Dominick Dunne, in an article for Vanity Fair titled \"Blonde Ambition\", wrote, \"[s]he is on the verge of stardom. In the parlance of the industry, she is hot.\""}, {"text": "=== Late 1970s and 1980s ===Following Scarface, she played Diana in John Landis' comedy Into the Night (1985), with Jeff Goldblum; Isabeau d'Anjou in Richard Donner's fantasy film Ladyhawke (1985), with Rutger Hauer and Matthew Broderick; Faith Healy in Alan Alda's Sweet Liberty (1986), with Michael Caine; and Brenda Landers in a segment of the 1950s sci-fi parody Amazon Women on the Moon (1987), all of which, despite achieving only modest commercial success, helped to establish her as an actress. She finally scored a major box-office hit as Sukie Ridgemont in the 1987 adaptation of John Updike's novel The Witches of Eastwick, with Jack Nicholson, Cher, and Susan Sarandon. The film received positive reviews and grossed over $63.7 million domestically, equivalent to $171 million in 2023 dollars, becoming one of her earliest critical and commercial successes. Praising their comedic timing, Roger Ebert wrote that Pfeiffer and her female co-stars each \"have a delicious good time with their roles\", while the Los Angeles Times film critic Sheila Benson said Pfeiffer makes her character \"a warm, irresistible character.\""}, {"text": "=== Late 1970s and 1980s ===Pfeiffer was cast against type, as a murdered gangster's widow, in Jonathan Demme's mafia comedy Married to the Mob (1988), with Matthew Modine, Dean Stockwell and Mercedes Ruehl. For the role of Angela de Marco, she donned a curly brunette wig and a Brooklyn accent, and received her first Golden Globe Award nomination as Best Actress in a Motion Picture Musical or Comedy, beginning a six-year streak of consecutive Best Actress nominations at the Golden Globes. Pfeiffer then appeared as chic restaurateuse Jo Ann Vallenari in Tequila Sunrise (1988) with Mel Gibson and Kurt Russell, but experienced creative and personal differences with director Robert Towne, who later described her as the \"most difficult\" actress he has ever worked with."}, {"text": "=== Late 1970s and 1980s ===At Demme's personal recommendation, Pfeiffer joined the cast of Stephen Frears's Dangerous Liaisons (1988), with Glenn Close and John Malkovich, playing Madame Marie de Tourvel, the virtuous victim of seduction. Hal Hinson of The Washington Post saw Pfeiffer's role as \"the least obvious and the most difficult. Nothing is harder to play than virtue, and Pfeiffer is smart enough not to try. Instead, she embodies it. Her porcelain-skinned beauty, in this regard, is a great asset, and the way it's used makes it seem an aspect of her spirituality.\" She won the BAFTA Award for Best Actress in a Supporting Role and received a nomination for the Academy Award for Best Supporting Actress."}, {"text": "=== Late 1970s and 1980s ===Pfeiffer then accepted the role of Susie Diamond, a hard-edged former call girl turned lounge singer, in The Fabulous Baker Boys (1989), which also starred Jeff Bridges and Beau Bridges as the eponymous Baker Boys. She underwent intense voice training for the role for four months, and performed all of her character's vocals. The film was a modest success, grossing $18.4 million in the US and Canada (equivalent to $45 million in 2023 dollars ). Her portrayal of Susie, however, drew unanimous acclaim from critics. Critic Roger Ebert compared her to Rita Hayworth in Gilda and to Marilyn Monroe in Some Like It Hot, adding that the film was \"one of the movies they will use as a document, years from now, when they begin to trace the steps by which Pfeiffer became a great star\". During the 1989–1990 awards season, Pfeiffer won as Best Actress at the Golden Globes, the National Board of Review, the National Society of Film Critics, the New York Film Critics Circle, the Los Angeles Film Critics Association and the Chicago Film Critics Association. Pfeiffer's performance as Susie is considered to be the most critically acclaimed of her career. The scene in which her character seductively performs \"Makin' Whoopee\" atop a grand piano is considered to be a memorable scene in modern cinema."}, {"text": "=== 1990s ===In 1990, Pfeiffer formed her own film production company, Via Rosa Productions, with business partner Kate Guinzburg, whom she had met on the set of Sweet Liberty (1986). The company was under a picture deal with Touchstone Pictures, a film label of The Walt Disney Studios. That year, Pfeiffer began earning $1 million per film, and took on the part of the Soviet book editor Katya Orlova in the film adaptation of John le Carré's The Russia House, with Sean Connery, a role that required her to adopt a Russian accent. For her efforts, she was rewarded with a Golden Globe nomination for Best Performance by an Actress in a Motion Picture – Drama. Pfeiffer then landed the role of damaged waitress Frankie in Garry Marshall's Frankie and Johnny (1991), a film adaptation of Terrence McNally's Broadway play Frankie and Johnny in the Clair de Lune, which reunited her with her Scarface co-star, Al Pacino. The casting was seen as controversial by many, as Pfeiffer was considered far too beautiful to play an \"ordinary\" waitress; Kathy Bates, the original Frankie on Broadway, also expressed disappointment over the producers' choice. Pfeiffer herself stated that she took the role because it \"wasn't what people would expect of [her]\". Pfeiffer was once again nominated for a Golden Globe Award for Best Actress – Motion Picture Drama for her performance."}, {"text": "=== 1990s ===Pfeiffer took on the role of Selina Kyle–Catwoman in Tim Burton's superhero film Batman Returns (1992), opposite Michael Keaton and Danny DeVito, after Annette Bening dropped out because of her pregnancy. For the role, she trained in martial arts and kickboxing. Pfeiffer received unanimous critical acclaim for her portrayal, which is often referred to as the greatest performance of Catwoman of all time by critics and fans. Premiere retrospectively stated: \"Arguably the outstanding villain of the Tim Burton era, Michelle Pfeiffer's deadly kitten with a whip brought sex to the normally neutered franchise. Her stitched-together, black patent leather costume, based on a sketch of Burton's, remains the character's most iconic look. And Michelle Pfeiffer overcomes Batman Returns' heavy-handed feminist dialogue to deliver a growling, fierce performance.\" Batman Returns was a big box office success, grossing over US$267 million worldwide."}, {"text": "=== 1990s ===The first film her company produced was the independent drama Love Field, which was released in 1992. Reviewers embraced the film and The New York Times felt that Pfeiffer was \"again demonstrating that she is as subtle and surprising as she is beautiful\". For her portrayal of an eccentric Dallas, Texas housewife, she earned nominations for the Academy Award for Best Actress and the Golden Globe for Best Actress – Drama and won the Silver Bear for Best Actress at the 43rd Berlin International Film Festival. In Martin Scorsese's period drama The Age of Innocence (1993), a film adaptation of Edith Wharton's 1920 novel, Pfeiffer starred with Daniel Day-Lewis and Winona Ryder, portraying a Countess in upper-class New York City in the 1870s. For her role, she received the Elvira Notari Prize at the Venice Film Festival, and a Golden Globe nomination for Best Actress – Motion Picture. That year, she was awarded the Women in Film Los Angeles' Crystal Award."}, {"text": "=== 1990s ===Following the formation of her producing company, Via Rosa Productions, Pfeiffer saw a professional expansion as a producer. While she continued to act steadily throughout the decade, she and her producing partner Guinzburg experienced a winning streak of producing back to back films next under their header. She starred with Jack Nicholson in the 1994 horror film Wolf, portraying the sardonic and willful interest of a writer who becomes a wolf-man at night after being bitten by a creature. The film was released to a mixed critical reception; The New York Times wrote: \"Ms. Pfeiffer's role is underwritten, but her performance is expert enough to make even diffidence compelling.\" Wolf was a commercial success, grossing US$65 million (equivalent to $134 million in 2023) at the domestic box office and US$131 million worldwide (equivalent to $269 million)."}, {"text": "=== 1990s ===Pfeiffer's next role was that of high school teacher and former United States Marine LouAnne Johnson in the drama Dangerous Minds (1995), co-produced by her company. She appeared as her character in the music video for the soundtrack's lead single, \"Gangsta's Paradise\" by Coolio, featuring L.V.; the song won the 1996 Grammy Award for Best Rap Solo Performance, and the video won the MTV Video Music Award for Best Rap Video. While Dangerous Minds received negative reviews, it was a box office success, grossing US$179.5 million around the globe. In 1996, Pfeiffer portrayed Sally Atwater in the romantic drama Up Close & Personal, with Robert Redford, took on the titular role in the drama To Gillian on Her 37th Birthday, which was adapted by her husband David Kelley from Michael Brady's play of the same name, and served as an executive producer and starred as the divorced single mother architect Melanie Parker in the romantic comedy One Fine Day, with George Clooney."}, {"text": "=== 1990s ===Subsequent performances included Rose Cook Lewis in the film adaptation of Jane Smiley's Pulitzer Prize-winning novel A Thousand Acres (1997) with Jessica Lange and Jennifer Jason Leigh; Beth Cappadora in The Deep End of the Ocean (1998) about a married couple who found their son who was kidnapped nine years ago; Titania the Queen of the Fairies in A Midsummer Night's Dream (1999) with Kevin Kline, Rupert Everett and Stanley Tucci; and Katie Jordan in Rob Reiner's comedy drama The Story of Us (1999) with Bruce Willis. A Thousand Acres and The Deep End of the Ocean were also produced by Via Rosa Productions. Pfeiffer voiced Tzipporah, a shepherdess who becomes the wife of Moses (voiced by Val Kilmer), in DreamWorks Animation's The Prince of Egypt (1998), a musical adaptation based on the Book of Exodus. She also recorded the film's theme song \"When You Believe\", for which songwriter Stephen Schwartz won the Academy Award for Best Original Song. The Prince of Egypt was released to critical and commercial success, but Kenneth Turan found the film's modernization of Pfeiffer's character into a \"feisty protofeminist\" to be problematic."}, {"text": "=== 2000s ===Pfeiffer chose to begin the process of dissolving her film production company, Via Rosa Productions, in 1999, and moved into semi-retirement in order to spend more quality time with her children and family, meaning that she would continue to star in films sporadically into the 2000s and beyond. Pfeiffer handed her producing partner Guinzburg one final film to produce under the Via Rosa Productions header. The film was called Original Sin (2001). It was originally intended to star Pfeiffer, who later changed her mind as she was looking to work less for a while. The film was produced by her company, but instead starred Angelina Jolie and Antonio Banderas."}, {"text": "=== 2000s ===In What Lies Beneath (2000), a Hitchcockian thriller directed by Robert Zemeckis, Pfeiffer and Harrison Ford starred as a well-to-do couple who experience a strange haunting that uncovers secrets about their past. While critical response towards the film was mixed, it opened atop at the box office, and went on to gross US$291 million worldwide. She then accepted the role of Rita Harrison, a highly strung lawyer helping a father with a developmental disability, in the drama I Am Sam (2001), with Sean Penn. Despite grossing $97.8 million worldwide, the film was unfavourably reviewed by critics; Seattle Post-Intelligencer wrote: \"Pfeiffer, apparently stymied by the bland clichés that prop up her screechy role, delivers her flattest, phoniest performance ever.\" Meanwhile, SF Gate observed: \"In one scene, she breaks down in tears as she unburdens herself to him about her miserable life. It's hard not to cringe, watching this emotionally ready actress fling herself headlong into false material.\""}, {"text": "=== 2000s ===Pfeiffer took on the role of a murderous artist, named Ingrid Magnussen, in the drama White Oleander (2002), with Alison Lohman (in her film début), Renée Zellweger and Robin Wright. The film was a critical and commercial success in its arthouse release. Stephen Holden of The New York Times wrote that \"Ms. Pfeiffer, giving the most complex screen performance of her career, makes her Olympian seductress at once irresistible and diabolical.\" Kenneth Turan of the Los Angeles Times described her as \"incandescent\", bringing \"power and unshakable will to her role as mother-master manipulator\" in a \"riveting, impeccable performance\". She earned Best Supporting Actress Awards from the San Diego Film Critics Society and the Kansas City Film Critics Circle, as well as a Screen Actors Guild Award nomination."}, {"text": "=== 2000s ===In 2003, Pfeiffer lent her voice for the character of goddess of chaos Eris in Sinbad: Legend of the Seven Seas, an animated film featuring Brad Pitt as the voice of Sinbad the Sailor. She had struggles with finding the character's villainies. Initially the character was \"too sexual\", then she lacked fun. After the third rewrite, Pfeiffer called producer Jeffrey Katzenberg and told him \"You know, you really can fire me,\" but he assured her that this was just part of the process. Following the release of the film, she took a four-year hiatus from acting, during which she remained largely out of the public eye to devote time to her husband and children. During this time, she turned down the role of the White Witch in the fantasy film The Chronicles of Narnia: The Lion, The Witch and The Wardrobe (2005), which went to Tilda Swinton."}, {"text": "=== 2000s ===Pfeiffer returned to cinemas in 2007 with villainous roles in two summer blockbusters, Hairspray and Stardust,  which was hailed as a successful comeback by the media. In the former, a film adaptation of the Broadway musical of the same name, she starred alongside John Travolta, Christopher Walken and Queen Latifah as Velma Von Tussle, the racist manager of a television station. Although a fan of Pfeiffer's work in the musicals Grease 2 and The Fabulous Baker Boys, director Adam Shankman cast Pfeiffer largely based on her performance in Batman Returns, claiming she was his first and only choice for Velma. Although she had fun with the part, Pfeiffer described Velma as the most difficult role she had played at the time, because of her character's racism; but she was drawn to the film's important message of anti-bigotry, accepting that \"in order to do a movie about racism, somebody has got to be the racist\". Released to widely positive reviews, Hairspray grossed $202.5 million worldwide. Pfeiffer's performance was also critically acclaimed, with film critic David Edelstein of NPR calling her \"sublime\". The cast of Hairspray was nominated for the Screen Actors Guild Award for Best Cast in a Motion Picture, and won the Broadcast Film Critics Association Award for Best Cast, the Hollywood Film Festival Award for Ensemble of the Year, and the Palm Springs International Film Festival Award for Ensemble Cast. In the fantasy adventure Stardust, Pfeiffer plays Lamia, an ancient witch who hunts a fallen star (Claire Danes) in search of eternal youth. The film received mostly positive reviews but performed moderately at the box office, earning $135.5 million globally. The New York Times film critic Stephen Holden described Pfeiffer as \"as deliciously evil a witch as the movies have ever invented\", writing that she \"goes for broke with the relish of a star who figures she has nothing to lose.\""}, {"text": "=== 2000s ===Pfeiffer starred in Amy Heckerling's romantic comedy I Could Never Be Your Woman (2007), with Paul Rudd and Saoirse Ronan, portraying Rosie, a 40-year-old divorced mother working as a scriptwriter and producer for a television show who falls in love with a much younger man (Rudd). Her reported salary was US$1 million, with an advance on 15 percent of the gross. However, the film was only distributed on home video markets domestically. Reviews for I Could Never Be Your Woman were moderately positive, with critic James Berardinelli finding Pfeiffer and Rudd to \"have adequate chemistry to pull off the romance,\" in what he described as an \"enjoyable romantic comedy that has enough going for it to make it worth a recommendation.\" Pfeiffer starred in Personal Effects, with Ashton Kutcher, playing two grieving people coping with the pain and frustration of their loss whose bond spawns an unlikely romance. The drama premiered at Iowa City's Englert Theatre in December 2008."}, {"text": "=== 2000s ===Her next film, an adaptation of Colette's Chéri, reunited her with the director (Stephen Frears) and screenwriter (Christopher Hampton) of Dangerous Liaisons (1988). Pfeiffer played the role of aging retired courtesan Léa de Lonval, with Rupert Friend in the title role, with Kathy Bates as his mother. Chéri premiered at the 2009 Berlin International Film Festival, where it received a nomination for the Golden Bear award. The Times of London reviewed the film favorably, describing Hampton's screenplay as a \"steady flow of dry quips and acerbic one-liners\" and Pfeiffer's performance as \"magnetic and subtle, her worldly nonchalance a mask for vulnerability and heartache\". Roger Ebert in the Chicago Sun-Times wrote that it was \"fascinating to observe how Pfeiffer controls her face and voice during times of painful hurt\". Kenneth Turan in the Los Angeles Times praised the \"wordless scenes that catch Léa unawares, with the camera alone seeing the despair and regret that she hides from the world. It's the kind of refined, delicate acting Pfeiffer does so well, and it's a further reminder of how much we've missed her since she's been away.\""}, {"text": "=== 2010s ===Following a two-year sabbatical from acting, Pfeiffer made part of a large ensemble cast in Garry Marshall's romantic comedy New Year's Eve (2011), her second collaboration with Marshall after Frankie and Johnny. The film, also starring Halle Berry, Jessica Biel, Robert De Niro, Josh Duhamel, Zac Efron, Sarah Jessica Parker, and Sofía Vergara, among many others, saw her take on the supporting role of Ingrid Withers, an overwhelmed secretary befriending a deliveryman (Efron). While the film was panned by critics, it made US$142 million worldwide. In 2012, she appeared with Chris Pine and Elizabeth Banks in the drama People Like Us, as the mother of a struggling New York City corporate trader (Pine). Rolling Stone found her to be \"luminous\" in the film, and The New York Times, positively pointing out Pfeiffer and Banks, noted that their performances \"partly compensate for the holes in a story whose timing is hard to swallow\". People Like Us debuted to US$4.26 million, described as \"meager\" by Box Office Mojo, and only made US$12 million in North America."}, {"text": "=== 2010s ===Pfieffer reunited with Tim Burton, her Batman Returns director, in Dark Shadows (2012), based on the gothic television soap opera of the same name. In the film, co-starring Johnny Depp, Eva Green, Helena Bonham Carter and Chloë Grace Moretz, she played Elizabeth Collins Stoddard, the matriarch of the Collins family. Critical response towards the film was mixed, but writers acclaimed the actors' performances—most notably Depp and Pfeiffer's. IGN found her to be \"commanding\" in her role and felt that the main characters were \"played by one of Burton's best ensemble casts yet\". While Dark Shadows grossed a modest US$79.7 million in North America, it ultimately made US$245.5 million globally. In Luc Besson's mob-comedy The Family (2013), co-starring Robert De Niro, Tommy Lee Jones, Dianna Agron and John D'Leo, she played the \"tough mother\" in a Mafia family wanting to change their lives under the witness protection program. Although reviews for the film were mixed, THV11 said on the cast's portrayals: \"The core actors of The Family were really solid, and the whole film comes together to make a solid movie.\" Meanwhile, The Huffington Post felt that \"De Niro, Pfieffer and Jones all brought 100% to their roles.\" The film grossed US$78.4 million worldwide."}, {"text": "=== 2010s ===Pfeiffer stated that her lack of acting throughout the 2000s was due to several reasons, including family matters and her approach to choosing roles. She stated she was intending to \"work a lot\" once her children left for college, mentioning that she felt her best performance was \"still in her\", saying how that's what she felt kept her going."}, {"text": "=== 2010s ===In the independent drama Where Is Kyra?, Pfeiffer starred as a sensitive and fragile woman who loses her mother and \"faces a crisis in which she must find a means for survival, all the while hiding her struggles from her new lover\". The film premiered at the Sundance Film Festival on January 23, 2017, and received a limited release on April 6, 2018, to critical acclaim; Her role as Kyra was called the \"performance of her life\" by Village Voice's Bilge Ebiri, and \"the performance of her career\", by Rolling Stone."}, {"text": "=== 2010s ===Pfeiffer landed the role of Ruth Madoff for the HBO Films drama The Wizard of Lies, based on the book of the same name. The film, directed by Barry Levinson, reunites her with actor Robert De Niro, who played her husband, disgraced financier Bernard Madoff. The Wizard of Lies premiered on HBO on May 20, 2017, garnering favorable reviews from critics and an audience of 1.5 million viewers, HBO's largest premiere viewership for a film in four years. Tolucan Times remarked that Pfeiffer \"steals the show as Madoff's wife, Ruth, and is a remarkable lookalike\", while Los Angeles Times asserted: \"As Ruth, Pfeiffer convincingly portrays a pampered woman left with utterly nothing —she's lost her homes, status and, most important, her relationship with her sons.\" She received a nomination for the Primetime Emmy Award for Outstanding Supporting Actress in a Movie, in addition to a Golden Globe Award nomination."}, {"text": "=== 2010s ===In Darren Aronofsky's psychological horror film Mother! (2017), Pfeiffer portrayed one of the mysterious guests who interrupt the tranquil life of a couple, played by Jennifer Lawrence and Javier Bardem. Although Mother! divided critics and audiences, reviewers praised Pfeiffer unanimously, some of whom found her performance worthy of an Oscar nomination. Vulture remarked: \"Out of the main actors, it's Pfeiffer who is able to root the character in meaning — she bracingly marries the exploration of Biblical creation, mythological overtones, and hellish domestic commentary. There's a gravity to Pfeiffer's performance that allows her to succeed where the other main actors fail, save for brief spurts — she straddles the boundaries between embodying a symbol and granting the character enough interiority to feel like a flesh and blood woman, too.\""}, {"text": "=== 2010s ===Pfeiffer played a widowed socialite in Kenneth Branagh's Murder on the Orient Express (2017), the fourth screen adaptation of Agatha Christie's 1934 novel of the same name. Featuring an ensemble cast, the mystery film follows world-renowned detective Hercule Poirot (Branagh) attempting to solve a murder, while stranded with several suspects on the Orient Express during the 1930s. She also recorded the original song \"Never Forget\" for the film's soundtrack. The film grossed US$351.7 million worldwide and received decent reviews from critics, with praise for the performances, but criticism for not adding anything new to previous adaptations. Although some critics found its large cast underused, Pfeiffer's performance was praised, with Richard Roeper of the Chicago Sun-Times saying she delivered the film's best performance. The New Yorker's Anthony Lane found that only Pfeiffer appears to be enjoying their material, while Mick LaSalle of the San Francisco Chronicle credited the film with reminding audiences that she is one of the industry's best actresses. David Edelstein of Vulture described the actress as \"a hoot and a half ... stealing every scene\"."}, {"text": "=== 2010s ===Pfeiffer debuted in the Marvel Cinematic Universe as Janet van Dyne, the original Wasp, in the Ant-Man (2015) sequel Ant-Man and the Wasp (2018). Variety's Owen Gleiberman described her performance as \"lovely\" and \"wistful\", while Josh Spiegel of /Film believed the film suffers from a lack of the actress. In 2019, Pfeiffer briefly reprised the role in Avengers: Endgame, and starred alongside Angelina Jolie and Elle Fanning in the dark fantasy sequel Maleficent: Mistress of Evil, playing the villainous Queen Ingrith. Despite the film earning mixed reviews, The Plain Dealer's Laura DeMarco felt that both Jolie and Pfeiffer \"clearly relish their roles.\""}, {"text": "=== 2020s ===Pfeiffer headlined the dark comedy French Exit (2020), based on the acclaimed novel of the same name by Patrick deWitt, directed by Azazel Jacobs. In the film, which co-stars Lucas Hedges and Tracy Letts, Pfeiffer played a widow who moves to Paris, France, with her son (Hedges) and cat, who happens to be her reincarnated husband (Letts). The film premiered at the New York Film Festival, to a positive reception. Peter Debruge of Variety remarked that she gave a performance \"for which she'll be remembered.\" Pfeiffer received a Golden Globe Award nomination for Best Actress – Motion Picture Comedy or Musical for her performance."}, {"text": "=== 2020s ===Pfeiffer portrayed former First Lady Betty Ford in the anthology drama television series The First Lady, which premiered on Showtime in April 2022. The series received mixed reviews and was cancelled after one season. The following year, she reprised the role of Janet van Dyne in Ant-Man and the Wasp: Quantumania."}, {"text": "=== 2020s ===Pfeiffer is attached to star alongside Annette Bening in the psychological thriller, Turn of Mind, set to be directed by Gideon Raff. In 2022, she was cast in Wild Four O'Clocks, penned and directed by Peter Craig, and produced by Marc Platt and Adam Siegel."}, {"text": "=== 2020s ===On March 18, 2024, it was announced that Pfeiffer had been cast in the Amazon MGM holiday comedy Oh. What. Fun."}, {"text": "== Acting style and reception ==Pfeiffer said she sometimes feels fraudulent as an untrained actor due to her lack of conventional schooling. She credits director Milton Katselas with teaching her to differentiate between how an actor and their character would behave during the same scene. Vulture's Angelica Jade Bastién said Pfeiffer's talent dispels any argument that untrained actors are less capable than their trained peers. Several film critics have described her as \"a character actress in a screen siren's body\", with Bastién profiling her as \"a character actress reluctantly placed in Hollywood’s lineage of blonde bombshells\". Journalist James Kaplan reported that some critics feel Pfeiffer has undersold herself by choosing character roles that emphasize her talent over her beauty. In 1993, film critic Ty Burr argued that her \"unshowy performances work because they don’t call attention to themselves\", although her looks might prevent her from being considered \"one of today’s best screen actresses\". Pfeiffer claims she rarely accepts glamorous roles because she finds few of them compelling, and prefers drama over comedy. She has also described acting as a \"sadomasochistic\" profession, due to how \"brutal\" she finds the process can be at times."}, {"text": "== Acting style and reception ==During the 1980s, Pfeiffer typically played smart, funny, and independent women, and pursued a wider range of roles in the 1990s. Early in her career, Pfeifer mostly played relatable working class women, apart from the occasional upper class character. She has admitted to enjoying playing imperfect, evil, and \"slightly trashy\" females. In a 2021 profile, Lynn Hirschberg of W said Pfeiffer excels in emotionally conflicted roles, while Adam Platt of New Woman and journalist Bilge Ebiri agreed that she tends to play emotionally detached women. Backstage contributor Manuel Betancourt observed parallels between Pfeiffer's roles and her own determination to subvert expectations, with the actress confirming that she searches for relatability when selecting new projects. However, Town & Country senior editor Adam Rathe finds Pfeiffer dissimilar to most of her characters. Known to be highly selective about potential projects, IndieWire contributor Kate Erbland believes Pfeiffer carefully chooses unconventional roles to avoid being typecast, although Pfeiffer claims to not know what her ideal type is. Pfeiffer's colleagues have described her as extremely committed, competent, and prepared when it comes to her work, but she refuses to watch her own performances."}, {"text": "== Acting style and reception ==Pfeiffer has been called one of the greatest actresses of her generation. However, she has often been deemed one of Hollywood's most underrated, with The Hollywood Reporter saying she \"is too seldom ranked among the best of her generation\". In 2009, Maclean's film critic Brian D. Johnson argued that Pfeiffer had yet to demonstrate her true acting range, believing she could potentially be as revered as Meryl Streep if afforded the same opportunities, while the San Francisco Chronicle's Mick LaSalle remarked that Pfeiffer's humility sometimes causes the public to overlook her as one of the industry's finest actresses. Pfeiffer is particularly renowned for her versatility, having accumulated a diverse filmography that spans period, romance, fantasy, musical, comedy, and drama. By 2016, Salon's Charles Taylor declared that no actor of the previous decade had rivaled Pfeiffer's versatility. Summarizing her career as eclectic, Erbland believes she has rarely repeated acting choices, with the actress confirming she had always aspired to play the widest range of characters possible, even when her opportunities were limited."}, {"text": "== Acting style and reception ==Pfeiffer was one of the highest-paid actresses of the 1980s and 1990s, typically earning $9–$10 million per film during the latter decade. Aside from The Witches of Eastwick, few of her films during the 1980s had been major box office successes, an observation Pfeiffer feared disclosing to film studios. In 1995, The New York Times journalist Bernard Weinraub said Pfeiffer belongs to a group of respected actresses who are \"not considered a big box-office draw\". However, several critics reported that her performances garnered consistent acclaim, despite some mediocre films and box office returns. Regardless, she was the sixth highest-grossing domestic box office star of 1990, and one of the few actresses whose salary corresponded with their box office appeal as of 1996, according to UPI. By 1999, Variety named Pfeiffer \"the female movie star most likely to improve a film's box-office appeal\". Film critic Robyn Karney wrote that among the several blond, attractive actresses who debuted during the 1980s, Pfeiffer was the most reminiscent of classic Hollywood legends, likening her to Carole Lombard. However, Karney felt the declining quality of her work towards the end of the century was a sobering reminder that \"the great female movie star of the Golden Age is no more\". Pfeiffer feels critics have not always understood her acting decisions, which Rathe attributed to the \"wildcard image\" she has maintained throughout her career, and has expressed that she is sometimes surprised by their reviews, whether positive or negative."}, {"text": "== Acting style and reception ==Pfeiffer has yet to receive top-billing in a blockbuster film, despite being one of the word's biggest and most acclaimed movie stars. Entertainment journalist James Ulmer ranked her the world's third most bankable actress in 1998, and the 27th most influential actor in the world in 2000. The Kenosha News voted Pfeiffer America's 26th favorite actress. The Boston Globe's Mark Shanahan believes Pfeiffer is sometimes overlooked as one of Hollywood's greatest leading ladies due to her perceived effortlessness. Matthew Jacobs of HuffPost Canada hailed her as \"one of the great comedic actors of our time, though she is rarely recognized as such\". The author identified subtlety as one of her strengths, explaining that her \"magnetism never overwhelms the movies she's in. Even when she is the most talented person on-screen\". Describing her as \"one of the industry's greatest stars during its pre-millennial twilight\", ABC Online's Luke Goodsell declared Pfeiffer's comparatively sparse workload \"[a]mong the many depressing phenomena of 21st-century Hollywood\". She was awarded a motion picture star on the Hollywood Walk of Fame in 2007."}, {"text": "== Public image ==Pfeiffer has been described as one of the world's most beautiful and talented actresses. After being typecast in early roles based on her appearance, Pfeiffer struggled to convince directors to take her seriously as an actor, and sought out more challenging opportunities. Journalists Candice Russell of the Sun-Sentinel and Rachel Syme of The New Yorker observed that, early in her career, critics regularly undermined Pfeiffer's work by focusing on her appearance instead of her acting."}, {"text": "== Public image ==Pfeiffer was considered one of the preeminent sex symbols of the 1980s and 1990s, and several publications dubbed her one of Hollywood's \"It girls\" from this time period. In 1990, Pfeiffer appeared on the inaugural cover of People magazine's annual \"50 Most Beautiful People in the World\" issue. She has been featured in the \"Most Beautiful\" issue a record-breaking six times throughout the decade (from 1990 to 1993, and in 1996 and 1999). In 2004, the magazine named her one of the most beautiful women of all time. In 2011, the Los Angeles Times Magazine featured her among the \"50 Most Beautiful Women in Film\". In 2020, Vogue Paris listed Pfeiffer as one of the 21 most beautiful American actresses of all time. Men's Health ranked Pfeiffer 45th and 67th on their all-time hottest women and sex symbol rankings, respectively. Pfeiffer has been famously self-deprecating about her appearance, at times mocking her trademark features. At least two of her films, Stardust (2007) and Chéri (2009), explore beautiful, youth-obsessed women struggling to accept aging, themes with which Pfeiffer personally identified. According to several plastic surgeons, she possesses some of the most requested celebrity features among clients. In 2001, plastic surgeon Stephen R. Marquardt declared Pfeiffer the most beautiful face in Hollywood. Nicknamed the \"golden ratio\", Marquardt claims Pfeiffer's face adheres to a mathematical formula in which he determined a person's ideal mouth is 1.618 times as wide as their nose. Several media publications have commented on Pfeiffer's perceived ability to physically age slowly."}, {"text": "== Public image ==Famous for being fiercely private like the characters she plays, Matthew Jacobs of HuffPost crowned Pfeiffer Hollywood's prime example of \"a movie star who doesn't walk around feeling like a movie star\", which benefits her ability to play authentic characters without allowing her fame to affect her talent. Pfeiffer is notorious for disliking press interviews, referring to herself as \"the worst interviewee that ever was\", and maintaining that it is not an actor's responsibility to promote a film project. The Baltimore Sun film critic Michael Sragow observed that the actress can at times appear \"flustered or elusive\" during interviews. Journalist Timothy Egan once likened profiling Pfeiffer to covering geology, which she outgrew by 1995. Vikram Murthi of The Nation believes Pfeiffer's aversion to publicity \"has lent her an air of gravitas, of someone who directs a spotlight rather than chases after it\"."}, {"text": "== Public image ==Media commentators noted that Pfeiffer had unexpectedly become a \"pop-music muse\" in 2014; her name is mentioned in two of the year's most popular songs: \"Uptown Funk\" by Mark Ronson featuring Bruno Mars, and \"Riptide\" by Vance Joy. Joy was particularly inspired by Pfeiffer's transformation from Selina Kyle into Catwoman in Batman Returns, whereas Ronson cited The Fabulous Baker Boys as his favorite Pfeiffer film. Australian cricketers speak of \"getting a Michelle\" when they take five wickets in an innings. In cricketing parlance, this is referred to as a \"five for\", a near-homophone for \"Pfeiffer\", which resulted in the nickname \"Michelle\"."}, {"text": "=== Product and endorsements ===In 2005, Pfeiffer served as the face of Giorgio Armani's spring campaign; the designer has often dressed her for public appearances."}, {"text": "=== Product and endorsements ===In 2019, she launched a collection of fine fragrances called Henry Rose. It is the first fine fragrance line to be both Cradle to Cradle Certified and EWG Verified.  On December 7, 2022, she promoted the line on The Tonight Show.  It was even featured as one of the smells in the game called \"Sniff Cup Flip Cup\" she played against Jimmy Fallon."}, {"text": "=== Philanthropy ===Having been a smoker for ten years, and having a niece who suffered from leukemia for ten years, Pfeiffer decided to support the American Cancer Society. She also supports the Humane Society. In 2016, she attended the Healthy Child Healthy World's L.A. Gala for people who lead organizations for children's environmental health. In December that year, Pfeiffer, who was vegan at the time, joined the board of directors for Environmental Working Group, an advocacy group based in Washington. D.C."}, {"text": "== Personal life ==Soon after coming to Hollywood at age 20, Pfeiffer was taken in by a seemingly friendly couple who ran a metaphysics and vegetarian cult. They helped her to cease drinking, smoking and doing drugs. Over time, they took control of her entire life. Much of her money went to the group. \"I was brainwashed,\" she said, \"I gave them an enormous amount of money.\""}, {"text": "== Personal life ==At an acting class taught by Milton Katselas in Los Angeles, she met fellow budding actor Peter Horton, and they began dating. They married in Santa Monica in 1981, and it was on their honeymoon that she discovered she had won the lead role in Grease 2. Horton directed Pfeiffer in a 1985 ABC TV special, One Too Many, where she played the high school girlfriend of an alcoholic student (Val Kilmer); and in 1987, the real-life couple played an on-screen couple in the 'Hospital' segment of John Landis's comedy skit compilation Amazon Women on the Moon."}, {"text": "== Personal life ==In 1988, Pfeiffer had an affair with John Malkovich, her co-star in Dangerous Liaisons, who at the time was married to Glenne Headly."}, {"text": "== Personal life ==Pfeiffer and Horton decided to separate in 1988, and were divorced two years later. Horton later blamed the split on their devotion to their work rather than their marriage. Pfeiffer then had a three-year relationship with actor/producer Fisher Stevens, whom Pfeiffer met when she was starring as Olivia in the New York Shakespeare Festival production of Twelfth Night, where Stevens played Sir Andrew Aguecheek."}, {"text": "== Personal life ==In 1993, Pfeiffer married television writer and producer David E. Kelley. She made a brief uncredited cameo appearance in one episode of Kelley's television series Picket Fences and played the title character in To Gillian on Her 37th Birthday, for which Kelley wrote the screenplay. She had entered into private adoption proceedings before she met Kelley, and in March 1993 adopted a newborn daughter, Claudia Rose, who was christened on Pfeiffer's and Kelley's wedding day. In 1994, Pfeiffer gave birth to a son, John Henry Kelley II, named for his grandfather and Pfeiffer's father-in-law, United States Hockey Hall of Fame coach John Henry \"Jack\" Kelley."}, {"text": "== Personal life ==Pfeiffer experimented with a plant-based diet for a few years but later added meat to her diet and advocated a \"paleoish\" diet."}, {"text": "== Acting credits and accolades ==According to review aggregation website Rotten Tomatoes, Pfeiffer's most acclaimed films include The Fabulous Baker Boys (1989), Avengers: Endgame (2019), Dangerous Liaisons (1988), Hairspray (2007), Married to the Mob (1988), Ant-Man and the Wasp (2018), The Age of Innocence (1993), Batman Returns (1992), Scarface (1983), Where Is Kyra? (2017), The Prince of Egypt (1998), and Stardust (2007)."}, {"text": "== Acting credits and accolades ==Pfeiffer has received three Academy Award nominations: Best Supporting Actress for Dangerous Liaisons (1988); and Best Actress for The Fabulous Baker Boys (1989) and Love Field (1992). She won the Golden Globe Award for Best Actress - Motion Picture Drama for The Fabulous Baker Boys, and has been nominated seven more times for her performances in Married to the Mob (1988), The Russia House (1990), Frankie and Johnny (1991), Love Field, The Age of Innocence (1993), The Wizard of Lies (2017), and French Exit (2020). For Dangerous Liaisons, she won the BAFTA Award for Best Actress in a Supporting Role. She also received a Primetime Emmy Award nomination for The Wizard of Lies."}, {"text": "== External links ==Michelle Pfeiffer at IMDb"}, {"text": "== External links ==Michelle Pfeiffer at the TCM Movie Database "}, {"text": "== External links ==Michelle Pfeiffer at AllMovie"}, {"text": "== External links ==Michelle Pfeiffer at Rotten Tomatoes"}, {"text": "== External links ==Michelle Pfeiffer in the Hollywood Walk of Fame Directory"}, {"text": "== External links ==Michelle Pfeiffer on Instagram"}, {"text": "== External links ==Michelle Pfeiffer discography at Discogs"}]