[{"text": "Olivia Wilde (born Olivia Jane Cockburn  KOH-bərn; March 10, 1984) is an American actress, director and producer. She played Remy \"Thirteen\" Hadley on the medical-drama television series House (2007–2012), and has appeared in the films Tron: Legacy (2010), Cowboys & Aliens (2011),  The Incredible Burt Wonderstone (2013), and The Lazarus Effect (2015). She made her Broadway debut in 2017 as Julia in 1984. "}, {"text": "Her first film as a director, the teen comedy Booksmart (2019), received critical acclaim and won the Independent Spirit Award for Best First Feature. Her second directed feature, the thriller Don't Worry Darling, was released in 2022."}, {"text": "== Early life and family ==Wilde was born Olivia Jane Cockburn in New York City on March 10, 1984. She grew up in the Georgetown neighborhood of Washington, D.C., while spending summers at Ardmore in Ireland. She attended Georgetown Day School in Washington, D.C., and Phillips Academy in Andover, Massachusetts, graduating in 2002. She derived her professional surname from Irish author Oscar Wilde, and began using it in high school to honor the writers in her family, many of whom used pen names. She was accepted to Bard College, but deferred her enrollment three times to pursue acting. She then studied at the Gaiety School of Acting in Dublin. For a short time, Wilde's family also had a house in Guilford, Vermont."}, {"text": "== Early life and family ==Wilde has a sister five years older and a brother nine years younger. Her father, Andrew Cockburn, is a British journalist who was born in the London suburb of Willesden and raised in Ireland. Her mother, Leslie Cockburn (née Redlich), is an American producer on 60 Minutes and a journalist. "}, {"text": "== Early life and family ==Writer Christopher Hitchens was the Cockburn family's tenant in Washington, D.C., and served as Wilde's babysitter. Her grandfather, British novelist Claud Cockburn, and his sons Alexander and Patrick Cockburn were also journalists, and her aunt, Sarah Caudwell, was a writer."}, {"text": "=== 2003–2012: Early career, House, and breakthrough ===Wilde appeared as \"Jewel Goldman\" on the short-lived television series Skin (2003–2004). She gained attention for her recurring role as bisexual bar owner Alex Kelly, who dates both characters played by Adam Brody and Mischa Barton on the teen drama TV series The O.C. (2004–2005)."}, {"text": "=== 2003–2012: Early career, House, and breakthrough ===She appeared in films The Girl Next Door (2004), Conversations with Other Women (2005), Bickford Shmeckler's Cool Ideas (2006), Turistas (2006) and Alpha Dog (2006)."}, {"text": "=== 2003–2012: Early career, House, and breakthrough ===In 2007, she starred off-Broadway in political thriller Beauty on the Vine, playing three characters. She was also in The Death and Life of Bobby Z (2007) and the short-lived drama television series The Black Donnellys (2007). In September 2007, she joined the cast of the medical drama TV series House as Remy \"Thirteen\" Hadley, a bisexual internist with Huntington's disease who is handpicked by House to join his medical team. Her first appearance was in the episode \"The Right Stuff\"."}, {"text": "=== 2003–2012: Early career, House, and breakthrough ===Wilde appeared in the comedy film Year One (2009) as Princess Inanna, and starred in Disney's Tron: Legacy (2010) as Quorra. Inspired by her award-winning journalist and documentary filmmaker parents, she has executive-produced several documentary short films, including Sun City Picture House (2010), about a community in Haiti that rallies to build a movie theater after the disastrous 2010 earthquake."}, {"text": "=== 2003–2012: Early career, House, and breakthrough ===In August 2011, it was announced Wilde would be leaving House to further pursue her film career; she left a few months later, in the episode \"Charity Case\". Wilde starred in Cowboys & Aliens (2011) as Ella Swensen, who works with other characters to save the Earth from evil aliens, and also starred in the comedy The Change-Up (2011). She was also in the films In Time (2011), On the Inside (2011) and Butter (2011). In 2011, Wilde became a global brand ambassador for the cosmetic company Revlon, which featured her in their commercials. Wilde made her directing and screenwriting debut with the film Free Hugs (2011) for Glamour Magazine's short film series, which was screened at various festivals."}, {"text": "=== 2003–2012: Early career, House, and breakthrough ===In May 2012, Wilde's character, Remy \"Thirteen\" Hadley, returned for the series finale of House for two episodes, \"Holding On\" and \"Everybody Dies.\" She starred in the film People Like Us (2012), Third Person (2012), The Words (2012) and as Liza in Deadfall (2012), a thriller about two siblings who decide to fend for themselves in the wake of a botched casino heist, and their unlikely reunion during another family's Thanksgiving celebration. In 2012, Wilde was featured in PBS docu-series Half the Sky: Turning Oppression into Opportunity for Women Worldwide, which was inspired by Nicholas Kristof and Sheryl WuDunn's book of the same name. The docu-series follows Wilde as she learns of the struggles women face in Nairobi, Kenya. She also produced the short film, Baseball in the Time of Cholera (2012), which explored the cholera epidemic in Haiti."}, {"text": "=== 2013–2018: Mainstream career and Broadway debut ===In 2013, Wilde wrote an article called the, \"Do's and Don'ts of Turning 30,\" which was published in Glamour Magazine. She starred in and executive produced Drinking Buddies (2013). She had a supporting role as Jane, a magician's assistant, in The Incredible Burt Wonderstone (2013). She also played Suzy Miller in the biographical drama Rush (2013), about James Hunt and Niki Lauda, and had a starring role in the film Her (2013), which was lauded by critics, and received accolades from the Academy Awards and Golden Globe Awards. She has served as executive producer for other documentary short films: The Rider and the Storm (2013), about Timmy Brennan, a New York ironworker from Breezy Point, Queens who lost everything he owned when Hurricane Sandy hit and Body Team 12 (2015), which follows the team tasked with collecting the dead at the height of the Ebola outbreak. The film went on to win Best Documentary Short at the 2015 Tribeca Film Festival, and was nominated for the Academy Award for Best Documentary (Short Subject) at the 88th Academy Awards."}, {"text": "=== 2013–2018: Mainstream career and Broadway debut ===Wilde starred as Elizabeth Roberts, a trophy-wife customer who enters a strait-laced pharmacist's life and takes him on a joyride involving sex, drugs and possibly murder in Better Living Through Chemistry (2014). She starred as Beatrice Fairbanks in The Longest Week (2014), as the middle of a love triangle between an affluent drifter and his best friend. In 2015, she was the brand ambassador of H&M's Conscious Exclusive campaign. She starred in the thriller The Lazarus Effect (2015) as Zoe, a medical researcher who is accidentally killed, then revived with a miraculous serum with unfortunate side-effects. Wilde also starred in and produced the drama Meadowland (2015), that premiered at the Tribeca Film Festival in New York on April 17, 2015. She played Eleanor in Love the Coopers (2015)."}, {"text": "=== 2013–2018: Mainstream career and Broadway debut ===In 2016, Wilde directed a music video for Edward Sharpe and the Magnetic Zeros, teaming up with director of photography Reed Morano. She then worked with American rock band Red Hot Chili Peppers, directing the music video for their song \"Dark Necessities\". Wilde starred as Devon Finestra in HBO's rock 'n' roll drama television series Vinyl (2016). Also in 2016, Wilde also directed an acclaimed live table reading of Hannah and Her Sisters at The New York Times's Center Theatre. The cast included Wilde as Hannah. Wilde stated that Hannah and Her Sisters is \"just a perfect script, and I knew an audience would enjoy having the chance to focus on the genius of the writing, which is what the Live Reads allow for\". Her brand ambassador partnership with Revlon ended in 2016."}, {"text": "=== 2013–2018: Mainstream career and Broadway debut ===In 2017, Wilde made her Broadway debut portraying the role of Julia in 1984. It opened at the Hudson Theatre in New York City on June 22 (previews beginning May 18) for a limited run until October 8, 2017. In May 2017, Wilde became chief brand activist of True Botanicals, a cosmetics and skin care company. Her documentary short Fear Us Women (2017) follows Canadian civilian Hanna Bohman, who has spent the last three years in Syria as a volunteer soldier battling ISIS. As a member of the YPJ, an all-female Kurdish army, Hanna gives an inside look at the women fighting for liberation in Syria."}, {"text": "=== 2013–2018: Mainstream career and Broadway debut ===In 2018, Wilde appeared in A Vigilante. Its world premiere was at South by Southwest on March 10, 2018. It was released March 29, 2019. The same year, Wilde starred in the drama Life Itself. The film was released on September 21, 2018, received negative reviews from critics, and performed poorly at the box office."}, {"text": "=== 2019–present: Expansion to film direction ===Wilde made her directing debut with the teen comedy Booksmart, which was released on May 24, 2019. As of June 27, 2019, it was rated 97% \"fresh\" on Rotten Tomatoes, from 271 critics' reviews. The Washington Post stated, \"[as the film progresses,] Wilde's filmmaking skills become more and more evident, bursting forth in a third act that builds into something beautiful and even transcendent.\" The Los Angeles Times wrote that it \"leaves you feeling unaccountably hopeful for the state of humanity – and the state of American screen comedy too\", and The Wall Street Journal noted, \"Nothing funnier, smarter, quicker or more joyous has graced the big screen in a long time.\" The film won the Independent Spirit Award for Best First Feature at the 35th Independent Spirit Awards on February 8, 2020."}, {"text": "=== 2019–present: Expansion to film direction ===Wilde next appeared in Richard Jewell in 2019, playing Atlanta Journal-Constitution reporter Kathy Scruggs who died in 2001. The film was criticised for depicting Scruggs as offering to trade sex with an FBI agent in return for confidential information. Wilde defended her role and stated that there was a sexist double standard, in that Jon Hamm's FBI agent character was not held to the same scrutiny. Commentators noted that Wilde's character was based on a real person, whereas the FBI agent was an amalgamation of multiple characters from the original script. They also stated that the purpose of the film was to expose and condemn the character assassination of Jewell; however, in the process, the film commits the same character assassination of Scruggs."}, {"text": "=== 2019–present: Expansion to film direction ===In 2020, Wilde directed Wake Up, a short film starring Margaret Qualley. In 2022, she directed her second feature, also playing a supporting role in, Don't Worry Darling, an erotic psychological thriller about a 1950s housewife, starring Florence Pugh, Harry Styles, Gemma Chan and Chris Pine, for New Line Cinema from a screenplay by Katie Silberman. The film gained substantive media attention for its multiple on- and off-set controversies. It premiered at the 79th Venice Film Festival to mixed reviews. The critics praised Pugh's performance, the cinematography, and production design but criticized the screenplay and direction. Also that year, she voiced Lois Lane in the animated film DC League of Super-Pets."}, {"text": "=== 2019–present: Expansion to film direction ===She is attached to direct Perfect, a biopic about gymnast Kerri Strug for Searchlight Pictures, an untitled holiday-comedy film for Universal Pictures, and a female-centered superhero film as part of the Sony's Spider-Man Universe franchise."}, {"text": "== Activism ==In 2008, Wilde campaigned with actors Justin Long and then-current House castmate Kal Penn in support for Democratic presidential nominee Barack Obama. She supported the youth voter organization 18 in '08, serving on their advisory council and appearing in a public service announcement that debuted June 30, 2008, encouraging youth to vote in the 2008 election."}, {"text": "== Activism ==She appeared in the MoveOn.org mock-PSA \"supporting\" the rights of the healthcare insurance industry. She was praised by the Coalition of Immokalee Workers, a farmworkers' union, for supporting the Fair Food program."}, {"text": "== Activism ==Wilde is on the board of directors of Artists for Peace and Justice, which provides education and health services in Haiti; and of the American Civil Liberties Union of Southern California. She is a celebrity influencer/activist for RYOT, a Los Angeles–based media company."}, {"text": "== Activism ==On June 30, 2015, she introduced Democratic presidential candidate Hillary Clinton at a campaign event in New York City."}, {"text": "== Activism ==Wilde starred in a PSA released on March 21, 2016, for World Down Syndrome Day, alongside 19-year-old AnnaRose from New Jersey who has Down Syndrome."}, {"text": "== Activism ==Wilde is widely known as a feminist. In 2013, she appeared in a video clip for Gucci's \"Chime for Change\" campaign that aimed to raise awareness of and funds for women's issues in education, health and justice. She participated in the 2017 Women's March in Washington, D.C., and the 2018 Women's March in Los Angeles."}, {"text": "== Personal life ==On June 7, 2003, when she was 19, Wilde married Italian filmmaker and musician Don Tao dei Principi Ruspoli, a member of the aristocratic Ruspoli family. They were married in Washington, Virginia, on a school bus with only a pair of witnesses. She later said the wedding occurred there because it was the only place where they could be completely alone; the marriage was a secret at the time. Upon her marriage, Wilde became a princess of the Papal nobility. On February 8, 2011, she and Ruspoli announced that they were separating. Wilde filed for divorce in Los Angeles County Superior Court on March 3, 2011, citing \"irreconcilable differences\", and the divorce was finalized on September 29, 2011. Wilde did not seek spousal support, and they reached a private agreement on property division."}, {"text": "== Personal life ==Wilde began dating actor Jason Sudeikis in November 2011. They became engaged in January 2013. They have two children: a son, born in 2014, and a daughter, born in 2016. Sudeikis and Wilde's relationship ended in November 2020. Wilde was publicly served with court documents regarding child custody while she was presenting Don't Worry Darling at CinemaCon 2022."}, {"text": "== Personal life ==In January 2021, Wilde began dating singer Harry Styles after they met during the filming of Don't Worry Darling. Their relationship ended in November 2022."}, {"text": "== See also ==List of female film and television directors"}, {"text": "== External links ==Olivia Wilde at IMDb "}, {"text": "== External links ==Olivia Wilde at the TCM Movie Database "}, {"text": "== External links ==Olivia Wilde at AllMovie "}, {"text": "== External links ==Olivia Wilde on Twitter"}]