[{"text": "Paris Whitney Hilton (born February 17, 1981) is an American media personality, businesswoman, and socialite. Born in New York City, and raised there and in Los Angeles, she is a great-granddaughter of Conrad Hilton, the founder of Hilton Hotels. After  first attracting tabloid attention in the late 1990s, when she became a fixture in NYC's social scene, Hilton ventured into fashion modeling in 2000 and was proclaimed \"New York's leading It Girl\" in 2001. The reality television series The Simple Life (2003–2007), in which she co-starred with her friend Nicole Richie, and a leaked 2003 sex tape with her then-boyfriend Rick Salomon, later released as 1 Night in Paris (2004), catapulted her to global fame."}, {"text": "Hilton's  media ventures have included  films, television series, advertisement campaigns, books, an album, standalone singles, podcasts, and video games. She achieved two New York Times Best Sellers with Confessions of an Heiress (2004) and Paris: The Memoir (2023), and a global top-10 hit with \"Stars Are Blind\" (2006); pursued film acting in House of Wax (2005) and Repo! the Genetic Opera (2008); ventured back into reality television with Paris Hilton's My New BFF (2008–2009), The World According to Paris (2011), Cooking with Paris (2021), and Paris in Love (2021–present); and was the subject of the documentary  This Is Paris (2020). She has performed as a disc jockey since 2012.A polarizing and ubiquitous public figure, Hilton is said to have influenced the revival of the \"famous for being famous\" phenomenon throughout the 2000s. Critics indeed suggest that she exemplifies the celebutante —a household name  through inherited wealth and lavish lifestyle. Forbes included her in its Celebrity 100 in 2004, 2005, and 2006, and ranked her as the most \"overexposed\" celebrity in 2006 and 2008. Hilton has parlayed her media fame into numerous business endeavors. Under her company, she has produced content for broadcast media, launched a variety of product lines, and opened a chain of self-branded boutiques worldwide, as well as an urban beach club in the Philippines. Her perfume line alone has brought in over US$2.5 billion in revenue, as of 2020."}, {"text": "== Early life ==Hilton was born on February 17, 1981, in New York City, to Richard Hilton, a businessman, and Kathy Hilton, a socialite and former child actress. The oldest of four children, she has one sister, Nicky Hilton (born 1983), and two brothers, Barron Hilton II (born 1989) and Conrad Hughes Hilton (born 1994). On her father's side, she is a great-granddaughter of Conrad Hilton, who founded Hilton Hotels, and granddaughter of Barron Hilton. Her maternal aunts are television personalities Kim and Kyle Richards. Hilton has Norwegian, German, Italian, English, Irish, and Scottish ancestry. The family followed the Catholic faith.Hilton moved frequently in her youth, living in Beverly Hills, the Hamptons, and a suite in the Waldorf-Astoria Hotel in Manhattan. Her relatives have described her as \"very much a tomboy\" who dreamed about becoming a veterinarian. Her mother recalled her saving money to buy monkeys, snakes, and goats, and once leaving \"the snake out the cage [...] at the Waldorf\". Hilton was raised in a very \"sheltered, conservative\" atmosphere; her parents were particularly strict and she was not allowed to date, wear make-up or certain types of clothes, or go to school dances. Her mother enrolled her in etiquette classes with the idea of introducing her as a debutante, which Hilton was at first reluctant to do, as she did not find it to be \"real\" or \"natural\". She described it as \"very proper, very prim, almost like a Stepford wife\". The family's social circle included figures such as Lionel Richie, Donald Trump, and Michael Jackson.Growing up in Los Angeles, Hilton attended the Buckley School and St. Paul the Apostle School, finishing elementary school in 1995. Her freshman year of high school (1995–96) was spent at the Marywood-Palm Valley School in Rancho Mirage, California. In 1996, Hilton and her family left California for the East Coast. At 15, she attended Professional Children's School. She skated and played ice hockey while in high school."}, {"text": "== Early life ==In New York City, Hilton had a rebellious youth, regularly skipping classes and sneaking out to parties. On this period, Kathy remarked: \"Let's put it this way —it got very out of control and I was scared for her. And my husband was very scared for her. And, you know, those nightclubs go on all night.\" Her parents eventually sent her, then 16, to a series of boarding schools for emotionally troubled teens, including Provo Canyon School, where she says that she was mentally and physically abused by the staff. In her documentary This Is Paris, Hilton and other former students from Provo Canyon School recall the abuses they faced, including solitary confinement, forced medication, restraint, battery and strangulation. She attended Provo for 11 months and was released in early 1999, around the time she turned 18. She then attended the Dwight School before dropping out a few months later. \"She knew no one at [Dwight]\", said her mother in an interview, while a classmate described her as \"sort of more sophisticated. She was different from everybody else\". She later earned a GED certification."}, {"text": "=== Social scene and modeling (1996–2002) ===With mother Kathy and sister Nicky, Hilton modeled as a child at charity events, graced the May 4, 1988, cover of the weekly magazine Beverly Hills 213, and made an uncredited appearance in the fantasy film Wishman (1992). "}, {"text": "=== Social scene and modeling (1996–2002) ===After relocating to NYC in 1996, Hilton developed a reputation as a socialite through appearances at nightclubs and high-profile events. She has recalled getting offers to show up in nightclubs as early as she was 16, when she obtained a counterfeited identity document in order to gain access to events. Her antics and late-night persona soon started attracting the spotlight from local tabloids. After becoming familiar with Paris and Nicky's social circle, Jason Binn, publisher of Hamptons magazine, stated: \"They're little stars. They've become names. To them it's like a job. I believe they wake up every morning and say, 'O.K., where am I supposed to be tonight?'.\"That lifestyle conflicted with her family's conservative background and proved too \"rebellious\" for the young Paris, whose parents sent her to a series of boarding schools until she turned 18. Hilton resumed public appearances shortly afterwards, and attended the NYC premiere of Cruel Intentions in March 1999 with  Nicky. A New Yorker profile by Bob Morris, published in October that year, described her and her sister as \"the littlest socialites in town [...] Without even a smile, they can breeze past the velvet ropes at Moomba or get a seat at Le Bilboquet\". Businessman George J. Maloof Jr., for instance, flew Hilton in his private jet and paid her to attend the Palms Casino Resort opening in Las Vegas in November 2001."}, {"text": "=== Social scene and modeling (1996–2002) ===Inspired by designers Patricia Field and Betsey Johnson, Hilton decided to pursue modeling, signing with Donald Trump's agency, T Management, at age 19. She modeled for Catherine Malandrino and Marc Bouwer, and posed alongside Nicky for David LaChapelle in a shoot that was featured in the September 2000 issue of Vanity Fair. On her persona, LaChapelle stated: \"Paris had a charisma back then that you couldn't take your eyes off. She would giggle and laugh and be effervescent and take up a room\". By 2001, Hilton had become \"one of the biggest stars, off and on the catwalk,\" at New York Fashion Week, graced an advertising campaign for Italian label Iceberg, and appeared on magazines such as Vogue and FHM.In addition to modeling, Hilton ventured into screen acting, playing an ill-fated character in the independent teen thriller Sweetie Pie (2000), and filming a cameo appearance as herself in the comedy Zoolander (2001), with Ben Stiller. In 2002, she appeared in Vincent Gallo's \"Honey Bunny\" video, played a \"strung-out supermodel\" in the 5-minute short QIK2JDG, and starred as a socialite in the straight-to-DVD horror film Nine Lives."}, {"text": "=== International stardom (2003–2007) ===Hilton's breakout came in 2003, when she starred with her childhood friend and socialite counterpart Nicole Richie in the Fox reality series The Simple Life, in which they lived for a month with a family in the rural community of Altus, Arkansas. The show was initially pitched to both Paris and Nicky Hilton; Paris was convinced to come on board, however Nicky, being somewhat shy to the limelight at the time, opted out. The series premiered on December 2, 2003, shortly after the leak of Hilton's sex tape, and was a ratings success. Its first episode attracted 13 million viewers, increasing Fox's adult 18–49 rating by 79 percent. The high viewership was attributed to the exposure Hilton received for the homemade tape, while she became known for her onscreen dumb blonde persona.By 2004, Hilton had taken on a number of supporting and guest-starring roles in feature films and scripted television series such as Raising Helen and The O.C., signed on to appear in a series of advertisement campaigns for Guess, released an autobiography co-written by Merle Ginsberg, Confessions of an Heiress: A Tongue-in-Chic Peek Behind the Pose, which was seventh on The New York Times Best Seller list, and introduced a lifestyle brand (with a purse collection for the Japanese label Samantha Thavasa, a jewelry line sold on Amazon.com, as well as a perfume line in collaboration with Parlux Fragrances). "}, {"text": "=== International stardom (2003–2007) ===Originally planned for a limited release, high demand for her first  fragrance choked supplies but led to increased availability by December 2004. Its introduction was followed by a 47-percent increase in Parlux sales, primarily of the Hilton-branded perfume. After this success, Parlux has released numerous perfumes under her name, including fragrances for men."}, {"text": "=== International stardom (2003–2007) ===In February 2005, Hilton hosted NBC's Saturday Night Live, with Keane as the musical guest, and in May, the slasher film House of Wax —her first major film role— was released in theaters, to mixed reviews. Writing for View London, Matthew Turner remarked that Hilton \"does better than you might expect\", while TV Guide called her \"talentless\". Her role earned her the Teen Choice Award for Best Scream, the 2005 Razzie for Worst Supporting Actress, and a nomination for Best Frightened Performance at the 2006 MTV Movie Awards. House of Wax grossed over US$70 million worldwide. In May 2005, Carl's Jr. aired a television advertisement, promoting its Spicy Burger product, which featured Hilton in a provocative swimsuit soaping up a Bentley automobile. By November 2005, she had published her second book, Your Heiress Diary: Confess It All to Me.The Simple Life was canceled by Fox in 2005 after three seasons following a dispute between Hilton and Richie. Neither Richie nor Hilton spoke publicly about their split, although it was speculated that they fell out after Richie showed one of Hilton's homemade sex tapes to a group of their friends. They reconciled in October 2006. After The Simple Life was cancelled, other networks (NBC, The WB, VH1 and MTV) were interested in obtaining the rights for new seasons of the show. On November 28, 2005, E! announced that it had picked up The Simple Life, ordering the production of a fourth season and obtaining the rights to repeat the first three seasons. Shooting for the new season began on February 27, 2006. The fourth–season premiere of the show was a ratings success for its new network.Hilton released her self-titled debut album, Paris, on August 22, 2006. The album reached number six on the Billboard 200, and sold over 600,000 copies worldwide. Its lead single, \"Stars Are Blind\", found global success. It was played on more than 125 pop stations in the United States, and reached the top ten in 17 countries. Critical reception was generally mixed, but AllMusic called the album \"more fun than anything released by Britney Spears or Jessica Simpson\".In 2006, Hilton top-billed as vain, dumb blonde characters in the comedy films Bottoms Up and National Lampoon's Pledge This!, both of which received DVD releases in North America. Australia's Urban Cinefile  described Bottoms Up as a \"crass, low-brow comedy\" with \"little merit\" except for \"some Paris Hilton curiosity value\". She reportedly snubbed the Cannes Film Festival premiere of Pledge This! to protest the addition of several nude scenes, which resulted in Worldwide Entertainment Group suing Hilton in August 2008, at the Miami District Court, alleging that she did not fulfill her contractual agreement to provide \"reasonable promotion and publicity\" for the film, despite receiving a US$1 million fee for the role. Hilton licensed her name to Gameloft for their 2006 mobile video game Paris Hilton's Diamond Quest."}, {"text": "=== International stardom (2003–2007) ===The Simple Life finished its run with its fifth season, which debuted on May 28, 2007, and ended on August 5, 2007. That year, Hilton introduced her DreamCatchers line of hair extensions with Hair Tech International, signed a licensing agreement with Antebi for a signature footwear line (Paris Hilton Footwear, featuring stilettos, platforms, flats, wedges and a sports collection), and launched a line of tops, dresses, coats and jeans at the Kitson Boutique in Los Angeles. She also posed nude (covered with gold paint) to promote \"Rich Prosecco\", a canned version of the Italian sparkling wine, traveling to Germany to appear in advertisements for the wine, and modeled for 2 B Free."}, {"text": "=== Screen and business ventures (2008–2011) ===The romantic comedy The Hottie and the Nottie (2008), in which Hilton starred, was a critical and commercial failure. She appeared in the My Name Is Earl episode \"I Won't Die with a Little Help from My Friends\". A documentary about Hilton, Paris, Not France, was screened at the 2008 Toronto International Film Festival. The gothic rock musical Repo! The Genetic Opera (2008) featured Hilton as Amber Sweet, the surgery and painkiller-addicted daughter of a biotech magnate. After screening at the San Diego Comic-Con International, the film received a limited release. Horror.com described it as \"by far Hilton's best role\", but Jam! Movies called her a \"hopeless twit as an actress\". At the 29th Razzie Awards, she won as Worst Actress for The Hottie and the Nottie and as Worst Supporting Actress for Repo!.Hilton starred in a MTV reality series, Paris Hilton's My New BFF, about her search for a new best friend, which premiered on September 30, 2008. The series was a hit and topped all other cable shows in its time slot. That year, she also appeared in two viral Funny or Die videos, Paris Hilton Responds to McCain and Paris Hilton Gets Presidential with Martin Sheen, and inspired by her love for dogs, created a canine apparel line, Little Lily by Paris Hilton.As a result of the American version's success, Paris Hilton's British Best Friend debuted on ITV2 in England on January 29, 2009, the second season of Paris Hilton's My New BFF premiered on June 2, and Paris Hilton's Dubai BFF was internationally broadcast on MTV in April 2011. She guest-starred in the fifth episode of Supernatural's fifth season, which aired on October 8, 2009. In 2009, Hilton also released a sunglasses line and a range of hair products that included shampoos, conditioners and vitamins. She won the Female Celebrity Fragrance of the Year Award at the 2009 Fifi Awards."}, {"text": "=== Screen and business ventures (2008–2011) ===In February 2010, Hilton participated in an advertising campaign for the Brazilian beer Devassa Bem Loura, whose slogan roughly translates into English as \"very blonde bitch\". As part of the campaign, she rode the brewery's float in the Rio Carnival. The critically acclaimed documentary Teenage Paparazzo, in which Hilton appeared, aired on HBO on September 27. She had her first voice-over role in the ABC made-for-television film The Dog Who Saved Christmas Vacation. The film aired on November 28, 2010 and attracted a respectable 2.611 million viewership.  That year, Hilton launched a footwear line in Las Vegas and her motorcycle racing team in Spain. Her driver, Maverick Viñales, won the final race and finished third overall in the 2011 125cc Grand Prix motorcycle racing championship.On June 1, 2011, Hilton returned to reality television in Oxygen's The World According to Paris. Focused on her daily life, the series bought in lackluster ratings amid a controversial promotional campaign, which was attributed to her then-fading popularity in North America. Alessandra Stanley, for The New York Times, described her as an \"attractive woman with proven talent for marketing and self-promotion, though as a reality heroine she seems a little passé [...] it's hard to see how she can recapture the kind of audience she enjoyed in her heyday —even by streaming her premiere live on Facebook\".In 2011, Hilton modeled for Triton during Brazil Fashion Week and for Andre Tan during Ukraine Fashion Week, and continued her endorsement and retail endeavors, introducing a mobile application, which became available for iPhone and iPod touch, and footwear collections in Mexico City and Istanbul. Beginning in 2011, Hilton opened several boutiques selling her products in Egypt, United Arab Emirates, Saudi Arabia, India, Philippines, Malaysia, Peru, Colombia, and Chile."}, {"text": "=== Deejaying and singing (2012–2019) ===On June 28, 2012, at Brazil's Pop Music Festival, Hilton made her debut as a DJ, which attracted negative responses from DJs Deadmau5, Samantha Ronson, and Afrojack. In 2012, she received US$1 million to star in a music video for Korean singer Kim Jang-hoon, and US$2 million to appear alongside Arda Turan in a commercial for Turkish fashion label DeFacto, modeled for designers Shane and Falguni Peacock at India Fashion Week, and  launched a line of sunglasses in Shanghai.After appearing in the music video for Rich Gang's song \"Tapout\" (2013), alongside Lil Wayne, Christina Milian and Nicki Minaj, it was announced that Hilton had signed with Cash Money Records. Under the label, she released three standalone singles —\"Good Time\" (2013), featuring rapper Lil Wayne, \"Come Alive\" (2014), and High Off My Love\" (2015), featuring Birdman— to moderate commercial success. \"Good Time\" and \"High Off My Love\" reached the top 20 and top 5 on the US Billboard Dance/Electronic Songs and Dance Club Songs charts, respectively.During August 2013, Hilton was a DJ at Amnesia's weekly \"Foam and Diamonds\" parties on Ibiza. The positive reaction from critics and audiences led to her contract's renewal for the subsequent four years. In November, Hilton won the Best Breakthrough DJ award at the NRJ DJ Awards. In 2013, Hilton appeared in four episodes of the Danish version of Paradise Hotel, for which she was paid US$300,000, and briefly played herself in Sofia Coppola's film The Bling Ring. In addition to appearing in the film, she loaned Coppola her house for two weeks of shooting.In January 2014, Hilton became a resident DJ at Harrah's Atlantic City's \"The Pool After Dark\". In March, she unveiled her first real estate project, the Paris Beach Club, in collaboration with Century Properties Group, Inc., at the Azure Urban Resort Residences in Parañaque, the Philippines. In July, she made a cameo appearance in another Carl's Jr. commercial, paying homage to the one in which she starred in 2005. To further her career as a DJ, Hilton embarked on a summer and fall tour consisting of 13 shows in Spain, France, Portugal, South Korea, Colombia and New Jersey. By November 2014, Hilton was the highest-paid female DJ and won as Best Female DJ at the NJR DJ Awards. In December, she performed as a DJ at W Hotel's Art Basel parties in Miami."}, {"text": "=== Deejaying and singing (2012–2019) ===In March 2015, Animoca Brands, a mobile game developer from Hong Kong, announced that they had secured a license from Hilton to use her name and likeness to produce mobile games and themes. In June, she performed at Summerfest in Milwaukee in front of 50,000 concert-goers. An online campaign to get her thrown off the bill achieved over 7,000 votes. In 2016, Hilton teamed up with Lidl for a hair care collection.Between 2017 and 2019, Hilton appeared in the music videos for \"Senza Pagare\"  by Fedez, \"Sorry Not Sorry\" by Demi Lovato,  \"I Don't Want It at All\" by Kim Petras, \"Lil One\" by Young Thug and Birdman, and \"Flowers\" by Gabi DeMartino. During the same period, she frequently served as a runway model for Christian Cowan and The Blonds during New York Fashion Week, and for Philipp Plein during Milan Fashion Week. For April Fools' Day 2017, she starred in a SodaStream's advertisement campaign, promoting NanoDrop, a fictitious sparkling-water product. In June 2017, she launched footwear and home decor lines in Mexico City.In 2018, Hilton was described as \"the centerpiece\" of two projects about social media and various personalities' online presence. The documentary The American Meme premiered on Netflix in December 2018, after screening at the Tribeca Film Festival. Rotten Tomatoes gave the film a 93 rating based on 28 reviews. It was written and directed by Bert Marcus, and she was one of the executive producers. She also hosted Hollywood Love Story, a six-episode series that aired on Viceland. That year, Hilton modeled Kanye West's Yeezy Season 6 collection,  released \"I Need You\" as a digital download on Valentine's Day, which peaked at number 32 on the Dance Club Songs Billboard chart, and launched a  70-piece collection with Boohoo.com, her skincare line, a five-nail polishes line with Nail and Bone, as well as a  clothing collection in Mexico.In 2019, Hilton modeled for Philipp Plein's Plein Sport campaign, was a special guest in the twelfth episode of Germany's Next Topmodel's 14th cycle, and collaborated with Belgian production duo Dimitri Vegas & Like Mike on \"B.F.A. (Best Friend's Ass)\", and with vocalist MATTN on  \"Lone Wolves\". \"B.F.A\" peaked at number 45 on the Billboard Dance/Electronic Songs chart, and at number 25 on Belgium's Ultratop chart, while \"Lone Wolves\" peaked at 59 on Ultratop. In July 2019, she performed as a DJ in Tomorrowland."}, {"text": "=== Resurgence (2020–present) ===This Is Paris (2020), a YouTube Originals documentary directed by Alexandra Dean, focuses on her personal and professional trajectory. In the film, Hilton revealed her experiences with emotional, verbal and physical abuse while attending a series of boarding schools as a teenager. Unprepared to disclose that information, she trusted Dean's approach and found the process of filming to be a healing space for her. She served as a producer but did not have artistic authority over the production. It received over 16 million views in its first month of release and was deemed a successful \"rebranding\" of her image.Between 2020 and 2024, Hilton appeared in advertisement campaigns for Skims, Valentino, Lanvin, Uber Eats, Hilton Hotels & Resorts, Klarna, Marc Jacobs, Taco Bell, Grey Goose, NBCUniversal's coverage of the 2024 Summer Olympics, MSCHF–Crocs' Big Yellow Boots, Living Proof, and WOW Vegas. With Klarna, she opened a pop-up store which ran from February 23 to 24, 2023 in Los Angeles.In 2020, Hilton served as a guest judge in the premiere episode of James Charles's YouTube series Instant Influencer, produced and starred in Ramez Silyan's short film Sorry, modeled at Rihanna's Savage X Fenty Show Vol. 2, and released a merchandise collection, as well as a single with Lodato, \"I Blame You\". In 2021, Hilton, who founded Paris Hilton Entertainment in 2006, renamed the company 11:11 Media. That year, she created London Audio, in partnership with iHeartMedia, and Slivington Manor Entertainment, with an overall deal at Warner Bros. Unscripted Television.Her podcast I am Paris debuted on February 22, 2021, offering personal content and conversations with her family, friends, and other celebrities. It served as the flagship of several programs produced by Hilton's company, London Audio, and iHeartMedia. The other podcasts were Trapped In Treatment (2022–2023), hosted by Caroline Cole and Rebecca Mellinger, and History of the World's Greatest Nightclubs (2023), hosted by Ultra Naté.Beginning in 2021, Hilton launched several NFT collections, including one with designer Blake Kathryn, which raked in US$1.5 million. She introduced ParisWorld on Roblox in 2021 and on The Sandbox in 2022. On June 8, 2022, it was announced that she had created a fund for the Los Angeles County Museum of Art to support the acquisition of digital art by female artists. She also became an investor in a number of  wellness and digital-orientated companies.Netflix released Cooking with Paris on August 4, 2021. It was a six-part reality series which she hosted and co-produced. It received lukewarm reviews from critics, who considered it a \"fun but pointless\" production, and briefly entered Netflix's daily Top 10 rankings. Her next reality series, Peacock's Paris in Love (2021–present), soon followed, premiering on November 11, the day she married Carter Reum. For both Cooking with Paris and Paris in Love, Hilton won the Best Reality Return at the 2022 MTV Movie & TV Awards.In 2022, Hilton released a tracksuits line, a sunglasses collection with Quay Australia, and a housewares collection on Amazon. She voiced herself in four episodes of the YouTube animated web series Rainbow High, and modeled for Versace at Milan Fashion Week. That year, she performed \"Stars Are Blind\", alongside Christina Aguilera and Mya, at the Los Angeles Pride festival, as well as with Miley Cyrus and Sia, on NBC's Miley's New Year's Eve Party.On December 30, 2022, Hilton released an updated version of the song, \"Stars Are Blind (Paris' Version)\", exclusively to Amazon Music, which was followed by another version featuring vocals by Kim Petras on June 2, 2023. She featured in Petras' single \"All She Wants\", from her sophomore studio album Problématique (2023).Hilton played the host of a reality dating series in the horror film Alone At Night, which was released on January 20, 2023 by Vertical Entertainment. Her third book, Paris: The Memoir, was published on March 14, 2023 by Harper Collins. She described it as a continuation of \"this whole path of self-discovery\" that started with her 2020 documentary. It debuted at number three on the New York Times Best Sellers list, in the combined print and e-book nonfiction section, selling 13,640 print copies. By October 2023, the book had sold 46,637 print copies in the United States.Hilton launched Parisland on The Sandbox in February 2023, and Slivingland on Roblox in August 2023. By February 2024, Slivingland had been visited by over 3.4 million users and reportedly \"drove a staggering US$60 million in earned media ad equivalency\" on Roblox.  In 2023, she held her first concert at The Fonda Theatre in Los Angeles,  recorded the single \"Hot One\", collaborated with Steve Aoki on \"Lighter\", modeled for Mugler at Paris Fashion Week, released a cookware collection with Walmart, and performed as a disc jockey at Tomorrowland."}, {"text": "=== Reception ===A particularly polarizing figure since rising to fame, Hilton has often been the subject of harsh criticism. Writing for The New York Times in 2003, John Leland opined: \"In a ravenous celebrity culture, Ms. Hilton's rise shows how far celebrity itself has been devalued\".A 2006 poll conducted by the Associated Press and AOL concluded that Hilton was the second-Worst Celebrity Role Model, behind Britney Spears. According to a June 2007 Gallup poll, nearly two-thirds of Americans (63%) felt very unsympathetic toward her, and a November 2007 online survey of children conducted by E-Poll Market Research ranked her among the most unfriendly celebrities among children. The 2007 Guinness World Records named her the world's \"most overrated celebrity\", and Forbes ranked her as the most \"overexposed\" in 2006 and 2008. The latter stated in 2008 that \"65% of the U.S. population would use the term 'overexposed' to describe Hilton [...] To put that in perspective, most celebrities average between 3% and 7% on the E-Poll celebrity index during the peak of their careers\". In the Forbes list, she also ranked second, fifth and eight in 2007, 2012, and 2014 respectively. A 2011 Ipsos poll concluded that she was the most unpopular celebrity with Americans (with 60 percent of respondents viewing her unfavorably).Despite the noticeable public disapproval, Hilton was among the most popular searches on various web browsers (such as Google, AOL and Lycos) between 2004 and 2008. In 2004, she was named one of the \"10 Most Fascinating People\", according to Barbara Walters' annual primetime special (\"Paris' Most Shocking Moments\"). Forbes included her in its Celebrity 100, which ranks the highest-paid celebrities, in 2004, 2005, and 2006. She ranked 59th, 23rd, 34th, and 35th in FHM's 100 Sexiest Women poll in 2004, 2005, 2006, and 2012, respectively, and was 20th and 38th on Maxim magazine's Hot 100 list in 2005 and 2006. She has been included among the \"50 Most Popular Women on the Web\" by Google in 2010, the \"100 Hottest Women of All Time\" by Men's Health in 2011, the \"50 Most Influential People in the NFT Industry\" by Fortune in 2021, and the \"40 Most Powerful Women on Reality TV\" by Variety in 2023."}, {"text": "=== Persona ===The nature and extent of her fame is often questioned by critics, as she is not considered an artist nor performer. Blair Soden of ABC News noted: \"She's made a lot of money with a hodgepodge of traditional celebrity revenue. But what she's best at is being Paris Hilton\". Writers indeed suggest that Hilton epitomizes the celebutante: a celebrity for no particularly identifiable reason other than inherited wealth and lavish lifestyle. Cait Munro of Refinery29 asserted: \"Paris Hilton is an icon not just of the 2000s, but of a certain widely held image of what inherited wealth, undeserved fame, and American excess looks like\".Much of her image has centered on her \"party girl-heiress archetype\" as well as her blonde hair and the stereotypes associated with it, especially stupidity, naïveté, sexual availability and artificiality. The development of that character stemmed from the initial success of The Simple Life and her desire to embody \"the ultimate brand based on [...] the right everything for a formula that far exceeded anybody else at that time\", according to Jason Moore, her former manager. He stated: \"She was the ultimate package that corporate America would want to make for itself as a marketing tool, but it was already made for them. They say to be a famous person, people want to be you or [sleep with you], and she encompassed both of those\".Fashion and language are two contributing factors to Hilton's star image. Known for her long bleached blonde hair, valley girl accent, and use of blue colored contact lenses over her naturally brown eyes, she developed her personal aesthetic through mainly pink attire, Juicy Couture tracksuits, rhinestones, trucker hats, oversized sunglasses, and the \"accessory dog\". She mimed \"high-fashion poses learned from drag queens\" and created what was described as the \"Paris talk\". For instance, she often uses one-liners and a breathy, childish voice in television shows and interviews."}, {"text": "=== Persona ===Her dim-witted blonde persona, a carefully crafted act, found significant credence among the general public, which she has described as an obstacle in her career. She once remarked: \"People assume before they meet me that I'm a really ditzy dumb blonde. That's the one thing that kind of annoys me sometimes. They just think because of the reality show that's who I really am. But that was just a character that I created. I didn't realize what a huge success [it would be...] With everything that's happening, though, with my business, I think people can understand that you couldn't possibly get this far being a dumb blonde\"."}, {"text": "=== Catchphrases ===\"That's hot\", \"loves it\" and \"sliving\" are Hilton's catchphrases. All three are registered as trademarks for products, like clothing apparel, electronic devices, and alcoholic beverages.On September 6, 2007, Hilton filed an injunction lawsuit against Hallmark Cards Inc., titled Hilton v. Hallmark Cards, in U.S. District Court over the unlawful use of her picture and catchphrase \"That's hot\" on a greeting card. The card is titled \"Paris's First Day as a Waitress\" with a photograph of Hilton's face on a cartoon of a waitress serving a plate of food, with a dialogue bubble saying \"Don't touch that, it's hot\" (which had a registered trademark on February 13, 2007). Hilton's attorney Brent Blakely said that the infringement damages would be based on profits from the greeting cards. Julie O'Dell said that Hallmark used the card as parody, protected under fair use law. The Court of Appeals for the Ninth Circuit reviewed the case and \"denied Hallmark's motion to dismiss\". Hilton and Hallmark Cards Inc. later settled out of court."}, {"text": "=== Media presence ===A subject of press and public attention due to her extravagant Hollywood lifestyle, Hilton's media exploits started in the late 1990s, when she became a fixture in NYC's late-night circuit. A combination of what has been described as \"vulgar Trump-era exhibitionism and Girls Gone Wild antics\" led publications such as Hamptons, The New Yorker, and particularly The New York Post, to often feature Hilton in their social columns.After her pictorial by David LaChapelle and September 2000 article for Vanity Fair, Hilton was hailed as \"New York's leading It Girl\", whose fame was beginning to \"extend beyond the [local] tabloids\", by The Guardian in February 2001. The scandal involving her sex tape, which arose shortly before the December 2003 premiere of The Simple Life, ultimately catapulted her into global fame and made her an overnight subject of media frenzy, paparazzi attention and public scrutiny. The sudden and unusual interest on her life led Entertainment Weekly to write that, \"[w]e in the media have become Paris-ites\". Similarly, CNN.com described her presence as an \"staple of the daily news cycles\" that became \"impossible to escape\". In an effort to \"rehabilite her public image\" and \"capitalise\" on the increased curiosity following the release of her sex tape, Hilton started to promote herself through different forms of mass media such as advertising, publishing and broadcasting.Throughout the 2000s, a decade widely associated with her heyday, Hilton's media ubiquity fed the then-booming online gossip industry and cemented her \"It Girl\" status. The exposure nurtured an \"ambivalent\" but symbiotic relationship between Hilton and the press, from which both parties benefited. On different occasions, she has complained about the way she was treated by the media in her twenties, particularly about their narrative on her and constant presence in her proximity, whereas at other times she sought their attention and hand information to reporters herself. Moreover, she regularly planned public occurrences, described as \"pseudo-events\", with the purpose of being photographed and reported on. "}, {"text": "=== Media presence ===Sheeraz Hasan, who founded Hollywood.TV and briefly served as her media consultant, stated: \"I built the foundation of one of the biggest paparazzi companies in the world on the back of Paris Hilton. I had over 100 guys in Los Angeles [...] all of them making a living off\" Hilton. Emerging media outlets often received criticism for having a personality cult around figures such as Hilton, but TMZ founder Harvey Levin attributed their coverage on her to how it helped draw a high viewership to the website. Perez Hilton, on his part, purports to have befriended Hilton, who became the source of his stage name and frequent subject of his posts. It has been noted, for example, that he rarely reports on stories or rumors casting her in a negative or unflattering light, and that, unlike most gossip blogs, he often acknowledges and praises her positive achievements. In August 2006, YouTube promoted her eponymous debut album as part of its first targeted advertising launch."}, {"text": "=== Media presence ===The media's over-saturation on Hilton had reached a peak in 2007 amid her much-publicized legal problems. She became the fifth most heavily covered story of the week of June 4 in North America. According to Pew Research Center, roughly a third of Americans (34%) followed news about Hilton very or fairly closely, with public interest in her surpassing that in the 2008 presidential campaign, The G8 summit, and talks between George W. Bush and Vladimir Putin. As a response, the Associated Press attempted to not mention her for the week of February 19, 2007, Mika Brzezinski refused to read a report about Hilton's release from jail on the June 26, 2007, broadcast of Morning Joe, and Us Weekly published its first \"100% Paris-Free\" issue on June 29, 2007.Despite the institution of a reporting ban on Hilton, Forbes ranked her as the most \"overexposed\" celebrity a second time in 2008. A television campaign ad by the 2008 John McCain presidential campaign, in which McCain compared Barack Obama to celebrities such as Hilton and Britney Spears, prompted a direct response from her through a Funny or Die video entitled Paris Hilton Responds to McCain Ad, which was viewed by more than seven million people in two days and received worldwide press coverage as well as written and verbal responses from both campaigns.By December 2009, Hilton's presence in mass media had reportedly started to wane and become less noteworthy. That month, CNN.com published a story asking, \"Why has Paris Hilton disappeared?\", in which her absence from daily news circles was attributed to an over-saturated public and a new collective interest on other celebrities. In subsequent years, she remained in the media spotlight, albeit was noted to have \"somewhat receded from view\".Hilton developed an online and social media presence and, as of 2021, reached over 60 million users across her social platforms, including Instagram, Twitter, TikTok, Facebook, and YouTube. In March 2012, an experiment conducted by The Next Web concluded that Hilton generated less traffic than actor Charlie Sheen on Twitter, but she has trended on the platform on several occasions. In 2020, according to a  Deadline report, there were over 257 million views on videos mentioning her name on social media and her catchphrase \"That's Hot\" resulted in more than 4.8 billion impressions on TikTok. TikTok videos tagged with her name had collectively received more than 2 billion views, as of 2022. To date, her YouTube channel has accumulated over 250 million views.Throughout her career, Hilton has graced the covers of numerous international magazines, including US' Ocean Drive, FHM, Maxim, Elle, Nylon, Variety, and Paper; UK's Elle, Es Magazine and Gay Times; France and Turkey's Vogue; Spain's Vanity Fair; and New Zealand's Remix. She interviewed singer Kim Petras for the Summer 2018 issue of Paper as well as rapper Saweetie for the Summer 2021 issue of Wonderland. She wrote a  profile on Britney Spears for the 2021 Time 100 listicle."}, {"text": "=== In popular culture ===Hilton has had two popular television characters loosely based on her real-life persona: London Tipton from The Suite Life of Zack & Cody (2005–2008) and Caroline Channing in 2 Broke Girls (2011–2017). The World of Warcraft massively multiplayer online role-playing game has featured a character named Haris Pilton, labeled a \"socialite\", since the release of The Burning Crusade expansion on January 15, 2007. She is the source for the name of the celebrity gossip blog PerezHilton.com.Hilton has been parodied in the music videos for Pink's \"Stupid Girls\" (2006), and Falling in Reverse's \"I'm Not a Vampire\" (2011), the South Park episode \"Stupid Spoiled Whore Video Playset\" (2004), The Simpsons episode \"Homerazzi\" (2007), and the Hollywood films White Chicks (2004), Date Movie (2006), Epic Movie (2007), and Meet the Spartans (2008). She has been dramatised in the television film Paparazzi Princess: The Paris Hilton Story (2008), by Amber Hay, who had spoofed Hilton in a viral 2007 YouTube video titled \"Paris in Jail\", and in the Lifetime biographical drama Britney Ever After (2017), by Jillian Walchuck. In the second, ninth and thirteenth seasons of RuPaul's Drag Race, she has been portrayed by Raven, Trinity the Tuck and Gottmik respectively. Comedians Breven Angaelica Warren (E! mock television series) and Maya Rudolph (SNL), and television personalities Tyra Banks (The Tyra Banks Show) and Matt Lauer (The Today Show) are among the figures who have spoofed Hilton's public persona.In 2005, Madame Tussauds unveiled Hilton's wax figure to coincide with the release of House of Wax. In 2006, she became a target of the street artist Banksy, when 500 copies of her album in 48 record shops across the United Kingdom were replaced with his own alternative version. His rework of the album featured remixes produced by himself and Danger Mouse. The track list contained satire song titles such as \"Why Am I Famous?\", \"What Have I Done?\" and \"What Am I For?\". He also changed the cover sleeve and booklet to display pictures of the singer topless. In 2017, she was one of the subjects of an art exhibit called \"Nicole Richie's 2007 Memorial Day BBQ\", which was unveiled at Brooklyn's THNK 1994 Museum. In The Good Place episode \"The Brainy Bunch\" (2018), an American-themed restaurant includes a wall art featuring an alternative Mount Rushmore formed by Hilton, David Hasselhoff, Judge Judy, and Hulk Hogan. She has also been a subject of other media depictions such as print biographies, documentaries and television specials."}, {"text": "== Cultural influence ==It has been said that Hilton's rise to fame, coinciding with society's increased fixation on celebrity and the internet becoming a more accessible medium, facilitated the insurgency of an unprecedented type of celebrity —which was initially promoted by reality television and has since intensified with the posterior growth of social media— whose displays of its private life became an unusual focus of public interest, and therefore, their own source of income.In 2018, Lili Anolik, of Vanity Fair, observed that Hilton \"instinctively grasped that the great cultural contribution of the movies was movie stars\", and further said that since \"anybody with a phone was now a potential cineaste\" and \"true movie stars require[d] raw presence, not refined acting skills\", she needed \"only ever perform herself, or, rather, 'herself'[:] a gorgeous blonde ditz, the modern-day Monroe\". In 2020, Los Angeles Times' editor Lindzi Scharf regarded her as \"the woman who will likely go down in history for putting the 'i' in influencer\". GQ's Carrie Battan had previously called her \"the figure who set off Hollywood 2.0's Big Bang, the effects of which continue to radiate through the industry today. Hilton, the one who made it possible to be famous for doing nothing, was so sought-after in the [...] 2000s that you couldn't get her to walk to her mailbox without giving her a check\". Bert Marcus, the director of the documentary The American Meme (2018), echoed that sentiment, remarking that she \"paved the way for creating a brand and a celebrity out of being herself and she turned it into a phenomenon,\" while Instagram celebrity and entrepreneur The Fat Jew, who was one of the subjects in the aforementioned documentary, credited her for \"inventing the way the world thinks about influence\"."}, {"text": "== Cultural influence ==Hilton made part of the early 2000s popularization of reality television into mainstream pop culture. Vice, in a 2015 profile, noted that after The Simple Life premiered in 2003, \"cable channels began programming reality television shows. MTV's second golden age consisted of The Hills; Andy Cohen reinvented Bravo with a repertoire of The Real Housewives, and TLC started teaching Americans about Dance Moms and Honey Boo Boo\". Dazed once considered that every \"[reality] star who cashes in after the series by collaborating with brands is essentially selling a sort of post-Hilton aspirational glamour\". The Kardashian family, Heidi Montag, Spencer Pratt, Tila Tequila, Danielle Staub, Alexa Chung, Brittny Gastineau, and Snooki are some of the personalities who are said to have followed in her footsteps. Kim Kardashian acknowledged Hilton for \"giving\" her a career, while Tana Mongeau stated that the media personality \"paved the way for me. A girl like me who is literally famous for nothing –Paris Hilton taught us how to make that a business, you know what I mean\".Hilton's influence on fashion, tabloid journalism, and Hollywood throughout the 2000s led her to be considered an American pop culture icon. The height of her fame contributed to the growth of what The New York Times described as a \"misogynist\" and intrusive celebrity culture, monopolized by tabloids and paparazzi. For instance, a paparazzi photograph of her, at that time, could range from US$8,000 to US$1 million, celebrity-focused newspapers and media agencies (e.g. TMZ and Hollywood.TV) attributed part of their large viewership to their coverage on Hilton, and a network of gossip blogs such as PerezHilton.com emerged after she rose to fame. The clothing style that defined her image in her heyday —tracksuits, rhinestones, trucker hats and \"the accessory dog\"— became a popular fashion trend and helped popularize brands such as Juicy Couture and Von Dutch. The Julien Macdonald dress Hilton wore for her 21st birthday has been recreated numerous times, while a 2011 report from The Kennel Club associated her with  \"the upsurge of popularity\" in \"so-called handbag dogs\". People magazine wrote in a March 2017 article: \"For millennials, Paris Hilton has always been and will always be a living legend. The socialite has come to perfectly define not only the millennial fashion aesthetic, but also a bygone era of celebrity where social media was nonexistent, as were stylists, and getting papped while partying was simply de rigueur\" (to get \"papped\" is to be followed and photographed by paparazzi).Hilton has been discussed by journalists and scholars interested in the role of celebrities and their influence through the media. Feminist theorist Camille Paglia described her as a \"groundbreaking\" figure in Hollywood, while in her book The Bling Ring, an account on the group of thieves who robbed Hilton's house, Nancy Jo Sales positioned her as a \"celebrity symbol of how destructive individualism ruled the 2000s\". Jej Perfekcyjność, a Polish sociologist and queer activist, created and organised a yearly event known as International Paris Hilton Day, which took place in Warsaw since 2006, on the first Sunday of May. However, the celebration was cancelled in 2010, following a plane crash near Smolensk, and was permanently discontinued in 2013, due to controversial comments made by Hilton the previous year. On August 29, 2006, the mayor of Las Vegas proclaimed the day \"Paris Hilton Day\" and gave Hilton a key to the city. Her quote, \"Dress cute wherever you go; life is too short to blend in\", was added to The Oxford Dictionary of Quotations in September 2009."}, {"text": "== Personal life ==Throughout Hilton's adulthood, numerous aspects of her personal life —particularly, her uninhibited and extravagant jet set lifestyle, her extensive list of friendships, relationships and romantic associations with other high-profile figures, heavy partying, and reported instances of inappropriate behavior— have drawn a large amount of media attention and public disapproval.Hilton is known for her love of small dogs, and has had a female Chihuahua named Tinkerbell among many other pets. Hilton was frequently seen carrying Tinkerbell (dubbed an \"accessory dog\") at social events and functions, and in all five seasons of television reality show The Simple Life. In April 2015, it was reported that Tinkerbell had died at age 14. In one of her properties, Hilton had a 300-square-foot house with air conditioning, heating, and designer furniture built for her pets at an estimated cost of US$325,000.Hilton resides in Beverly Hills, and owns a house in Mulholland Estates, an oceanfront property in Malibu, as well as a penthouse in Manhattan."}, {"text": "=== Relationships and family ===In 2000, a then-19-year-old Hilton drew attention from tabloids when she and Leonardo DiCaprio were seen together on the NYC late-night circuit. That led to one of her first magazine profiles, with Vanity Fair, in which she denied that they were involved. She dated actor Edward Furlong in 2000, and poker player Rick Salomon, with whom she filmed her sex tape, in 2001. She was engaged to fashion model Jason Shaw from 2002 to 2003. They have reportedly remained friends since their split. She had a seven-month relationship with singer Nick Carter in 2004; Carter opened up about their relationship in his 2013 autobiography. \"Paris was the worst person in the world for me to hook up with,\" he wrote. \"[She] fed my worst impulses as far as partying.\"Hilton started dating Greek shipping heir Paris Latsis in December 2004, and they became engaged seven months later. In November 2005, they called the wedding off. She next had a relationship with another Greek heir, Stavros Niarchos, whom she dated on and off between December 2005 and March 2007. Hilton dated Good Charlotte guitarist Benji Madden from February until November 2008. An on-and-off relationship with The Hills star Doug Reinhardt followed, but they broke up definitively in April 2010, when she became concerned that he was using her to further his career. She next had a one-year relationship with Las Vegas nightclub owner Cy Waits. She dated Spanish model River Viiperi between 2012 and 2014, and businessman Thomas Gross between 2015 and 2016. Actor Chris Zylka proposed to her in January 2018, during a vacation in Aspen, after one year of dating. They called off their engagement in November 2018.In December 2019, Hilton started a relationship with businessman Carter Reum. After becoming engaged on February 13, 2021, Hilton and Reum were married in Los Angeles on November 11. They have a son and a daughter born via surrogacy in January and November 2023, respectively."}, {"text": "=== Sex tape ===In 2003, a sex tape featuring Hilton and then-boyfriend Rick Salomon was leaked onto the Internet shortly before the premiere of The Simple Life. Salomon filed a lawsuit against the company that distributed the tape, and against the Hilton family, whom he accused of tarnishing his reputation by suggesting that he had exploited Hilton. Hilton later sued the company that released the tape, Kahatani Ltd., for US$30 million for violation of privacy and emotional distress.Under the title 1 Night in Paris, Salomon began distributing the tape himself in April 2004 through the adult film company Red Light District Video. In July 2004, Salomon dropped his lawsuit against the Hilton family after Paris Hilton's privacy lawsuit was thrown out of court. Salomon and Red Light District Video agreed to pay Hilton US$400,000 plus a percentage of the tape's sale profit. In 2013, Hilton claimed she never made money off her sex tape: \"[I] never made a dollar. I make enough money in nice ways. My fragrance [line] makes enough, I don't need to worry about that.\""}, {"text": "=== Legal issues ===On September 7, 2006, Hilton was arrested by the Los Angeles Police Department (LAPD) and charged with driving under the influence of alcohol, with a blood alcohol content of 0.08%. In November 2006, Hilton's driver's license was suspended, and on January 22, 2007, she pleaded no contest to a reckless driving charge. Her sentence was 36 months' probation and fines totaling about US$1,500. On February 27, 2007, she was stopped for driving with a suspended license, and she signed an agreement that she was not permitted to drive. The next month, she was caught driving 70 mph in a 35-mph zone without headlights at night with a suspended license. Prosecutors in the office of the Los Angeles City Attorney charged that these infractions and her failure to enroll in a court-ordered alcohol-education program violated her probation. On May 4, 2007, Hilton was sentenced by Judge Michael T. Sauer to 45 days in jail for the probation violation. She planned to appeal the sentence, supporting an online petition (created on May 5 by Joshua Morales) asking California governor Arnold Schwarzenegger for a pardon. Hilton changed lawyers and dropped her plans to appeal."}, {"text": "=== Legal issues ===Hilton was required to begin her jail term on June 5, 2007, and entered the Century Regional Detention Facility (a women's prison in Lynwood, California) after attending the 2007 MTV Movie Awards on June 3, 2007. On June 7, 2007, Los Angeles County Sheriff, Lee Baca signed an order resentencing Hilton to 40 days of home confinement with an electronic monitoring device due to an unspecified medical condition. Baca said, \"My message to those who don't like celebrities is that punishing celebrities more than the average American is not justice.\" He added, \"The special treatment, in a sense, appears to be because of her celebrity status ... She got more time in jail.\" Judge Michael Sauer summoned her to reappear in court the following morning (June 8), since her original sentence specified imprisonment: \"No work furlough. No work release. No electronic monitoring.\" At the hearing, Sauer declined a briefing in chambers by Hilton's attorney on her medical condition and sent her back to jail to serve the original 45-day sentence. When she heard the decision, Hilton shouted \"It's not right!\" Screaming, she asked to hug her mother. Hilton was moved to the medical wing of the Twin Towers Correctional Facility in Los Angeles, and returned to the Century Regional Detention Facility in Lynwood on June 13. Hilton was released from jail on Tuesday, June 26, 2007.Hilton was influenced by minister Marty Angelo in jail, referring to a \"new beginning\" in an interview with talk-show host Larry King on June 28, 2007 (two days after her release) and quoting from Angelo's autobiography (Once Life Matters: A New Beginning). On June 9, Angelo unsuccessfully petitioned Sauer to let him serve the remainder of Hilton's sentence if the judge would release her to an alternative treatment program. Hilton told King during the interview that she had taken Adderall for ADHD since childhood.On July 2, 2010, Hilton was accused of smoking marijuana at the 2010 FIFA World Cup game between Brazil and the Netherlands. Although she was escorted from the Nelson Mandela Bay Stadium by local police, the case was later dismissed. Her publicist, Dawn Miller, said: \"I can confirm that the incident was a complete misunderstanding and it was actually another person in the group who did it\". Two weeks later, Hilton was detained and released after she was caught with cannabis at Corsica's Figari Sud-Corse Airport.On August 27, 2010, Hilton was arrested by the Las Vegas Metropolitan Police Department on suspicion of cocaine possession in Las Vegas and her boyfriend, Cy Waits, was charged with driving under the influence. Hilton and Waits were booked into the Clark County jail, where Hilton was kept handcuffed on a booking room bench, fingerprinted, photographed and released without bail. Hilton's defense initially claimed that the handbag (containing 0.8g of cocaine) was not hers. She later claimed personal items (including cash and credit cards) from the bag, acknowledging that it was hers. To avoid a felony conviction, Hilton pleaded guilty to two misdemeanors on September 17, 2010. Under the terms of the plea bargain she was sentenced to one year of probation, 200 hours of community service, a US$2,000 fine and the completion of a drug-abuse treatment program on September 20. Clark County District Attorney David Roger said, \"If she was arrested for anything besides a minor traffic violation she will spend a year in jail. There will be no discussion. The court will have no discretion.\"On September 21, 2010, on their way to a Tokyo press conference to promote fashion and fragrance lines, Hilton and her sister Nicky were stopped by immigration officers at Narita Airport because of Hilton's drug-possession conviction the previous day. Under Japan's strict drug laws, travelers convicted of a drug crime are usually denied entry into the country. Airport officials questioned Hilton \"for hours\", and she and Nicky were detained overnight at the airport hotel. On September 22, Japanese authorities denied Hilton entry, and she was put on a plane back to the United States. Other stops on their Asian promotional tour were canceled due to Indonesia and Malaysia's anti-drug laws."}, {"text": "=== Bling Ring ===Between 2008 and 2009, Hilton's house was burgled several times by the Bling Ring, a group of fashion-motivated thieves. She was the group's first and main celebrity target, with a majority of the stolen property belonging to her. They reportedly burgled Hilton's residence seven times. It was not until nearly US$2 million were stolen in jewellery, clothing, cash, and other items from Hilton that she made a report. She allowed Sofia Coppola to shoot some scenes for The Bling Ring (2013) at her house."}, {"text": "=== Stalking and other incidents ===On January 22, 2007, her private life became public on ParisExposed.com, a website with images of personal documents, video and other material allegedly obtained when the contents of a storage locker rented by Hilton were auctioned in lieu of a US$208 payment. The website, which charged for online access to the material, had 1.2 million visitors in just over 40 hours. Among its contents were medications, diaries, photographs, contracts, love letters and a video shot by Joe Francis of Girls Gone Wild, in which Hilton repeats racist and homophobic slurs. Hilton obtained a temporary injunction against ParisExposed.com which shut down the website.In August 2010, Nathan Lee Parada was arrested after security men spotted him wielding two knives outside Hilton's house. He was found guilty on one felony count of attempted first-degree residential burglary and was sentenced to two years in state prison. In October 2010, James Rainford bicycled past guards at the entrance to her gated community, went to her house, and began pounding on her door. He was arrested and earned three years' probation, along with a restraining order from Hilton. In April 2011, Rainford was arrested a second time for attacking her boyfriend Cy Waits outside Van Nuys Superior Court, where Hilton was headed to testify against Nathan Lee Parada, and he was arrested again in July outside her Malibu, California, beach house. He was charged with two felony stalking counts and three misdemeanor counts of disobeying a court order, but a judge found him to be \"mentally incompetent to stand trial\" and he was sent to a state mental hospital."}, {"text": "=== Stalking and other incidents ===On September 20, 2012, an audio of what was perceived as homophobic comments made by Hilton, leaked onto the Internet. Following the backlash caused, she issued an apology through GLAAD.In November 2013, an \"obsessed fan\", flew a plane over Malibu with two banners, one of which read, \"Can't Get Paris Whitney Hilton Out of My Mind.\" The other read, \"Mr. & Mrs. Hilton, may I court your daughter Paris?\". The same person reportedly posed as a flower deliveryman to gain access to her gated community, where he left her a classic Cadillac, in 2015. In October 2014, Lukas Redanz, a man who was  completely covered with tattoos of Hilton and appeared to be \"extremely drunk\", was arrested after he reportedly went to her gated community \"to see her\". In December 2014, Hilton filed a report with the Los Angeles Police Department after receiving anti-Semitic messages on social media from a man who believed she was Jewish; he threatened to rape and kill her.Between 2015 and 2017, Hilton was the target of an identity theft scheme by Paytsar Bkhchadzhyan, a woman who used Hilton's credit cards to book a party at the Hollywood Roosevelt Hotel worth around $53,000. She also pretended to be Hilton in emails to her employees, convincing them to transfer $106,000 to her account, and hacked her sister Nicky and father Rick Hilton in an attempt to gain passwords to various other accounts. She also stole nude photos of Hilton from her iCloud account. Bkhchadzhyan was arrested in 2017 for bank fraud conspiracy, and was later sentenced to 57 months in prison and ordered to pay restitution."}, {"text": "=== Activism ===As a public figure, Hilton has been a  guest at fundraising events, children's hospitals, and orphanages. She has been involved with the Starlight Children's Foundation and the Make-A-Wish Foundation, and is listed on the \"First Families\" of the Children's Hospital Los Angeles, which means she has donated US$100,000 or more to the hospital. In 2008, a room at the hospital was named in her honor, and for her charitable efforts, Starlight and the American Humane Association have awarded Hilton the 2011 Heart of Gold Award, and the 2014 National Humanitarian Award, respectively.In 2011, Hilton supported the LGBT rights organization NOH8, and participated at the American Red Cross run to benefit relief effort in Japan, hosted by actor Josh Duhamel in Santa Monica, CA. In 2015, she raised US$100,000 for children with disabilities in Ibiza. In 2017, she donated 50 of her personal items to the Children's Hospital Los Angeles and the Starlight Children's Foundation, and visited San Gregorio Atlapulco, Mexico, where she handed out food and clothes to the affected families following the 2017 Central Mexico earthquake, donated merchandise and a sum of US$350,000 to help rebuild seven homes that were affected.In October 2018, Hilton hosted Rock The Runway, an event benefitting Children's Miracle Network Hospitals and The Sasha Project LA. 20 percent of the proceeds from her 2018 five-nail polishes line with Nail and Bone goes to Animal Haven, a New York-based non-profit rescue group. In June 2019, Hilton was part of the annual, all-female Cash & Rocket auto rally, which took place across Europe and raised money for Sumbandila, The Helen Bamber Foundation and Dream for Future Africa Foundation.During the COVID-19 pandemic, Hilton performed a DJ set at the virtual music festival #TrillerFest, to drive donations for No Kid Hungry and Music Cares, and a portion of the proceeds from her merchandise collection went to Frontline Foods and local restaurants feeding frontline workers.The release of the documentary This is Paris (2020), in which Hilton spoke about the abuse she endured as a teen in a series of boarding schools such as Provo Canyon School, prompted an increase of interest on #BreakingCodeSilence, a viral movement organized by people who were sent in their youth to a \"network of privately-owned, powerfully punitive, and often wilderness-based therapy programs, residential treatment centers, therapeutic boarding schools, group homes, boot camps, and faith-based academies\". On October 9, 2020, she held a rally outside Provo Canyon School in Utah in protest of alleged abuse and programs for troubled teens."}, {"text": "=== Activism ===On February 8, 2021, Hilton appeared before the Utah State Legislature to testify on behalf of a proposed measure that would require more government oversight of youth residential treatment centers and require them to document when they use restraints. During her testimony, Hilton said that she had been emotionally and physically abused during her 11-month stay at Provo Canyon School when she was 17. She accused staffers at Provo School of beating her, subjecting her to strip searches, force-feeding her medication, watching her shower, and sending her to solitary confinement without clothes as punishment. On March 2, the Utah Legislature approved the bill, known as SB127. On October 20, Hilton held a press conference at the United States Capitol, with lawmakers Ro Khanna and Jeff Merkley, to advocate for the introduction of the Accountability for Congregate Care Act, which would establish a bill of rights with protections for children in such facilities."}, {"text": "=== Wealth ===According to Forbes, Hilton  earned about US$2 million between 2003 and 2004, US$6.5 million between 2004 and 2005, US$7 million between 2005 and 2006, and US$8 million between 2008 and 2009. By 2011, CNN.com reported Hilton's annual earnings to be over US$10 million.In December 2007, Hilton's grandfather Barron Hilton pledged 97 percent of his estate (the Hilton family fortune) to a charitable organization founded by her great-grandfather Conrad Hilton: the Conrad N. Hilton Foundation. As a result, his grandchildren's inheritance was reduced. An immediate pledge of US$1.2 billion (proceeds from the sale of Hilton Hotels Corporation) was made, with a further US$1.1 billion due after his death. Barron cited the actions of his father, Conrad Hilton, as the motivation for his pledge. Conrad (Barron's father) had also left 97 percent of his estate to the foundation, and Barron contested his father's will to regain a sizable amount of the family fortune in a settlement.Much of Hilton's wealth comes from numerous endorsements, as well as her retail business, which includes numerous product lines and stores, and has generated sales of over US$4 billion. Her regular fees for both DJing and personal appearances in parties and events have been reported to be between US$250,000 and US$1 million. In 2009, for instance, Hilton, 50 Cent and Lenny Kravitz received US$4 million for the 51st-birthday party of Ed Hardy founder Christian Audigier, and in 2014, she earned US$2.7 million for four nights work —US$347,000 an hour— as part of her two-month residence in Ibiza."}, {"text": "== External links ==Official website"}, {"text": "== External links ==Paris Hilton at IMDb"}, {"text": "== External links ==Paris Hilton at Fashion Model Directory"}]