[{"text": "Sir Patrick Stewart  (born 13 July 1940) is an English actor whose career has spanned seven decades in theatre, film, television and video games. He has received accolades throughout his career including two Laurence Olivier Awards and a Grammy Award, as well as nominations for a Tony Award, three Golden Globe Awards, four Emmy Awards, and three Screen Actors Guild Awards. He received a star on the Hollywood Walk of Fame in 1996 and was knighted by Queen Elizabeth II for services to drama in 2010."}, {"text": "In 1966, Stewart became a member of the Royal Shakespeare Company. He made his Broadway theatre debut in 1971 in a production of A Midsummer Night's Dream. In 1979, he received the Laurence Olivier Award for Best Actor in a Supporting Role for his performance in Antony and Cleopatra in the West End. His first television role was in Coronation Street in 1967. His first major screen roles were in Fall of Eagles (1974), I, Claudius (1976) and Tinker Tailor Soldier Spy (1979). In 2008 he reprised his role as King Claudius in Hamlet and received his second Olivier Award and his first Tony Award nomination for respectively the West End and Broadway theatre productions."}, {"text": "Stewart gained international stardom for his leading role as Captain Jean-Luc Picard in Star Trek: The Next Generation (1987–94), its subsequent films and Star Trek: Picard (2020–23). He starred as Captain Ahab in the USA miniseries Moby Dick (1998), Ebenezer Scrooge in TNT television film A Christmas Carol (1999) and King Henry II in the Showtime made-for-television film The Lion in Winter (2003). He also became known for his comedic appearances on sitcoms Frasier and Extras for which he received a Primetime Emmy Award for Outstanding Guest Actor in a Comedy Series nomination. He also starred as the lead of Blunt Talk (2015–2016). He currently voices Avery Bullock on American Dad!. "}, {"text": "Stewart's first film role was in Trevor Nunn's Hedda (1975) followed by roles in John Boorman's Excalibur (1981) and David Lynch's Dune (1984). He gained further stardom when he portrayed Professor Charles Xavier in the X-Men series (2000–2014), Logan (2017) and an alternate version of the eponymous character in the Marvel Cinematic Universe film Doctor Strange in the Multiverse of Madness (2022). He has acted in films such as L.A. Story (1991), Robin Hood: Men in Tights (1993), Jeffrey (1995) and The Kid Who Would Be King (2019). He has also voiced roles in The Pagemaster (1994), The Prince of Egypt (1998), Jimmy Neutron: Boy Genius (2001), Chicken Little (2005), Gnomeo & Juliet (2011) and Ted (2012). "}, {"text": "== Early life and education ==Patrick Stewart was born in Mirfield in the West Riding of Yorkshire on 13 July 1940, the son of Gladys (née Barrowclough), a weaver and textile worker, and Alfred Stewart (1905–1980), a regimental sergeant major in the British Army Parachute Regiment during the Second World War who later worked as a general labourer and postman. He has two older brothers named Geoffrey (1925–1974) and Trevor (born 1935). He spent much of his childhood in a poor household in Mirfield, where he experienced domestic violence at the hands of his father. As a result of wartime service during the Dunkirk evacuation, his father suffered from combat fatigue, which is now known as PTSD. Stewart said in 2008, \"My father was a very potent individual, a very powerful man, who got what he wanted. It was said that when he strode onto the parade ground, birds stopped singing. It was many, many years before I realised how my father inserted himself into my work. I've grown a moustache for Macbeth. My father didn't have one, but when I looked in the mirror just before I went on stage I saw my father's face staring straight back at me.\"Stewart attended Crowlees Junior and Infant School, a Church of England–affiliated school in Mirfield. He later attributed his acting career to his English teacher there, Cecil Dormand, who \"put a copy of Shakespeare in [Stewart's] hand\" and told him to get up and perform. He entered Mirfield Secondary Modern School in 1951, aged 11, and continued to study drama there. Around the same time, he met and befriended fellow actor Brian Blessed on a drama course in Mytholmroyd. At the age of 15, he left school and increased his participation in local theatre. He supported himself with work as a newspaper reporter and obituary writer for the local newspaper, but quit after one year when his boss gave him an ultimatum to choose acting or journalism. According to one of his brothers, Stewart would attend theatre rehearsals when he was supposed to be in work and then invent the stories he was reporting on, or persuade other reporters to cover for him. Stewart got a job in a furniture store, that not only allowed him to attend rehearsals with little scheduling conflict, but he also found that his thespian talent was applicable, resulting him in becoming productive in sales while practising his acting technique by tailoring his sales pitch for each customer. He also trained in boxing. He has said that acting served as a means of self-expression in his youth. Stewart and Blessed later received grants to attend the Bristol Old Vic Theatre School. Stewart was the first person who was neither a graduate of Oxford nor Cambridge to receive a grant from West Riding Council."}, {"text": "=== Early acting career (1959–1987) ===Stewart's first professional stage appearance was on 19 May 1959 at the Theatre Royal, Bristol (for the Bristol Old Vic Company), playing Cutpurse (a thief among the audience for the play-within-a-play) in Cyrano de Bergerac, directed by John Hale. Following a period with Manchester's Library Theatre, Stewart became a member of the Royal Shakespeare Company in 1966, remaining with them until 1982. He was an associate artist of the company in 1967. He appeared with actors such as Ben Kingsley and Ian Richardson. In January 1967, he made his debut TV appearance on Coronation Street as a fire officer. In 1969, he had a brief TV cameo role as Horatio, opposite Ian Richardson's Hamlet, in a performance of the gravedigger scene as part of episode six of Sir Kenneth Clark's Civilisation television series. During the early 1970s, UCSB professor Homer Swander recruited him to help teach American university students about Shakespeare, which led to his breakthrough into Hollywood. He made his Broadway debut as Snout in Peter Brook's legendary 1970 production of A Midsummer Night's Dream, then moved to the Royal National Theatre in the early 1980s. "}, {"text": "=== Early acting career (1959–1987) ===Over the years, Stewart took roles in many major television series without ever becoming a household name. He appeared as Vladimir Lenin in Fall of Eagles; Sejanus in I, Claudius; Karla in Tinker Tailor Soldier Spy and Smiley's People; Claudius in a 1980 BBC adaptation of Hamlet. He took the romantic male lead in the 1975 BBC adaptation of Elizabeth Gaskell's North and South. He also took the lead, as psychiatric consultant Dr Edward Roebuck, in BBC's Maybury in 1981. He continued to play minor roles in films, such as King Leondegrance in John Boorman's Excalibur (1981), the character Gurney Halleck in David Lynch's Dune (1984), Dr. Armstrong in Tobe Hooper's Lifeforce (1985) and Henry Grey in Lady Jane (1986), the story of English Queen Lady Jane Grey.Stewart preferred classical theatre to other genres, asking Doctor Who actress Lalla Ward why she would work in science fiction or on television. In 1987, he nonetheless agreed to work in Hollywood on a revival of Star Trek, after Robert H. Justman saw him while attending a literary reading at UCLA. Stewart knew nothing about the cultural influence of Star Trek or its iconic status in American culture. He was reluctant to sign the standard contract of six years, but did so as he, his agent, and others with whom Stewart consulted, all believed the new show would quickly fail, and that he would return to his London stage career after making some money. Regardless, Stewart's trusted colleague, Ian McKellen, was particularly vocal in advising Stewart not to throw away his theatrical career for this foray into television, which Stewart had to disregard considering the opportunity. While in Hollywood, he spent 18 months using the professional name \"Patrick Hewes Stewart\" while negotiating the rights to his original name from an American actor who had already registered it with the Screen Actors Guild."}, {"text": "==== Star Trek: The Next Generation ====When Stewart was picked for the role of Captain Jean-Luc Picard in Star Trek: The Next Generation (1987–1994), the Los Angeles Times called him an \"unknown British Shakespearean actor\". Still living out of his suitcase because of his scepticism that the show would succeed, he was unprepared for the long schedule of television production that began at 4:45 am each day. He initially experienced difficulty fitting in with his less-disciplined castmates with a time when he called the main cast in to scold them for being unprofessional in his eyes recalled as an embarrassment, especially when he berated them saying \"We're not here... to have fun!\" Furthermore, Stewart recalled that his \"spirits used to sink\" when he was required to memorise and recite technobabble. He eventually came to better understand the cultural differences between the stage and television and relaxed to a degree at work, and his favourite technical line became \"spacetime continuum\". He remained close friends with his fellow Star Trek actors and became their advocate with the producers when necessary. Marina Sirtis credited Stewart with \"at least 50%, if not more\" of the show's success because others imitated his professionalism and dedication to acting. Jonathan Frakes said that while \"Some shows I've been on, actors show up who haven't even read the script\", Stewart \"set such a high bar for preparation. We all came to work in the morning completely prepared. We knew our lines and had broken down the script\"."}, {"text": "==== Star Trek: The Next Generation ====Stewart unexpectedly became wealthy because of the show's success. In 1992, during a break in filming, Stewart calculated that he earned more during that break than from 10 weeks of Woolf in London. From 1994 to 2002, he also portrayed Picard in the films Star Trek Generations (1994), Star Trek: First Contact (1996), Star Trek: Insurrection (1998) and Star Trek: Nemesis (2002); and in Star Trek: Deep Space Nine's pilot episode \"Emissary\", and received a 1995 Screen Actors Guild Award nomination for \"Outstanding Performance by a Male Actor in a Drama Series\"."}, {"text": "==== Star Trek: The Next Generation ====When asked in 2011 for the highlight of his career, he chose Star Trek: The Next Generation, because \"it changed everything [for me].\" He has also said he is very proud of his work on Star Trek: The Next Generation for its social messages and educational impact on young viewers. When questioned about his role's significance compared to his distinguished Shakespearean career, he said, \"The fact is all of those years in Royal Shakespeare Company—playing all those kings, emperors, princes and tragic heroes—were nothing but preparation for sitting in the captain's chair of the Enterprise.\" The accolades he has received include the readers of TV Guide in 1992 choosing him with Cindy Crawford, of whom he had never heard, as television's \"most bodacious\" man and woman. In an interview with Michael Parkinson, he expressed gratitude for Gene Roddenberry's response to a reporter who said, \"Surely they would have cured baldness by the 24th century,\" to which Roddenberry replied, \"In the 24th century, they wouldn't care.\""}, {"text": "==== Star Trek: The Next Generation ====On 4 August 2018, CBS and Stewart jointly announced that he would reprise his role as Jean-Luc Picard in a new Star Trek series. In a prepared statement, Stewart said he and the new show's producers would \"endeavour to bring a fresh, unexpected and pertinent story to life once more.\""}, {"text": "==== X-Men film series ====The success of the Star Trek: The Next Generation TV and film franchises typecast Stewart as Picard and obtaining other roles became difficult. He also found returning to the stage difficult because of his long absence. He commented that he would never have joined The Next Generation had he known that it would air for seven years: \"No, no. NO. And looking back now it still frightens me a little bit to think that so much of my life was totally devoted to Star Trek and almost nothing else.\""}, {"text": "==== X-Men film series ====However, in the late 1990s he accepted a key role in the big-budget X-Men film series, as Professor Charles Xavier, founder and mentor of the superhero team, a role similar in many ways to Picard. He was initially reluctant to sign on to another movie franchise, but his interest in working with director Bryan Singer persuaded him. In addition, Stewart was joined by Ian McKellen, who had by then conceded that his friend had made a prudent choice performing in popular screen science fiction, who played Xavier's friend and ideological nemesis, the super villain Magneto. Stewart has played the role in seven feature films (X-Men, X2, X-Men: The Last Stand, X-Men Origins: Wolverine, The Wolverine, X-Men: Days of Future Past and Logan) and voiced the role in several video games (X-Men Legends, X-Men Legends II, and X-Men: Next Dimension). Stewart announced that he would be leaving the X-Men film franchise after Logan.In 2022, Stewart portrayed the Professor Xavier of Earth-838 in the Marvel Cinematic Universe film Doctor Strange in the Multiverse of Madness."}, {"text": "==== Documentaries ====In 2011, Stewart appeared in the feature-length documentary The Captains alongside William Shatner (who played Star Trek Captain James Kirk) – Shatner also wrote and directed the film. In the film, Shatner interviews actors who have portrayed captains within the Star Trek franchise. The film pays a great deal of attention to Shatner's interviews with Stewart at his home in Oxfordshire, as well as at a Star Trek Convention in Las Vegas, Nevada; Stewart reveals the fear and personal failings that came along with his tenure as a Starfleet captain, and also the great triumphs he believes accompanied his role as Picard. In 2016, he narrated Connected Universe, a crowdfunded documentary film directed by Malcolm Carter on the ideas of self-styled physicist Nassim Haramein."}, {"text": "==== Other film and television ====Stewart's other film and television roles include the flamboyantly gay Sterling in the 1995 film Jeffrey and King Henry II in The Lion in Winter, for which he received a Golden Globe Award nomination for his performance and an Emmy Award nomination for executive-producing the film. He portrayed Captain Ahab in the 1998 made-for-television film version of Moby Dick, receiving an Emmy Award nomination and Golden Globe Award nomination for his performance. He starred in the 1998 film Safe House. He also starred as Scrooge in a 1999 television film version of Charles Dickens' A Christmas Carol, receiving a Screen Actors Guild Award nomination for his performance."}, {"text": "==== Other film and television ====In late 2003, during the 11th and final season of NBC's Frasier, Stewart appeared on the show as a gay Seattle socialite and opera director, who mistakes Frasier for a potential lover. In July 2003, he appeared in Series 2 (Episode 09) of Top Gear in the Star in a Reasonably-Priced Car segment, achieving a time of 1:50 in the Liana. In 2005, he was cast as Professor Ian Hood in an ITV thriller 4-episode series Eleventh Hour, created by Stephen Gallagher. The first episode was broadcast on 19 January 2006. He also, in 2005, played Captain Nemo in a two-part adaptation of The Mysterious Island. Stewart also appeared as a nudity-obsessed caricature of himself in Ricky Gervais and Stephen Merchant's television series Extras. He played John Bosley in the 2019 action comedy film Charlie's Angels, released on 15 November.He also was a voice actor on the animated films The Prince of Egypt, Jimmy Neutron: Boy Genius, Chicken Little, The Pagemaster, The Emoji Movie, Dragon Rider,  the English dubbings of the Japanese anime films Nausicaä of the Valley of the Wind, by Hayao Miyazaki, and Steamboy, by Katsuhiro Otomo. He supported his home town of Dewsbury in West Yorkshire by lending his voice to a series of videos on the town in 1999. He voiced the pig Napoleon in a made-for-TV film adaptation of George Orwell's Animal Farm and guest starred in the Simpsons episode \"Homer the Great\" as Number One. Stewart also recorded a narration planned for the prologue and epilogue for Tim Burton's The Nightmare Before Christmas but the final movie used another voice (the original narration appears only on the first edition of the film's soundtrack). He plays a recurring role as CIA Deputy Director Avery Bullock, lending his likeness as well as his voice on the animated series American Dad!. He has also made several guest appearances on Family Guy in various roles. Stewart also appears as narrator in Seth MacFarlane's 2012 film directorial debut, Ted. In 2006, Stewart voiced Bambi's father, the Great Prince of the Forest, in Disney's direct-to-video sequel Bambi II."}, {"text": "=== Theatre (1990–present) ===After The Next Generation began, Stewart soon found that he missed acting on the stage. Although he remained associated with the Royal Shakespeare Company, the lengthy filming for the series had prevented him from participating in most other works, leaving a \"gaping hole\" of many years in his CV as a Shakespearean actor, causing him to miss opportunities to play such notable roles as Hamlet, Romeo, and Richard III. Instead, Stewart began writing one-man shows that he performed in California universities and acting schools. One of these—a version of Charles Dickens's A Christmas Carol in which he portrayed all 40-plus characters—became ideal for him as an actor as well, because of its limited performing schedule."}, {"text": "=== Theatre (1990–present) ===In 1991, Stewart performed it on Broadway, receiving a nomination for that year's Drama Desk Award for Outstanding One-Person Show. He staged encore Broadway performances in 1992 and 1994, with the 1993 run held in London and the 1996 production in Los Angeles. Stewart brought the show back to Broadway in 2001, with all proceeds going to charity – and the show of 28 December's revenue, specifically, going to the 11 September campaign of the Actors Fund of America. A 23-day run re-opened in London's West End in December 2005. For his performances in this play, Stewart has received the Drama Desk Award for Best Solo Performance in 1992 and the Laurence Olivier Award for Best Entertainment for Solo Performance in 1994. He was also the co-producer of the show, through the company he set up for the purpose: Camm Lane Productions, a reference to his birthplace in Camm Lane, Mirfield."}, {"text": "=== Theatre (1990–present) ===Shakespeare roles during this period included Prospero in Shakespeare's The Tempest, on Broadway in 1995, a role he would reprise in Rupert Goold's 2006 production of The Tempest as part of the Royal Shakespeare Company's Complete Works Festival. In 1997, he took the role of Othello with the Shakespeare Theatre Company (Washington, D.C.) in a \"photo negative\" production of a white Othello with an otherwise all-black cast. Stewart had wanted to play the title role since the age of 14, so he and director Jude Kelly inverted the play so Othello became a comment on a white man entering a black society."}, {"text": "=== Theatre (1990–present) ===He played Antony again opposite Harriet Walter's Cleopatra in Antony and Cleopatra at the Novello Theatre in London in 2007 to excellent reviews. During this period, Stewart also addressed the Durham Union Society on his life in film and theatre. When Stewart began playing Macbeth in the West End in 2007, some said that he was too old for the role; he and the show again received excellent reviews, with one critic calling Stewart \"one of our finest Shakespearean actors\". He was named as the next Cameron Mackintosh Visiting Professor of Contemporary Theatre based at St Catherine's College, Oxford in January 2007. In 2008, Stewart played King Claudius in Hamlet alongside David Tennant. He won the Laurence Olivier Award for Best Supporting Actor for the part. When collecting his award, he dedicated the award \"in part\" to Tennant and Tennant's understudy Edward Bennett, after Tennant's back injury and subsequent absence from four weeks of Hamlet disqualified him from an Olivier nomination.In 2009, Stewart appeared alongside Ian McKellen as the lead duo of Vladimir (Didi) and Estragon (Gogo), in Waiting for Godot. Stewart had previously appeared only once alongside McKellen on stage, but the pair had developed a close friendship while waiting around on set filming the X-Men films. Stewart stated that performing in this play was the fulfilment of a 50-year ambition, having seen Peter O'Toole appear in it at the Bristol Old Vic while Stewart was just 17. Reviewers stated that his interpretation captured well the balance between humour and despair that characterises the work.In 2014, Stewart and McKellen appeared on Broadway with two alternating productions, Waiting for Godot and No Man's Land. To promote the plays, Stewart and McKellen, acted on Stewart's wife's suggestion to tour New York City in a Twitter campaign in which the actors would take playful photographs of themselves visiting various tourist locations on their days off while wearing their Godot characters' bowler hats. Although the plays' marketing department disapproved of the idea, the actors proceeded with the inexpensive publicity campaign, which proved a major success. Furthermore, this campaign changed Stewart's image as a serious actor by emphasizing his sense of humour, which led to frequent guest appearances in various comedy programs.Stewart has been a prolific actor in performances by the Royal Shakespeare Company, appearing in more than 60 productions. His first appearance was in 1966 in The Investigation and in the years that followed he became a core member of the company, taking on three or four major roles each season. On 18 November 2012, Stewart appeared on stage at St Martin's Theatre in the West End for a 60th anniversary performance of Agatha Christie's The Mousetrap, the world's longest-running play."}, {"text": "=== Voice work ===Known for his strong and authoritative voice, Stewart has lent his voice to a number of projects. He has narrated recordings of Prokofiev's Peter and the Wolf (winning a Grammy), Vivaldi's The Four Seasons (which had also been narrated by William Shatner), C. S. Lewis's The Last Battle (conclusion of the series The Chronicles of Narnia), Rick Wakeman's Return to the Centre of the Earth; as well as numerous TV programmes such as High Spirits with Shirley Ghostman. Stewart provided the narration for Nine Worlds, an astronomical tour of the Solar System and nature documentaries such as The Secret of Life on Earth and Mountain Gorilla. He is heard as the voice of the Magic Mirror in Disneyland's live show, Snow White – An Enchanting Musical. He also was the narrator for the American release of Dragons: A Fantasy Made Real. He is narrator for two fulldome video shows produced and distributed by Loch Ness Productions, called MarsQuest and The Voyager Encounters."}, {"text": "=== Voice work ===He lent his voice to the Activision-produced Star Trek computer games Star Trek: Armada, Armada II, Star Trek: Starfleet Command III, Star Trek: Invasion, Bridge Commander, and Elite Force II, all reprising his role as Picard. Stewart reprised his role as Picard in Star Trek: Legacy for both PC and Xbox 360, along with the four other \"major\" Starfleet captains from the different Star Trek series."}, {"text": "=== Voice work ===In addition to voicing his characters from Star Trek and X-Men in several related computer and video games, Stewart worked as a voice actor on games unrelated to both franchises, such as Castlevania: Lords of Shadow, Forgotten Realms: Demon Stone, Lands of Lore: The Throne of Chaos and The Elder Scrolls IV: Oblivion for which in 2006 he won a Spike TV Video Game Award for his work as Emperor Uriel Septim. He also lent his voice to several editions of the Compton's Interactive Encyclopedia."}, {"text": "=== Voice work ===His voice talents also appeared in a number of commercials including the UK TV adverts for the relaunch of TSB Bank, Domestos bleach and Moneysupermarket.com, an advertisement for Shell fuel and an American advertisement for the prescription drug Crestor. He also voiced the UK and Australian TV advertisements for the PAL version of Final Fantasy XII.Stewart used his voice for Pontiac and Porsche cars and MasterCard Gold commercials in 1996, and Goodyear Assurance Tyres in 2004. He also did voice-overs for RCA televisions. He provided the voice of Max Winters in TMNT in March 2007. In 2008, he was also the voice of television advertisements for Currys and Stella Artois beer. Currently, he is heard during National Car Rental television spots."}, {"text": "=== Voice work ===He voiced the narrator of the Electronic Arts computer game, The Sims Medieval, for the game's introduction cinematic and trailer released on 22 March 2011. He also voiced the story plaques and trailer of the MMOG LEGO Universe and the narrator of My Memory Of Us."}, {"text": "== Awards and honours ==In 2004, Stewart was appointed chancellor of the University of Huddersfield and subsequently as a professor of performing arts in July 2008. In these roles, Stewart has regularly attended graduation ceremonies in the UK and Hong Kong and teaches master classes for drama students. He stepped down from the chancellorship in July 2015, and was named chancellor emeritus in the installation ceremony for his successor, Prince Andrew, Duke of York. In August 2016 a building at the university was renamed the \"Sir Patrick Stewart Building\"."}, {"text": "== Awards and honours ==On 16 December 1996, Patrick Stewart received a Star on Hollywood Walk of Fame at 7021 Hollywood Blvd. In 1993, TV Guide named him the Best Dramatic Television Actor of the 1980s. Stewart was appointed an Officer of the Order of the British Empire (OBE) in the 2001 New Year Honours for services to acting and the cinema and a Knight Bachelor in the 2010 New Year Honours for services to drama. Stewart's knighthood was conferred by Queen Elizabeth II at an investiture ceremony at Buckingham Palace on 2 June 2010. Stewart carried the Olympic torch in July 2012 as part of the official relay for the 2012 London Summer Olympics and stated it was an experience he \"will never forget\", adding that it was better than any movie premiere. In a 2018 poll for Yorkshire Day, Stewart was ranked the third greatest Yorkshireman ever behind Monty Python comedian Michael Palin and fellow actor Sean Bean.In July 2001, Stewart received an honorary fellowship from the University of Wales, Cardiff. In 2011, he received an honorary doctorate of letters (D.Litt.) from the University of East Anglia. In July 2014, he received a D.Litt. from the University of Leeds. In May 2015, Stewart received an honorary doctorate (Dr.h.c.) from the Vrije Universiteit Brussel. He is an emeritus fellow of St Catherine's College, Oxford.Stewart shared with Hugh Jackman the Guinness World Record for the longest career as a live-action Marvel superhero, for his portrayal of Professor X until December 2021 when they were eclipsed by Tobey Maguire and Willem Dafoe. In May 2022, Stewart retook the record by appearing as the character in Doctor Strange in the Multiverse of Madness. Guinness cautioned the possibility of another change in the near future, with either Jackman solely or, Jackman and Stewart jointly likely to hold the award after the expected 2024 release of Deadpool 3."}, {"text": "== Charity work and activism ==In 2006, Stewart made a short video against domestic violence for Amnesty International, in which he recollected his father's physical attacks on his mother and the effect it had on him as a child. He said, \"The physical harm ... [was] a shocking pain. But there are other aspects of violence which have more lasting impact psychologically on family members. It is destructive and tainting. As a child witnessing these events, one cannot simply help somehow feeling responsible for them; for the pain, and the screaming, and the misery.\" In the same year, he gave his name to a scholarship at the University of Huddersfield, where he was Chancellor (2004–2015), to fund post-graduate study into domestic violence. Stewart's childhood experience also led him to become a patron of Refuge, a UK charity for abused women.In 2009, Stewart gave a speech at the launch of Created Equal, a book about women's rights, talking again about his personal experiences with domestic violence and the impacts they had on him. He said, \"Violence is a choice, and it's a choice a man makes ... the lasting impact on my mother ... and indeed on myself ... was extreme. Overcoming the lessons of that male stereotype that I was being shown was a struggle.\" He now hopes to set an example of \"what it has been like to be in an environment of such violence and that it can pass and that one can survive it and even though sometimes still a struggle.\" Additionally, in October 2011, he presented a BBC Lifeline Appeal on behalf of Refuge, discussing his own experience of domestic violence and interviewing a woman whose daughter was murdered by her ex-husband.Stewart has supported the armed forces charity Combat Stress since learning about his father's post-traumatic stress disorder when researching his family genealogy for the documentary series Who Do You Think You Are? He is patron of the United Nations Association – UK, and delivered a speech at UNA-UK's UN Forum 2012 on Saturday 14 July 2012, speaking of his father's experiences in the Second World War, and how he believed the UN was the best legacy of that period.On 15 April 2018 Stewart attended the launch event of the People's Vote, a campaign group calling for a public vote on the final Brexit deal between the UK and the European Union.In 2019, he acted as an International Rescue Committee spokesperson.Stewart is an avid advocate for pit bulls. He has fostered several dogs through Wags and Walks, a dog rescue in Los Angeles, and was honoured at the rescue's annual gala in 2018. He partnered with the ASPCA in 2017 for their National Dog Fighting Awareness Day Campaign. He frequently tweets pictures of himself with his foster dogs. In 2021, the ASPCA gave him their Pit Bull Advocate & Protector Award."}, {"text": "=== Relationships and children ===Stewart married his first wife, Sheila Falconer, in 1966; they divorced in 1990. Together, they have a son, Daniel, and a daughter, Sophia. Daniel is also an actor, and appeared alongside his father in the film Death Train, the sitcom Blunt Talk, and the Star Trek: The Next Generation episode \"The Inner Light\", playing his son in the last.In 1997, Stewart became engaged to American producer Wendy Neuss, one of the producers of Star Trek: The Next Generation. They married on 25 August 2000, and divorced three years later. Four months before his divorce from Neuss, Stewart co-starred with English actress Lisa Dillon in a production of The Master Builder, and the two were romantically involved until 2007.In 2008, Stewart began dating American singer and songwriter Sunny Ozell, whom he met while performing in Macbeth at the Brooklyn Academy of Music. He purchased a home in Brooklyn's Park Slope neighbourhood in August 2012, and subsequently began living there with Ozell. In March 2013, it was reported that they were engaged, and they married in September 2013 with Ian McKellen officiating. In 2020, Stewart revealed that his marriage to Ozell in Nevada had not been legally binding because McKellen's marriage credentials were not valid in Nevada. The couple subsequently held an impromptu and official second ceremony with McKellen at a Mexican restaurant in Los Angeles shortly after the Nevada ceremony."}, {"text": "=== Beliefs, causes, and interests ===Stewart has stated that his politics are rooted in a belief in \"fairness\" and \"equality\". He considers himself a socialist and is a member of the Labour Party. He stated, \"My father was a very strong trade unionist and those fundamental issues of Labour were ingrained into me.\" He was critical of the Iraq War and UK government legislation in the area of civil liberties, in particular its plans to extend detention without charge to 42 days for terrorist suspects. He signed an open letter of objection to this proposal in March 2008. In August 2018 he was widely misquoted by the Daily Telegraph amongst others, who announced that he had left Labour owing to concerns over the leadership of Jeremy Corbyn. He posted on Twitter to confirm that he had been misquoted and denied that he had left the party.Stewart is an atheist and a patron of Humanists UK. He also identifies as a feminist. He has publicly advocated the right to assisted suicide. In January 2011, he became a patron for Dignity in Dying and campaigns for an assisted dying law in the UK.In August 2014, Stewart was one of 200 public figures who signed a letter to The Guardian expressing their hope that Scotland would vote to remain part of the United Kingdom in September's referendum on that issue. In 2016, Stewart was among more than 280 figures from the arts world who backed a vote to remain in the EU in the referendum on that issue.On 2 March 2017, Stewart said he was going to apply for US citizenship to oppose the Trump administration. However, in an interview by the Press Association at the British Film Institute Luminous Fundraising Gala on 3 October 2017, he said that he hoped the US would pass stronger gun laws, but did not mention any intention of becoming an American citizen in furtherance of that hope.Stewart is a lifelong supporter of his local football club Huddersfield Town A.F.C. He was at Wembley Stadium in 2017 when the club won promotion to the top division for the first time since 1972. Since 2010, he has been president of Huddersfield Town Academy, the club's project for identifying and developing young talent.In an interview with American Theatre, he said, \"From time to time, I have fantasies of becoming a concert pianist. I've been lucky enough through the years to work very closely with the great Emanuel Ax. I've said to him that if I could switch places with anyone it would be with him.\"In 2015, Stewart defended the Belfast-based Christian bakers who were penalised for discrimination after refusing to bake a cake with words reading, \"Support Gay Marriage\". Stewart, on his Facebook profile, said that while he was still opposed to organised religion, \"It was not because it was a gay couple that they objected, it was not because they were celebrating some sort of marriage or an agreement between them. It was the actual words on the cake they objected to. Because they found the words offensive. I would support their rights to say 'No, this is personally offensive to my beliefs, I will not do it.'\" The Christian bakers ultimately won in a landmark Supreme Court decision for the United Kingdom, almost simultaneously with a similar case in the United States.Stewart is an avid car enthusiast, and is regularly seen at Silverstone during British Grand Prix weekends. He conducted the podium interview with the top three finishers in the 2017 Canadian Grand Prix. On a 2003 appearance on Top Gear, he set a lap time of 1 minute and 50 seconds on the \"Star in a Reasonably Priced Car\" feature. He holds a Motorsport UK competition licence and competed in the 2012 Silverstone Classic Celebrity Challenge race, finishing ninth, 3 m 02.808 s behind winner Kelvin Fletcher. During 2012, Stewart met his racing hero Stirling Moss for the BBC Two documentary Racing Legends.Stewart is a fan of the Beavis and Butt-Head television series from Mike Judge."}, {"text": "== Audiobooks ==2005: The Last Battle by C. S. Lewis"}, {"text": "== Audiobooks ==2006: A Christmas Carol by Charles Dickens (Audible)"}, {"text": "== Audiobooks ==2023: Making It So: A Memoir by himself"}, {"text": "== Books ==Stewart, Patrick (2023). Making It So: A Memoir. New York, NY: Gallery Books. ISBN 9781982167738. OCLC 1398633873."}, {"text": "== Further reading ==Schulman, Michael (15 November 2010). \"The Talk of the Town: The Boards: Roommates\". The New Yorker. Vol. 86, no. 36. pp. 36–?. Retrieved 28 January 2012."}, {"text": "== External links ==Portraits of Patrick Stewart at the National Portrait Gallery, London "}, {"text": "== External links ==Patrick Stewart at the Internet Broadway Database "}, {"text": "== External links ==Patrick Stewart at the Internet Off-Broadway Database "}, {"text": "== External links ==Patrick Stewart at IMDb "}, {"text": "== External links ==Patrick Stewart at the TCM Movie Database "}, {"text": "== External links ==Patrick Stewart at AllMovie "}, {"text": "== External links ==Patrick Stewart at Memory Alpha"}, {"text": "== External links ==Patrick Stewart at Emmys.com"}, {"text": "== External links ==Patrick Stewart Answers the Web's Most Searched Questions at Wired"}, {"text": "== External links ==Patrick Stewart at Library of Congress, with 29 library catalogue records"}, {"text": "== External links ==Patrick Stewart at the Internet Speculative Fiction Database"}]