[{"text": "Patricia Arquette (born April 8, 1968) is an American actress. She made her feature film debut as Kristen Parker in A Nightmare on Elm Street 3: Dream Warriors (1987) and has since starred in several film and television productions. She has received several awards including an Academy Award, two Primetime Emmy Awards, and three Golden Globe Awards."}, {"text": "She had starring roles in several critically acclaimed films, including True Romance (1993), Ed Wood (1994), Flirting with Disaster (1996), Lost Highway (1997), The Hi-Lo Country (1998), Bringing Out the Dead (1999) and Little Nicky (2000).  From 2005 to 2011, she starred as a character based on the medium Allison DuBois in the supernatural drama series Medium, winning the Primetime Emmy Award for Outstanding Lead Actress in a Drama Series in 2005."}, {"text": "For playing a single mother in the coming-of-age film Boyhood (2014), which was filmed from 2002 until 2014, Arquette won the Academy Award for Best Supporting Actress. Further success came for starring as a prison worker in the miniseries Escape at Dannemora (2018) and as Dee Dee Blanchard in the drama The Act (2019). They both won her Golden Globe Awards in addition to a Primetime Emmy Award for Outstanding Supporting Actress for the latter. She has since starred in the Apple TV+ thriller series Severance (2022) and comedy series High Desert (2023)."}, {"text": "== Early life and family ==Arquette was born in Chicago, Illinois, in 1968 to Lewis Arquette, an actor and puppeteer, and Brenda Olivia \"Mardi\" (née Nowak), who was involved in the arts and worked as a therapist. Through her father, Patricia is distantly related to explorer Meriwether Lewis. Arquette's father had converted from Catholicism to Islam. Arquette's mother was Jewish, and her ancestors emigrated from Poland and Russia."}, {"text": "== Early life and family ==Her father's family's surname was originally \"Arcouet\", and his paternal line was of French-Canadian descent. Her paternal grandfather was comedian Cliff Arquette. Patricia's siblings also became actors: Rosanna, Richmond, Alexis, and David. When she was a child, her parents offered to get her braces for her teeth, but she refused, claiming she didn't want to look perfect and \"it didn't feel like it would fit who I was inside.\"For a time her family lived on a commune in rural Bentonville, Virginia. She has said they became poorer the longer they lived there and she believes that experience enlarged her empathy. Her father was an alcoholic; her mother was violently abusive. When Arquette was seven, the family relocated to Chicago. They later settled in Los Angeles, California. Arquette attended Catholic school, and has said that when she was a teenager, she had wanted to be a nun."}, {"text": "== Early life and family ==At the age of fourteen, Arquette ran away from home after learning her father was having an affair—she settled with her sister, Rosanna Arquette, in Los Angeles. She has described her father as a working actor for industrial films, commercials and voiceovers – he was best known for his role as J.D. Pickett in the TV series The Waltons. Before pursuing a career in acting, Arquette had wanted to be a midwife."}, {"text": "== Early life and family ==She put this career prospect aside briefly in an attempt to gain acting jobs and gained success in the industry."}, {"text": "=== 1987–1996: Early career and breakthrough ===In 1987, Arquette's first starring roles included pregnant teenager Stacy in the television film Daddy, boarding school student Zero in Pretty Smart, and Kristen Parker in A Nightmare on Elm Street 3: Dream Warriors, alongside Robert Englund as Freddy Krueger and Heather Langenkamp as Nancy Thompson. She reprised her role as Kristen in the music video to Dokken's Dream Warriors (1987). She was asked to reprise her role in the sequel, A Nightmare on Elm Street 4: The Dream Master (1988), but she declined the offer in order to do other projects. She gave up the role of Tralala in Last Exit to Brooklyn due to her pregnancy with her son Enzo."}, {"text": "=== 1987–1996: Early career and breakthrough ===In 1988, Arquette played the daughter of Tess Harper in Far North. Her roles in the early 1990s were in low budget and independent films, including Prayer of the Rollerboys (1990) as love interest of Corey Haim's character, The Indian Runner (1991), which was the directorial debut of Sean Penn; and the drama Inside Monkey Zetterland. In 1992, she won a CableACE Award for Best Lead Actress in a Mini-Series for her portrayal of a deaf girl with epilepsy in Wildflower, directed by Diane Keaton and also starring Reese Witherspoon."}, {"text": "=== 1987–1996: Early career and breakthrough ===In her early career, Arquette received the most recognition for her role as Alabama Whitman, a free-spirited, kind-hearted prostitute in Tony Scott's True Romance (1993). The film was a moderate box office success but became a cultural landmark because of Quentin Tarantino's screenplay, which preceded Pulp Fiction, although some critics were deterred by the graphic violence. In one scene, Arquette puts up a fierce physical struggle in a fight with James Gandolfini (as a viciously sadistic killer) which her character ultimately wins. Arquette's performance received unanimous praise from critics. Janet Maslin of The New York Times remarked that Arquette played her role with \"surprising sweetness\", while Peter Travers remarked that \"Arquette delivers sensationally\". TV Guide noted that the film blends and recycles elements from the story of Bonnie and Clyde and Terrence Malick's \"love on the run\" film Badlands (1973). It gave True Romance overall a favourable review for having \"enough energy and verve to create something entirely fresh and infectiously entertaining\". Richard Corliss of Time Magazine made similar statements and also likened the film to the earlier, seminal Bonnie and Clyde.Arquette next appeared in the television film Betrayed by Love (1994), and the well-received biopic Ed Wood, directed by Tim Burton and starring Johnny Depp, where she portrayed his girlfriend. Her next role was as Laura Bowman in John Boorman's Beyond Rangoon (1995), which drew mixed critical reviews, but was a success internationally. In France, it was the official selection at the 1995 Cannes Film Festival, where it became one of the most popular hits of the event. Although the film had lackluster reviews, Arquette's performance as an American tourist in Burma during the 8888 Uprising was regarded as one of the work's strong points. Michael Sragow, writing for The New Yorker, stated \"Arquette gives the kind of mighty physical performance usually delivered by men in existential action classics like \"The Wages of Fear,\" but she suffuses it with something all her own - she's bulletproof yet vulnerable.\" Hal Hinson of The Washington Post remarked that the film was \"odd, brilliant in places, but frustrating all the same,\" commenting that \"Arquette shows real grit when the chips are down\".Arquette appeared in three films in 1996, the first the comedy film Flirting with Disaster (1996), about a young man's cross-country pursuit to find his parents. Critical reception was largely positive, with Todd McCarthy of Variety praising the film and the authenticity of Arquette's performance, highlighting that \"Arquette [is] very believably distracted and infuriated\". Flirting with Disaster grossed $14 million at the American box office and was screened in the Un Certain Regard section at the 1996 Cannes Film Festival. Her second film released that year was the period drama The Secret Agent, an adaptation of Joseph Conrad's 1907 novel of the same name. The film received average reviews. Infinity was her third film that year, a biographical drama about the early life of American physicist Richard Feynman. The film received mixed to positive reviews. Although Emmanuel Levy of Variety said that Arquette was \"miscast\", he stated that she \"registers more credibly in the first part of the film, when she plays an adolescent\"."}, {"text": "=== 1997–2003: Independent film work and critical success ===In 1997, Arquette starred in David Lynch's neo-noir psychological thriller Lost Highway, in dual roles as Renee Madison and Alice Wakefield. The film had an ambiguous narrative, which polarized audiences and drew varying critical opinion, but it established a strong cult following. Arquette played an elusive femme fatale in a critically revered performance that enabled her to draw on her sexuality more than any other previous role. Roger Ebert, of the Chicago Sun-Times, disliked the film, saying there was \"no sense to be made of it\" and voiced his distaste over a scene in which Arquette's character is asked to disrobe at gunpoint. Other critics were more favourable: Andy Klein of the Dallas Observer called it a \"two-hour plus fever dream\", Michael Sragow of The New Yorker called the film a \"compelling erotic nightmare\", and Edward Guthman of the San Francisco Gate wrote a glowing review praising Arquette's performance, calling it the \"strongest, most memorable performance [of the film]\" and favourably comparing her double role to Kim Novak's in Vertigo (1958). That same year, Arquette appeared in Nightwatch, a horror-thriller film directed by Ole Bornedal. The film is a remake the Danish film Nattevagten (1994), which was also directed by Bornedal. Nightwatch was not a box office success and received poor reviews by critics, many of whom considered it an unnecessary, inferior retelling of the original film."}, {"text": "=== 1997–2003: Independent film work and critical success ===In 1998, Arquette performed in two films: Goodbye Lover, a comedic neo-noir directed by Roland Joffé and The Hi-Lo Country, a period Western directed by Stephen Frears. The former received a poor critical reception while the latter received a more appreciative albeit modest response. The Hi-Lo Country was widely cited as a \"classic Western\" in the press. Stephen Holden of The New York Times said, \"In its best moments the movie feels like an epic hybrid of Red River and The Last Picture Show.\" In 1999, Arquette returned to familiar territory with the genre that began her career, in Stigmata, a horror film, in the lead role. Produced on a budget of $29 million, the film was a box office success, grossing $50,046,268. Internationally the film earned $39,400,000 for a total worldwide gross $89,446,268. Critics were not as receptive of the film as audiences, with Roger Ebert remarking \"possibly the funniest movie ever made about Catholicism – from a theological point of view\". Arquette then appeared in Martin Scorsese's Bringing out the Dead, based on the novel by Joe Connelly. The film united her with then-husband Nicolas Cage and received highly favourable critical reviews, but was a box office flop. Janet Maslin of The New York Times wrote that \"Arquette's quietly credible performance helps center Frank's experiences; one of the film's most honest scenes is one in which they share an ambulance ride without sharing a word\".Her next role was in the light-hearted comedy Little Nicky (2000), alongside Adam Sandler. Despite being a box office hit, the film received negative reviews, although Roger Ebert called it Sandler's best film to date. Following this, she starred in French-American comedy drama Human Nature (2001), written by Charlie Kaufman and directed by Michel Gondry. The film was met with mixed reviews and was screened out of competition at the 2001 Cannes Film Festival. Roger Ebert, in a three-star (out of a possible four) review, lauded the film's \"screwball charm\". The following year, she appeared in the small-scale mystery film The Badge, playing the widowed victim of a murdered transsexual woman. In 2003, she portrayed the controversial pornographic film star Linda Lovelace in the little known Deeper than Deep, which was followed with the more family orientated Disney produced Holes, as Kissin' Kate Barlow. Based on the 1998 novel of the same title by Louis Sachar, Holes grossed $16,300,155 in its opening weekend, making #2 at the box office, behind Anger Management's second weekend. Holes would go on to gross a domestic total of $67,406,173 and an additional $4 million in international revenue, totaling $71,406,573 at the box office against a $20 million budget, making the film a moderate financial success. Arquette's next film, Tiptoes, was released straight-to-DVD in the United States, despite a screening at the Sundance Film Festival."}, {"text": "=== 2004–2014: Further acclaim with Medium and Boyhood ===After the humdrum reception of Tiptoes, Arquette did not appear in another film until 2006's Fast Food Nation, directed by Richard Linklater. During these three years, she was largely working on Boyhood; it was released eight years later in July 2014. Fast Food Nation marked her second collaboration with Linklater; it is based on the bestselling 2001 non-fiction book of the same name by Eric Schlosser. Fast Food Nation received mixed to positive critical reviews. Peter Travers of Rolling Stone awarded the film three out of four stars and added, \"It's less an exposé of junk-food culture than a human drama, sprinkled with sly, provoking wit, about how that culture defines how we live ... The film is brimming with grand ambitions but trips on many of them as some characters aren't given enough screen time to register and others vanish just when you want to learn more about them.\" A. O. Scott of The New York Times wrote \"It's a mirror and a portrait, and a movie as necessary and nourishing as your next meal.\"In January 2005, Arquette made her first transition to television with NBC's Medium. Her role as (a fictional version of) psychic medium Allison DuBois won her an Emmy Award for Outstanding Lead Actress in 2005, as well as nominations for a Golden Globe in 2005, 2006 and 2007, a SAG Award in 2006, 2007 and 2010, and an Emmy Award in 2007. In 2009 NBC cancelled Medium, then CBS picked the series up and it lasted another two seasons. In 2008, she provided voice work for A Single Woman, which was panned. She did not appear in another film until 2012. Girl in Progress, a drama directed by Patricia Riggen, marked her return; it was met with negative reviews. In 2013, she returned to television, appearing on Boardwalk Empire as Sally Wheet. Also in 2013, Arquette filmed the true crime drama Electric Slide."}, {"text": "=== 2004–2014: Further acclaim with Medium and Boyhood ===In 2014, Boyhood was released, a project that Arquette and other actors had shot for 12 years beginning in 2002. The film was directed by Richard Linklater, marking his second collaboration with Arquette. In the film, she plays Olivia Evans, a single mother who raises her two children mostly alone with the sometimes assistance of their father (played by Ethan Hawke). The epic explores a 12-year scope. The film details the progression of her character's son, Mason, from ages 8 to 18. The film has received universal praise, with many critics calling it a \"landmark film\". Arquette received widespread acclaim for her performance. Critic Katie McDonahugh, writing for Salon, states \"the role gave [Arquette] space to be all of these messy things at once, and her performance was a raw, gutsy meditation on those profoundly human contradictions\". Margaret Pomeranz, writing for ABC Australia, called Arquette's performance \"stunning\" and praised the film, further remarking that \"the elision from one time to another is subtle and seamless. It's just a fabulous movie experience\". Arquette won the Academy Award, BAFTA, Critics' Choice, Golden Globe, Independent Spirit, and SAG Award for Best Supporting Actress."}, {"text": "=== 2015–present: Continued success and recent roles ===In early 2015, Arquette began starring in the CBS series CSI: Cyber, a show about FBI agents who combat Internet-based crimes. On May 12, 2016, CBS canceled the series after two seasons, thus ending the CSI franchise.Arquette portrayed Tilly Mitchell in the Ben Stiller-directed Showtime miniseries Escape at Dannemora, which premiered on November 18, 2018. For the role, she gained weight, wore prosthetic teeth, and brown contact lenses. For her performance, she received critical acclaim and won the SAG Award, Critics' Choice Television Award, and Golden Globe Award. She also received a nomination for the Primetime Emmy Award for Outstanding Lead Actress in a Limited Series or Movie."}, {"text": "=== 2015–present: Continued success and recent roles ===In 2018, it was announced that Arquette would be starring in the Hulu series The Act. The series premiered in March 2019 to critical acclaim. For her performance, Arquette received the Primetime Emmy Award for Outstanding Supporting Actress in a Limited Series or Movie. In 2022, Arquette began co-starring in the Apple TV+ thriller series Severance, also directed by Stiller. The series has received critical acclaim."}, {"text": "== Personal life ==At age 20, Arquette had a relationship with Paul Rossi, a musician. They had a son together, Enzo Rossi, born on January 3, 1989. In April 1995, Arquette married Nicolas Cage (with whom she later co-starred in Bringing Out the Dead in 1999). They separated after nine months, but acted as a couple in public until Cage filed for divorce in February 2000. She briefly dated Mark Rogowski.Arquette and actor Thomas Jane became engaged in 2002. Their daughter Harlow Olivia Calliope Jane was born on February 20, 2003. Arquette and Jane married on June 25, 2006, at the Palazzo Contarini in Venice, Italy. In January 2009, Arquette filed for divorce from Jane on the grounds of irreconcilable differences, but the couple soon reconciled. Arquette withdrew the divorce petition on July 9, 2009. On August 13, 2010, Jane's representative announced that Arquette and Jane had decided to proceed with a divorce due to \"irreconcilable differences\". The divorce was finalized on July 1, 2011, and the two agreed to joint custody of their child."}, {"text": "== Charity work ==After the Haiti earthquake in 2010, Arquette and childhood friend Rosetta Millington-Getty formed GiveLove, a non-profit organization supporting ecological sanitation and composting, community development projects and housing construction in Haiti. She has also worked with Eracism Foundation, Libby Ross Foundation, The Art of Elysium, and The Heart Truth.In 1997, after her mother died of breast cancer, Arquette worked to raise awareness about the disease. She has run in the annual Race for the Cure. In 1999 she was the spokesperson for Lee National Denim Day, which raises millions of dollars for breast cancer research and education.In April 2010, she teamed up with welding students of the Robert Morgan Educational Center in Miami, Florida, to build shelters in Haiti from 20 used shipping containers, to provide housing to people displaced by the earthquake."}, {"text": "=== Politics ===Arquette participated in the 2017 Women's March against President Donald Trump."}, {"text": "== External links ==Patricia Arquette at IMDb"}, {"text": "== External links ==Patricia Arquette at AllMovie"}]