[{"text": "Raymond Allen Liotta (Italian: [liˈɔtta]; December 18, 1954 – May 26, 2022) was an American actor. He first gained attention for his role in the film Something Wild (1986), which earned him a Golden Globe Award nomination. He was best known for his portrayals of Shoeless Joe Jackson in the film Field of Dreams (1989) and Henry Hill in the film Goodfellas (1990). Liotta appeared in numerous other films, including Unlawful Entry (1992), Cop Land (1997), Hannibal (2001), Blow (2001), John Q. (2002), Identity (2003), Killing Them Softly (2012), The Place Beyond the Pines (2012), Marriage Story (2019), and Cocaine Bear (2023). "}, {"text": "Liotta won a Primetime Emmy Award for his guest role in the television series ER in 2005. He starred as Frank Sinatra in the television film The Rat Pack (1998) and Lorca in the miniseries Texas Rising (2015), both of which earned him Screen Actors Guild Award nominations, and starred in the series Shades of Blue (2016–2018) and Black Bird (2022). The latter nominated him a posthumous Primetime Emmy Award  for his role as Big Jim Keene at the 75th Primetime Emmy Awards. He had a prominent voice acting role as Tommy Vercetti in the video game Grand Theft Auto: Vice City (2002)."}, {"text": "== Early life and education ==Liotta was born in Newark, New Jersey, on December 18, 1954. Having been abandoned at an orphanage, he was adopted at the age of six months by township clerk Mary (née Edgar) and auto-parts store owner Alfred Liotta. His adoptive parents were Scottish and Italian Americans. Alfred was a personnel director and president of a local Democratic Party club. His adoptive parents each unsuccessfully ran for local political office; he recalled attending parades to hand out flyers for his father's run."}, {"text": "== Early life and education ==Liotta had a sister, Linda, who was also adopted. He said that he knew that he was adopted as a young child, and presented a show-and-tell report. He hired a private detective to locate his biological mother, named Ruth, in the 2000s, from whom he learned his family was of Scottish descent. He had one biological sister, one biological half-brother also named Ray, and five biological half-sisters."}, {"text": "== Early life and education ==Liotta grew up in a Roman Catholic household in Union, New Jersey, although his family was not especially religious. They attended church and he received first communion and was confirmed, but the family did not pray much. He occasionally used prayer in his daily life, telling an interviewer, \"... if I'm in a fix, I'll pray ... if I'm feeling uncomfortable about something, I'll say \"Our Fathers\" and \"Hail Marys\" to this day.\" In 1973, he graduated from Union High School, and was later named to the Union High School Hall of Fame."}, {"text": "== Early life and education ==Liotta attended the University of Miami, where he studied acting and graduated with a Bachelor of Fine Arts in 1978. He performed in plays and  musicals, including Cabaret, Dames at Sea, Oklahoma, and The Sound of Music, at the University of Miami's Jerry Herman Ring Theatre."}, {"text": "== Career ==After graduating from the University of Miami, Liotta moved to New York City, where he was hired as a bartender at the Shubert Organization and landed an agent within six months. One of his earliest roles was as Joey Perrini on the soap opera Another World, on which he appeared from 1978 to 1981. He left the show and moved to Los Angeles. He made his film debut in 1983's The Lonely Lady. His first major acting role was Something Wild (1986), for which he received his first Golden Globe nomination, this nomination being for Best Supporting Actor – Motion Picture. In 1989, Liotta portrayed the ghost of baseball player Shoeless Joe Jackson in the fantasy/drama film Field of Dreams."}, {"text": "== Career ==In 1990, Liotta portrayed real-life mobster Henry Hill in Martin Scorsese's universally praised and commercially successful Academy Award winning film Goodfellas. In 1992, he starred as a psychopathic cop in the thriller Unlawful Entry. He appeared in a leading role in the science-fiction/action film No Escape. In 1996, he starred in the sci-fi/thriller Unforgettable. Liotta earned critical praise for his turn in James Mangold's 1997 film Cop Land, and he received critical praise in 1998 for his performance as a compulsive gambler in Phoenix."}, {"text": "== Career ==Liotta portrayed singer Frank Sinatra in the 1998 TV film The Rat Pack (for which he received a Screen Actors Guild award nomination). He starred as himself in the sitcom Just Shoot Me in December 2001. In October 2002 he provided the voice of Tommy Vercetti for the 2002 video game Grand Theft Auto: Vice City. He appeared in the television drama ER in 2004, playing Charlie Metcalf in the episode \"Time of Death\"."}, {"text": "== Career ==The ER role earned Liotta an Emmy for Outstanding Guest Actor in a Drama Series (Liotta later spoofed himself and his Emmy win in Bee Movie). Liotta starred in the 2006 CBS television series Smith, which was pulled from the schedule after three episodes. In 2012 Liotta appeared as himself in a purely vocal role for the \"What a Croc!\" episode of the Disney Channel comedy series Phineas & Ferb."}, {"text": "== Career ==Liotta played the Justice Department official Paul Krendler in the 2001 film Hannibal opposite Anthony Hopkins and Julianne Moore. Also in 2001, he played the father of drug dealer George Jung in the film Blow. In 2002 he appeared as Detective Lieutenant Henry Oak in the Joe Carnahan-directed film Narc, a role that led to an Independent Spirit Award nomination and a Phoenix Film Critics Society Awards nomination for Best Supporting Male."}, {"text": "== Career ==He reunited with director James Mangold in 2003, alongside John Cusack and Alfred Molina, in the dark horror-thriller Identity. In 2005, he narrated Inside the Mafia for the National Geographic Channel. In 2006 he appeared in Smokin' Aces—reuniting with Narc director Carnahan, in which he portrayed an FBI agent named Donald Carruthers in one of the lead roles. In 2004, Liotta made his Broadway debut opposite Frank Langella in the Stephen Belber play Match. Ben Brantley of The New York Times described Liotta as \"compelling\" but \"doesn't have much to work with for his Broadway debut.\" That same year he appeared in an advertisement for Heineken in the UK. The ads were eventually pulled by Ofcom \"in breach of the advertising code for implying that stronger alcohol is better.\""}, {"text": "== Career ==In 2007, Liotta appeared with John Travolta in the film Wild Hogs, and in Battle in Seattle as the city's mayor. In 2008, he starred in Hero Wanted as a detective alongside Cuba Gooding Jr. Also in 2008, he made a guest appearance on the SpongeBob SquarePants episode \"What Ever Happened to SpongeBob?\". In the episode, he voices the leader of a gang called the Bubble Poppin' Boys, who try to kill an amnesiac SpongeBob (voiced by Tom Kenny). In 2009 he appeared in Crossing Over, co-starring Harrison Ford. Liotta played Detective Harrison in the 2009 Jody Hill comedy Observe and Report as Seth Rogen's nemesis from the local police. In 2011, he starred in The Son of No One, opposite Channing Tatum and Al Pacino."}, {"text": "== Career ==In the 2010s, Liotta appeared in Date Night with Steve Carell, in Charlie St. Cloud with Zac Efron, the independent drama Snowmen, and The River Sorrow, which stars Liotta as a detective alongside Christian Slater and Ving Rhames. He starred alongside Brad Pitt and James Gandolfini in the 2012 Andrew Dominik film Killing Them Softly and the 2012 Ariel Vromen film The Iceman features Liotta as the character of Roy DeMeo. He had a supporting role in Muppets Most Wanted (2014)."}, {"text": "== Career ==In 2014, he played a preacher in the faith-based film The Identical. His other 2014 projects include Kill the Messenger with Jeremy Renner, Stretch with Chris Pine, and a David Guetta video. He starred in the Western miniseries Texas Rising for The History Channel in 2015. For his performance he earned a Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Miniseries or Television Movie nomination. From 2015 to 2016, he narrated the AMC docu-series The Making of the Mob. Liotta starred opposite Jennifer Lopez in Shades of Blue between 2016 and 2018. In 2018, he became a spokesperson for Pfizer's Chantix advertising campaign."}, {"text": "== Career ==Liotta appeared as Charlie Barber's (Adam Driver) second divorce attorney, Jay Marotta in the 2019 Noah Baumbach film Marriage Story. The film received critical acclaim and earned six Academy Award nominations including Best Picture. Liotta received praise for his performance with Peter Bradshaw of The Guardian declaring, \"what a thrill to hear his syrupy-gravelly voice again\". The Hollywood Reporter described Liotta as being in \"fine, mischievous form\".  In 2021, he played twin brothers \"Hollywood Dick\" Moltisanti and Salvatore \"Sally\" Moltisanti in the film The Many Saints of Newark, a prequel to the HBO crime drama series The Sopranos."}, {"text": "== Career ==Liotta appeared in Cocaine Bear, a thriller film based on the true story of an American black bear that ingested a duffel bag full of cocaine in 1985. The movie, released in theaters in February 2023, is directed by Elizabeth Banks and traces the aftermath of a drug runner's cocaine disappearing in a plane crash and being devoured by a bear. The movie was dedicated to his memory."}, {"text": "== Personal life ==Liotta married Michelle Grace, an actress and producer, in February 1997 after they met at a baseball game, where her former husband Mark Grace was playing for the Chicago Cubs. They had a daughter, Karsen, before divorcing amicably in 2004."}, {"text": "== Personal life ==On an episode of Jay Leno's Garage, Liotta revealed that Nancy and Tina Sinatra, daughters of Frank Sinatra, once sent Liotta a fake horse's head in the mail. The joke was in response to Liotta's declining to play their father in a miniseries they were working on, only to see Liotta play him in the 1998 HBO television film The Rat Pack."}, {"text": "== Personal life ==In February 2007, he was charged with driving under the influence after crashing his Cadillac Escalade into two parked vehicles in Pacific Palisades. He pleaded no contest."}, {"text": "== Personal life ==From his experience shooting the Western Texas Rising, Liotta continued horseback riding and said in September 2014: \"I was obsessed with riding horses [on the show]. I love it now. I've never had a hobby. It might be my new hobby.\""}, {"text": "== Personal life ==In May 2017, Liotta, along with talk show host and actress Kelly Ripa, were inducted into the New Jersey Hall of Fame."}, {"text": "== Personal life ==In 2018, while discussing his role alongside Jennifer Lopez as a corrupt cop targeted by the FBI in the NBC crime drama Shades of Blue, Liotta told a reporter for Long Island Weekly: "}, {"text": "== Personal life ==You want to do as many different genres as you can and that's what I've been doing. I've done movies with the Muppets. I did Sinatra. I did good guys and bad guys. I did a movie with an elephant. I decided that I was here to try different parts and do different things. That's what it's really all about. That's what a career should be."}, {"text": "== Personal life ==In 2022, after wrapping up filming of Cocaine Bear, Liotta made a speech and stated that he's known for being Italian, but he did a heritage tree and found that he mostly has Irish ancestry."}, {"text": "== Death ==Liotta died in his sleep on May 26, 2022, at age 67, in Santo Domingo, Dominican Republic, during the filming of Dangerous Waters. At the time of his death, he was engaged to Jacy Nittolo. An autopsy report released in 2023 concluded that Liotta's cause of death was respiratory failure, pulmonary edema, and heart failure, with atherosclerosis cited as an underlying issue."}, {"text": "== Death ==Liotta was posthumously recognized on the Hollywood Walk of Fame on February 24, 2023, with his daughter Karsen collecting the recognition on his behalf."}, {"text": "== External links ==Ray Liotta at IMDb"}, {"text": "== External links ==Ray Liotta at the Internet Broadway Database"}, {"text": "== External links ==Ray Liotta: An Oral History at Esquire magazine"}, {"text": "== External links ==Tarshis, Joan (Fall 2001). \"One on One with Ray Liotta\". Smoke Magazine. Archived from the original on October 29, 2013. Retrieved September 14, 2014."}, {"text": "== External links ==Keier, Helen (March 1, 2001). \"IGN: Interview with Ray Liotta\". IGN.com. Retrieved July 7, 2009."}, {"text": "== External links ==Ray Liotta discography at Discogs"}]