[{"text": "Rebel Melanie Elizabeth Wilson (born Melanie Elizabeth Bownds; 2 March 1980) is an Australian actress and producer. After graduating from the Australian Theatre for Young People in 2003, Wilson began appearing in the SBS comedy series Pizza (2003–2007) and later appeared in the sketch comedy show The Wedge (2006–2007). She wrote, produced and starred in the musical comedy series Bogan Pride (2008). Shortly after moving to the United States, Wilson appeared in the comedy films Bridesmaids and A Few Best Men, both in 2011."}, {"text": "In 2012, Wilson appeared in the comedy films What to Expect When You're Expecting, Struck by Lightning, and Bachelorette. Wilson wrote and starred in Super Fun Night (2013), a television sitcom that aired for one season on ABC. She gained wider recognition for her role in the musical comedy Pitch Perfect film series (2012–2017)."}, {"text": "In 2019, Wilson had her first lead roles in the comedies Isn't It Romantic and The Hustle, and also had a supporting role in the comedy drama Jojo Rabbit. In 2022, she starred in the Netflix comedy film Senior Year, also serving as a producer."}, {"text": "== Early life and education ==Rebel Melanie Elizabeth Wilson was born on 2 March 1980 in Sydney, New South Wales, Australia. Her parents are professional dog handlers, dog show judges and breeders. Wilson grew up in the suburbs of Kenthurst, Parramatta and Castle Hill. She attended the independent Tara Anglican School for Girls as a boarder. She completed her Higher School Certificate in 1997, achieving a ranking of 99.3, including second place in the state in Food Technology. Wilson joined the debating team and a teacher encouraged her to enter Tournament of Minds which she credits for helping her come out of her shell. Wilson worked at a cinema in Castle Hill in her younger years, but quit after patrons recognised her after the showing of her first movie, Fat Pizza.Wilson has three siblings: sisters Liberty and Annaleise (who uses the name \"Annarchi\") and a brother, who uses the name \"Ryot\". Liberty and Ryot appeared on the first season of The Amazing Race Australia in 2011, where they were the first team eliminated. Wilson has stated that, according to her grandmother, her great-aunt was Lillian Disney, who was married to Walt Disney until his death in 1966. Wilson stood by this belief in court, despite there being no evidence to support the claim; it continues to be disputed by genealogist Dale Sheridan.Wilson's first career choice was mathematics. She told The Sydney Morning Herald, \"I was very academic at high school and was always good with numbers.\" She attended the University of New South Wales, graduating in 2009 with Bachelor of Arts (Theatre and Performance Studies) and Bachelor of Laws degrees. She planned to be a lawyer, but decided against corporate life and went to the United States to act. A former Rotary International youth ambassador for Australia, she was based in South Africa for one year, where she contracted malaria. She has spoken of malaria-induced hallucinations, where she saw herself as an actress who had won an Oscar, convincing her to pursue an acting career."}, {"text": "=== 2002–2010: early work ===Wilson studied at the Australian Theatre for Young People (ATYP). In 2003, she moved to New York after winning the ATYP International scholarship, which was funded by Nicole Kidman. While in New York, Wilson trained with The Second City. She appeared with the Sydney Theatre Company and performed at the Melbourne International Comedy Festival. She first came to the public's attention in 2002 with her stage musical The Westie Monologues, which she wrote, starred in and produced in Sydney. Her follow-up stage productions, which she wrote, produced and starred in include Spunks and Confessions of an Exchange Student.In Australia, Wilson is most known for her roles as Toula on the SBS comedy series Pizza and as various characters including Lucy, Fat Mandi and Karla Bangs on the sketch comedy series The Wedge. She played an Australian Idol mad schoolgirl in a series of Telstra advertisements shown during Australian Idol from 2004 to 2005. She also had roles in the feature films Fat Pizza (2003) and Ghost Rider (2007).In 2008, Wilson created, wrote, produced and starred in the musical comedy series Bogan Pride on SBS One and also starred in the improvisational Nine Network series Monster House. In 2009 Wilson won the Tropfest Best Actress award for her role in the film Bargain. She has made appearances on the improvisational comedy show Thank God You're Here and the comedy game show Talkin' 'Bout Your Generation. She performed stand-up on the television special The Breast Darn Show In Town and guest starred in the Seven Network drama City Homicide and performed improv at the Upright Citizens Brigade in Los Angeles."}, {"text": "=== Since 2010: transition to Hollywood ===Not content with her small role in Ghost Rider, Wilson moved to the United States in January 2010 and signed to talent and literary agents William Morris Endeavor. Wilson's next film role came in the Judd Apatow film, Bridesmaids, in which she played Brynn, the sister of Matt Lucas' character. The role was written especially for her. Wilson then appeared in the CBS sitcom Rules of Engagement and on the Comedy Central series, Workaholics. She co-hosted the 2010 ARIA Music Awards and performed at the inaugural Variety's Power of Comedy event in Los Angeles with Lucas and Russell Brand. In early 2011, Wilson filmed A Few Best Men at Fox Studios Australia. She also filmed a role in Small Apartments. Wilson was named one of Variety magazine's \"Top Ten Comics to Watch for 2011\". In 2012, Wilson had a role in the ensemble comedy What to Expect When You're Expecting, as Janice, and co-starred in the indie film Struck By Lightning.On 19 August 2011, Borys Kit of The Hollywood Reporter reported that Wilson had replaced Casey Wilson in Bachelorette. In 2012, Wilson voiced a character in Ice Age: Continental Drift and played Fat Amy in Pitch Perfect. For the latter role, she received critical acclaim and earned various award nominations, including Best Supporting Actress from the San Diego Film Critics Society and Best Actress in a Comedy from the Broadcast Film Critics Association. She won the MTV Movie Award for Best Actor in a Movie and shared the Best Musical Moment award with her Pitch Perfect co-stars. Wilson was also nominated for MTV Movie Award for Best Performance. Wilson later won the Choice Movie Actress: Comedy award for Pitch Perfect at the 2013 Teen Choice Awards. She had also been nominated for Choice Comedian at the 2013 Teen Choice Awards."}, {"text": "=== Since 2010: transition to Hollywood ===In January 2012, Michael Ausiello of TVLine announced that Wilson would be writing and starring in Super Fun Night, a comedy that follows three friends on a quest to have fun every Friday night. The pilot was picked up by CBS and Conan O'Brien became one of the executive producers. The pilot was later turned down by CBS, but the ABC network picked up the project. A series was ordered and the show began broadcasting on 2 October 2013. The series was cancelled after one season. Wilson played Robin Peck in Michael Bay's Pain & Gain (2013). She hosted the 2013 MTV Movie Awards on 14 April 2013.In March 2014, the American satellite television network Dish Network launched a marketing campaign for its Hopper DVR featuring Wilson as the voice of the eponymous animated kangaroo. Wilson reprised her role in the sequels Pitch Perfect 2 (2015) and Pitch Perfect 3 (2017). She also made a cameo in the television comedy Pompidou. Wilson joined the voice cast for Kung Fu Panda 3; however, in September 2015, she was replaced with Kate Hudson. Wilson next appeared in the ensemble comedy How to Be Single, released in February 2016. Nigel M. Smith of The Guardian wrote, \"Wilson is the standout, nailing every pratfall she's dealt, but How to Be Single doesn't make strong use of her character.\" Wilson also appeared in the action comedy Grimsby. On 14 February 2016, Wilson presented the nominations for the Best Supporting Actor category at the 69th British Academy Film Awards. Wilson is one of sixty celebrities who make a cameo in Absolutely Fabulous: The Movie.Wilson appeared as Ursula, the sea witch, in an all-star concert version of The Little Mermaid at the Hollywood Bowl on 3 June 4 June, and 6 June 2016. She made her West End debut in the musical Guys and Dolls in the role of Miss Adelaide from 28 June to 21 August 2016. She received positive reviews. In 2018, it was announced that Wilson was to produce and star in a feature film adaptation of the Image Comics comic book Crowded. Wilson played LeFou in a production of Beauty and the Beast: Live in Concert at the Hollywood Bowl on 25–26 May 2018. She also appeared on the cover of Vogue Australia for the first time.Wilson starred in two 2019 comedies. The first, Isn't It Romantic, was released in February, and is about a woman (Wilson) who wakes up in a literal romantic comedy, despite the character's hate for the genre; the film is Wilson's first solo lead role and her first ever producer credit. In May, Wilson starred alongside Anne Hathaway in The Hustle, a female-centred remake of the 1988 comedy film Dirty Rotten Scoundrels. Wilson also co-produced the latter film. Wilson plays twins Doreen and Dolores Bognor in Australian drama series Les Norton. Towards the end of 2019, Wilson played Fraulein Rahm in Taika Waititi's dark comedy drama Jojo Rabbit, and Jennyanydots in the musical film Cats.Wilson hosted the dog styling competition Pooch Perfect for Seven Network. The show features professional dog stylists competing over a number of challenges for a $100,000 prize. She also hosted the ABC's version of Pooch Perfect in the United States, which was cancelled after one season. Wilson stars in the Netflix comedy film Senior Year, released in May 2022. She plays a woman who, after waking from a 20-year coma, returns to high school to earn the prom queen crown she feels she deserves. Wilson will appear in her first non-comedy film role in The Almond and the Seahorse, which is an adaptation of Kaite O'Reilly's stage play of the same name. Wilson is making her directorial debut with The Deb, a musical comedy film set in the Australian outback. It is based on Hannah Reilly's 2022 theatre production, which sees \"lovable farm girl and high school outcast\" Taylah, who hopes the upcoming Debutante Ball will help change how her peers see her, but her plans are disrupted by the arrival of her cousin Maeve from the city. Production began in September 2023."}, {"text": "== Personal life ==In 2013, Wilson created a plus-size T-shirt collection named after her \"Fat Mandi\" character in The Wedge featuring images of donuts and cupcakes. In 2017, Wilson launched a plus-sized clothing range called Rebel Wilson x Angels on the heels of a collaboration with Torrid.Wilson and her Bridesmaids co-star, British actor Matt Lucas, lived together in West Hollywood, from September 2012 until 2015.In July 2015, Wilson stated her support for stricter American gun laws following the 2015 Lafayette shooting, stating, \"I don't like getting political but America you really have to follow Australia's example in gun laws. I don't remember a mass shooting in Australia since they overhauled the gun laws. It seems like every week in America there's a shooting. I just want people to be safe, especially people that are doing one of my favorite things in the world—going out to the movies to have fun.\"In 2014, Wilson paid $3.75 million for her Sydney harbourside home. The 1900s freestanding Victorian house underwent $900,000 of renovations. Wilson also settled on a Balmain investment apartment, a conversion of a historic mansion. The New York-inspired terrace home took three years to complete. Wilson paid $1.88 million off the plan in 2015 for the two-bedroom apartment.Wilson is a fan of the Los Angeles Rams of the National Football League.In 2024, Wilson stated she was a virgin until age 35. As her 40th birthday approached, Wilson made the decision to freeze her eggs which spurred on her effort to make healthy life changes. She has polycystic ovarian syndrome, and suffers from emotional eating due to pressures of fame. In November 2022, she announced on Instagram the birth of her first child, a daughter born via surrogacy.Wilson publicly came out as Queer on Instagram in June 2022, revealing her relationship with Ramona Agruma while posting on Instagram, \"I thought I was searching for a Disney Prince… but maybe what I really needed all this time was a Disney Princess.\" She chose to announce her relationship with Agruma to pre-empt an article by Andrew Hornery of The Sydney Morning Herald that would have outed her. While Herald editor Bevan Shields initially defended Hornery in the face of widespread backlash, denying they were outing her, Hornery later admitted to having made mistakes, and the original article was deleted. In a tweet on 19 February 2023, Wilson confirmed her engagement to Agruma."}, {"text": "=== Weight ===An advocate for body positivity, Wilson has been a role model for larger women. \"There's a lot of pressure on women, especially younger women, to conform to the thin body image,\" she told the Associated Press. \"Not everyone can be that way and no one should be ashamed of how they look or suffer bullying and other forms of abuse because of their size and shape.\"Throughout her career, Wilson has been known for her plus-sized figure and would often play to it in her acting work with characters such as \"Fat Amy\". In a 2013 interview with Hunger Magazine, Wilson stated \"As long as I look like this, I'm going to make fat jokes. All comedians have to use their physicality, so I use my size.\" Wilson said that her agency signed her almost on the spot because they had nobody on their books like her.Wilson felt lucky to have her body type and stated that people in the industry would tell her not to lose weight. \"For me, I think it's about being comfortable in your own skin. I never want to be too unhealthy, because that's bad. You just want to be comfortable with who you are at whatever size\", she said. In 2016 Wilson said that she felt bigger girls did better in comedy because they are easier to laugh at and used that to her advantage.In July 2011, Wilson became a spokesperson for weight loss and nutrition company Jenny Craig in Australia. In January 2012, Wilson told The Daily Telegraph that she had lost 10 kilograms (22 lb) since signing up to the program. In February 2013, she confirmed that she had ended her agreement with Jenny Craig the previous year.Wilson asserted that the producers of Pitch Perfect had refused to let her lose any more weight during filming, as her contract stated she must stay the same size. She said that once her film commitments were over, she would start her diet again to reach her target weight of 80 kilograms (180 lb).In her 2020 \"year of health\", Wilson made it her mission to lose 60 pounds (27 kg) and did so by November 2020. Wilson stated that she has always been confident in how she looked, but now feels \"super confident\"."}, {"text": "==== Disputed biography ====In May 2015, Australian magazine Woman's Day published a story claiming that Wilson had been misleading about her birth name, age, and upbringing. Wilson had previously said in interviews that she was raised by dog-training \"bogan\" parents in the ghetto of Sydney, spent a year in Zimbabwe, climbed into a cage with a leopard, got caught in a shoot-out and then struck down by a severe strain of malaria from a mosquito in Mozambique where, from her intensive care bed, she envisioned herself winning an Oscar and rapping her acceptance speech. Her age was also incorrectly given as 29 (when it was actually 35), which she would later admit was something she chose not to correct. Woman's Day called all of this into question and claimed that Wilson had, on the contrary, a \"very normal, upper-middle-class upbringing\" and \"added a touch of 'fantasy' to the life she led before becoming a household name\". The story was picked up by several other publications including The Sydney Morning Herald, People magazine, the Chicago Tribune and The Huffington Post. Most notably, Wilson's true birth date was confirmed through business records filed with the Australian Securities & Investments Commission, which were obtained by The Sydney Morning Herald."}, {"text": "==== Memoir ====Wilson's memoir, Rebel Rising, will be published in April 2024. It garnered attention for her recounting of discomfort on the set of \"The Brothers Grimsby,\" including Sacha Baron Cohen's alleged requests for nudity and inappropriate behavior during a sex scene, which she refused. Baron Cohen has denied these claims through a spokesperson.[1]"}, {"text": "==== Legal suits ====On 16 May 2016, Wilson said print and online articles in Woman's Day, the Australian Women's Weekly, NW and OK! magazines made her out to be a serial liar. According to a defamation writ filed in the Supreme Court of Victoria, Wilson said her reputation and credit had suffered and she had been humiliated and embarrassed. She also sued for special damages, claiming she missed out on roles and other ones were terminated because of the articles. Wilson was represented by Matthew Collins QC. On 15 June 2017, a six-person jury ruled in Wilson's favour, finding that publisher Bauer Media Group had indeed wrongly painted the actress as a serial liar, and that publishing the articles was likely to have caused harm to her career.On 13 September 2017, Wilson was awarded A$4,500,000 in damages. Wilson's lawyer Richard Leder, said \"Today's verdict is a significant record—it's about four times the highest previous verdict in a defamation case in Australia.\" In June 2017, Wilson tweeted \"Any dollars I receive will go to charity, scholarships or invested into the Aussie film industry to provide jobs.\"Bauer Media appealed the amount of the damages. On 14 June 2018, Bauer Media won its appeal and the damages were reduced to $600,000, meaning that she had to pay back A$4.1m and A$60,000 in interest. She also had to cover 80% of what Bauer spent on its appeal. Wilson announced her intention to appeal the decision, and lodged an appeal with the High Court on 11 July 2018. The High Court refused the application on 16 November 2018."}, {"text": "== Soundtrack appearances ==Pitch Perfect (2012)"}, {"text": "== Soundtrack appearances ==Pitch Perfect 2 (2015)"}, {"text": "== Soundtrack appearances ==Pitch Perfect 3 (2017)"}, {"text": "== Soundtrack appearances ==Isn't It Romantic (2019)"}, {"text": "== Soundtrack appearances ==Cats: Highlights from the Motion Picture Soundtrack (2019)"}, {"text": "== Awards and nominations ==The BBC included her on a list of \"100 inspiring and influential women from around the world for 2021\"."}, {"text": "== External links ==Rebel Wilson at IMDb"}]