[{"text": "Robert Hepler Lowe (born March 17, 1964) is an American actor, filmmaker, and podcast host. He made his acting debut at the age of 15 with ABC's short-lived sitcom A New Kind of Family (1979–1980). Following numerous television roles in the early 1980s, he came to prominence as a teen idol and member of the Brat Pack with roles in films like The Outsiders (1983), Class (1983), The Hotel New Hampshire (1984), Oxford Blues (1984), St. Elmo's Fire (1985), About Last Night... (1986), and Square Dance (1987). The success of these films established him as a Hollywood star."}, {"text": "Lowe was involved in a sex tape scandal in 1988. By the turn of the millennium, his career saw a resurgence when he ventured back into television, making his breakthrough as Sam Seaborn on the NBC political drama The West Wing (1999–2003), for which he received nominations for a Primetime Emmy Award and two Golden Globe Awards. His other television roles include Robert McCallister on the ABC drama Brothers & Sisters (2006–2010), Chris Traeger on the NBC sitcom Parks and Recreation (2010–2015), Ethan Willis on the CBS medical drama Code Black (2016–2018), and as Captain Owen Strand on the critically praised Fox drama 9-1-1: Lone Star (2020–present). In 2018, he made his directorial debut with the television film The Bad Seed, a remake of the 1956 film of the same name."}, {"text": "== Early life ==Robert Lowe was born in Charlottesville, Virginia, to Barbara (née Hepler), a teacher, and Charles 'Chuck' Davis Lowe, a trial lawyer. While still a baby, he lost complete hearing in his right ear as a result of undiagnosed mumps. His parents divorced when Lowe and his younger brother Chad were young. Lowe was baptized into the Episcopal church. He is of German, English, Irish, Scottish and Welsh ancestry. On the show Who Do You Think You Are?, Lowe found out that one of his ancestors, Christopher East, was a Hessian soldier. His ancestor was fighting under the command of Colonel Johann Gottlieb Rall and was captured at the American victory at Trenton, New Jersey, on the morning of December 26, 1776. As an American POW, his ancestor was given a choice, and took the option to stay in the United States.Lowe grew up in Dayton, Ohio, in a \"traditional American setting\". He attended Oakwood Junior High School before moving to the Point Dume area of Malibu, California, with his mother and brother. In California, he attended Santa Monica High School, where he met Charlie Sheen. In his autobiography Stories I Only Tell My Friends, he wrote regarding Sheen, \"We were both nerds [...] he wanted to be a baseball player.\""}, {"text": "=== 1970s ===Lowe got his first professional acting role in 1976 when he was 12 and still living in Dayton. He played an errand boy in a production of Sherlock Holmes at the Wright State University summer theater. He landed the part by calling every local theater and asking each if there was a part for a child in a play. Lowe was paid $150 for the role. In 1979, Lowe landed the part of Tony Flanagan in the short-lived television comedy A New Kind of Family."}, {"text": "=== 1980s ===One of Lowe's earliest roles came in the 1983 television film Thursday's Child, for which he received his first Golden Globe Award nomination for Best Supporting Actor in a Series, Miniseries, or Television Film. He also appeared in the music video for The Go-Go's song, \"Turn to You\". His breakthrough role was his big-screen debut in 1983, when he and Emilio Estevez were cast in Francis Ford Coppola's The Outsiders. Lowe played the role of Sodapop Curtis, the brother of the main characters Ponyboy Curtis (C. Thomas Howell) and Darrel Curtis (Patrick Swayze). In 1984, he starred opposite Jodie Foster in Tony Richardson's The Hotel New Hampshire.  Lowe and Estevez reunited in St. Elmo's Fire, making them the two more prominent actors from the group known as the Brat Pack. About Last Night... followed, with Demi Moore (who had starred alongside Lowe in St. Elmo's Fire). He then received his second Golden Globe nomination for Best Supporting Actor for his role as the mentally disabled Rory in Square Dance (1987). In August 1987, he performed on stage, playing Baron Tusenbach in Chekov's The Three Sisters at The Williamstown Theatre Festival. He recalled meeting Paul Newman there, and that the older actor encouraged him to work in the theatre in 1993 when filming a British TV production of the Tennessee Williams play Suddenly, Last Summer with (the now) Dame Maggie Smith and Natasha Richardson.In 1989 Lowe made his musical debut alongside actress Eileen Bowman, dressed as an unauthorized depiction of Snow White from Disney's Snow White and the Seven Dwarfs, singing a reworked duet of Creedence Clearwater Revival's \"Proud Mary\", with lyrics rewritten to refer to the film industry, as part of the opening ceremony for the critically derided telecast of the 61st Academy Awards produced by Allan Carr."}, {"text": "=== 1990s ===Lowe appeared in 1994's The Stand, based on Stephen King's book of the same title.He played Sam Seaborn in the television series The West Wing from 1999 to 2003 (and briefly in 2006). His performance in the show garnered Lowe a Primetime Emmy Award nomination and two Golden Globe nominations for Best Actor in a Drama Series. Lowe was drawn to the role because of his personal love of politics, and his longstanding friendship with Martin Sheen, who was cast as President Josiah Bartlet."}, {"text": "=== 1990s ===When the show premiered, Lowe was considered the lead, and the pilot centered on his character. But as the cast of the show—including Allison Janney, Richard Schiff, Janel Moloney, Dulé Hill, John Spencer, Bradley Whitford, Martin Sheen (who was initially scripted as a small role), and Stockard Channing (whose First Lady was initially scripted as a guest role)— were all well-known actors, eventually Lowe's character was no longer the show's main focus. Lowe and series creator Aaron Sorkin soon found themselves at odds over the network's meddling with the show, most notably the network demanding changes in Lowe's character. Eventually, Lowe left the series, not long before Sorkin and director/executive producer Thomas Schlamme, resigned over a dispute with NBC."}, {"text": "=== 1990s ===During the final season of The West Wing, Lowe returned to his role of Sam Seaborn, appearing in two of the final four episodes. In 2011, Lowe stated on The Oprah Winfrey Show that he left the show because he did not feel he was being respected, when the other lead characters received a raise and he did not."}, {"text": "=== 2000s ===After leaving The West Wing, Lowe was the star and executive producer of a failed NBC drama, The Lyon's Den (2003). In 2004, he tried again in a series entitled Dr. Vegas, but it also was quickly canceled.Lowe passed on the role of Derek Shepherd of Grey's Anatomy, which eventually went to Patrick Dempsey.Despite his two canceled TV series and flops like View From the Top and the made-for-TV movie Perfect Strangers during his post–West Wing run, Lowe found success in the TV miniseries genre. In 2004, Lowe starred in the TNT remake of the Stephen King miniseries Salem's Lot, which was the highest-rated cable program of that summer and the highest ratings TNT original programming had at the time.In 2005, he starred as Lieutenant Daniel Kaffee in Sorkin's London West End production of A Few Good Men, the first time the two had worked together since The West Wing. Although Lowe had expressed unhappiness about his decreased role on that show at the time of his departure, he has now repeatedly said that any animosity between them is over and that he was pleased to be working once more with Sorkin.That same year, Lowe starred in the miniseries Beach Girls on the Lifetime network, based on the Luanne Rice novel of the same name. The series premiere received the highest ratings for a movie premiere in Lifetime history. Later, Lowe filmed his supporting role as a movie agent in the 2006 independent film Thank You for Smoking.In 2006, he filmed The Perfect Day for TNT, in which he took a pay cut to film in New Orleans in order to help the Hurricane Katrina-ravaged area. That same year, Lowe filmed Stir of Echoes: The Homecoming, the sequel to the 1999 Kevin Bacon thriller Stir of Echoes, and it was announced that Lowe would join the cast of Brothers & Sisters for a guest run of several episodes."}, {"text": "=== 2000s ===In January 2007, ABC announced that Lowe would be staying on Brothers and Sisters as a \"special guest star\" for the rest of Season 1 after Lowe's initial appearance on the show in November 2006 brought the best ratings and demographic showing for the show since its premiere. Soon after ABC announced an early Season 2 renewal for Brother & Sisters in March 2007, Lowe announced he would be returning for the show's second season. He continued to appear in the series until the end of the 2009–10 season. Then, Lowe announced he would leave, unhappy with the stories and his lack of screen time in the fourth season. In an episode broadcast on May 16, 2010, his character was part of a multi-vehicle crash involving a large truck and was put into a coma. The storyline was wrapped up in the first episode of the fifth season; Lowe did not appear in the episode."}, {"text": "=== 2000s ===In June 2006, he was the guest host for an episode in the third series of The Friday Night Project for the United Kingdom's Channel 4. Lowe has also appeared in a televised advertisement for 'Visit California' with other celebrities, including Governor Arnold Schwarzenegger. (In the advertisement campaign, he was usually pictured in a white tee-shirt printed with the California state flag.)Lowe had a supporting role in the 2009 movie The Invention of Lying and a leading role in Too Late to Say Goodbye."}, {"text": "=== 2010s ===In 2010, he appeared in the biography of the Brat Packers called: Brat Pack: Where Are They Now? He also appeared on The Tonight Show with Conan O'Brien. Lowe is currently teaming up with 44 Blue to produce a reality series entitled Potomac Fever about young adults living in Washington, D.C.In July 2010, it was announced that Lowe would be providing the voice for the superhero Captain Marvel in the animated series, Young Justice. It was also announced in July 2010 that Lowe would become a series regular on the series Parks and Recreation. He portrayed Chris Traeger, the relentlessly upbeat city manager of the fictional town of Pawnee, Indiana, for four seasons, before his character was written out of the show in 2014. He was so pleased with the show and his guest appearances on season 2 that he agreed to become a full-fledged cast member from there on out. He reprised the role in the 2015 series finale, \"One Last Ride\", and in the 2020 special episode \"A Parks and Recreation Special\"."}, {"text": "=== 2010s ===In 2011, Lowe guest starred in a recurring role on Showtime's comedy Californication. Lowe featured as the troubled but in-demand actor Eddie Nero – a character based upon \"about ten people\", according to Lowe but somewhat contradicted by sources at Showtime itself – employed to portray Hank in a film version of his book, Fucking and Punching.In 2011, Lowe wrote a memoir titled Stories I Only Tell My Friends, which was released in May 2011. During his promotional tour for Stories I Only Tell My Friends, Lowe told Australian radio show The Kyle & Jackie O Show that during his five-day press visit to Australia in 1990, he was so badly affected by the overuse of painkillers that the only two things he remembers from the trip were being at the Sydney Zoo and getting a tattoo, although he states in his book that he does not remember getting the tattoo. In 2014, Lowe wrote a second book titled Love Life, which was released in April that year. He uses stories and observations from his life in a poignant and humorous series of true tales about men and women, art and commerce, fathers and sons, addiction and recovery, and sex and love."}, {"text": "=== 2010s ===In 2014, Lowe starred in a pilot for the single-camera comedy The Pro as Ben Bertrahm, a former professional tennis player. The pilot was not picked up for series. He also narrated The '90s: The Last Great Decade? on the National Geographic Channel, which aired in July of that year. In 2015, Lowe starred in the satirical thriller Pocket ListingLowe has been a commercial spokesman for DirecTV since fall 2014. Commercials featuring Lowe contrast him with some alternate, less appealing form of Lowe, who instead has cable. The advertisements were pulled in April 2015 after the National Advertising Division, acting on a complaint by Comcast, found DirecTV's claims about its customer satisfaction, quality, and ranking to be less than truthful.In February 2015, Fox announced they had greenlit a pilot for the comedy The Grinder starring Lowe and Fred Savage, and directed by Jake Kasdan. The series, in which Lowe starred as a washed-up actor starting a new career as a lawyer, was cancelled after one season."}, {"text": "=== 2010s ===In November 2015, Lowe voiced Simba in the television pilot movie The Lion Guard: Return of the Roar. Lowe continued to voice Simba for its subsequent series The Lion Guard.In December 2015, Lowe was honored with a star on the Hollywood Walk of Fame. His star is located in front of the Musso, and Frank Grill on Hollywood Boulevard.In 2015, Lowe launched Profile™, a men's skincare product line. The line features a collection of five antiaging products specially formulated for men. It is currently sold at Nordstrom stores and online. The product collection includes a cleanser, a shave gel, an aftershave serum, a moisturizer, and an eye serum in the price range of $24.50 to $59.50. In 2016, Lowe launched a fragrance product line called 18 Amber Wood with the Profile™ brand.On August 27, 2016, a Comedy Central Roast TV special was recorded and aired on September 5, 2016, with Rob Lowe as the Roastee and David Spade as Roast Master. Amongst the Roasters were Jewel, Nikki Glaser, Ralph Macchio, Pete Davidson, Peyton Manning, Rob Riggle, Jimmy Carr, Ann Coulter and the \"Roast Master General\" Jeff Ross.On April 21, 2017, KFC released a campaign featuring Lowe as astronaut Colonel Sanders giving a JFK speech spoof/homage about launching the Zinger chicken sandwich into space. Lowe said in a statement that when he was a child, his grandfather took him to meet Harland Sanders.In late autumn 2017, Lowe began a reality series with his two sons, 24-year-old Matthew and 22-year-old Jon Owen, on A&E titled The Lowe Files. With the exception of the hour-long pilot, the series features 30-minute road trips with the Lowe boys, and occasional TV guest stars known in the field, investigating common urban myths and legends that Rob has loved since he was a young boy and has shared with his boys throughout their growth. Some of the topics being explored are Bigfoot/Sasquatch, the alleged unidentified \"submerged\" objects that may have a base off the coast from Los Angeles, alien abduction, and ghosts and their direct responses to stimuli. The series debuted on August 2, 2017."}, {"text": "=== 2010s ===On January 3, 2018, Atkins Nutritionals announced Lowe as a new brand spokesperson. Due to his \"low carb lifestyle\", Lowe was selected for a series of multimedia ads that were still airing throughout 2019.In October 2018, it was announced that Lowe would star in an ITV series, Wild Bill, about an American policeman who moves to Boston, Lincolnshire with his daughter. While the show was cancelled by ITV after one season, there were hopes it would be picked up by Netflix or Hulu at a future date.On March 19, 2019, Lowe began hosting the Fox competition series Mental Samurai where he also serves as a producer."}, {"text": "=== 2020s ===Lowe began hosting a podcast called Literally! With Rob Lowe on June 25, 2020. Guests included Chris Pratt and Conan O'Brien. In September 2021 Lowe launched a second podcast, a Parks and Recreation recap show called Parks and Recollection, alongside Parks and Rec writer and producer Alan Yang.Lowe directed a short documentary named Madness in the Hills, which is about the mudslides that killed 23 people in Southern California in January 2018, including many friends and neighbors of Lowe. It debuted on Peacock on October 9, 2020.On May 12, 2019, it was announced that a spin-off the 9-1-1 series titled 9-1-1: Lone Star was ordered to series with Lowe in the starring role of Owen Strand. The series premiered on January 19, 2020, to generally favorable reviews and was renewed for a second season which premiered on January 18, 2021."}, {"text": "=== 2020s ===On August 6, 2021, Deadline revealed that Lowe will star and executive produce the Netflix movie Dog Gone.Lowe will offer commentary in The Andy Warhol Diaries, premiering on Netflix on March 9, 2022.On April 6, 2022, it was announced that Lowe will star in and executive produce Unstable with Victor Fresco and his son John Owen Lowe for Netflix. The show, which follows Lowe as successful biotech entrepreneur Ellis Dragon as he struggles to regain his footing following the death of his wife, premiered on March 30, 2023."}, {"text": "=== Family and relationships ===Lowe has been married to makeup artist Sheryl Berkoff since 1991. They met on a blind date in 1983, and again on the set of Lowe's movie Bad Influence. They have two sons: Matthew Edward Lowe (b. 1993) and John Owen Lowe (b. 1995).Lowe is a fan of the Los Angeles Dodgers and the Los Angeles Rams."}, {"text": "=== Sex tape ===In 1988, Lowe, who was 24 years old at the time, was involved in a sex scandal over a videotape of him having sex with two women: Tara Siebert who was 22 and her younger friend Lena Jan Parsons who was 16 years old at the time. The three met at Club Rio, an Atlanta nightclub. They were videotaped the night before the Democratic National Convention in Atlanta, Georgia. As the age of consent in Georgia was 14 at the time (in 1995 it was raised to 16), both were of legal age to engage in sexual activity, but 18 was the legal age to be involved in such a recording. At the time, Lowe was campaigning for Michael Dukakis. Eventually, his career rebounded and Lowe mocked his own behavior during two post-scandal appearances as host of Saturday Night Live."}, {"text": "=== Sobriety ===Lowe began drinking heavily as a teenager. His early fame allowed him to lead a hard-partying lifestyle that was covered extensively in the tabloids. In 1990, two years following the sex tape scandal, Lowe decided to quit drinking and completed an extensive alcohol rehabilitation program. He has maintained sobriety ever since, saying it was the best decision of his life. Adopting a daily Transcendental Meditation practice has been instrumental to his well-being. \"It's changed my life,\" says Lowe."}, {"text": "=== Nanny lawsuit cases ===In April 2008, Lowe filed separate lawsuits against three former employees, accusing them of breach of contract, defamation, and intentional infliction of emotional distress. Lowe accused an ex‑nanny of engaging in a scheme to hurt him and his wife by spreading \"malicious lies.\" Another former nanny was accused of falsely claiming to have had a personal and intimate relationship with Lowe, and also repeatedly expressing romantic interest in Lowe, claiming Lowe sexually harassed her and that Sheryl Lowe was an abusive employer. Lowe also claimed a former chef engaged in sex on their bed when the family was out of town, stole prescription drugs from the Lowes, broke several security cameras, overcharged them for food, and allegedly made statements to various people that Sheryl was heartless, cold, and unclean.Jessica Gibson, Lowe's 24-year-old former nanny, made 12 allegations against Lowe involving sexual harassment claims and labor-code violations. On June 19, 2008, Santa Barbara, California, Superior Court Judge Denise de Bellefeuille dismissed two allegations regarding labor-code violations due to lack of legal basis. The legal battle ended in May 2009. The press reported that court records showed that lawsuits filed by both nannies and Lowe were dismissed in Santa Barbara. Attorneys for both women and Lowe sought the dismissals."}, {"text": "== Philanthropy ==Lowe was the first male spokesman for the 2000 Lee National Denim Day fundraiser, which raises money for breast cancer research and education. His grandmother and great-grandmother both suffered from breast cancer, and his mother died of the disease in late 2003.Lowe is a founder of the Homeowner's Defense Fund, a Santa Barbara County non-profit, non-partisan organization dedicated to local control of land-use planning and transparency in government. The average price of tract homes in Santa Barbara in early 2006 was US$1,100,000, which motivated some to propose denser housing on existing lots. While in favor of increasing housing density, Lowe sought to build a 14,260-square-foot (1,325 m2) mansion for himself on an empty lot in Montecito, California. His protest over the appearance of the address of the empty lot in the Santa Barbara News-Press precipitated a mass resignation of senior employees at that newspaper on July 6, 2006."}, {"text": "== Awards and nominations ==In December 2017, Lowe was chosen to receive the Horatio Alger Award for 2018. The Horatio Alger Association of Distinguished Americans recognizes people who have overcome personal challenges to achieve personal and professional success."}, {"text": "== Books ==Love Life. New York: Simon & Schuster, 2014."}, {"text": "== Books ==Stories I Only Tell My Friends: An Autobiography. New York: Henry Holt and Company, 2011."}, {"text": "== External links ==Rob Lowe at IMDb"}, {"text": "== External links ==Rob Lowe interviewed by KVUE reporter Roy Faires in 1986 about his new movie \"About Last Night\" from Texas Archive of the Moving Image."}]