[{"text": "Robert Michael Schneider (; born October 31, 1963) is an American actor, comedian and screenwriter. After several years performing stand-up comedy, Schneider achieved wider success as a cast member and writer for the NBC sketch comedy series Saturday Night Live from 1988 to 1994."}, {"text": "Following his departure from SNL, he went on to a career in feature films, including starring roles in the comedy films Deuce Bigalow: Male Gigolo (1999) and its 2005 sequel, The Animal (2001), The Hot Chick (2002), The Benchwarmers (2006), and Big Stan (2007). Schneider is the father of singer Elle King."}, {"text": "== Early life ==Schneider was born in San Francisco, California on October 31, 1963, and grew up in the nearby suburb of Pacifica. His parents were Pilar (née Monroe), a former kindergarten teacher and ex-school board president, and Marvin Schneider, a real estate broker. His father was Jewish and his mother was Catholic. Schneider's maternal grandmother was a Filipina who met and married his grandfather, a white American army private, while he was stationed in the Philippines. His mixed background has been a common theme throughout his career. Schneider graduated from Terra Nova High School in 1982 and then attended San Francisco State University. His older brother, John, is a producer."}, {"text": "=== Early career ===Schneider began his career doing stand-up comedy in San Francisco. He made his debut appearance on television in 1987, on HBO's 13th Annual Young Comedians special, which was hosted by comedian Dennis Miller."}, {"text": "=== Saturday Night Live ===Schneider was part of the comedy team at NBC sketch comedy series Saturday Night Live from 1990 to 1994. He played such roles as \"Tiny Elvis\", \"Orgasm Guy\", and Richard Laymer, the office worker beside the photocopier who addressed each of his fellow employees with an endless stream of annoying gossip. Schneider is featured in the video release The Bad Boys of Saturday Night Live, along with colleagues Adam Sandler, Chris Rock, David Spade, and Chris Farley."}, {"text": "==== Recurring SNL characters ====The Richmeister, an office worker who annoys people by giving them nicknames as they make copies."}, {"text": "==== Recurring SNL characters ====Carlo, from the Il Cantore Restaurant sketches"}, {"text": "==== Recurring SNL characters ====The Sensitive Naked Man, a nude man who gives advice to other characters"}, {"text": "=== Feature films, sitcoms, and endorsements ===After leaving SNL, Schneider played supporting roles in a series of movies including Surf Ninjas, Judge Dredd, The Beverly Hillbillies, Home Alone 2: Lost in New York, Demolition Man, and Down Periscope. He also appeared in a recurring part on the television series Coach. In 1996, he co-starred in the NBC sitcom Men Behaving Badly, an American take on the hit British series of the same name. The U.S. version ran for two seasons."}, {"text": "=== Feature films, sitcoms, and endorsements ===Schneider starred in the 1999 feature film Deuce Bigalow: Male Gigolo, a tale of a fish-tank cleaner who incurs a massive debt and is forced to become a \"man-whore.\" This was followed by The Animal, about a man given animal powers by a mad scientist; The Hot Chick, wherein the body of a petty thief named Clive Maxtone (played by Schneider) is mystically switched with the body of a pretty, but mean-spirited high school cheerleader named Jessica Spencer (played by Rachel McAdams in her film debut); and the sequel Deuce Bigalow: European Gigolo. The latter movie was not well received by critics or moviegoers, and as a result, Schneider won a 2005 Worst Actor Razzie Award for his role in the film.In 2006, Schneider co-starred in the baseball-themed family comedy The Benchwarmers, along with his fellow SNL alumnus David Spade as well as Jon Heder. Other film roles include Schneider's appearance with Jim Henson's Muppets in the 1999 film Muppets from Space, and his role as a San Francisco hobo in the 2004 remake of Around the World in 80 Days."}, {"text": "=== Feature films, sitcoms, and endorsements ===Schneider's directorial debut, the comedy Big Stan, was released in some overseas markets during the fall of 2008, with a U.S. release in early 2009. In the film, he starred as a real estate con artist who is arrested for perpetrating real-estate scams. He is sentenced to prison, so he takes a crash-course in martial arts to survive incarceration."}, {"text": "=== Feature films, sitcoms, and endorsements ===Schneider has also appeared in numerous comedies starring his SNL comrade Adam Sandler, including 1998's The Waterboy, 2010's Grown Ups, and 2020's Hubie Halloween. The comedic characters Schneider plays in these films include an overly enthusiastic Cajun man who proclaims the catch-phrase, \"You can do it!\"; an amiable Middle Eastern delivery boy; a prison inmate; and Sandler's one-eyed Hawaiian sidekick, Ula. Schneider has uttered the line \"You can do it!\" as a running gag in Sandler's films The Waterboy, Little Nicky, 50 First Dates, The Longest Yard, and Bedtime Stories, as well as in a deleted scene from Click (a sample of Schneider saying the phrase also turns up in the song \"Original Prankster\" by The Offspring). Returning the favor, Sandler appeared in a cameo to spout the same line in Schneider's The Animal. Schneider narrated Sandler's 2002 animated movie Eight Crazy Nights, and voiced the part of a Chinese waiter. Schneider also had an uncredited cameo as a Canadian-Japanese wedding-chapel minister in the 2007 Sandler-Kevin James comedy I Now Pronounce You Chuck & Larry, and played a Palestinian cab driver who serves as the title character's nemesis in the 2008 Sandler film You Don't Mess with the Zohan."}, {"text": "=== Feature films, sitcoms, and endorsements ===Schneider played a variety of roles in the 2005 television special Back to Norm, starring another former SNL player Norm Macdonald, and appeared on episodes of the popular television shows Seinfeld and Ally McBeal. Schneider hosted the Sports Illustrated: Swimsuit '97 TV special, and the 2005 Teen Choice Awards, and was a frequent guest on NBC's late-night variety program The Tonight Show with Jay Leno. In Schneider's appearance with Leno on the July 24, 2007, episode of The Tonight Show, he showed up in drag as actress Lindsay Lohan after the latter cancelled following a controversial arrest for driving under the influence.Besides his efforts in movies and television, Schneider released his first comedy album Registered Offender in July 2010. Registered Offender is composed of audio sketches and songs, with Schneider himself doing all of the character voices on the recording. He also revived his stand-up comedy career in 2010 with an international tour of theaters, clubs, and casinos.Schneider appeared in the music video for country singer Neal McCoy's \"Billy's Got His Beer Goggles On\", as the song's title character. McCoy and Schneider met while the two went on a USO tour in support of U.S. troops two months after the September 11, 2001 terrorist attacks."}, {"text": "=== Feature films, sitcoms, and endorsements ===Schneider starred as the title character in the CBS sitcom Rob, which was loosely based on his real life. The series ran for eight episodes starting on January 12, 2012 and was canceled in May. In 2015, he produced, directed and starred in Real Rob, a sitcom that follows his life and includes his real-life wife Patricia and daughter Miranda. Netflix released a season of 8 episodes, and a second season in 2017.Schneider is the official celebrity spokesperson for the Taiwan Tourism Bureau and the Ten Ren Tea company in Taipei.Schneider was spokesperson for State Farm Insurance, but was dropped in 2014 due to his anti-vaccination views.In May 2016, Schneider was featured as a special guest on the Let's Play webseries Game Grumps, alongside his wife Patricia, commentating over Midway's Mortal Kombat Trilogy. They reappeared on the show in November 2017, then commentating over Konami's Contra."}, {"text": "=== Feature films, sitcoms, and endorsements ===In 2021, Schneider competed on season six of The Masked Singer as the wild card contestant \"Hamster\". A running gag is that \"Hamster\" would pantomime urinating on Nick Cannon and get affectionate with him. When unmasked on the fifth week, Schneider dedicated his performance of Luis Miguel's Sabor a Mí to Patricia and his daughters Miranda, Madeline, and Elle. In addition, Schneider did a variation of his Townie character's \"You can do it\" line by quoting Hamster's final words \"You can do it Masked Singer, all night long!\""}, {"text": "=== Feature films, sitcoms, and endorsements ===In 2022, he starred, produced, and directed in Daddy Daughter Trip, which served as his third film as a director and also starred his wife Patricia and daughter Miranda. The film was to be exclusively shown in Harkins Theaters."}, {"text": "== Personal life ==Schneider has a daughter with former model London King, musician Elle King, who was born in 1989. On September 1, 2021, King gave birth to a son named Lucky, Schneider's first grandchild.In 1996, Schneider established the Rob Schneider Music Foundation. The foundation returned music education to Pacifica's elementary schools by paying the teachers' salaries and providing funds for instruments and other equipment. Prior to Schneider's efforts, the school system had been without music education programs for years.Schneider once co-owned the DNA Lounge, a San Francisco nightclub.On April 23, 2011, Schneider married television producer Patricia Azarcoya Arce in Beverly Hills, California. Their first child, Miranda Scarlett Schneider, was born in 2012. The couple had their second daughter, Madeline Robbie Schneider, in September 2016. The family supports Mexican soccer club Tigres, which is based in Patricia's hometown of Monterrey, Mexico.In 2023, Schneider converted to Catholicism."}, {"text": "== Political views and positions ==In 2013, Schneider switched political parties from the Democratic Party to the Republican Party, explaining: \"The state of California is a mess, and the super majority of Democrats is not working. I've been a lifelong Democrat and I have to switch over because it no longer serves the people of this great state.\"In an interview on Larry King Now in 2017, Schneider said he was an independent but leaned more conservative.In 2023, Schneider endorsed candidate Robert F. Kennedy Jr. in the 2024 Democratic Party presidential primaries."}, {"text": "=== Anti-vaccination activism ===Schneider has been a critic of childhood vaccinations. In an interview with News10 in Sacramento, Schneider opined that \"The efficacy of these shots have not been proven ... And the toxicity of these things – we're having more and more side effects. We're having more and more autism.\" Schneider's statements have been discredited as lacking any factual basis. He also views the actions from the state to mandate vaccinations as government overreach.In 2015, Schneider actively opposed the passage of two California laws, California Assembly Bill 2109 and California Senate Bill 277, which both made childhood vaccination exemptions harder to obtain. On September 28, 2012, Schneider and California State Assemblyman Tim Donnelly spoke at the \"Medical Freedom Rally\", where they urged California Governor Jerry Brown to veto Assembly Bill 2109, which would have made it more difficult for parents to use philosophical reasons for exemptions from mandatory childhood vaccinations. While the bill was not vetoed, Governor Brown added a signing message instructing the Department of Health to add a religious exemption and to make sure the process was not overly burdensome to parents.While fighting California Senate Bill 277, which removed exemptions to mandatory vaccinations due to personal beliefs, Schneider left a phone message to California state Assemblywoman and bill co-author Lorena Gonzalez saying that he would spend money against her in her next re-election. Gonzalez, in an interview with The Washington Times, said that she found the message to be disturbing, but upon calling back, she said, \"he was actually much nicer to me, but let's be honest ... that is 20 mins of my life I'll never get back arguing that vaccines don't cause autism with Deuce Bigalow: Male Gigolo.\""}, {"text": "== External links ==Official website"}, {"text": "== External links ==Rob Schneider at IMDb"}]