[{"text": "RuPaul Andre Charles (born November 17, 1960) is an American drag queen, television personality, actor, singer, producer, and writer. He produces, hosts, and judges the reality competition series RuPaul's Drag Race and has received several accolades, including 14 Primetime Emmy Awards, three GLAAD Media Awards, a Critics' Choice Television Award, two Billboard Music Awards, and a Tony Award. He has been dubbed the \"Queen of Drag\" and is considered the most commercially successful drag queen in the United States, with Fortune saying that he is \"easily the world's most famous drag queen.\"Born and raised in San Diego, RuPaul later studied performing arts in Atlanta, before relocating to New York City, where he became a popular fixture on the LGBT nightclub scene. He also taught classes at local public schools. He achieved international fame as a drag queen with the release of his debut single, \"Supermodel (You Better Work)\", which was included on his debut studio album Supermodel of the World (1993). RuPaul became a spokesperson for MAC Cosmetics in 1994, raising money for the Mac AIDS Fund and becoming the first drag queen to land a major cosmetics campaign. He later received his own television talk show on VH1 titled The RuPaul Show (1996–1998), while co-hosting the morning radio show on WKTU with Michelle Visage."}, {"text": "RuPaul's Drag Race was created in 2009 and has gone on to produce sixteen seasons in the United States. The show has also seen success internationally. There are several international variants of the show, including RuPaul's Drag Race UK (2019–present) and Canada's Drag Race (2020–present). This has also inspired several spin-offs of the main show, including RuPaul's Drag U (2010–2012), RuPaul's Drag Race All Stars, (2012–present), and RuPaul's Secret Celebrity Drag Race (2020–2022). He has also featured as a host on other reality series, such as Skin Wars (2014–2016), Good Work (2015), and Gay for Play Game Show Starring RuPaul (2016–2017)."}, {"text": "RuPaul has made appearances in films, including  Crooklyn (1994), The Brady Bunch Movie (1995), To Wong Foo, Thanks for Everything! Julie Newmar (1995), and But I'm a Cheerleader (1999), as well as television series, including Girlboss (2017), Broad City (2017), and Grace and Frankie (2019). He created and starred in his own Netflix original series AJ and the Queen (2020). RuPaul has also published four books: Lettin' It All Hang Out (1995), Workin' It! RuPaul's Guide to Life, Liberty, and the Pursuit of Style (2010), GuRu (2018), and The House of Hidden Meanings (2024). As a recording artist, he has released fifteen studio albums. He received a Tony Award for Best Musical as a producer for the musical A Strange Loop (2019)."}, {"text": "== Early life ==RuPaul was born in San Diego on November 17, 1960, the son of Ernestine \"Toni\" (née Fontenette) and Irving Andrew Charles. His parents were both from Louisiana. He was named by his mother; \"Ru\" came from roux, the French term for the base of gumbo and other creole stews and soups. According to DNA analysis by Finding Your Roots staff, his ancestry is 70% African and 30% European.After his parents divorced in 1967, RuPaul and his three sisters lived with their mother, a Seventh-day Adventist. He was raised in the Catholic faith and attended Patrick Henry High School.At 15, RuPaul and his sister Renetta moved to Atlanta, where they studied performing arts. RuPaul struggled as a musician and filmmaker during the 1980s, working at Atlanta's Plaza Theatre. In 1982, he debuted on an Atlanta public access variety show called The American Music Show, and went on to appear on the show frequently.: 59  He also took part in underground cinema, helping create the low-budget film Star Booty and an album of the same name. In Atlanta he often performed at the Celebrity Club, managed by Larry Tee, as a bar dancer or with his band, Wee Wee Pole. RuPaul also performed as a backup singer to Glen Meadmore along with drag queen Vaginal Davis. His first prominent national exposure came in 1989, when he danced as an extra in the video for The B-52s' \"Love Shack\".In the early 1990s, RuPaul worked the Georgia club scene and was known by his full birth name. Initially participating in gender bender-style performances, he performed solo and in collaboration with other bands at several New York City nightclubs, most notably the Pyramid Club. He played opposite New York City drag performer Mona Foot (Nashom Benjamin) in the one-act science-fiction parody \"My Pet Homo\", written and directed by Jon Michael Johnson for Cooper Square Productions. He performed for many years at the annual Wigstock drag festival and appeared in the documentary Wigstock: The Movie."}, {"text": "== Early life ==In the 1990s, RuPaul was known in the UK for his appearances on the Channel 4 series Manhattan Cable, a weekly series produced by World of Wonder and presented by American Laurie Pike about New York's public-access television system."}, {"text": "== Early life ==He also worked at WKTU in the late 1990s and was hired at WNEW in 2004."}, {"text": "=== 1993–1997: Supermodel of the World, Foxy Lady, and Ho Ho Ho ===In 1993, RuPaul recorded the dance/house album Supermodel of the World. It was released through the rap label Tommy Boy, spawning the dance track hit \"Supermodel (You Better Work)\". The song peaked at 45 on the Billboard Hot 100. It charted on the UK Singles Chart, peaking on the top 40 at 39. The song found the most success on the Billboard Hot Dance Music/Club Play chart, where it peaked at 2. Radio airplay, heavy rotation of the music video on MTV, and television appearances on popular programs like The Arsenio Hall Show popularized the song."}, {"text": "=== 1993–1997: Supermodel of the World, Foxy Lady, and Ho Ho Ho ===What other people think of me is not my business. What I do is what I do. How people see me doesn't change what I decide to do. I don't choose projects so people don't see me as one thing or another. I choose projects that excite me. I think the problem is that people refuse to understand what drag is outside of their own belief system."}, {"text": "=== 1993–1997: Supermodel of the World, Foxy Lady, and Ho Ho Ho ===His next two singles/videos, \"Back to My Roots\" and \"A Shade Shady (Now Prance)\", both went to the top spot on the Billboard Hot Dance Music/Club Play chart and furthered his campy persona. His following release \"House of Love\" failed to place on any U.S. charts but peaked at 68 on the UK Singles Chart."}, {"text": "=== 1993–1997: Supermodel of the World, Foxy Lady, and Ho Ho Ho ===RuPaul was signed to a modeling contract for MAC Cosmetics. Various billboards featured him in full drag, often with the text \"I am the MAC girl\". He also released his autobiography, Lettin' It All Hang Out. He promoted the book in part with a 1995 guest appearance on ABC's All My Children, in a storyline that put it on the set of Erica Kane's talk show \"The Cutting Edge\". The same year, he was featured in his first of two appearances in the Brady Bunch movies, in which he played Jan's female guidance counselor."}, {"text": "=== 1993–1997: Supermodel of the World, Foxy Lady, and Ho Ho Ho ===The next year he landed a talk show of his own on VH1, called The RuPaul Show interviewing celebrity guests and musical acts. Cher, Diana Ross, Nirvana, Duran Duran, Pat Benatar, Mary J. Blige, Bea Arthur, Dionne Warwick, Cyndi Lauper, Olivia Newton-John, Beenie Man, Pete Burns, Bow Wow Wow, and the Backstreet Boys were notable guests. His co-host was Michelle Visage with whom he also co-hosted on WKTU radio. On one episode, RuPaul featured guests Chi Chi LaRue and Tom Chase speaking about the gay porn industry."}, {"text": "=== 1993–1997: Supermodel of the World, Foxy Lady, and Ho Ho Ho ===Later in the year he released his second album, Foxy Lady, this time on the L.A.-based Rhino Records label. The album failed to chart on the Billboard 200. However, its first single \"Snapshot\" went to number four on the Hot Dance Music/Club Play chart. It also enjoyed limited mainstream success, charting at 95 on the Billboard Hot 100, which was his second and final solo Hot 100 entry to date. The album's second single \"A Little Bit of Love\" was not as successful, peaking at 28 on the Hot Dance Music/Club Play chart. During this time, RuPaul helped launch the return of WKTU radio in New York City and would serve as host of its morning show until 1998."}, {"text": "=== 1993–1997: Supermodel of the World, Foxy Lady, and Ho Ho Ho ===In 1997, he released his third album, the Christmas-themed Ho Ho Ho. That year, RuPaul teamed with Martha Wash to remake the classic disco anthem, \"It's Raining Men\". The song was included on the 1998 compilation CD RuPaul's Go Go Box Classics. During this time, he appeared in Webex TV commercials and magazine ads. In 2002, he was featured on the Eurodance track \"You're No Lady\" alongside Brigitte Nielsen."}, {"text": "=== 2004–2007: Red Hot, ReWorked, and Starrbooty ===In 2004, RuPaul released his fourth album, Red Hot on his own RuCo Inc. music label. It received dance radio and club play, but very little press coverage. On his blog he discussed how he felt betrayed by the entertainment industry, particularly the gay press. In one incident, it was noted that Entertainment Weekly refused to review the album, instead asking him to make a comedic contribution to a fashion article. He likened the experience to \"a black person being invited to a party, but only if they'll serve.\" Despite his apparent dissatisfaction with the release, Red Hot's lead single \"Looking Good, Feeling Gorgeous\" peaked at number two on the dance chart. The second, \"WorkOut\", peaked at number five. The third and final single from the album \"People Are People\" a duet with Tom Trujillo, peaked at number 10. The album itself only charted on the Top Electronic Albums chart, where it hit number nine. RuPaul later noted, \"Well, betrayed might be the wrong word. 'Betrayed' alludes to an idea that there was some kind of a promise made to me, and there never was. More so, I was disappointed. I don't feel like it was a betrayal. Nobody promises anything in show business and you understand that from day one. But, I don't know what happened. It seemed I couldn't get press on my album unless I was willing to play into the role that the mainstream press has assigned to gay people, which is as servants of straight ideals.\"On June 13, 2006, RuPaul released ReWorked, his first remix album and fifth album overall. It features reworked versions of songs from his back catalog, as well as new recordings. The only single released from the album was a re-recording of \"Supermodel (You Better Work)\", which reached number 21 on the U.S. dance chart. June 20, 2007, saw the release of Starrbooty: Original Motion Picture Soundtrack in the United States. The single \"Call Me Starrbooty\" was digitally released in 2007. The album contains new tracks as well as interludes with dialogue from the movie. The film was released on DVD in October 2007."}, {"text": "=== 2008–2010: RuPaul's Drag Race and Champion ===In mid-2008, RuPaul began producing RuPaul's Drag Race, a reality television game show which aired on Logo in February 2009. On the program drag queens compete to be selected by RuPaul and a panel of judges as \"America's next drag superstar\". The first season's winner was BeBe Zahara Benet, and first runner-up Nina Flowers was chosen by fans as \"Miss Congeniality\" through voting via the show's official website. To publicize the new show, RuPaul appeared on several other shows in 2008, including Project Runway, as guest judge, and on Paula's Party as a guest \"chef\".In March 2009, RuPaul released the album Champion. The album spawned four singles \"Cover Girl\", \"Jealous of My Boogie\", \"Devil Made Me Do It\", and \"Tranny Chaser\". The album peaked at number 12 on the Billboard Dance/Electronic Albums as well as 26 on the Billboard Top Heatseekers chart. Logo's second annual NewNowNext Awards in 2009 were hosted by RuPaul. There he performed \"Jealous of My Boogie (Gomi & RasJek Edit)\". In March 2010, RuPaul released his second remix album, Drag Race, the album features remixes of songs from the 2009 album Champion."}, {"text": "=== 2011–2013: Glamazon, make-up and perfume line ===In April 2011, coinciding with the finale of season 3 of RuPaul's Drag Race, RuPaul released his sixth studio album Glamazon, produced by Revolucian, who previously worked with RuPaul on his album Champion. The album charted on Billboard's Dance/Electronic Albums and the Billboard Top Heatseekers chart at 11 and 8 respectively. In July 2011, he released another remix EP entitled SuperGlam DQ which features remixes of tracks from Glamazon, remixes of the \"Drag U Theme Song\", and a new song, \"Sexy Drag Queen\". The second season of RuPaul's Drag U began in June 2011. In late 2011, promotions for season 4 of Drag Race began. RuPaul made appearances on The Rosie Show and The Chew, and also attended a Drag Race NY Premiere party at Patricia Field's store in New York. Season 4 of RuPaul's Drag Race premiered on Logo on January 30, 2012, with RuPaul returning as the main host and judge. After season 4 ended TV.com declared it was the best reality TV show on television."}, {"text": "=== 2011–2013: Glamazon, make-up and perfume line ===In the fall of 2012, the spin-off RuPaul's Drag Race All Stars premiered after a large fan demand. The show featured past contestants of the previous four seasons to compete. Season 5 of RuPaul's Drag Race premiered on January 28, 2013, with a 90-minute special and RuPaul returning as the main host and judge. On April 30, 2013, he released a single \"Lick It Lollipop\" featuring Lady Bunny, who RuPaul previously collaborated with on Champion. On October 25, 2013, he reported via Twitter that the new album would be released in January 2014."}, {"text": "=== 2011–2013: Glamazon, make-up and perfume line ===In fall of 2013, RuPaul joined forces with cosmetic manufacturers Colorevolution to launch his debut make-up line featuring ultra-rich pigment cosmetics and a beauty collection. Released alongside the line was a unisex perfume entitled \"Glamazon\". Talking to World of Wonder he said: \"Glamazon is for women and men of all ages and preferences who share one thing in common: They are not afraid to be fierce. For me, glamour should be accessible to all, and I am committed to helping the world look and smell more beautiful.\" The line was exclusively sold on the Colorevolution website in various gift sets."}, {"text": "=== 2014: Born Naked, What's The Tee?, and Skin Wars ===RuPaul and Revolucian both confirmed through their Twitter and Instagram accounts that they had been working on an upcoming seventh studio album. Born Naked was released on February 24, 2014, to coincide with the premiere of the 6th season of RuPaul's Drag Race. Prior to the premiere an album of RuPaul cover songs performed by the Season 6 cast was released on January 28, 2014. The covers album is titled RuPaul Presents The CoverGurlz and contains RuPaul songs from 2009 to 2013. To further promote the Drag Race season premiere, RuPaul, representing Logo TV (and parent company Viacom) was chosen to ring the NASDAQ closing bell on February 24, 2014. The week of its release, Born Naked reached number one on the iTunes dance album chart. The following week it placed at number 4 on the US Billboard dance chart and 85 on the Billboard 200 chart. In a profile by The New York Times it was revealed that he is currently working on a porcelain statuette of his likeness. On April 9, 2014, RuPaul and Michelle Visage released the first episode of their podcast, RuPaul: What's the Tee? with Michelle Visage. In August, he joined the reality competition show Skin Wars acting as a judge."}, {"text": "=== 2015: Realness, Good Work, and Slay Belles ===On March 2, 2015, RuPaul released his eighth studio album, Realness. The release coincided with the premiere of the seventh season of RuPaul's Drag Race. In April, he launched and began hosting a new show, Good Work, a plastic surgery-themed talk show for E!. In October he released his second Christmas album, and ninth studio album, Slay Belles. The album contains ten original Christmas-themed songs and features collaborations with Michelle Visage, Siedah Garrett, Todrick Hall, and Big Freedia. The album charted at 21 on the US Billboard Dance chart."}, {"text": "=== 2016: Gay for Play, Butch Queen, All Stars 2 ===In January 2016, it was announced RuPaul would present a new game show for Logo TV called Gay for Play Game Show Starring RuPaul which premiered on April 11, 2016, after RuPaul's Drag Race. In February 2016, he announced his tenth album, Butch Queen. It was released in March 2016, just prior to the premiere of the eighth season of RuPaul's Drag Race. A song from the album, \"U Wear It Well\" was featured in the teaser campaigns for the season and was later officially released as the first single on iTunes in February 2016. The album charted at number 3 on the US Billboard Dance chart, marking his highest position on this chart to date (2016?). \"'Be Someone\" featuring American singer Taylor Dayne was released as the album's second and final single. Additionally, Butch Queen: The Ru-Mixes was released."}, {"text": "=== 2016: Gay for Play, Butch Queen, All Stars 2 ===In July 2016, it was announced that RuPaul was nominated for the Primetime Emmy Award for Outstanding Host for a Reality or Reality-Competition Program. He was presented the award at the September Creative Arts Emmy Awards Ceremony. 2016 also saw the release of the single \"Read U Wrote U\" that features rap parts by the RuPaul's Drag Race All Stars 2 finalists Roxxxy Andrews, Katya Zamolodchikova, Alaska Thunderfuck, and Detox Icunt with production by Ellis Miah."}, {"text": "=== 2017–2018: Remember Me, American, return to VH1, and Essential, Vol. 2 ===On January 27, 2017, RuPaul announced that a new album would be released the week after. The album, named Remember Me: Essential, Vol. 1 was put up for pre-order on February 2 and eventually released the next day. It is a collection of new songs and remakes of classic RuPaul hits that feature new artists. Two singles have been released from the album so far: \"Rock It (To The Moon)\" which is a new song loosely based on the lyrics and the melody of \"Hey Booty\" which was released on the Starrbooty soundtrack in 2007, and an updated version of RuPaul's 1996 hit single \"Snapshot\" from the album Foxy Lady. The album failed to chart on the Dance Albums Chart but managed to debut at number four on the Billboard Dance Albums Sales Chart in the United States. It also charted at number eleven on the UK Dance Albums Chart, becoming RuPaul's highest-charting album on that chart, after Realness managed to debut and peak at number 13."}, {"text": "=== 2017–2018: Remember Me, American, return to VH1, and Essential, Vol. 2 ===On March 24, 2017, RuPaul released his eleventh studio album, American. Later on the same day, the ninth regular season of RuPaul's Drag Race debuted on basic cable channel VH1, home of RuPaul's talk show in the 1990s. It moved from the expanded cable channel Logo TV which aired all previous seasons of the show. The season 9 premiere featured singer Lady Gaga as its guest judge and was a success, with ratings of nearly 1,000,000 viewers making it the series' most viewed episode. The number was double LogoTV's season 8 premiere ratings from the year prior, and triple VH1's usual Friday night viewership in that programming timeslot. World of Wonder Productions announced they were casting contestants for a tenth season when the ratings were released.On June 2, 2017, Essential, Vol. 2 was put up on pre-order on iTunes. It was released on June 9 and preceded by the single \"Crying on the Dance Floor\" which is a re-recording of the 2010 single \"Main Event\" from the album Champion. On June 22, 2017, it was announced that RuPaul would receive a star on the Hollywood Walk of Fame for his contributions to the television industry. He was awarded the honor on March 16, 2018, making him the first drag queen to be given the award.In August 2018, it was announced that RuPaul will be releasing his third Christmas album in October 2018."}, {"text": "=== 2019–present: Drag Race UK, AJ and the Queen and further TV shows ===In June 2019, a daytime talk show titled RuPaul premiered. It was cancelled after a three-week test run, since it was not picked by any Fox TV stations. He also appeared in Taylor Swift's \"You Need to Calm Down\" music video.In late 2019, the first season of RuPaul's Drag Race UK was released on BBC3. It was well-received, with The Guardian stating that the British version had \"saved\" the franchise. It was renewed for a second season which was released in 2021. RuPaul also created and starred in the Netflix drama-comedy show AJ and the Queen as a drag queen touring the country with an unlikely young sidekick, which was released on January 10, 2020. On March 6, 2020, Netflix announced that the series had been cancelled.Also in January 2020, it was announced that RuPaul would host Saturday Night Live on February 8, 2020, with Justin Bieber as a musical guest. On May 4, 2020, it was announced that RuPaul would be on The Price Is Right at Night airing May 11. He also made an appearance in the premiere episode of Canada's Drag Race."}, {"text": "=== 2019–present: Drag Race UK, AJ and the Queen and further TV shows ===In August 2021, RuPaul guest hosted two episodes of the talk show Jimmy Kimmel Live!; he also interviewed RuPaul's Drag Race season 13 winner Symone on the program. He did voice work in Amphibia portraying the FBI agent Mr. X. He will be hosting a revival of the game show Lingo for CBS in 2022. He is currently hosting the celebrity version of the British version of the show on ITV.In 2022, he won the Tony Award for Best Musical for serving as a producer on the Broadway musical A Strange Loop. He also voices himself as the announcer on The Tiny Chef Show.In 2023, it was announced that RuPaul would be releasing a memoir, House of Hidden Meanings, through publisher HarperCollins in 2024."}, {"text": "=== Podcasting ===The podcast RuPaul: What's the Tee? With Michelle Visage debuted on April 6, 2014. Ru-Paul co-hosts with longtime friend and fellow RuPaul's Drag Race judge Michelle Visage. The weekly show features their thoughts on topics including behind-the-scenes of RuPaul's Drag Race, life advice, beauty tips, and conversations with featured guests from the entertainment world."}, {"text": "=== Audiobooks ===In 2018, RuPaul was one of the actors who voiced the audiobook A Day in the Life of Marlon Bundo."}, {"text": "=== Drag conventions ===Launched through production company World of Wonder, RuPaul's DragCon LA is an annual drag-themed convention held in Los Angeles which started in 2015, followed by RuPaul's DragCon NYC. It began in 2007 in New York City; the public is able to meet with RuPaul, former RuPaul's Drag Race contestants, and other drag queens. The conventions feature performances, meet-and-greet booths, merchandise sales and panel discussions."}, {"text": "=== Activism ===RuPaul has been an active supporter of voter registration, producing a public service announcement supporting National Voter Registration Day and urging everyone to register. As RuPaul said voter ID laws vary from state to state; the details of the voter ID required in each state are provided by HeadCount and VoteRiders. As one in five LGBTQ adults are not registered to vote, voter registration efforts have expanded recently. Several stars from RuPaul's Drag Race act as Ambassadors for Drag Out the Vote."}, {"text": "=== Activism ===In March 2023, in response to the Tennessee Adult Entertainment Act, RuPaul, World of Wonder producers Randy Barbarto and Fenton Bailey, and MTV began a fund to fight anti-drag initiatives. The ACLU maintains the fund, which received donations from efforts at DragCon LA 2023, the \"Drag Isn't Dangerous\" livestream telethon, \"Can't Hold us Down\", \"Born This Way\", and \"God Save the Queens\", as well as a small donation from the Manhattan Association of Cabarets.The Instagram post RuPaul made prior to the establishment of the fund called on followers to vote, saying, \"Register to vote so we can get those stunt queens out of office.\" The video ends with the statement, \"By the way, a social media post has never been as powerful as a registered vote.\""}, {"text": "== Impact ==Lauren Herold of Mic.com deemed RuPaul \"arguably the most commercially successful drag queen in America.\" Sami Main of Adweek credited him with creating wider exposure for drag queens from LGBT culture into mainstream society, thanks to his early-career chart success, and later, the successive climb in viewership of RuPaul's Drag Race. His talk show The RuPaul Show was the first-ever national talk show to have a drag queen as a host. Along with his partner Michelle Visage, he welcomed an array of high-profile guests such as Cher, Lil Kim, and Diana Ross over the show's 100-episode span. As well as having a variety of comedy skits, the show was noted for discussing topics such as black empowerment, female empowerment, misogyny, and liberal politics that were otherwise unheard of in 1990s television at the time. In 1999, RuPaul was awarded the Vito Russo Award at the GLAAD Media Awards for work in promoting equality in the LGBT community."}, {"text": "== Impact ==RuPaul has also been noted as having a large part in RuPaul's Drag Race's continuous television success. By pioneering queer representation on television, many believe RuPaul to have essentially revolutionised the portrayal of the LGBTQ+ community on screen. He first won an Emmy for his work on the show in 2016, and one year later the show garnered eight nominations, including Outstanding Reality-Competition Program for the first time in its 11-season run, and a second consecutive win for RuPaul in the Primetime Emmy Award for Outstanding Host for a Reality or Reality-Competition Program. In 2017, he was included in the annual Time 100 list of the most influential people in the world. In 2019, Fortune noted RuPaul as \"easily the world's most famous\" drag queen."}, {"text": "=== Relationship with transgender community ===RuPaul has been the subject of multiple controversies regarding his comments and actions towards the transgender community. According to Vox, he has a complicated relationship with this community, in part due to differing philosophies: through drag he seeks to mock gender and identity stereotypes, while in his view the trans community takes identity seriously. Nevertheless, RuPaul's Drag Race has featured a number of contestants who are trans women, some of whom made their identity public while competing on the show, including Sonique, Carmen Carrera, Jiggly Caliente, Monica Beverly Hillz, Kenya Michaels, and Gia Gunn. Later seasons of the show have included contestants who had already disclosed their trans identity prior to their season beginning. In 2017, Peppermint became the first contestant to compete throughout her season as an openly trans woman and in 2021 Gottmik was the first to compete as an openly trans man. Other non-conforming gender identities expressed by former contestants include both non-binary (Jinkx Monsoon, Aja, Valentina, Divina de Campo, Ginny Lemon, Violet Chachki, and Sasha Velour) and genderfluid (Courtney Act and Kelly Mantle) persons."}, {"text": "=== Relationship with transgender community ===In 2014, trans activists and former contestants Carmen Carrera and Monica Beverly Hillz criticized the show's use of words such as tranny and shemale, including the main challenge announcement phrase up to season 6, \"You've got she-mail\", which they described as transphobic. That year's season also included a \"Female or She-male\" segment that required contestants to guess whether various photographs featured cisgender \"biological women\" or \"psychological women\" (drag queens), causing further criticism. RuPaul and the producers issued a statement promising \"to help spread love, acceptance and understanding\" and Logo TV removed the \"You've got she-mail\" phrase from subsequent broadcasts, replacing it instead with the phrase \"She done already done had herses.\" RuPaul criticized those attempting to police his language in bad faith and noted that tranny referred to transvestites and drag queens, not just trans women.In 2018, RuPaul gave an interview to The Guardian in which he stated that a post-transition trans woman would \"probably not\" be accepted onto the show, noting that at the time of competition Peppermint had not yet had breast implants. After facing criticism on social media and from former contestants for his remarks, RuPaul compared trans drag queens who had transitioned to athletes who had taken performance-enhancing drugs. He subsequently expressed regret for the hurt caused by his remarks, and that the only screening criteria for contestants were \"charisma, uniqueness, nerve, and talent.\" Since he made these statements, multiple transgender contestants have competed on the show."}, {"text": "== Personal life ==RuPaul met painter Georges LeBar in 1994 at the Limelight nightclub in New York City. They married in January 2017. They have an open marriage; RuPaul has said he would not want to \"put restraints\" on the person he loves. The two split their time between a home in Los Angeles and a 60,000-acre (24,000 ha) ranch in Wyoming. Environmentalists criticized them in 2020 after RuPaul revealed that they lease mineral rights and sell water to oil companies on their ranch, and allow fracking there. According to public maps, the ranch has at least 35 active wells. RuPaul previously held a climate-themed ball on his show to raise environmental awareness, leading to accusations of hypocrisy.RuPaul publicly endorsed Democratic nominee Hillary Clinton in the 2016 U.S. presidential election. He expressed dismay at Clinton's defeat by Republican nominee Donald Trump, saying, \"The America that we have all fought so hard for, the narrative of love and peace and liberty and equality, it feels like it is dead.\" He has described doing drag as a \"very, very political\" act because it \"challenges the status quo\" by rejecting fixed identities: \"Drag says 'I'm a shapeshifter, I do whatever the hell I want at any given time'.\"RuPaul started smoking cannabis at age 10 or 11. Since 1999, he has been sober and has not had alcohol, drugs, or tobacco. In 2020, he found out while appearing on the TV show Finding Your Roots that he and New Jersey Senator Cory Booker are cousins. In a 2013 interview, RuPaul said, \"I'm not religious, but I do have spiritual practices like yoga and meditation and I do pray.\""}, {"text": "== Discography ==Studio albums"}, {"text": "== Awards and nominations ==In 2020, a species of Australian soldier fly was named Opaluma rupaul. The name was chosen in reference to the fly's \"costume of shiny metallic rainbow colours.\" Other species described in the same article were named O. ednae (after fellow drag queen Dame Edna Everage) and O. fabulosa."}, {"text": "== Books ==Lettin' It All Hang Out: An Autobiography. New York: Hyperion Books. June 1, 1995. ISBN 0-7868-6156-8. OCLC 31657240."}, {"text": "== Books ==Workin' It! RuPaul's Guide to Life, Liberty, and the Pursuit of Style. New York: It Books. January 1, 2010. ISBN 9780061985836. OCLC 435421683."}, {"text": "== Books ==GuRu. New York: Dey Street Books. January 1, 2018. ISBN 9780751573831. OCLC 1076520397."}, {"text": "== Books ==The House of Hidden Meanings: A Memoir. New York: Dey St. March 5, 2024. ISBN 9780063263901. OCLC 1388319009."}, {"text": "== See also ==LGBT culture in New York City"}, {"text": "== See also ==List of LGBT people from New York City"}, {"text": "== See also ==List of number-one dance hits (United States)"}, {"text": "== See also ==List of artists who reached number one on the US Dance chart"}, {"text": "== External links ==Official website "}, {"text": "== External links ==RuPaul at IMDb "}, {"text": "== External links ==RuPaul at The Interviews: An Oral History of Television"}]