[{"text": "Ryan John Seacrest (born December 24, 1974) is an American television presenter and producer. Seacrest co-hosted and served as executive producer of Live with Kelly and Ryan, and has hosted other media including American Idol, American Top 40, and On Air with Ryan Seacrest. He became co-host of Dick Clark's New Year's Rockin' Eve in 2005, and became the sole host following Clark's death in 2012.Seacrest received Emmy Award nominations for American Idol each year from 2004 to 2013, and once more in 2016. He won an Emmy for his work on Jamie Oliver's Food Revolution in 2010, and was nominated once more in 2012. In 2018, he received nominations for Live with Kelly and Ryan in the categories of Outstanding Talk Show Entertainment as well as Outstanding Entertainment Talk Show Host.In September 2024, Seacrest will become the host of Wheel of Fortune, replacing Pat Sajak."}, {"text": "== Early life ==Ryan John Seacrest was born in Atlanta on December 24, 1974, the son of homemaker Constance Marie (née Zullinger) and real estate lawyer Gary Lee Seacrest. His father served as a lieutenant in the U.S. Army, in which his grandfather Henry Gene Skeen was a major general. His mother told the Atlanta Journal-Constitution, \"Instead of playing with G.I. Joes or Cowboys and Indians, Ryan would always have a little microphone and do shows in the house.\" At age 14, he attended Dunwoody High School. At age 16, while still attending high school, he won an internship at WSTR in Atlanta where Tom Sullivan trained him in many aspects of radio. When a regular DJ called in sick, Sullivan put him on the air for the first show of his broadcasting career. He was given the weekend overnight shift at WSTR. He continued to work on air at WSTR until graduating from Dunwoody High in 1992. He studied journalism at the University of Georgia in the fall of 1992. He continued his radio show at a local station in Athens, Georgia. He left the university at age 19 and moved to Los Angeles to pursue his broadcasting career."}, {"text": "==== Early work ====In 1993, Seacrest hosted the first season of ESPN's Radical Outdoor Challenge. He also hosted three kids' game shows, Gladiators 2000 from 1994 to 1996 (a spinoff of the television show, American Gladiators), Wild Animal Games in 1995, and Click in 1997. He appeared as the host of the fictional game show Lover's Lane on Beverly Hills, 90210 in \"The Final Proof\". In the fall and winter of 2000, he was the host of The NBC Saturday Night Movie. During commercial breaks he offered trivia on the film and a chance to win prizes by answering online on NBCi. In 2001, he hosted a reality television program, Ultimate Revenge, where elaborate practical jokes were played on family and friends instigated by their own relatives and friends. It was shown on TNN from 2001 to 2003."}, {"text": "==== American Idol ====In 2002, Seacrest accepted the position as co-host of a new Fox reality television series American Idol with comedian Brian Dunkleman. The following year he became the sole host. The show increased in popularity and was seen by some 26 million viewers weekly; Seacrest became recognizable around the world. In 2003, he hosted the spin-off show, American Juniors. In July 2009, he signed a deal with CKX for $45 million to continue to host American Idol which made him the highest paid reality television host at the time. In April 2012, he signed a two-year $30 million deal to stay on as host of American Idol. In May 2014, Deadline Hollywood reported that he had signed a one-year deal with the option of signing for another year. He remained host of the series until the end of its run in April 2016. The following May, it was announced that ABC had won a multi-network bidding war for the rights to the show. On July 20, 2017, he announced on Live with Kelly & Ryan that he would be the host of an Idol reboot. His initial multi-year deal was reported to be worth over $10 million."}, {"text": "==== New Year's Rockin' Eve ====In August 2005, it was announced that Seacrest would become executive producer and co-host of ABC's Dick Clark's New Year's Rockin' Eve. On December 31, 2005, Seacrest performed much of the show's hosting duties; Dick Clark's role was limited by speech and mobility issues due to his recovery from a stroke. Seacrest also occasionally served as a substitute host on the CNN television program Larry King Live, and co-emceed Larry King's final show with Bill Maher on December 16, 2010.In 2009, ABC renamed the program Dick Clark's New Year's Rockin' Eve With Ryan Seacrest, paying attention to Seacrest's role. He co-hosted the show delivering ABC's biggest New Year's numbers in twelve years, with 22.8 million viewers.When Dick Clark died, Seacrest publicly remembered his mentor's impact on his life in a special tribute in The Hollywood Reporter. After Clark's death, Seacrest hosted the 2013 edition of Dick Clark's New Year's Rockin' Eve with co-hosts Jenny McCarthy and Fergie paying tribute to Dick Clark in the pre-show. In October 2013, Seacrest signed a multi-year contract extension with Dick Clark Productions to continue as host and executive producer of Dick Clark's New Year's Rockin' Eve. In 2017, Seacrest hosted Dick Clark's New Year's Rockin' Eve for the 13th consecutive year alongside McCarthy, who had co-hosted for eight years. The show had 25.6 million viewers, the highest in six years. The 2019–20 edition of Rockin' Eve marked his 15th consecutive year as the host and Lucy Hale also hosted. Recently he received a multi-year deal extension to continue hosting the show."}, {"text": "==== E! and NBC ====In January 2006, US cable channel E! announced a three-year, $21 million deal for Seacrest to host various programs, including E! News and its red carpet awards show coverages. In April 2012, Seacrest signed a deal with NBCUniversal expanding his on-air role beyond E! to NBC. He contributed to the Today Show, Olympics coverage, entertainment programming, as well as news and other special events. Seacrest will remain managing editor of E! News and host and produce its red carpet awards show coverage.In September 2012, Seacrest left E! News and was replaced by Terrence J.Seacrest was an NBC correspondent for the 2012 London Olympic Games and co-hosted the closing ceremony with Bob Costas and Al Michaels. In 2016, Seacrest hosted NBC's live late-night coverage for the Rio Olympic Games."}, {"text": "==== Live with Kelly and Ryan ====After a year-long search, on May 1, 2017, it was announced that Seacrest would join Kelly Ripa as host of Live with Kelly and Ryan as her new permanent co-host and executive producer. Seacrest succeeded Michael Strahan starting work on the day of the announcement. By December 2017 the show was averaging over 3 million viewers.On February 16, 2023, Seacrest announced that he would be leaving Live with Kelly and Ryan after six years in April 2023, primarily due to traveling as his primary residence is in Los Angeles, while the show tapes in New York City. Seacrest made his last appearance as full-time host on April 14, 2023. Mark Consuelos, husband of Kelly Ripa, replaced him full-time on April 17, 2023. "}, {"text": "==== Live with Kelly and Ryan ====Seacrest has stated, however, that he will return to guest host whenever Consuelos is unavailable, meaning he is not permanently leaving the show."}, {"text": "==== Wheel of Fortune ====On June 27, 2023, The New York Times reported that Seacrest would replace the outgoing Pat Sajak as the host of Wheel of Fortune beginning with the show's 42nd season in fall 2024, citing \"two people familiar with the plan\". Seacrest and Sony would later confirm the news in separate releases."}, {"text": "==== Other shows ====In 2013, Seacrest hosted The Million Second Quiz which was an interactive game show on NBC. Seacrest hosted Knock Knock Live in 2015, which premiered on Fox. The show featured celebrities arriving at the door of ordinary people who've done something special and giving them a prize. However, the show was cancelled after two episodes."}, {"text": "=== Radio hosting ===In January 2004, Seacrest became the new host of the radio program American Top 40, a syndicated weekly countdown show, created and formerly hosted by Casey Kasem. The show was syndicated by Premiere Radio Networks. In February 2004, Seacrest became host of Los Angeles radio station KIIS-FM's morning show, replacing long-time host Rick Dees. The show, On Air With Ryan Seacrest, since 2017 Seacrest has been broadcasting from a studio at the facilities of WABC-TV in New York City, where Live with Kelly and Ryan is produced. Seacrest renewed his contract with Premiere and KIIS parent company iHeartMedia in September 2021, a contract that will last through the end of 2025.In 2018, Seacrest was inducted into the Library of American Broadcasting Foundation's 16th Annual Giants of Broadcasting & Electronic Arts."}, {"text": "=== Television producing ===Seacrest's three-year hosting deal with E! included executive producing credits on various programs, including E! News and its red carpet awards show coverages. In the same year, Seacrest launched Ryan Seacrest Productions (RSP). In August 2008, Seacrest named his longtime William Morris agent Adam Sher as CEO. Through 2012 Comcast had first-look rights for all RSP shows. Clear Channel acquired a minority stake in RSP in early 2012, but RSP no longer has a first look deal with any network.Seacrest remains managing editor of E! News and executive produces its red carpet awards show coverage but no longer hosts (since January 2012) E! News on a daily basis.An Associated Press profile portrayed Seacrest as using both the deal with E! and Dick Clark's New Year's Rockin' Eve as springboards to a long-lasting career in television production and ownership.Seacrest produces the hit series Keeping Up with the Kardashians, the highest-rated show on the E! network, and the spin-offs Khloe and Lamar, Kourtney and Kim Take New York and Kourtney and Khloe Take Miami. RSP also produced the Emmy Award-winning ABC reality series Jamie Oliver's Food Revolution. RSP also produced two new reality series in 2012 including Melissa and Tye, which aired on CMT and Shahs of Sunset for Bravo. Bravo announced a second season of Shahs of Sunset on April 18, 2012. RSP's new show Married to Jonas premiered on August 19, 2012, on E! and was renewed for a second season.On January 31, 2012, Thomas H. Lee Partners and Bain Capital announced they would invest up to $300M in Ryan Seacrest Media. A consortium headed by Seacrest (with partners AEG and CAA) agreed to rebrand Mark Cuban's HDNet television network as AXS TV.In 2017, Seacrest signed a multi-year overall deal between Ryan Seacrest Productions and ABC Studios in which the company's scripted division would develop scripted projects for ABC Studios exclusively.In 2018, Seacrest joined the Paley Center for Media's Board of Trustees."}, {"text": "=== Business ventures ===Seacrest was a principal investor in the Typo keyboard, which aimed at cloning the BlackBerry physical keyboard for use with iPhone devices that launched in 2014.  The Typo keyboard was discontinued in a 2015 patent settlement with Blackberry Ltd. He is also an investor and partner at Pathwater, a brand of purified water offered in a refillable aluminum bottle."}, {"text": "=== Fashion ===Seacrest worked with Burberry's Christopher Bailey who designed Seacrest's suits for red carpet events as well as New Year's Eve since 2009 and American Idol starting in 2010. Seacrest wore close-fitting suits and decided to make something similar for a wider audience at an \"accessible\" price point."}, {"text": "=== Fashion ===In 2013, in conjunction with Randa Apparel & Accessories, Seacrest developed his own clothing and accessories collection, \"Ryan Seacrest Distinction.\" The Randa/Seacrest partnership signed an exclusive retail deal with Macy's to sell the brand and it successfully launched in 2014. It consists of suit separates, sports coats, and evening wear manufactured by Peerless Clothing International; accessories including ties, pocket squares, belts, wallets, cufflinks, and jewelry produced by Randa Accessories; and dress shirts from PVH (produced later by Itochu Prominent which added sportswear in September 2017).Seacrest partnered with dermatologist Harold Lancer to produce the men's skincare line Polished. The line has five items and they are designed for easy use. Seacrest announced the line in August 2017 on The Tonight Show Starring Jimmy Fallon."}, {"text": "== Philanthropy ==In 2010, Seacrest launched the nonprofit Ryan Seacrest Foundation. The foundation has fourteen Seacrest Studios: at Children's Healthcare of Atlanta (opened 2010), Children's Hospital of Orange County (2013), Children's Hospital of Philadelphia (2011), Children's National Hospital in Washington DC (2015), Levine Children's Hospital (2013), Cincinnati Children's Hospital Medical Center (2013), Children's Medical Center Dallas (2012), Boston Children's Hospital (2014), Children's Hospital Colorado (2014). Monroe Carell Jr. Children's Hospital at Vanderbilt in Tennessee (2016), Arnold Palmer Hospital for Children in Florida (2020), Le Bonheur Children's Hospital in Tennessee (2023 May), Cohen Children's Medical Center in New York (2023 September), and Primary Children's Hospital in Utah (2023 December). Apparently there was a location at Children's Hospital Los Angeles, but it isn't included in the Foundation's map in 2023. In April 2012, Seacrest named Selena Gomez Ambassador of the Foundation. In February 2017, the foundation partnered with the Atlanta Braves to promote the non-profit at SunTrust Park. Seacrest did voice overs for the Braves' \"Welcome Home\" broadcast media campaign.Seacrest serves on the board of trustees of the Los Angeles County Museum of Art, and honorary co-chair of the GRAMMY Foundation board, which later merged with the GRAMMY Museum and became the GRAMMY Museum Foundation.The day before Georgia's special election in 2018, Seacrest, a Georgia native, urged voters in the state to visit the VoteRider's site or call or text the nonpartisan voter advocacy organization's helpline to find out what ID is required to vote."}, {"text": "== Personal life ==Seacrest had a two-year on-and-off relationship with model Sara Jean Underwood, which was revealed on The Howard Stern Show in 2009. He began dating dancer and actress Julianne Hough in April 2010. In March 2013, it was announced that their relationship had ended. He dated model Shayna Taylor from 2017 until 2020.In May 2016, Seacrest returned to the University of Georgia to serve as the commencement speaker at the graduation ceremony and receive an honorary Doctor of Humane Letters.In November 2017, it was reported that a former E! wardrobe stylist had accused Seacrest of sexual harassment and that he was under investigation. Seacrest denied the allegations and said, \"This person who has accused me of horrible things offered, on multiple occasions, to withdraw her claims if I paid her millions of dollars. I refused.\" In February 2018, the investigation was closed due to insufficient evidence."}, {"text": "=== Radio ===Source"}, {"text": "== External links ==Official website "}, {"text": "== External links ==Ryan Seacrest at IMDb"}, {"text": "== External links ==DigitalReview.net Biography and reviews of Ryan Seacrest Archived June 18, 2009, at the Wayback Machine"}]