[{"text": "Samuel Pack Elliott (born August 9, 1944) is an American actor. With a career spanning over five decades of film and television, he is recognized for his deep sonorous voice. Elliott has received various accolades, including a Screen Actors Guild Award and a National Board of Review Award, in addition to nominations for an Academy Award, two Primetime Emmy Awards and two Golden Globe Awards."}, {"text": "A graduate of the University of Oregon and Clark College, Elliott began his career with minor roles on screen, making his film debut in the western The Way West (1967). After his first leading film role in the horror Frogs (1972), Elliott gained wider attention with his breakthrough role in the drama Lifeguard (1976). He achieved commercial success with his role in the biopic Mask (1985) and received Golden Globe nominations for starring in Louis L'Amour's adaptation of Conagher (1991) and the miniseries Buffalo Girls (1995), the latter of which also earned him his first Primetime Emmy Award nomination. Throughout the 1990s, he portrayed John Buford in the historical drama Gettysburg (1993), Virgil Earp in the western Tombstone (1993), and the Stranger in the crime comedy The Big Lebowski (1998)."}, {"text": "In ensuing decades, Elliott established himself as a character actor, with supporting roles in a number of films, such as the drama We Were Soldiers (2002) and superhero films Hulk (2003) and Ghost Rider (2007). In the 2010s, he had guest starring roles in the FX neo-western series Justified (2015) and the Netflix comedy series Grace and Frankie (2016) and subsequently starred in the Netflix sitcom The Ranch (2016–2020). He went on to headline the comedy drama film The Hero (2017) and star opposite Lady Gaga and Bradley Cooper in Cooper's 2018 adaptation of A Star Is Born, for which he received critical acclaim and a nomination for the Academy Award for Best Supporting Actor. His role in the Paramount+ western miniseries 1883 (2021–2022) earned him further praise and a SAG Award."}, {"text": "== Early life == "}, {"text": "== Early life ==Samuel Pack Elliott was born August 9, 1944, at the Sutter Memorial Hospital in Sacramento, California, the son of Glynn Mamie (née Sparks), a Texas state diving champion in high school and later a physical-training instructor and high-school teacher, and Henry Nelson Elliott, who worked as a predator-control specialist for the Department of the Interior. His parents were originally from El Paso, Texas, and Elliott has an ancestor who served as a surgeon at the Battle of San Jacinto. He moved from California to Portland, Oregon, with his family when he was 13 years old."}, {"text": "== Early life ==Elliott spent his teenaged years living in northeast Portland, and graduated from David Douglas High School in 1962. After graduating from high school, Elliott attended college at the University of Oregon as an English and psychology major for two terms before dropping out. He returned to Portland and attended Clark College in nearby Vancouver, Washington, where he completed a two-year program and was cast as Big Jule in a stage production of Guys and Dolls. The Vancouver Columbian newspaper suggested that Elliott should be a professional actor. After his graduation from Clark in 1965, Elliott re-enrolled at the University of Oregon and pledged at the Sigma Alpha Epsilon fraternity. He dropped out again after his father died of a heart attack."}, {"text": "== Early life ==In the late 1960s, Elliott relocated to Los Angeles to pursue a career in acting, which his father had dissuaded him from doing, instead urging him to obtain a college degree. \"He gave me that proverbial line, 'You've got a snowball's chance in hell of having a career in (Hollywood),'\" Elliott recalled. \"He was a realist, my dad. He was a hard worker. He had a work ethic that I've fashioned mine after, and I thank him for that every day.\" Elliott worked in construction while studying acting and served in the California Air National Guard's 146th Airlift Wing (the Hollywood Guard) at Van Nuys Airport before the unit moved to Channel Islands Air National Guard Station."}, {"text": "=== Early work ===Elliott began his career as a character actor; his appearance, voice, and bearing were well-suited to Westerns. In 1969, he earned his first television credit as Dan Kenyon in Judd for the Defense in the episode \"The Crystal Maze\"."}, {"text": "=== Early work ===That same year he appeared in the show Lancer in the episode \"Death Bait\", playing Renslo. He went on to appear in two additional episodes of the series between 1970 and 1971. One of his early film roles was as a card player who watches as the Sundance Kid (Robert Redford) demonstrates his shooting ability in the opening scene of Butch Cassidy and the Sundance Kid (1969). In the 1970–1971 television season, Elliott starred as Doug Robert for several episodes in the hit series Mission: Impossible. Beginning in 1972, Elliott appeared as the cowboy Walker in a series of Falstaff Beer commercials. In 1975, Elliott was cast in a lead role as Charles Wood in the television film I Will Fight No More Forever, a dramatization of Chief Joseph's resistance to the U.S. government's forcible removal of his Nez Perce Indian tribe to a reservation in Idaho."}, {"text": "=== Early work ===From 1976 to 1977, he played the lead character Sam Damon in the miniseries Once an Eagle, an adaptation of the Anton Myrer novel of the same name, opposite Amy Irving, Kim Hunter, Clu Gulager, and Melanie Griffith. He also had a starring role as Rick Carlson in the summer sleeper hit Lifeguard (1976), which marked his feature film breakthrough. He portrayed a lifeguard in Southern California who reevaluates his life choices after being invited to a reunion. Variety deemed the film \"unsatisfying,\" adding: \"Elliott, who has some beefcake value, projects a character who is mostly a passive reactor rather than a person in sure command of his fate.\""}, {"text": "=== Recognition as a character actor ===Elliott played Tom Keating in the miniseries Aspen in 1977. He later played an abusive wife-killer in the miniseries Murder in Texas (1981) opposite Farrah Fawcett and his future wife Katharine Ross, and starred with Cheryl Ladd in A Death in California (1985). In 1979, he co-starred with Tom Selleck in the popular miniseries adaptation of Louis L'Amour's The Sacketts. Elliott and Selleck were a team again in 1982 in The Shadow Riders, another Louis L'Amour adaption."}, {"text": "=== Recognition as a character actor ===Elliott had a supporting role in Mask (1985) opposite Cher. He played a hard-nosed, rough-around-the-edges but ultimately sympathetic father figure in the Christmas film Prancer (1989). He has made guest appearances on shows including Felony Squad, Gunsmoke, Lancer, and Hawaii Five-O, and has been featured in many TV movies, including Buffalo Girls (1995), in which he played Wild Bill Hickok."}, {"text": "=== Recognition as a character actor ===In 1986, he starred in the TV movie Gone to Texas, based on a biography of Sam Houston. The role allowed him to play Houston as both fighter and a man who grew into a skillful political leader; the film depicted his disgrace as governor of Tennessee, his return to his Cherokee Nation friends, and his pivotal role in the liberation of Texas from Mexico in 1836. Elliott appeared with Patrick Swayze in Road House (1989) as Wade Garrett, a bouncer, mentor and friend of Swayze's character. In 1991, Elliott and his wife Katharine Ross starred in the adaptation of the Louis L'Amour novel Conagher (1991)."}, {"text": "=== Recognition as a character actor ===He portrayed Brigadier General John Buford in the 1993 historical drama Gettysburg, and the same year played Virgil Earp in the Western Tombstone (1993).  Elliott played The Stranger, a character narrating the story of The Big Lebowski (1998). He co-starred in We Were Soldiers (2002), an adaptation of We Were Soldiers Once… And Young, in which he portrayed Command Sergeant Major Basil L. Plumley. He played General Thaddeus Ross in the 2003 action film Hulk."}, {"text": "=== Later career ===In 2005, he appeared in Thank You for Smoking as a former Marlboro Man advertisement cowboy who has developed lung cancer. In 2006 he provided the voice for the character Ben the Cow in the animated film Barnyard."}, {"text": "=== Later career ===In 2007, Elliott joined the comic book adaptation Ghost Rider. He played the character Carter Slade. The same year, Elliott appeared in The Golden Compass as the character Lee Scoresby. The film is based on Northern Lights in Philip Pullman's trilogy His Dark Materials. Also appearing in the film are Nicole Kidman, Christopher Lee, and Daniel Craig."}, {"text": "=== Later career ===In 2009, Elliott had a small role in Up In The Air in which he portrayed the chief pilot of American Airlines. He appeared three times on Parks and Recreation as Ron Dunn, the Eagleton equivalent of Ron Swanson; Dunn is a hippie, compared to Swanson's staunch survivalist and Libertarian personality. He then provided the voice of Buster (a.k.a. Chupadogra) in the animated film Marmaduke (2010). He had a supporting role in the thriller film The Company You Keep and played a college football coach in 2014's drama film Draft Day."}, {"text": "=== Later career ===In 2015, Elliott appeared opposite Lily Tomlin as a former love interest of a grandmother (Tomlin) attempting to help her pregnant granddaughter in Paul Weitz's comedy Grandma. In the same year he appeared in the romance I'll See You in My Dreams, and had a role in the independent film Digging for Fire. In 2015, he won the Critics' Choice Television Award for best guest performer in a drama for his role in the FX Network's show Justified."}, {"text": "=== Career resurgence and critical acclaim ===In 2015, Elliott began appearing as a series regular in the Netflix series The Ranch, opposite Ashton Kutcher and Danny Masterson. He also had a recurring role as Phil Millstein in the second season of Grace and Frankie. In film, he supplied the voice of Butch in the animated film The Good Dinosaur (2015)."}, {"text": "=== Career resurgence and critical acclaim ===In 2017, Elliott starred in The Hero, as Lee Hayden, an aging Western icon with a golden voice, whose best performances are decades behind him. His work in the film received much critical acclaim with Joey Magidson, writing for AwardsCircuit, proclaiming that \"Elliott is perfect here. The Hero encapsulates everything you love about him into one package.\" Later that year, Elliott starred in The Man Who Killed Hitler and Then the Bigfoot."}, {"text": "=== Career resurgence and critical acclaim ===The following year, Elliott costarred in A Star Is Born (2018), in which he plays Bobby Maine, the elder half-brother of Bradley Cooper's lead character. Elliott received critical acclaim for his performance, winning the National Board of Review Award for Best Supporting Actor. He was also nominated for the Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Supporting Role, as well as the Academy Award for Best Supporting Actor,  his career-first nomination. Commenting on his Academy Award nomination, Elliott declared: \"I think the thing off the top of my head might be, 'It's about fucking time!'\""}, {"text": "=== Career resurgence and critical acclaim ===In 2022, Elliot played Shea Brennan on the Paramount+ miniseries 1883, a prequel to the Yellowstone series. The show's story involves Brennan as he leads a group of immigrants from Fort Worth, Texas into the untamed western areas of the plains, and its connection to the Dutton family and its migration to Montana. The show's first season was aired from late 2021 until February 2022. For his performance he won the Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Miniseries or Television Movie."}, {"text": "== Other ventures ==In 1998, Elliott was named the grand marshal of the Calgary Stampede parade and rode in the procession before an estimated 300,000 spectators."}, {"text": "=== Voice work ===Elliott has performed voice-over narration for various commercials. He has lent his voice to campaigns for Dodge, IBM, Kinney Drugs, Union Pacific, and most notably the American Beef Council, succeeding Robert Mitchum in the latter. Since late 2007 Elliott has done voice-overs for Coors beer, bringing his deep, rich voice and \"western\" appeal to the brand brewed in Colorado. In 2010, Ram Trucks hired Elliott to do the voice-over for their Ram Heavy Duty truck commercial; he has been voicing their commercials since. Starting in 2008, he has voiced Smokey Bear, and shares the mascot's birth date (August 9, 1944). He also narrated the Pittsburgh Steelers and Green Bay Packers team introductions to Super Bowl XLV, played at Cowboys Stadium in Arlington, Texas at the conclusion of the 2010 NFL season for NFL on Fox. On September 9, 2020, it was announced that Elliott would begin recurring on Family Guy as the new mayor of Quahog, the late Mayor Adam West's cousin, Wild Wild West. Also in 2020, he voiced Joe Biden's \"Go From There\" campaign ad."}, {"text": "== Personal life ==Elliott married actress Katharine Ross in 1984, becoming her fifth husband. They have a daughter, Cleo, who is a musician in Malibu, California. Ross and Elliott live on a seaside ranch in Malibu, which they purchased in the 1970s. Elliott also maintains a property in the Willamette Valley in Oregon. Following his mother's death in 2012 at the age of 96, he also took ownership of his childhood home in northeast Portland."}, {"text": "== Filmography and accolades ==Elliott has received a number of awards and nominations for his numerous screen performances. These include a Screen Actors Guild Award, a National Board of Review Award and nominations for an Academy Award, two Primetime Emmy Awards and two Golden Globe Awards."}, {"text": "== Filmography and accolades ==After gaining early recognitions in western films in the late 1960s and continuing into the 1970s and 1980s, Elliott received two Golden Globe Award nominations—for Best Actor in a Miniseries or Television Film and Supporting Actor in a Series, Miniseries or Television Film—for his respective roles in the television film Conagher (1991) and miniseries Buffalo Girls (1995), the latter of which also earned him a nomination for the Primetime Emmy Award for Outstanding Supporting Actor in a Miniseries or Special. His voice-over performance in Robot Chicken (2012–2020) earned him a nomination for the Primetime Emmy Award for Outstanding Voice-Over Performance. Elliott's guest role in Justified (2015) earned him a Critics' Choice Television Award for Best Guest Performer in a Drama Series."}, {"text": "== Filmography and accolades ==As a member of the ensemble cast of Up in the Air (2009), Elliott was nominated for the Critics' Choice Movie Award for Best Acting Ensemble. For starring opposite Lady Gaga and Bradley Cooper in Cooper's 2018 adaptation of A Star Is Born, Elliott won the National Board of Review Award and received nominations for the AACTA International, Academy Award, Critics' Choice and SAG Award for Best Supporting Actor, as well as another nomination for the SAG Award for Outstanding Cast. His role in the Paramount+ miniseries 1883 (2021–2022) won him the SAG Award for Outstanding Actor in a Miniseries or Movie."}, {"text": "== External links ==Sam Elliott at IMDb"}, {"text": "== External links ==Sam Elliott at the TCM Movie Database"}, {"text": "== External links ==Hajek, Daniel (September 6, 2015). \"Typecast as a Cowboy, Sam Elliott Came to Embrace That 'Western Box'\". My Big Break (story series). All Things Considered. NPR. Retrieved September 7, 2015."}]