[{"text": "Samuel Leroy Jackson (born December 21, 1948) is an American actor. One of the most widely recognized actors of his generation, the films in which he has appeared have collectively grossed over $27 billion worldwide, making him the highest-grossing actor of all time. In 2022, he received the Academy Honorary Award as \"a cultural icon whose dynamic work has resonated across genres and generations and audiences worldwide\".Jackson made his professional theatre debut in Mother Courage and Her Children in 1980 at The Public Theatre. From 1981 to 1983 he originated the role of Private Louis Henderson in A Soldier's Play off-Broadway. He also originated the role of Boy Willie in August Wilson's The Piano Lesson in 1987 at the Yale Repertory Theatre. He portrayed Martin Luther King Jr. in the Broadway play The Mountaintop (2011). He returned to Broadway in the 2022 revival of The Piano Lesson playing Doaker Charles, for which he received a Tony Award for Best Featured Actor in a Play nomination.Jackson's early film roles include Coming to America (1988), Juice (1992), True Romance (1993), Menace II Society (1993), and Fresh (1994). His collaborations with Spike Lee led to greater prominence with films such as School Daze (1988), Do the Right Thing (1989), Mo' Better Blues (1990), Jungle Fever (1991), Oldboy (2013), and Chi-Raq (2015). Jackson's breakout performance was as Jules Winnfield\tin Quentin Tarantino's crime drama Pulp Fiction (1994) which earned him a BAFTA Award win and a nomination for the Academy Award for Best Supporting Actor. He further collaborated with Tarantino, acting in Jackie Brown (1997), Kill Bill: Volume 2 (2004), Django Unchained (2012), and The Hateful Eight (2015)."}, {"text": "He also gained widespread recognition as the Jedi Mace Windu in the Star Wars prequel trilogy (1999–2005), and Nick Fury in 11 Marvel Cinematic Universe films, beginning with Iron Man (2008), as well as guest-starring in the ABC series Agents of S.H.I.E.L.D.. Jackson has provided his voice for Lucius Best / Frozone in the Pixar films The Incredibles (2004) and Incredibles 2 (2018). He has also acted in a number of big-budget films, including Die Hard with a Vengeance (1995), A Time to Kill (1996), Unbreakable (2000), Shaft (2000) and its reboot (2019), XXX (2002), Coach Carter (2005), Snakes on a Plane (2006), Kingsman: The Secret Service (2014), Kong: Skull Island (2017), and Glass (2019)."}, {"text": "== Early life ==Samuel Leroy Jackson was born in Washington, D.C., on December 21, 1948, the only child of Elizabeth Harriett (née Montgomery) and Roy Henry Jackson. He grew up in Chattanooga, Tennessee. His father lived away from the family in Kansas City, Missouri, and later died of alcoholism. Jackson met him only twice during his life. He was raised by his mother, a factory worker and later a supplies buyer for a mental institution; he was also raised by his maternal grandparents, Edgar and Pearl Montgomery, as well as extended family. According to DNA tests, Jackson partially descends from the Benga people of Gabon, and he became a naturalized citizen of Gabon in 2019. He attended several segregated schools and graduated from Riverside High School in Chattanooga. He played the French horn, piccolo, trumpet, and flute in the school orchestra. He developed a stutter during childhood and learned to \"pretend to be other people who didn't stutter\". He still uses the word \"motherfucker\" to get through a speech block. He still has days where he stutters. Initially intent on pursuing a degree in marine biology, he attended Morehouse College in Atlanta, Georgia. After joining a local acting group to earn extra points in a class, he found an interest in acting and switched his major. Before graduating in 1972, he co-founded the Just Us Theatre.After Martin Luther King Jr.'s assassination in 1968, Jackson attended King's funeral in Atlanta as one of the ushers. He then travelled to Memphis, Tennessee, to join an equal rights protest march. In a 2005 Parade interview, he said, \"I was angry about the assassination, but I wasn't shocked by it. I knew that change was going to take something different—not sit-ins, not peaceful coexistence.\" In 1969, Jackson and several other students held members of the Morehouse College board of trustees (including Martin Luther King Sr.) hostage on the campus, demanding reform in the school's curriculum and governance. The college eventually agreed to change its policy, but Jackson was charged with and eventually convicted of unlawful confinement, a second-degree felony. He was suspended for two years for his criminal record and his actions. He would later return to the college to earn a BA in drama in 1972. While he was suspended, he took a job as a social worker in Los Angeles. He decided to return to Atlanta, where he met with Stokely Carmichael, H. Rap Brown, and others active in the Black Power movement. He began to feel empowered with his involvement in the movement, especially when the group began buying guns. However, before he could become involved with any significant armed confrontations, his mother sent him to Los Angeles after the FBI warned her that he would die within a year if he remained with the group. In a 2018 interview with Vogue, he denied having been a member of the Black Panther Party."}, {"text": "=== 1972–1987: Early roles and theatre work ===Jackson initially majored in marine biology at Morehouse College before switching to architecture. He later settled on drama after taking a public speaking class and appearing in a version of The Threepenny Opera. Jackson began acting on the stage, including Home and A Soldier's Play, which was the inspiration for the 1984 film A Soldier's Story. He appeared in several television films, and made his feature film debut in the blaxploitation independent film Together for Days (1972). After these initial roles, Jackson moved from Atlanta to New York City in 1976, and spent the next decade appearing in stage plays, including the premieres of The Piano Lesson and Two Trains Running at the Yale Repertory Theater. To supplement his income while auditioning, he worked at the Manhattan Plaza apartment complex as an overnight security guard.  Jackson developed addictions to alcohol and cocaine, which prevented him from proceeding with the two plays to Broadway (actors Charles S. Dutton and Anthony Chisholm took his place)."}, {"text": "=== 1988–1993: Rise to prominence ===After a 1981 performance in the play A Soldier's Play, Jackson was introduced to director Spike Lee, who cast him for small roles in School Daze (1988) and Do the Right Thing (1989). He also worked for three years as a stand-in for Bill Cosby on The Cosby Show. Throughout his early film career, mainly in minimal roles in films such as Coming to America (1988) and various television films, Jackson was mentored by Morgan Freeman.Jackson played a minor role in the 1990 Martin Scorsese film Goodfellas, as real-life Mafia associate Stacks Edwards. Having overdosed on heroin several times, he switched to cocaine. His family entered him into a New York rehabilitation clinic. After he completed rehabilitation, he appeared in Jungle Fever as a crack cocaine addict. Jackson said that the role was cathartic, commenting, \"It was a funny kind of thing. By the time I was out of rehab, about a week or so later I was on set and we were ready to start shooting.\" His performance was so acclaimed that the jury of 1991 Cannes Film Festival added a special \"Supporting Actor\" award just for him. Following this role, Jackson became involved with the comedy Strictly Business and dramas Juice and Patriot Games. He then moved on to two other comedies: National Lampoon's Loaded Weapon 1 (his first starring role) and Amos & Andrew. Jackson worked with the director Steven Spielberg in 1993's Jurassic Park."}, {"text": "=== 1994–1998: Career breakthrough ===After a turn as the criminal Big Don in 1993's True Romance—written by Quentin Tarantino and directed by Tony Scott—Tarantino asked Jackson to play Jules Winnfield in Pulp Fiction (1994). Jackson was surprised to learn that the part had been specifically written for him: \"To know that somebody had written something like Jules for me. I was overwhelmed, thankful, arrogant—this whole combination of things that you could be, knowing that somebody's going to give you an opportunity like that.\" Pulp Fiction, Jackson's thirtieth film, made him internationally recognized and he received praise from critics. Entertainment Weekly wrote: \"As superb as Travolta, Willis, and Keitel are, the actor who reigns over Pulp Fiction is Samuel L. Jackson. He just about lights fires with his gremlin eyes and he transforms his speeches into hypnotic bebop soliloquies.\" For the Academy Awards, Miramax Films pushed for, and received, the Best Supporting Actor nomination for Jackson. He also received a Golden Globe nomination and won the BAFTA Award for Best Supporting Role.After Pulp Fiction, Jackson received multiple scripts to review: \"I could easily have made a career out of playing Jules over the years. Everybody's always sending me the script they think is the new Pulp Fiction.\" With a succession of poor-performing films such as Kiss of Death, The Great White Hype, and Losing Isaiah, Jackson began to receive poor reviews from critics who had praised his performance in Pulp Fiction. This ended with his involvement in two box-office successes: Die Hard with a Vengeance, in which he starred alongside Bruce Willis in the third installment of the Die Hard series; and A Time to Kill, where he played a father put on trial for killing two men who raped his daughter. For A Time to Kill, Jackson earned an NAACP Image for Best Supporting Actor in a Motion Picture and a Golden Globe nomination for a Best Supporting Actor.Quickly becoming a box office star, Jackson continued with three starring roles in 1997. In 187 he played a dedicated teacher striving to leave an impact on his students. He received an Independent Spirit award for Best First Feature alongside first-time writer/director Kasi Lemmons in the drama Eve's Bayou, for which he also served as executive producer. He worked again with Tarantino on Jackie Brown and received the Silver Bear for Best Actor at the Berlin Film Festival and a fourth Golden Globe nomination for his portrayal of the arms merchant Ordell Robbie. In 1998, he worked with established actors: Sharon Stone and Dustin Hoffman in Sphere; and Kevin Spacey in The Negotiator, playing a hostage negotiator who resorts to taking hostages himself when he is falsely accused of murder and embezzlement. In 1999, Jackson starred in the horror film Deep Blue Sea, and as Jedi Master Mace Windu in George Lucas' Star Wars: Episode I – The Phantom Menace. In an interview, Jackson claimed that he did not have a chance to read the script for the film and did not learn he was playing the character Mace Windu until he was fitted for his costume (though he later said that he was eager to accept any role, just for the chance to be a part of the Star Wars saga)."}, {"text": "=== 1999–2007: Established actor ===On June 13, 2000, Jackson was honored with a star on the Hollywood Walk of Fame at 7018 Hollywood Blvd. He began the next decade of his film career playing a Marine colonel put on trial in Rules of Engagement, co-starred with Bruce Willis for a third time in the supernatural thriller Unbreakable, and starred in the 2000 remake of the 1971 film Shaft. He reprised both of the latter roles in 2019, his Unbreakable character Mr. Glass in Glass and Shaft in another film titled Shaft. Jackson's sole film in 2001 was The Caveman's Valentine, a murder thriller directed by Lemmons in which he played a homeless musician. In 2002, he played a recovering alcoholic, attempting to keep custody of his kids while fighting a battle of wits (in Changing Lanes) with Ben Affleck's character. He returned for Star Wars: Episode II – Attack of the Clones, seeing his minor supporting role develop into a major character. Mace Windu's purple lightsaber in the film was the result of Jackson's suggestion; he wanted to be sure that his character would stand out in a crowded battle scene. Jackson then acted as an NSA agent, alongside Vin Diesel in XXX, and as a kilt-wearing drug dealer in The 51st State. In 2003, Jackson again worked with John Travolta in Basic and then as a police sergeant alongside Colin Farrell in the television show remake SWAT A song within the soundtrack was named after him, entitled Sammy L. Jackson by Hot Action Cop. Jackson also appeared in HBO's documentary Unchained Memories, as a narrator along many other stars like Angela Bassett and Whoopi Goldberg."}, {"text": "=== 1999–2007: Established actor ===Based on reviews gathered by Rotten Tomatoes, in 2004 Jackson starred in both his lowest and highest ranked films in his career. In the thriller Twisted, Jackson played a mentor to Ashley Judd. The film garnered a 2% approval rating on the website, with reviewers calling his performance \"lackluster\" and \"wasted\". He then lent his voice to the computer-animated film The Incredibles as the superhero Frozone. The film received a 97% approval rating, and Jackson's performance earned him an Annie Award nomination for Best Voice Acting. He made a cameo in another Quentin Tarantino film, Kill Bill: Volume 2.In 2005, he starred in the sports drama Coach Carter, where he played a coach (based on the actual coach Ken Carter) dedicated to teaching his players that education is more important than basketball. Although the film received mixed reviews, Jackson's performance was praised despite the film's storyline. Bob Townsend of the Atlanta Journal-Constitution commended Jackson's performance, \"He takes what could have been a cardboard cliché role and puts flesh on it with his flamboyant intelligence.\" Jackson also returned for two sequels: XXX: State of the Union, this time commanding Ice Cube, and the final Star Wars prequel film, Star Wars: Episode III – Revenge of the Sith. His last film for 2005 was The Man alongside comedian Eugene Levy. On November 4, 2005, he was presented with the Hawaii International Film Festival Achievement in Acting Award.On January 30, 2006, Jackson was honored with a hand and footprint ceremony at Grauman's Chinese Theatre; he is the seventh African American and 191st actor to be recognized in this manner. In an interview that year, he said that he chooses roles that are \"exciting to watch\" and have an \"interesting character inside of a story\", and that in his roles he wanted to \"do things [he hasn't] done, things [he] saw as a kid and wanted to do and now [has] an opportunity to do\". He next starred opposite actress Julianne Moore in the box office bomb Freedomland, where he depicted a police detective attempting to help a mother find her abducted child while quelling a citywide race riot. Jackson's second film of the year, Snakes on a Plane, gained cult film status months before it was released based on its title and cast. Jackson's decision to star in the film was solely based on the title. To build anticipation for the film, he also cameoed in the 2006 music video \"Snakes on a Plane (Bring It)\" by Cobra Starship. On December 2, 2006, Jackson won the German Bambi Award for International Film, based on his many film contributions. In December 2006, Jackson starred in Home of the Brave, as a doctor returning home from the Iraq War."}, {"text": "=== 1999–2007: Established actor ===On January 30, 2007, Jackson was featured as narrator in Bob Saget's direct-to-DVD Farce of the Penguins. The film was a spoof of the box office success March of the Penguins (which was narrated by Morgan Freeman). Also in 2007, he portrayed a blues player who imprisons a young woman (Christina Ricci) addicted to sex in Black Snake Moan, and the horror film 1408, an adaptation of the Stephen King short story. Later the same year, Jackson portrayed an athlete who impersonates former boxing heavyweight Bob Satterfield in director Rod Lurie's drama, Resurrecting the Champ. In 2008, Jackson reprised his role of Mace Windu in the CGI film, Star Wars: The Clone Wars, followed by Lakeview Terrace where he played a racist cop who terrorizes an interracial couple. In November of the same year, he starred along with Bernie Mac and Isaac Hayes (who both died before the film's release) in Soul Men."}, {"text": "=== 2008–2019: Career expansion ===In 2008, he portrayed the villain in The Spirit, which was poorly received by critics and the box office. In 2009, he again worked with Quentin Tarantino when he narrated several scenes in the World War II film Inglourious Basterds.In 2010, he starred in the drama Mother and Child and portrayed an interrogator who attempts to locate several nuclear weapons in the direct-to-video film Unthinkable. Alongside Dwayne Johnson, Jackson again portrayed a police officer in the opening scenes of the comedy The Other Guys. He also co-starred with Tommy Lee Jones for a film adaptation of The Sunset Limited."}, {"text": "=== 2008–2019: Career expansion ===Throughout Jackson's career, he has appeared in many films alongside mainstream rappers. These include Tupac Shakur (Juice), Queen Latifah (Juice/Sphere/Jungle Fever), Method Man (One Eight Seven), LL Cool J (Deep Blue Sea/S.W.A.T.), Busta Rhymes (Shaft), Eve (xXx), Ice Cube (xXx: State of the Union), Xzibit (xXx: State of the Union), David Banner (Black Snake Moan), and 50 Cent (Home of the Brave). Additionally, Jackson has appeared in five films with actor Bruce Willis (National Lampoon's Loaded Weapon 1, Pulp Fiction, Die Hard with a Vengeance, Unbreakable, and Glass) and the actors were slated to work together in Black Water Transit before both dropped out."}, {"text": "=== 2008–2019: Career expansion ===In 2002, Jackson gave his consent for Marvel Comics to design their \"Ultimate\" version of the character Nick Fury after his likeness. In the 2008 film Iron Man, he made a cameo as the character in a post-credit scene. In February 2009, Jackson signed on to a nine-picture deal with Marvel Studios which would see him appear as the character in Iron Man 2, Thor, Captain America: The First Avenger, and The Avengers, as well as any other subsequent film they would produce. He reprised the role in Captain America: The Winter Soldier (2014) and Avengers: Age of Ultron (2015). In February 2015, Jackson stated that he only has two movies left on his Marvel contract following Age of Ultron. In 2018 and 2019, Jackson made cameo appearances as Fury in the Avengers sequels Infinity War and Endgame, and starred as a younger, de-aged Fury in Captain Marvel alongside Brie Larson."}, {"text": "=== 2008–2019: Career expansion ===Among his more recent film roles, Jackson appeared in Quentin Tarantino's Django Unchained, which was released December 25, 2012, Tarantino's The Hateful Eight, which was released in 70mm on December 25, 2015, and Jordan Vogt-Roberts' Kong: Skull Island, which was released on March 10, 2017. In 2019, Jackson reprised his Unbreakable role as Mr. Glass in the film Glass, and his Shaft role in Shaft, both sequels to his 2000 films. Also in 2019, he appeared in the Brie Larson film Unicorn Store, and had a prominent role as Fury in the Marvel film Spider-Man: Far From Home. Additionally, he reprised his role as Fury in a cameo appearance on the ABC television series Agents of S.H.I.E.L.D. in 2013 and the season finale in 2014."}, {"text": "=== 2020–present: Return to theatre ===In 2020, he appeared in the television documentary series Enslaved, with investigative journalist Afua Hirsch as co-presenter. He also appeared in the 2021 movie Spiral: From the Book of Saw alongside Chris Rock. After an 11-year absence from the stage Jackson returned to Broadway as Doaker Charles in a revival of August Wilson's The Piano Lesson opposite John David Washington and Danielle Brooks. The 2022 production was directed by Jackson's wife LaTanya Richardson Jackson. For his performance he received a Tony Award for Best Featured Actor in a Play nomination.He reprised his role as Nick Fury in the Disney+ series Secret Invasion, and in The Marvels, the sequel to Captain Marvel. The following year Jackson had a minor role in the Matthew Vaughn directed spy comedy Argylle (2024)."}, {"text": "==== Upcoming projects ====He is set to produce a live-action film adaptation of Afro Samurai, and will play the role of Sho'nuff in a remake of The Last Dragon. Jackson also completed his work on the upcoming film Damaged.  He is also set to appear opposite Pierce Brosnan in Unholy Trinity.He will commence filming Last Meals in late November 2023."}, {"text": "== Other appearances ==He's known for his extensive voice roles including Whiplash in Turbo (2013), the title character of the anime series Afro Samurai (2007), and Frank Tenpenny in the video game Grand Theft Auto: San Andreas (2004). He also narrated the acclaimed documentary I Am Not Your Negro (2016)."}, {"text": "== Other appearances ==In addition to films, Jackson also appeared in several television shows, a video game, music videos, as well as audiobooks. Jackson had a small part in the Public Enemy music video for \"911 Is a Joke\". Jackson voiced several television show characters, including the lead role in the anime series, Afro Samurai, in addition to a recurring part as the voice of Gin Rummy in several episodes of the animated series The Boondocks. He was in the Pilot for Ghostwriter. He guest-starred as himself in an episode of the BBC/HBO sitcom Extras. He voiced the main antagonist, Officer Frank Tenpenny, in the video game Grand Theft Auto: San Andreas. Jackson also hosted a variety of awards shows. He has hosted the MTV Movie Awards (1998), the ESPYs (1999, 2001, 2002, and 2009), and the Spike TV Video Game Awards (2005, 2006, 2007, and 2012). In November 2006, he provided the voice of God for The Bible Experience, the New Testament audiobook version of the Bible. He was given the lead role because producers believed his deep, authoritative voice would best fit the role. He also recorded the Audible.com audiobook of Go the Fuck to Sleep. For the Atlanta Falcons' 2010 season, Jackson portrayed Rev. Sultan in the Falcons \"Rise Up\" commercial."}, {"text": "== Other appearances ==He also appeared in the Capital One cash-back credit card commercials. Jackson too appeared in a Sky Broadband Shield commercial, Sky UK's broadband service as Nick Fury to promote Captain America: The Winter Soldier. He also played Nick Fury in an ad for the video game Marvel Snap. Jackson released a song about social justice with KRS-One, Sticky Fingaz, Mad Lion & Talib Kweli about violence in America called \"I Can't Breathe\" which were the last words said by Eric Garner."}, {"text": "== Box-office performance ==Throughout the 1990s, A.C. Neilson E.C.I., a box office–tracking company, determined that Jackson appeared in more films than any other actor who grossed $1.7 billion domestically. By 2011, the films that featured Jackson as a leading actor or supporting co-star had grossed a total of $2.81 to $4.91 billion at the North American box office. This placed him as the seventh-highest-grossing lead actor and the second-highest-grossing actor, behind only voice actor Frank Welker. The 2009 edition of The Guinness World Records, which uses a different calculation to determine film grosses, stated that Jackson is the world's highest-grossing actor, with $7.42 billion generated across 68 films. Subsequently, as of 2022, according to data crunched by the Golden Globes, this total has ballooned out to more than $27 billion grossed across 152 movies, locking him in as the highest-grossing actor, and second-highest grossing person in film in general behind Stan Lee, who was primarily known for his cameo work."}, {"text": "== Audiobooks ==2011: Adam Mansbach: Go the Fuck to Sleep, publisher: BRILLIANCE CORP, ISBN 978-1-4558-4165-3"}, {"text": "== Audiobooks ==2014: Chester Himes: A Rage in Harlem, publisher: BRILLIANCE CORP, ISBN 978-1-4915-1908-0"}, {"text": "== Personal life ==In 1980, Jackson married actress and producer LaTanya Richardson, whom he met while attending Morehouse College. The couple have a daughter named Zoe (born 1982). In 2009, they started their own charity to help support education. Jackson has said that he watches his own films in cinemas: \"Even during my theater years, I wished I could watch the plays I was in—while I was in them! I dig watching myself work.\" He also enjoys collecting the action figures of the characters he portrays in his films, including Jules Winnfield, Shaft, Mace Windu, and Frozone.Jackson is bald but enjoys wearing wigs in his films. He said about his decision to shave his head, \"I keep ending up on those 'bald is beautiful' lists. It's cool. You know, when I started losing my hair, it was during the era when everybody had lots of hair. All of a sudden, I felt this big hole in the middle of my afro. I couldn't face having a comb over so I had to quickly figure what the haircut for me was.\" His first bald role was in The Great White Hype. He usually gets to pick his own hairstyles for each character he portrays. He poked fun at his baldness the first time he appeared bald on The Tonight Show, explaining that he had to shave his head for one role, but then kept receiving more and more bald roles and had to keep shaving his head so that wigs could be made for him. He joked that \"the only way [he's] gonna have time to grow [his] hair back is if [he's] not working\". He is noted for often wearing a Kangol hat in public.Jackson has a clause in his contracts that allows him to play golf during film shoots. He has played in the Gary Player Invitational charity golf tournament to assist Gary Player in raising funds for children in South Africa. He is a keen basketball fan, supporting the Toronto Raptors and the Harlem Globetrotters. He has supported English football team Liverpool FC since appearing in The 51st State, which was shot in Liverpool, and also supports Irish football team Bohemian FC."}, {"text": "== Personal life ==Jackson campaigned during the 2008 Democratic Primary for Barack Obama in Texarkana, Texas. He said, \"Barack Obama represents everything I was told I could be growing up. I am a child of segregation. When I grew up and people told me I could be president, I knew it was a lie. But now we have a representative... the American Dream is a reality. Anyone can grow up to be a president.\" He also said, \"I voted for Barack because he was black. That's why other folks vote for other people—because they look like them.\" In December 2012, he compared his Django Unchained character, a villainous house slave who sides with his white oppressors, to black conservative Justice Clarence Thomas and said that the character had \"the same moral compass as Clarence Thomas does\". Following the Supreme Court's decision to overturn Roe v. Wade in June 2022, he again criticized Thomas, referring to him as \"Uncle Clarence\" and asking how Thomas—who is married to white attorney Ginni Thomas—feels about overturning Loving v. Virginia, a Supreme Court ruling which allowed interracial marriages.In June 2013, Jackson launched a joint campaign with Prizeo in an effort to raise money to fight Alzheimer's disease. As part of the campaign, he recited various fan-written monologues and a popular scene from the AMC series Breaking Bad. In August 2013, he started following a vegan diet for health reasons, explaining that he is \"just trying to live forever\". He attributed his 40 lb (18 kg) weight loss to the diet. He had largely abandoned the diet by March 2017, but still praised and recommended it. He launched a campaign called \"One for the Boys\", which teaches men about testicular cancer and urges them to \"get themselves checked out\".He was granted Gabonese citizenship in 2019 after the results of a DNA test claimed to link him to the country's Benga ethnic group. In 2020, during the COVID-19 pandemic, Jackson encouraged people to wear face masks as part of California's \"Your Actions Save Lives\" campaign. Along with Dwayne Johnson, he also encouraged those who had recovered from COVID-19 to donate their blood to help others fighting the virus. He additionally appeared on Jimmy Kimmel Live! to read a satirical book, Stay the Fuck at Home, which spread awareness of social distancing."}, {"text": "== Awards and honors ==Over his career, Jackson has received various awards for his performances on film. At the 44th Cannes Film Festival he received the Cannes Film Festival Award for Best Actor for his performance in Spike Lee's Jungle Fever (1991). He received the BAFTA Award for Best Actor in a Supporting Role and the Independent Spirit Award for Best Male Lead for his performance in Quentin Tarantino's Pulp Fiction (1994). He also received Academy Award, Golden Globe Award, and Screen Actors Guild Award nominations for the performance as well. At the 48th Berlin International Film Festival, he received Silver Bear for Best Actor for his leading performance in Tarantino's Jackie Brown (1997). In 2021, the Academy of Motion Picture Arts and Sciences named Jackson as one of its Academy Honorary Award recipients as \"A cultural icon whose dynamic work has resonated across genres and generations and audiences worldwide.\" At the 12th Annual Governors Awards, friend and actor Denzel Washington presented Jackson with his Oscar."}, {"text": "== Further reading ==Dils, Tracey E. (1999). Samuel L. Jackson. Black Americans of Achievement. Philadelphia: Chelsea House Publications. ISBN 0-7910-5282-6. OCLC 41885637."}, {"text": "== Further reading ==Hudson, Jeff (2004). Samuel L. Jackson: The Unauthorised Biography. London: Virgin Books. ISBN 1-85227-024-1. OCLC 224038091."}, {"text": "== Further reading ==Jordan, Pat (April 26, 2012). \"How Samuel L. Jackson Became His Own Genre\". The New York Times."}, {"text": "== External links ==Samuel L. Jackson at IMDb "}, {"text": "== External links ==Samuel L. Jackson at the Internet Broadway Database "}, {"text": "== External links ==Samuel L. Jackson at the Internet Off-Broadway Database "}, {"text": "== External links ==Samuel L. Jackson at AllMovie "}, {"text": "== External links ==Samuel L. Jackson at the TCM Movie Database "}, {"text": "== External links ==Samuel L. Jackson at Rotten Tomatoes "}, {"text": "== External links ==Samuel L. Jackson collected news and commentary at The New York Times"}, {"text": "== External links ==Samuel L. Jackson collected news and commentary at The Guardian "}, {"text": "== External links ==Extensive biography of Samuel L. Jackson"}]