[{"text": "Selena Marie Gomez ( sə-LEE-nə GOH-mez; born July 22, 1992) is an American singer, songwriter, actress, producer, and businesswoman. She began her career as a child actress, starring on the children's television series Barney & Friends (2002–2004). Gomez rose to prominence and emerged as a teen idol, for her leading role as Alex Russo on the Disney Channel sitcom Wizards of Waverly Place (2007–2012). As a recording artist, she signed with Hollywood Records in 2008 and formed the pop rock band Selena Gomez & the Scene, for which she served as lead vocalist. With three studio albums and seven singles, each of the band's releases have received gold certifications or higher by the Recording Industry Association of America (RIAA)."}, {"text": "Further pursuing a career as a soloist, Gomez found continued success with her solo studio albums, as each have debuted atop the U.S. Billboard 200. Her EDM-inspired debut, Stars Dance (2013) yielded the international top-ten single \"Come & Get It\". Desiring more artistic control, Gomez signed with Interscope Records to release the electropop set Revival (2015), supported by the top-ten singles \"Good for You\", \"Same Old Love\", and \"Hands to Myself\". Its follow-up, Rare (2020), topped the charts in 11 countries, and was led by the single \"Lose You to Love Me\", which marked Gomez's first number-one song on both the U.S. Billboard Hot 100 and the Canadian Hot 100. She forayed into Spanish-language music with the extended play Revelación (2021), which earned her first Grammy and Latin Grammy Award nominations. Gomez has also released various collaborative singles, including \"We Don't Talk Anymore\", \"It Ain't Me\", \"Wolves\", \"Taki Taki\", and \"Calm Down (Remix)\"; the latter became the most commercially successful Afrobeats song of all time and became the best-selling collaboration of 2023 globally."}, {"text": "Gomez has starred in numerous films, including voicing Mavis in the Hotel Transylvania film franchise (2012–2022). On television, she produced the teen drama series 13 Reasons Why (2017–2020), the documentary Living Undocumented (2019), her cooking show Selena + Chef (2020–present), and the mystery comedy series Only Murders in the Building (2021–present), in which she plays a lead acting role. Gomez has received numerous accolades, including an American Music Award, a Billboard Music Award, two MTV Video Music Awards, and 16 Guinness World Records; and received nominations for four Emmy Awards, two Grammy Awards, and two Golden Globe Awards."}, {"text": "Outside of music and acting, Gomez has worked with various charitable organizations, and advocates for mental health, and gender, racial, and LGBT equality; she has been a UNICEF goodwill ambassador since 2009. She launched the cosmetics company Rare Beauty in 2020, which was valued at $2 billion in 2024, and founded the Rare Impact Fund, a non-profit committed to raising $100 million this decade for mental health awareness. Gomez has been featured in listicles such as the Time 100 (2020) and Forbes 30 Under 30 (2016 and 2020), and was named the Billboard Woman of the Year in 2017. Billboard ranked her as one of the most successful artists of the 2010s decade. With over 430 million followers, she is the most-followed woman on Instagram, as of 2024."}, {"text": "== Early life ==Selena Marie Gomez was born on July 22, 1992, in Grand Prairie, Texas, to Ricardo Joel Gomez and Texas-born former stage actress Mandy Teefey. She was named after Tejano singer Selena Quintanilla, who died in 1995. Her father is of Mexican descent, while her mother, who was adopted, has Italian ancestry. Gomez's paternal grandparents emigrated to Texas from Monterrey in the 1970s. Of her heritage, Gomez has said she is \"a proud third-generation American-Mexican\" and \"My family does have quinceañeras, and we go to the communion church. We do everything that's Catholic, but we don't really have anything traditional except go to the park and have barbecues on Sundays after church.\" Gomez's Spanish fluency waned after age seven, when she began working in television. Her parents divorced when she was five years old, and she remained with her mother. Gomez has two younger half-sisters and a younger stepbrother: Gracie Elliot Teefey, through Mandy and her second husband, Brian Teefey, and Victoria \"Tori\" and Marcus Gomez, through Ricardo and his second wife, Sara. She earned her high-school diploma through homeschooling in May 2010.Gomez was born when her mother was 16 years old. The family had financial troubles throughout Gomez's childhood, her mother struggling to provide for the pair. At one point, Gomez recalls that they had to search for quarters just to get gas for their car. Her mother later recalled that the two would frequently walk to their local dollar store to buy spaghetti for dinner. Gomez has said, \"I was frustrated that my parents weren't together, and never saw the light at the end of the tunnel where my mom was working hard to provide a better life for me. I'm terrified of what I would have become if I'd stayed [in Texas].\" She later added that her mother \"was really strong around me. Having me at 16 had to have been a big responsibility. She gave up everything for me, had three jobs, supported me, sacrificed her life for me.\" Gomez had a close relationship with her grandparents as a child and appeared in various pageants. Her grandparents often took care of her while her parents finished their schooling, and she has said they \"raised her\" until she found success in show business."}, {"text": "=== 2002–2006: Career beginnings ===Gomez first gained an interest in pursuing a career in entertainment watching her mother prepare for stage productions. In 2002, she began her acting career on the children's television series Barney & Friends, portraying the character Gianna. The show was her first acting gig. Gomez recalled of the experience, \"I was very shy when I was little [...] I didn't know what 'camera right' was. I didn't know what blocking was. I learned everything from Barney.\" Gomez appeared in thirteen episodes of the show between 2002 and 2004; the show's producers released her as she was \"too old\" for the series. While working on Barney & Friends, Gomez had bit part roles in the film Spy Kids 3-D: Game Over (2003) and the made-for-television film Walker, Texas Ranger: Trial by Fire (2005). She guest starred in a 2006 episode of the Disney Channel series The Suite Life of Zack & Cody."}, {"text": "=== 2007–2012: Breakthrough with Disney and Selena Gomez & the Scene ===Gomez was given a recurring role on the Disney Channel series Hannah Montana in 2007 as pop star Mikayla. During this time, Gomez filmed pilot episodes for two potential Disney Channel series; the first was a Suite Life spin-off titled Arwin!, and the second was a Lizzie McGuire spin-off titled What's Stevie Thinking?. She later auditioned for a role in the network's series Wizards of Waverly Place, ultimately winning the lead role of Alex Russo. Gomez and her mother subsequently moved to Los Angeles. Wizards of Waverly Place saw Gomez playing a teenage girl in a family of wizards who own a restaurant in New York City. It quickly became a success for the Disney Channel and represented Gomez's breakthrough into the mainstream. The role brought Gomez \"teen idol\" status. And she also became one of the ten highest-paid children's TV stars of all time, earning from US$25,000-30,000 per episode. The series received numerous awards and nominations, and won the Outstanding Children's Program at the 61st Primetime Emmy Awards. It garnered positive reviews, with Gomez's being particularly praised for her comic timing and sarcastic delivery.In 2008, while working on the second season of her series, Gomez voiced Helga along with Jim Carrey, Steve Carell and others in the animated film Horton Hears a Who!. The film became a commercial and critical success, grossing over US$300 million worldwide. In September of the same year, the teen musical comedy film Another Cinderella Story was released, where Gomez played the main role of an aspiring dancer Mary Santiago, the film became the second installment of the A Cinderella Story series, released on direct-to-video. Gomez recorded three songs for the soundtrack album, including the single \"Tell Me Something I Don't Know\"-which became Gomez's first entry on the U.S. Billboard Hot 100, and the premiere of the music video was on MTV's Total Request Live. This role earned Gomez a Young Artist Award. She also recorded the original song \"Fly to Your Heart\" for the soundtrack album of the animated film Tinker Bell (2008). In 2008, at age 16, Gomez signed with Hollywood Records, and formed her own production company, July Moon Production. She partnered with XYZ Films for the project, allowing Gomez to option articles, hire writers and create talent packages to shop to studios. Gomez was slated to release two films under the company. The first, titled What Boys Want, would feature Gomez as a girl who could hear the thoughts of men. She later announced a film adaptation of the novel Thirteen Reasons Why, in which she was to play a young girl who commits suicide; ultimately, neither film was made, but later, Gomez will produce a television adaptation of this novel.Gomez continued to enjoy mainstream success throughout the following year, appearing as Alex Russo in a crossover episode of the Disney Channel series The Suite Life on Deck in 2009. She also guest starred as herself on the Disney Channel series Sonny with a Chance. Gomez, along with Demi Lovato, starred in the Disney Channel film Princess Protection Program, which aired in June 2009. The film had a total of 8.5 million viewers during its premiere. For the film's soundtrack, the pair recorded the song \"One and the Same\", which charted at number eighty-second in the U.S. She next starred in Wizards of Waverly Place: The Movie, a television film based on the series. The film premiered in August to an audience of 11.4 million viewers, becoming cable's number-one scripted telecast of the year and was the second-most watched TV movie on cable, behind High School Musical 2. Roxana Hadadi of The Washington Post credited all three performers—Gomez, David Henrie and Jake T. Austin—for their \"acting skills that carry the film\". The film won the series its second consecutive Emmy for Outstanding Children's Program at the 62nd Primetime Emmy Awards. Gomez recorded three songs on the television series and film's soundtrack, including the single \"Magic\", which reached number sixty-one in the U.S. She then voiced Princess Selenia in the English-language French animated/live-action film Arthur and the Revenge of Maltazard (2009)."}, {"text": "=== 2007–2012: Breakthrough with Disney and Selena Gomez & the Scene ===Hoping to cross over into the music industry, Gomez formed the pop rock band Selena Gomez & the Scene through her record deal with Hollywood Records. The name of the band is an \"ironic jab\" at the people who called Gomez a \"wannabe scene\". The band's debut studio album, Kiss & Tell, influenced by pop rock and electronic rock was released in September 2009. The album received mixed reviews from critics, BBC News described the album as \"[...] fast and full of energy [...]\", and Mikael Wood from Billboard wrote: \"[...] her music could use more of her in it\". Kiss & Tell debuted at number nine on the U.S. Billboard 200, with first-week sales of 66,000 album-equivalent units, and spent a non-consecutive 59 weeks there. Although its lead single was not commercially and critically successful, the second single, \"Naturally\", became a breakthrough and the first highly successful single in Gomez's career, reaching number twenty-nine in the U.S., and top-ten in many European countries, including number seven in the U.K.. In a 2021 Grammy interview, Gomez credited the LGBT community for kickstarting her music career and supporting her before anyone else, stating \"I remember when it was released, it truly started getting played in gay bars before anywhere else\", and expressed her gratitude for the community. \"I hope they hear in my music the importance of self-love and the strength that comes through vulnerability\"-Gomez said, adding that she has always truly loved and supported gays since childhood. All studio albums and singles of the band were certified gold or higher by the RIAA. In July 2010, Gomez starred alongside Joey King in Ramona and Beezus, a film adaptation of the children's novel series by Beverly Cleary, in which she portrayed Beezus Quimby. The film was well received by critics; Roger Ebert described it as \"a sweet salute\", and found both actresses \"appealing\". Gomez later reprised the voice role of Princess Selenia in Arthur 3: The War of the Two Worlds (2010). The band's second studio album, A Year Without Rain, inspired by dance-pop and synth-pop, was released in September 2010. Basically, the album was not poorly appreciated by critics, many of whom called it the effort was an improvement over 2009's Kiss & Tell. The album debuted at number four on the U.S., with first-week sales of over 66,000 album-equivalent units, and also debuted at number six in Canada. Both of the record's singles, \"Round & Round\" and \"A Year Without Rain\", achieved moderate success. The band was awarded Favorite Breakout Artist at the 37th People's Choice Awards.Selena Gomez & the Scene released their third and final, as well as most successful studio album, When the Sun Goes Down, in June 2011. The album received mixed reviews from critics, who praised the album's production and described it as \"[...] is a very professional affair\", the album also was co-written by Britney Spears and Katy Perry. It debuted at number four on the U.S. with first-week sales of 78,000 album-equivalent units, reaching number three the following week, as well as reaching number two in Canada and Spain. Its lead single, \"Who Says\", was the band's highest charting effort, peaking at number twenty-one in the U.S. Its second single, \"Love You like a Love Song\", although it did not reach great heights in the charts, reaching only number twenty-two in the U.S. and spending 38 consecutive weeks there, as well as reaching the top-ten in Canada, and topping the chart in Russia, but became a worldwide hit and one of the most successful, best-selling and popular songs in Gomez's career. Alex Frank from Pitchfork called the song \"a cult karaoke classic\". In 2022, Billboard ranked the song as the biggest song that peaked at number twenty-two of all time. For two years in a row (2010–2011), Billboard magazine ranked Gomez third in their list of 21 Under 21: Music's Hottest Minors, an annual ranking of the most popular musicians under the age of 21.Gomez starred in the comedy film Monte Carlo (2011), with Leighton Meester and Katie Cassidy; she played the lead role of Grace, a teenager \"mistaken for a socialite\", Cordelia (also Gomez), \"while on a trip to Paris\". In preparation for the role, she learned to play polo and received dialect coaching to speak in two different British accents; Gomez's accent was described as \"unconvincing\". The film received mixed reviews from critic. Nick Schager from Slant Magazine found Gomez \"cute, but too bland to lend the proceedings any vivid character, except for the few scenes that allow her to indulge her cold, sarcastic, nasty side as Cordelia\". That year, Gomez appeared in a cameo role in the film The Muppets. Gomez hosted in June the MuchMusic Video Awards in Toronto, Canada, and in November the MTV Europe Music Awards in Belfast, Northern Ireland."}, {"text": "=== 2012–2014: Stars Dance and films ===Gomez confirmed in January 2012 that she would be taking a break from music, placing Selena Gomez & the Scene on hiatus. That year, Wizards of Waverly Place officially ended its run on the Disney Channel after four seasons. For five years in a row (2009-2013), Gomez won the Kids' Choice Award for Favorite TV Actress. She currently holds the record for the most Kids' Choice Awards wins (12) for an individual. In 2012, Gomez starred in the controversial comedy-crime film from director Harmony Korine Spring Breakers together with James Franco, Vanessa Hudgens, Ashley Benson and Rachel Korine. The film premiered at the 69th Venice International Film Festival, and was released the following year. The story followed four college-aged girls who decide to rob a fast food restaurant in order to pay for their spring break. It saw Gomez playing a more mature character than she did previously and reportedly led to her having a \"bit of a meltdown on set\". Spring Breakers received positive reviews from critics, some called it a potential cult classic. The film entered many prestigious ratings, including the BBC's 100 Greatest Films of the 21st Century and Rolling Stone's The 50 Best Movies of the 2010s and many others. Many critics and tabloids were shocked to see the \"teen idol\" Miss Gomez in such a provocative film, in particular Manohla Dargis from The New York Times wrote: it is not surprising that Miss Gomez quit Disney. \"In \"Spring Breakers\" [she] have the chance to simulate the behavior that feeds the tabloids without the humiliations and career-crushing price paid [...]\".In February 2012, Gomez received the voice role of Mavis Dracula in the animated film Hotel Transylvania. In September of the same year, the film premiered at the 37th annual Toronto International Film Festival, and was released in theaters the same month. The film received mixed reviews from critics, some calling it \"buoyant\" and some \"[...] a little too loud and thinly-scripted for older audiences\". Hotel Transylvania was commercially successful, grossing US$358 million worldwide. In 2013, Gomez starred alongside Ethan Hawke in the action thriller film Getaway, in which she played a young hacker. The film was a critical and commercial failure. This role earned her the first and only nomination for the Worst Actress at the 34th Golden Raspberry Awards. Christopher Orr of The Atlantic described her as \"a kid trying desperately to act like a grownup, but with no real idea what that might entail\". In 2013, she was executive producer and star in a special The Wizards Return: Alex vs. Alex on the Disney Channel."}, {"text": "=== 2012–2014: Stars Dance and films ===Despite earlier claims that she would be taking a break from music, Gomez announced in March 2013 the release of her solo debut album. In April 2013, Gomez released \"Come & Get It\" as the lead single for her upcoming album. This song became Gomez's first top-ten entry on the U.S. Billboard Hot 100, reaching number six, and also reached the top-ten on the charts in Canada and the U.K. The album's second single, \"Slow Down\", peaked at number twenty-seven in the U.S. Gomez released her debut solo studio album, Stars Dance, in July 2013. The style of the record was rooted musically on EDM and electropop. It received mixed reviews from music critics. Writing for Los Angeles Times, August Brown found that the album was \"the kind of album one makes in 2013 if you want to keep the pop sugar of the Disney tween cabal but mix in some broken glass and a club bathroom nosebleed. Its productions are rooted in today's pop-EDM default mode [...]\". Andrew Hampp of Billboard wrote: \"[...] is a collection of 11 shinily produced pop songs that find Gomez trying on a series of different personalities with her slight-yet-capable vocals [...]\". Stars Dance became her first album to debut at number one on the U.S. Billboard 200, with first-week sales of 97,000 album-equivalent units. At that time, Gomez, who turned 21, became the youngest solo artist to take first place since Speak Now from Taylor Swift in 2010. The album also reached number one in Canada. Gomez incorporated choreographed dance routines into the album's music videos and her promotional live performances, having been inspired by artists such as Janet Jackson and Britney Spears. The music video of \"Come & Get It\" won the Best Pop Video at the 2013 MTV Video Music Awards.In August 2013, Gomez embarked on her first solo worldwide concert tour, Stars Dance Tour, to further promote Stars Dance, with shows in North America, Europe, Australia and Asia. In December 2013, Gomez canceled the Australian and Asian legs of the tour, claiming that she would be taking a hiatus to spend time with her family. In January 2014, it was reported that Gomez had spent two weeks at Dawn at The Meadows, which is a treatment center in Wickenburg, Arizona, that specializes in treating addiction and trauma in young people. Her representative stated that she had spent time there \"voluntarily [...] but not for substance abuse\". Gomez confirmed in 2015 that she had been diagnosed with lupus and that after canceling the tour she entered rehab to undergo chemotherapy. Gomez played Nina Pennington, an innocent straight-A student, in Behaving Badly (2014). The project, filmed prior to Gomez's stint in rehab, was released in August to a generally negative critical and commercial reception. However, critics deemed Gomez's performance superior to the film. Gomez also had a supporting role in the drama Rudderless (2014), the directorial debut of William H. Macy. The independent film premiered at the 2014 Sundance Film Festival, and received a mixed reception from critics. At the 2014 Teen Choice Awards, Gomez was honored with the Ultimate Choice Award for her \"contributions to the entertainment world\". Currently, with 18 wins, she is the fourth-most awarded solo artist at the Teen Choice Awards. Seventeen also named her \"the most powerful girl under 21\" in 2014.In April 2014, Gomez had fired her mother and stepfather as her managers, who had served in those roles since her career at Disney. Gomez later signed with two new talent agencies, WMA and Brillstein, to manage her career. The Hollywood Reporter informed: \"Selena's desire to find fresh handlers is part of a strategy to \"move on into more adult-oriented fare in film and music\"\", and finally get rid of the image of the \"Disney's Teen Idol\". The news about Gomez's new management fueled rumors that her contract with Hollywood Records was coming to an end. In November 2014, Gomez surprise-released her new single \"The Heart Wants What It Wants\", and confirmed after months of speculation that she would be releasing a compilation album to complete her contract with her label. The single became her second top-ten hit in the U.S., and reached the top-ten in Canada. In the same month, Gomez released her first solo compilation album of her greatest hits, For You, which also includes three brand new songs. The album debuted at number twenty-four on the U.S. Billboard 200, earning 35,506 album-equivalent units in its first week. Gomez officially parted ways with Hollywood Records and later signed with Interscope Records in December 2014."}, {"text": "=== 2015–2016: Revival ===While working on her second studio album, Gomez collaborated with German DJ Zedd on \"I Want You to Know\", released in February 2015, and debuted at number-seventeen in the U.S. In May, she appeared in Taylor Swift's music video for \"Bad Blood\". Gomez released \"Good for You\" featuring rapper ASAP Rocky as the lead single from her second studio album, in June. The song debuted at number-one on the Digital Songs chart with first-week sales of 179,000 copies—the best sales week in Gomez's career for a single. It was the chart's first number-one debut since Swift's \"Blank Space\" (2014). \"Good for You\" became Gomez's first top-five single on the Billboard Hot 100, and her first single to top the Mainstream Top 40 chart. It also reached the top-ten on charts in Australia and Canada. Gomez later reprised the voice role of Mavis in Hotel Transylvania 2 (2015); the film was met with a positive critical reception and commercial success upon release, grossing US$474 million worldwide. She was awarded Favorite Animated Movie Voice at the 42nd People's Choice Awards."}, {"text": "=== 2015–2016: Revival ===Gomez released her second studio album, Revival, in October 2015. It is primarily a dance-pop and electropop record with R&B vibes. The album was reviewed positively by critics, who praised its production and lyrical content. Writing for Rolling Stone, Brittany Spanos stated that \"Revival is an audacious name for a 23-year-old singer's second album, but from start to finish, Gomez earns it,\" noting that \"[t]his is the sound of a newly empowered pop artist growing into her strengths like never before.\" Kristen S.Hé of Billboard called it \"one of the most influential pop albums of the late 2010s.\" The album debuted at number-one on the U.S. Billboard 200 with first-week sales of 117,000 album units, and was certified platinum by the RIAA. It remains Gomez's highest first-week sales to date. \"Same Old Love\" was released as the album's second single and topped the Mainstream Top 40 chart. It also peaked at number-five in the U.S., tying with \"Good for You\" as Gomez's highest-charting single at the time, and reached the top-ten in Canada. \"Hands to Myself\" served as the album's third single and became her third consecutive number-one on the Mainstream Top 40, making Gomez one of only six female artists to have three singles from the same album top the chart. The single also peaked within the top-ten in the U.S., and the top-five in Canada. For her performance on Billboard's music charts, Gomez received the Chart-Topper Award at the 2015 Billboard Women in Music event.Gomez was a key advisor during the ninth season of the reality singing competition The Voice. She made a cameo appearance in Adam McKay's film The Big Short (2015). She then starred as Dot, a young runaway hitchhiker, in the comedy-drama The Fundamentals of Caring with Paul Rudd, which premiered at the 2016 Sundance Film Festival in January, and was released on Netflix five months later. The film received a positive critical response; Tristram Fane Saunders of The Daily Telegraph described Gomez's performance as \"impressive\" and \"mature\". Gomez performed as the musical guest on an episode of the NBC late-night sketch comedy Saturday Night Live in January 2016. \"Kill Em with Kindness\" was released as the Revival's fourth and final single four months later. Gomez played the president of a sorority in the comedy Neighbors 2: Sorority Rising (2016); the film grossed US$108 million worldwide, and received mixed to positive reviews.Gomez embarked on her worldwide Revival Tour in May 2016. She claimed that the tour would focus solely on her as an artist and would feature less choreography and fewer effects than her previous tour. Gomez began working on her third studio album while touring and added a new song titled \"Feel Me\" to the setlist of her Revival Tour. The song was later released in February 2020, due to high demand from fans. After touring in North America, Asia and Oceania, she canceled the European and South America legs in August 2016 due to anxiety, panic attacks and depression caused by her lupus. "}, {"text": "=== 2015–2016: Revival ===Gomez featured on Charlie Puth's single, \"We Don't Talk Anymore\". The song was an international success, and reached the top-ten in the U.S., Australia, France, Spain, and topped the charts in Italy; and was certified 5× platinum by the RIAA. The music video became the most-viewed music video published in 2016 on YouTube, with over 3 billion views. Gomez had a supporting role in In Dubious Battle (2016) starring and directed by James Franco. The film had its world premiere at the 73rd Venice International Film Festival, and was met with underwhelming reviews. She also guest starred in the Comedy Central variety sketch series Inside Amy Schumer. Gomez and Canadian singer Tory Lanez were featured on Norwegian DJ Cashmere Cat's single, \"Trust Nobody\".Following the cancelation of her tour, Gomez rechecked into rehab to focus on her mental health and was noticeably absent from social media. At that time, she was the most followed person on Instagram, and became the first person to reach 100 million followers on it. In February 2023, she regained her status as the most-followed woman on the platform, and became the first woman to reach 400 million followers on it the following month. From 2015 to 2016, Gomez broke 9 Guinness World Records, and she had the most-liked Instagram image of all time at that time. After being absent from the public eye for four months, Gomez triumphantly returned to the media making her highly anticipated return since entering rehab at the 2016 American Music Awards, where she owned all the attention and became the most-talked about and hight-profile person of the evening. Where she was nominated for Favorite Pop/Rock Female Artist and Artist of the Year, the first of which she won. And her spirited speech became one of the most-powerful awards show speeches in recent history. At the 2016 iHeartRadio Music Awards, Gomez won Biggest Triple Threat, and at the 2016 Billboard Music Awards, she was nominated for two awards including Top Female Artist. In the same year, she was named to Forbes' 30 Under 30 list in the music category, and again in 2020 in its \"All-Star Alumni\" category. Billboard named Gomez one of the Top 50 Money Markers of 2016, an annual ranking of the most profitable musicians of the year, having earned US$8.8 million only from her music career in 2016."}, {"text": "=== 2017–2019: Standalone releases and 13 Reasons Why ===Gomez and the Norwegian DJ Kygo released a single together, \"It Ain't Me\", in February 2017. The collaboration reached top ten of most major music charts worldwide, including the U.S. and the U.K., and attained top five peaks in Australia, Canada, Germany and many European countries. The song received nominations at major awards around the world, including Top Dance/Electronic Song at the 2018 Billboard Music Awards, and it also her best-selling song in the UK, selling over 1.4 million chart units.Gomez served as executive producer for the series adaptation of the novel Thirteen Reasons Why. The show premiered on Netflix in March 2017. The series drew backlash from various mental health charities and suicide prevention communities over \"dangerous content\", with some people feeling the show glamorized suicide. Gomez addressed the controversy, saying that \"We stayed very true to the book and that's initially what [author] Jay Asher created was a beautifully tragic, complicated yet suspenseful story and I think that's what we wanted to do. We wanted to do it justice and, yeah, [the backlash is] gonna come no matter what. It's not an easy subject to talk about, but I'm very fortunate with how it's doing. Despite the controversy, the first season was a critical success. However, the other three seasons received generally negative reviews. 13 Reasons Why was the most tweeted about show of 2017, and the most-watched original streaming series of 2018. In 2022, its second season ranks as the ninth most watched English-language television series on Netflix, with 496.1 million hours viewed within 28 days of release. The series ended after four seasons in June 2020. Gomez recorded a cover version of the song \"Only You\" for the series' first season soundtrack.In May 2017, Gomez released the single \"Bad Liar\", alongside a vertical music video which was available for streaming only through Spotify; it was the first-ever music video to premiere on Spotify. The song received universal acclaim from music critics, with some deeming it Gomez's best song to date; Billboard ranked it as the best song of 2017. Rolling Stone ranked \"Bad Liar\" at number 39 on its 2019 list of best songs of the 2010s. Winston Cook-Wilson of Spin magazine found Gomez's vocals pristine and the track \"charmingly weird\", calling its lyrics and sample usage \"harebrained but ultimately brilliant\". He appreciated \"Bad Liar\" for eschewing contemporary radio trends, concluding that it \"mostly just sounds like itself, and there's no higher compliment to pay it. Gomez released the single \"Fetish\" featuring rapper Gucci Mane two month later. In October 2017, Gomez and EDM producer Marshmello released the single \"Wolves\". The song was a commercial success, and reached the top ten on charts in Australia, Canada, the U.K, and several European countries, peaking at number twenty in the U.S. Later that year, Gomez was named Billboard's Woman of the Year, in recognition of her influence and commercial success."}, {"text": "=== 2017–2019: Standalone releases and 13 Reasons Why ===In May 2018, Gomez released the single \"Back to You\", from the 13 Reasons Why Season 2 Soundtrack. It reached the top-ten in a variety of charts in European countries, top-five in Australia and Canada, and reached top-twenty in the U.S. and the U.K. Gomez voiced Mavis again in Hotel Transylvania 3: Summer Vacation, which was released in July. The film was a commercial success, and received mixed to positive reviews. With box office earnings of US$528 million worldwide, it becoming Sony Pictures Animation's highest-grossing film worldwide to be completely animated and second-highest overall. (Spider-Man: Across the Spider-Verse in 2023 surpassed this record). Gomez featured on DJ Snake's song \"Taki Taki\" alongside Ozuna and Cardi B, released in September. The single achieved global success, reaching the top-ten in Canada, France, Germany, Italy, topped the charts in Spain and several Latin American countries, and peaked at number eleven in the U.S. The song has received numerous awards and nominations including, nominations for the two Billboard Music Awards and, but ultimately won Song of the Year at the 2019 Latin American Music Awards. From 2011 to 2018, Gomez had a streak of 16 consecutive top 40 hits on the Billboard Hot 100, which is the longest active run of any artist according to Billboard. In November 2018, Gomez surpassed Drake and became Spotify's most-streamed artist with 46 million monthly listeners while not releasing new album since 2015 (Ariana Grande later surpassed this record). Gomez also featured on Julia Michaels's single \"Anxiety\", released in January 2019, and the following month, her collaboration titled \"I Can't Get Enough\" with Benny Blanco, Tainy and J Balvin, was released.Gomez appeared in Jim Jarmusch's comedy horror The Dead Don't Die (2019). The film had its world premiere at the 2019 Cannes Film Festival, where it generated mixed reviews. That year, she starred in Woody Allen's romantic comedy A Rainy Day in New York, with Timothée Chalamet and Elle Fanning. Due to a resurgence of the 1992 sexual abuse allegation against Allen prompted by the MeToo movement, Gomez made a donation of over $1 million, exceeding her salary from the film, to the Time's Up initiative. The film received mixed reviews from critics, but Gomez's performance was praised; Variety's Jessica Kiang wrote: \"Gomez comes out the best of the younger cast, husking her way through some of the films better lines.\" Gomez served as an executive producer for the Netflix docuseries Living Undocumented, released in October 2019, "}, {"text": "=== 2017–2019: Standalone releases and 13 Reasons Why ===which follows eight undocumented families in America. The docuseries was a critical success. According to an op-ed written by Gomez for Time on October 1, 2019, Gomez said she was approached about the project in 2017 and decided to become involved after watching footage that captured \"the shame, uncertainty, and fear I saw my own family struggle with. But it also captured the hope, optimism, and patriotism so many undocumented immigrants still hold in their hearts despite the hell they go through.\""}, {"text": "=== 2020–2023: Rare, Revelación and television projects ===In October 2019, Gomez released \"Lose You to Love Me\" as the lead single from her third studio album. The next day, she surprise-released the album's second single, \"Look at Her Now\". \"Lose You to Love Me\" became her first number-one song in the U.S. and Canada, and reached the top five of various national charts worldwide, including Australia and the U.K. Rare was released in January 2020, and debuted atop in the U.S., earning 112,000 album-equivalent units in its first week. It became her third consecutive number-one album in the U.S., and topped the charts in Australia, Canada, and several other territories, peaking at number two in the UK. The album received positive reviews from music critics, who praised its production and cohesiveness, with many calling it Gomez's best album to date; Jem Aswad of Variety labeled Rare \"one of the best pop albums to be released in recent memory\" and described it as \"sophisticated, precisely written and expertly produced music\". Other singles released from the album include \"Rare\" and \"Boyfriend\".In January 2020, Gomez voiced a giraffe in the adventure film Dolittle, directed by Stephen Gaghan. The film, starring Robert Downey Jr., was a box office disappointment, and received negative reviews from critics, who called it \"too long [and] lifeless.\" Gomez hosted and executive produced the HBO Max cooking show Selena + Chef, which features Gomez joined by a different chef each episode; this was initially implemented remotely due to the COVID-19 pandemic. Each episode highlights a food-related charity. The show premiered in August 2020, and was well received by critics. It ran for four seasons till September 2022, and was nominated for Outstanding Culinary Series at the 50th Daytime Emmy Awards. Gomez won a Critics' Choice Real TV Award for her work on the program. In May 2023, it was announced that Food Network had ordered two projects to be hosted by Gomez. The first—Selena + Chef: Home for the Holidays, a four-part holiday special off the heels of Selena + Chef; is also produced by Gomez, and premiered on November 30, and concluded on December 21, 2023. An interactive cooking series will premiere in 2024. In June, Gomez featured in a remix of Trevor Daniel's song, \"Past Life\". She executive produced two films that year; the romantic comedy The Broken Hearts Gallery, released in September 2020, to positive reviews, and the teen comedy-drama This Is the Year. In August, Gomez collaborated with South Korean girl group Blackpink for \"Ice Cream\". The song peaked at number thirteen in the U.S., and achieved the third-highest 24-hour debut for a music video on YouTube at the time, with over 79 million views. That year, Gomez was honored by The Latin Recording Academy as one of the Leading Ladies of Entertainment. She was also named by Time as one of the 100 most influential people in the world.Gomez released her first Spanish-language project, an EP titled Revelación, in March 2021. The record blends reggaeton, Latin pop, R&B genres with urbano elements, marking a departure from the dance-pop sound of its predecessor, Rare. It debuted at number twenty-two in the U.S., shifting 23,000 equivalent album units in its first week of release, marking the largest sales week for a Latin album by a woman since Shakira's El Dorado in 2017. It also debuted atop the Billboard Top Latin Albums chart, becoming the first album by a woman to do so, also since 2017's El Dorado. Revelación debuted with over 8.57 million streams on Spotify in its first 24 hours, becoming the biggest debut of a female EP on the platform. The EP received universal acclaim and became Gomez's best-reviewed project, with a weighted mean score of 83, on Metacritic, a website collecting reviews from professional music critics; it was nominated for Best Latin Pop Album at the 64th Annual Grammy Awards. It also received Latin Pop Album of the Year nominations from the Billboard Latin Music, Latin American Music and Lo Nuestro award ceremonies. Gomez's expansion of her artistry was praised; AllMusic's Matt Collar found her remaining \"artistically fearless\". Entertainment Weekly's Marcus Jones called her \"a far more versatile musician than she's been given credit for\". It spawned three singles: \"De Una Vez\", \"Baila Conmigo\" with Rauw Alejandro, and \"Selfish Love\" with DJ Snake. With this EP and the single \"Baila Conmigo\", she became the first female act to top the US Latin Albums and Latin Airplay charts simultaneously in over a decade. The music video for \"De Una Vez\" was nominated for Best Short Form Music Video at the 22nd Annual Latin Grammy Awards. Gomez performed at the 2021 UEFA Champions League final opening ceremony in May. She later collaborated with Colombian singer Camilo in a song titled \"999\".Gomez starred in and executive produced the Hulu mystery-comedy series Only Murders in the Building alongside Steve Martin and Martin Short, which premiered on Hulu in August 2021, and set the record for the most-watched comedy premiere in Hulu history. The program was renewed for a fourth season in October 2023. Ahead of the official premiere of the series, Gomez revealed that she was happy to have played a character that matched her current actual age, saying that she \"signed [her] life away\" to The Walt Disney Company at the start of her career and that she \"did not know what she was doing.\" The series has received critical acclaim, and numerous accolades. The performances and chemistry among the main trio were praised by critics; Richard Roeper of the Chicago Sun-Times wrote: \"Gomez is a true co-star in the series and does a superb job of meshing with Martin and Short to form one of the more entertaining albeit unlikely friendship trios in recent memory.\" Gomez won the Satellite Award for Best Actress – Television Series Musical or Comedy, while she was nominated for a Critics' Choice Television Award, and twice for a Golden Globe Award and a Screen Actors Guild Award. She won two times the People's Choice Award for Comedy TV Star of the Year. At the 74th Primetime Emmy Awards, she was nominated as producer for Outstanding Comedy Series, marking only the third time a Latina has ever been among the producing nominees for comedy series in the awards' history. Several journalists expressed disappointment over her failure to receive an Emmy nomination for Outstanding Lead Actress in a Comedy Series. Her co-stars, Steve Martin and Martin Short, released a statement saying, \"We're a little dismayed that Selena didn't get nominated because she's so crucial to the trio, to the show. She kind of balances us.\" She was again nominated for this award the following ceremony.Gomez reprised the voice role of Mavis, and also served as an executive producer, for the fourth and final installment in the Hotel Transylvania franchise, Hotel Transylvania: Transformania (2022). In response to the rising cases of the SARS-CoV-2 Delta variant in the United States, Sony Pictures cancelled the film's theatrical plans. The film was released on Amazon Prime Video in January to mixed reviews. Gomez was nominated as executive producer for a Children's and Family Emmy Award. She collaborated with British band Coldplay on \"Let Somebody Go\", released as a single in February. For her work as a featured artist on Coldplay's ninth studio album, Music of the Spheres, she was nominated for Album of the Year at the 65th Annual Grammy Awards. In May, Gomez hosted an episode of the NBC late-night sketch comedy Saturday Night Live. She later made a cameo appearance on the show in December. In July, Gomez executive produced the ViX+ docuseries Mi Vecino, El Cartel. In August, she was featured on the remix of Nigerian artist Rema's song, \"Calm Down\". An international success, it peaked at number three on the Billboard Global 200. The single became Gomez's ninth top-ten in the U.S., peaking at number three; and her second number-one in Canada, spending nine weeks atop the Canadian Hot 100. It topped Global Excl. U.S. and Radio Songs for 2 and 10 weeks, respectively, becoming Gomez's first leader on both charts. \"Calm Down\" became the longest-running number-one of all time on the Billboard U.S. Afrobeats Songs chart, with 58 weeks at the summit. The remix reached number one on the Billboard U.S. Pop Airplay. Billboard called it \"Afrobeats' biggest crossover hit\". At the 2023 MTV Video Music Awards, the song was nominated for Song of the Year, and won Best Afrobeats; while it won Top Afrobeats Song at the 2023 Billboard Music Awards. It is the most-streamed Afrobeats song on Spotify (over 1 billion plays) and the most-viewed music video of an Afrobeats song (over 700 million views) on YouTube, as of 2023. According to the International Federation of the Phonographic Industry (IFPI), \"Calm Down\" was the second best-selling song of 2023 globally.Gomez was the focus of the Alek Keshishian-directed \"raw and intimate\" documentary film, Selena Gomez: My Mind & Me. The film premiered at the AFI Fest in November 2022, and was released two days after on Apple TV+ and in select movie theaters. It was met with a positive critical reception upon release; the documentary was praised for mental health transparency. Chris Azzopardi from The New York Times described it as an \"honest portrait study of stardom and mental illness\". The film was nominated for Outstanding Writing for a Nonfiction Programming at the Primetime Creative Arts Emmy Awards, and received the Seal of Female Empowerment in Entertainment honor by the Critics Choice Association, and also won the MTV Movie & TV Award for Best Music Documentary. Gomez released the song \"My Mind & Me\" to coincide with the release of the documentary. The song received Variety's \"Film Song of the Year\" honor. \"My Mind & Me\" was shortlisted for the Best Original Song category for the 95th Academy Awards but didn't make the final nominations.In March 2023, Gomez appeared in the second-season finale of the Apple TV+ documentary television series Dear.... She released the standalone single \"Single Soon\" on August 25, 2023. Gomez stated it is a \"fun little song [she] wrote a while back that's perfect for the end of summer\" since she is \"not quite done with\" her upcoming fourth studio album. It debuted in the top-twenty on the Billboard Global 200, in Canada, and in the U.S. On October 1, the singer made a surprise appearance on stage at Coldplay's concert of their Music of the Spheres World Tour at the Rose Bowl in Pasadena to perform \"Let Somebody Go\"."}, {"text": "=== 2024: Upcoming fourth studio album ===Gomez revealed in 2022 that her next album was in the works, and alluded to a potential tour. She said the record would be \"really powerful, strong, very pop\" with themes revolving around \"freedom from relationships [and] the darkness\".In January 2024, the artist stated that she prefers acting over music, and only has \"one more album in [her]\". She revealed that she \"never really intended on being a singer full-time\" but \"that hobby\" evolved into a career when she was working with Disney. In February, Gomez released the standalone single \"Love On\", which debuted at number fifty-six in the U.S., and at number sixty-seven on the Global 200 chart."}, {"text": "==== Upcoming projects ====Gomez will next star opposite Zoe Saldaña in the musical crime comedy Emilia Perez, which she filmed from April to June 2023 in Paris, directed by Jacques Audiard. The film is slated for a 2024 release.In October 2020, it was announced that Gomez is set to produce, and possibly star in, the horror thriller film Dollhouse. In November 2020, Gomez was announced as executive producer and star of the Elgin James-directed biographical film In the Shadow of the Mountain, based on the memoir of Silvia Vasquez-Lavado, the first openly gay woman to complete the Seven Summits. In April 2021, Gomez was also set to star in the psychological thriller Spiral. In March 2022, a project inspired by Sixteen Candles titled 15 Candles entered development for Peacock, with Gomez serving as executive producer. In August 2022, it was announced that Gomez was in talks to produce a reboot of Working Girl on Hulu. In December, Gomez was announced as producer of the music documentary Won't Be Silent. In December 2023, Gomez revealed through Instagram that her upcoming studio album will be released before March 2024. Gomez is set to portray Linda Ronstadt in an upcoming biopic based on her life."}, {"text": "=== Musical style ===Gomez is described as a pop artist. Her work is primarily characterized as dance-pop and EDM; however, she has experimented with different music genres. Her debut album with the Scene was influenced by electronic rock and pop rock, while her subsequent records with the band opted for a dance-pop sound. A Year Without Rain noted synth-pop characteristics, and When the Sun Goes Down featured a more electropop and electro-disco musical direction. Her debut solo album Stars Dance was rooted in the EDM-pop genre—Gomez herself described it as \"baby dubstep\"—drawing elements from electronic, disco, techno, and dancehall. Her songs \"The Heart Wants What It Wants\" and \"Good for You\" have been described as \"minimalistic\" and \"grown-up\", introducing a more adult pop sound into her repertoire."}, {"text": "=== Influences ===Early in her career, Gomez cited Bruno Mars as an influence for \"his style of music, his style in general, the way he performs, the way he carries himself\". Gomez has also cited Christina Aguilera, Britney Spears, Beyoncé, Rihanna, and Taylor Swift as influences. Gomez's debut solo album Stars Dance (2013) was prominently influenced by Spears, Swift, and EDM producer Skrillex; her second album, Revival, was mainly inspired by Aguilera's album Stripped (2002), as well as Janet Jackson and Spears."}, {"text": "== Products and endorsements ==In 2009, Gomez was part of Sears's back-to-school fashion campaign and featured in television commercials. She hosted the \"Sears Arrive Air Band Casting Call\" to select five winners for the first-ever \"Sears Air Band\" to perform at the 2009 MTV Video Music Awards. She also became the spokesperson for Borden Milk and starred in campaign's print ads and television commercials for the brand."}, {"text": "== Products and endorsements ==Having previously announced plans to launch a fashion line, Gomez released the Dream Out Loud collection in 2010. It consisted of bohemian dresses, floral tops, jeans, skirts, jackets, scarves and hats, all of which were made from recycled or eco-friendly materials. Gomez stated, \"With my line, I really want to give the customer options on how they can put their own looks together [...] I want the pieces that can be easy to dress up or down, and the fabrics being eco-friendly and organic is super important [...] Also, the tags will all have some of my inspirational quotes on them. I'm just looking to send a good message.\" Gomez teamed up with designers Tony Melillo and Sandra Campos for the project, both of whom had previously worked with big-name fashion houses. Melillo and Campos teamed with New York-based Adjmi Apparel to manufacture the brand, which was formed by Adjmi CH Brands LLC, the holding company for the brand. From 2010 to 2014, Gomez worked with retailer Kmart to release the clothing line.It was announced on July 14, 2011, that Gomez had signed a license agreement with Adrenalina, an extreme sports and adventure-themed lifestyle brand, to develop, manufacture, and distribute her own fragrance. Chairman and CEO of Adrenalina, Ilia Lekach, said, \"We are incredibly enthused to be working with Ms. Gomez and will reveal more details pertaining to the fragrance as we get closer to the launch date.\" The perfume was released in May 2012. In 2013, she released her second fragrance, Vivamore by Selena Gomez. She also created her own collection of nail polish colors for Nicole by OPI.From 2013 to 2015, Gomez was a spokesperson and partner for Neo by Adidas. In 2015, Gomez signed $3 million endorsement deal with Pantene. In 2016, Gomez appeared in a fashion campaign for luxury brand Louis Vuitton. She also appeared in ads for Coca-Cola's \"Share a Coke\" campaign, and advertisements for the campaign and lyrics from two of her songs were featured on Coca-Cola packaging nationwide. In 2017, Gomez confirmed her collaboration with Coach, beginning with their fall line, thereby becoming the new face of the brand and earning $10 million. The limited-edition collection of handbags was called the \"Selena Grace\" line. Gomez's second collection and \"first ever ready-to-wear collection for Coach\", named Coach X Selena Gomez, included clothing, outerwear, and bags. That year, Gomez signed a $30 million contract with the athletic brand Puma as brand ambassador, appearing in campaigns such as those for the Phenom Lux sneakers released in March. Her collection with Puma, called SG x PUMA Strong Girl collection, launched on December 12 of that year and contained products from sneakers to athleisure attire. Since 2017, Gomez has been one of the top five highest paid people on Instagram, becoming the highest paid person on the platform of 2017. As of July 2023, Gomez earns $1.7 million per sponsored Instagram post.In April 2020, Gomez became an owner and investor of the ice cream brand Serendipity. Gomez announced that the Serendipity brands donated $1 from every ice cream pint and product sold in May to the Rare Impact Fund. In September, she launched her own makeup line, \"Rare Beauty\". The makeup line was named Startup of the Year at the 2020 WWD Beauty Inc Awards. In July 2021, Gomez released a swimwear line with La'Mariette. In November, Gomez co-founded the mental health media platform Wondermind. The following month, she became an investor in the food delivery company Gopuff. In May 2022, Gomez collaborated with Our Place on a cookware line, the Summer Collection. A second edition of the range was released in June 2023."}, {"text": "=== UNICEF ===In October 2008, Gomez participated in St. Jude's Children's Hospital's \"Runway For Life\" benefit in strutting her stuff down the runway in Beverly Hills, where over $1 million was raised for the cause. That same month, Gomez was named UNICEF's spokesperson for the Trick-or-Treat for UNICEF campaign, which encouraged children to raise money on Halloween to help children around the world. In August 2009, Gomez, then 17 years old, became the youngest UNICEF ambassador (Millie Bobby Brown later surpassed this record). In her first official field mission, Gomez traveled to Ghana in September 2009 for one week to witness first-hand the stark conditions of vulnerable children that lack vital necessities such as clean water, nourishment, education and healthcare. Gomez explained in an interview with Associated Press correspondents that she wanted to use her star power to bring awareness to Ghana: \"That's why I feel very honored to have a voice that kids listen to and take into consideration [...] I had people on my tour asking me where IS Ghana, and they Googled it [...] and because I went there, they now know where Ghana is. So it's pretty incredible.\" Gomez said, of her role as ambassador, that \"Every day 25,000 children die from preventable causes. I stand with UNICEF in the belief that we can change that number from 25,000 to zero. I know we can achieve this because every moment, UNICEF is on the ground providing children with the lifesaving assistance needed to ensure zero becomes a reality.\"Gomez was named spokesperson for UNICEF's 2009 Trick-or-Treat campaign for the second year in a row. She raised over $700,000 for the charity in 2008 and stated that she hopes to be able to raise US$1 million in 2009. Gomez participated in a celebrity auction and hosted a live web cast series on Facebook in support of the Trick-or-Treat campaign. She returned as the UNICEF spokesperson for the 60th anniversary of Trick-or-Treat for UNICEF campaign in 2010. In celebration of the organization's 60th anniversary, Gomez and the Scene held a benefit concert, donating all proceeds to the campaign. Gomez also encouraged teenagers to donate via social media. She also auctioned personal items to CharityBuzz.com, designed a Trick-or-Treat for UNICEF t-shirt and participated in a small concert in Los Angeles. With Gomez's help, UNICEF raised $4 million.In February 2011, Gomez traveled to Chile to meet with the families of the UNICEF-supported \"Programa Puente\", which helped families better understand and develop skills to deal with early childhood education, development, and other issues related to raising children. Gomez remarked that \"UNICEF is helping Chilean families get out of poverty, prevent violence within the home and promote education. To witness first hand these families' struggles, and also their hope and perseverance, was truly inspiring\". In March, Gomez participated in the UNICEF Tap Project's \"Celebrity Tap Pack\" which featured limited-edition, custom-made water bottles with tap water from the homes of each celebrity advocate to raise funds and increase profile for the clean water and sanitation programs. All the funds raised (the campaign raised $900,000) made it possible to provide clean, safe drinking water to children in Vietnam, Togo, Mauritania, and Cameroon- countries where it's desperately needed. She was also featured in videos that promoted the campaign. In April 2012, she advocated for the global \"Sound the Alarm\" campaign on Facebook and Twitter, and recorded a public announcement encouraging young people to donate $10 via text message to prevent the death of a million children from malnutrition in the Sahel Region of West and Central Africa.Gomez has conducted and organized three charity concerts (2010-2013) to help UNICEF provide children around the world with life-saving therapeutic foods, medicines, clean water, education, and immunization. In total, Gomez's three charity concerts for UNICEF have raised nearly $400,000 for UNICEF programs worldwide. In 2014, Gomez visited Nepal to raise awareness for children in need. A UNICEF ambassador since 2009, Gomez has played an active role in advocating for the world's \"most vulnerable children\" by participating in several campaigns, events, and initiatives on behalf of the organization. In June 2021, Gomez signed a UNICEF open letter urging the G7 \"to donate more coronavirus vaccines to the international COVAX initiative.\""}, {"text": "=== Other charity work ===Gomez was involved in the UR Votes Count campaign, which encouraged teenagers to learn more about 2008 presidential candidates Barack Obama and John McCain. The following year, Gomez became the ambassador of DoSomething after being involved with the charity Island Dog, which helped dogs in Puerto Rico. Gomez updated fans on her blog at MySpace: \"We are spending the day feeding puppies, washing them and hanging out with them. After we spend the day with them we are sending these dogs to different places in the U.S the no-kill dog shelters so they can find a home [...].\" She joined while filming Wizards of Waverly Place: The Movie in Puerto Rico. In 2009, Gomez has been involved with the charity RAISE Hope For Congo, an initiative of the Enough Project, raising funds for war-torn African country, in order to raise awareness of conflict minerals and sexual crimes and violence committed against women and girls in the Congo, as well as to eliminate sexual violence, torture and other atrocities through the 4P method; Peace, Protection, Punishment and Prevention.From 2009 to 2012, Gomez was involved in \"Disney's Friends for Change\", an organization which promoted \"environmentally-friendly behavior\", and appeared in its public service announcements. Gomez, Demi Lovato, Miley Cyrus, and the Jonas Brothers recorded the charity single \"Send It On\" as the ad hoc musical team \"Disney's Friends For Change\", all of whose proceeds were donated into the Disney Worldwide Conservation Fund. The song debuted on the Billboard Hot 100 at number 20.  Billboard included this song in their list of The 100 Greatest Disneyverse Songs of All Time (2023). In April 2012, Gomez was named ambassador to the Ryan Seacrest Foundation. The year before, Gomez made an appearance at The Children's Hospital of Philadelphia during a Ryan Seacrest Foundation broadcast from the hospital's multimedia center. She was also a spokesperson for State Farm Insurance and appeared in numerous television commercials, which aired on the Disney Channel, to raise awareness of being a safe driver. Gomez provided the narration for Girl Rising (2013), a CNN documentary film, which focused on the power of female education as it followed seven girls around the world who sought to overcome obstacles and follow their dreams.In 2017, during her partnership with the Coach brand, Gomez participated in their charity work Step Up, an organization that supports girls in under-resourced communities to pursue an education. Gomez attended Step Up events at two Los Angeles high schools. She talked to the girls about many things, including their goals, and gifted them with new Coach bags. Gomez posted photos from this event on her social medias with the caption: “@instagram is celebrating world kindness day and I got to spend it with people who fully will change our world one day. @coach introduced me to @stepupwomensnetwork which is an after-school organization that encourages girls to believe that they have the capability to do anything they set their mind to. It’s crazy to me how much they are willing put others before themselves.” Gomez attended the We Day California youth empowerment event in Los Angeles in 2018 and 2019. During the 2018 event, Gomez introduced Nellie Mainor, a young fan who had a rare kidney disease. Her participation in We Day 2019 was her first appearance after an extended break from the spotlight. Gomez continued her partnership with WE Charity when she traveled to Kenya in December 2019 to meet the local community and visit schools built by the organization.During the 2019–20 Australian bushfire season, Gomez donated US$3 million to fight Australia wildfires and urged followers to do the same. In 2020, she created the Rare Impact Fund by Rare Beauty to help \"young people gain access to mental health resources\", and is committed to raise US$100 million over the next ten years. To achieve that goal, one percent of all sales of her brand of Rare Beauty products (yes, that's gross, not net) will go toward the fund. In its first year, the Rare Impact Fund distributed $1.2 million in grants to support 8 organizations that work to expand mental health services in educational settings. For each episode of her HBO Max cooking show Selena + Chef, the show donates $10,000 to the charity of the Chef's choice, often food related. In 2021, over two seasons of the show, $360,000 was raised for nonprofit organizations. In October 2022, Gomez co-founded the Wondermind, a mental health-focused digital platform. In December 2022, Gomez donated exclusive items to the 2nd Annual ASCAP Foundation, which supports music education and talent development programs across the U.S.Gomez donated 10 percent of the net proceeds from her cookware line with Our Place to the Rare Impact Fund, which focuses on mental health awareness. In honor of World Mental Health Day, Sephora donated all proceeds of the October 10, 2023 sales of Rare Beauty products to the Rare Impact Fund. In response to the 2023 Israel–Hamas war, Gomez and her cosmetics brand Rare Beauty issued a statement about the humanitarian crisis in Gaza, and donated funds to Magen David Adom in Israel and Palestinian Red Crescent Society in Gaza and the West Bank, and also donated to UNICEF to help get urgent medical relief and resources to the children of Gaza. Both Gomez and Rare Beauty were heavily criticized for their misleading statement which implied solidarity with the people of Gaza, whilst they donated funds to Magen David Adom, which is an auxiliary service to the Israel Defense Forces who are implicated in war crimes against the people of Gaza. Gomez signed an Artist4Ceasefire letter in October 2023 calling on President Joe Biden and Congress to call for an immediate cease-fire in Gaza. The letter says: \"We believe that all life is sacred, regardless of faith or ethnicity, and we condemn the killing of Palestinian and Israeli civilians. In December 2023, Gomez attended Ramy Youssef's fundraiser for Gaza."}, {"text": "== Impact and advocacy ==Gomez has been referred to as \"Pop Princess\" by several media outlets, and various journalists regard her as a \"triple threat\", owing to her successful singing, performing, and acting careers. The Guardian credits her with popularizing \"whisper pop\", a style of pop music characterized by soft, hushed and breathy vocals. Rolling Stone India regards her as one of the most influential pop culture icons of her time. In 2017, Time honored her as one of the \"women who are changing the world\" on its First Women Leaders list. In 2020, Gomez received the Art Award from Hispanic Heritage Foundation for her impact on global culture via her music, filmography and advocacy. In 2022, People named Gomez as one of 15 women who are \"changing the music industry today\". Variety considers her a key personality in global media, owing to her \"multi-hyphenate\" presence incorporating music, films, television, cosmetics, and social activism. Gomez was also included in The Hollywood Reporter's Power 100 list as one of the most powerful women in entertainment.Gomez advocates for various causes. She is known for frequently raising awareness on mental health. In 2019, she received the McLean Award for mental health advocacy. The Stanford Healthcare Innovation Lab honored her with the first ever Mental Health Innovations Award for Excellence in Mental Health Advocacy in 2022. That year, she also received the Morton E. Ruderman Award in Inclusion by the Ruderman Family Foundation. Gomez has shown support for the LGBT community. She joined numerous celebrities to write a \"love letter\" during pride month, as a part of Billboard's 30 Days of Pride during the month of June 2016. She also collaborated with 23 other artists for the charity single \"Hands\", a tribute for the victims of the Pulse nightclub shooting, to raise funds for Equality Florida's Pulse Victims Fund, GLAAD, and the GLBT Community Center of Central Florida. That year, she donated proceeds of her Revival Tour concert in North Carolina to fight the state's recent legislation known as the \"bathroom law;\" The law, repealed in 2017, required people to use public restrooms in line with their birth gender unless they had fully transitioned. In 2023, Gomez and her cosmetics brand Rare Beauty, participated in the 53rd annual Los Angeles Pride Parade, as well as her Rare Impact Fund has been donating funds since the foundation for The Trevor Project and in 2023 for Trans Lifeline who focus on LGBTQ+ youth.In 2014, Gomez spoke out about the 2014 Israeli-Palestinian Gaza War, posting a message on her social media in which she asked for help and prays for Gaza, the message read: “It’s About Humanity. Pray for Gaza.”, “Please pray for those families and babies today. Please always remember what’s important in life. It’s not any of this. We are here to help, inspire and love. Be that change. #wearethenextgeneration,” Gomez wrote in the caption. A few hours later, she added that: “And of course to be clear, I am not picking any sides. I am praying for peace and humanity for all!” Gomez wrote in her message. In the wake of the Alabama abortion ban in May 2019, Gomez spoke out on Instagram in favor of abortion rights in the United States. Amidst Roe v. Wade being overturned in June 2022, Gomez stated she is \"not happy\" and that \"men need to stand up and also speak against this issue. It's also the amount of women that are hurting.\" Gomez is a critic of racism and supported the Black Lives Matter movement, lending her Instagram account to Alicia Garza, co-creator of Black Lives Matter and one of the founders of Black Futures Lab, in June 2020. In May 2021, Gomez participated in the VAX Live: The Concert to Reunite the World concert organized by Global Citizen to promote the distribution of COVID-19 vaccines worldwide through the COVAX program. The event urged people to ask their governments to pledge $22.1 billion in aid to the vaccine distribution. In May 2022, MTV partnered with Gomez and the Rare Impact Fund by Rare Beauty to host the Mental Health Youth Action Forum at the White House in coordination with the Biden-Harris Administration."}, {"text": "=== Property ===Gomez owned a $6.6 million home in Calabasas, Los Angeles. In 2014, she sold her mansion in Tarzana, Los Angeles for $3.5 million. In 2015, she purchased a mansion in Fort Worth, Texas, for $3.5 million, and in October 2018 the house was sold. In 2020, Gomez moved to a $5 million mansion in the Los Angeles neighborhood of Encino. In the same year, she sold her house in Studio City, Los Angeles for $2.3 million."}, {"text": "=== Religious beliefs ===Gomez was raised Catholic. At age 13, she wanted a purity ring, and her father went to the church and had it blessed. She has said, \"He actually used me as an example for other kids: I'm going to keep my promise to myself, to my family and to God.\" Gomez stopped wearing the ring in 2010. In 2017, she said she did not like the term \"religion\" and that sometimes it \"freaks me out,\" adding, \"I don't know if it's necessarily that I believe in religion as much as I believe in faith and a relationship with God.\" In 2014, Gomez said that she listened to \"Oceans (Where Feet May Fail)\" by Hillsong United before performing at the 2014 American Music Awards. In 2016, she appeared at a Hillsong Young & Free concert in Los Angeles, leading worship by singing her song \"Nobody\". When a fan on Twitter asked her who the lyrics to \"Nobody\" refer to, Gomez replied that they refer to God. She also covered Hillsong Worship's song \"Transfiguration\" during her Revival Tour. As of 2020, she attends a different congregation in California, the Hillsong Church, and has said that she does not consider herself religious, but is more concerned with her faith and connection to God."}, {"text": "=== Health ===Gomez was diagnosed with lupus sometime between 2012 and early 2014. In September 2017, she revealed on Instagram that she had withdrawn from public events during the previous few months because she had received a kidney transplant from actress and friend Francia Raisa. During the transplant, an artery broke and emergency surgery was conducted to build a new artery using a vein from her leg.Gomez has been open about her struggles with both anxiety and depression. She began pursuing therapy in her early twenties and also spent time in treatment facilities. When she reached 100 million Instagram followers, Gomez said she \"sort of freaked out\" and has since taken several extended breaks from social media, due in part to negative comments. In April 2020, she revealed she has bipolar disorder.In October 2022, Gomez canceled an appearance on The Tonight Show Starring Jimmy Fallon after testing positive for COVID-19. In November 2022, she revealed that she had an episode of psychosis in 2018."}, {"text": "=== Relationships ===Gomez dated singer Nick Jonas in 2008. She appeared in the music video for his band's song \"Burnin' Up\". From December 2010 to March 2018, Gomez was in an on-again, off-again relationship with Canadian singer Justin Bieber. In 2015, she began dating Russian-German DJ Zedd shortly after recording their song \"I Want You to Know\". They broke up later that year. In January 2017, Gomez began dating Canadian singer-songwriter the Weeknd. They moved in together temporarily later on in September, but broke up a month later. In December 2023, Gomez confirmed she is in a relationship with American record producer Benny Blanco."}, {"text": "== Achievements ==Gomez has won various awards including: an American Music Award, a Billboard Music Award,  16 Guinness World Records, three iHeartRadio Music Awards, six Latin American Music Awards (she is the third most-awarded female artist), two MTV Video Music Awards, three MTV Movie & TV Awards, and five People's Choice Awards. For her music work, she was nominated for two Grammy Awards (including Album of the Year as featuring artist) and a Latin Grammy Award. For her acting work, she won a Satellite Award, and was nominated for a Critics' Choice Television Award, two Golden Globe Awards, three NAACP Image Awards, and three Screen Actors Guild Awards. As a producer, she was nominated for four Emmy Awards including: at the 74th Primetime Emmy Awards, Gomez was nominated for Outstanding Comedy Series, marking only the third time a Latina has ever been among the producing nominees for comedy series in the awards' history, and she was nominated for this award again at the succeeding ceremony, and for a Daytime Emmy Award. With 18 wins, Gomez is the fourth-most awarded solo artist at the Teen Choice Awards. She currently holds the record for the most Kids' Choice Awards wins (12) for an individual. In addition, she has also won numerous awards for her philanthropic, charity work and mental health advocacy, including the McLean Award, the Stanford Healthcare Innovation Lab Award, the Morton E. Ruderman Award in Inclusion from the Ruderman Family Foundation, and the Art Award from Hispanic Heritage Foundation for her impact on global culture via her music, filmography and advocacy.Gomez has been included in many prestigious lists and has been awarded by prestigious publications and magazines. In 2015, Gomez was honored with the Chart-Topper Award at the Billboard Women in Music event. The following year, she was named to Forbes' 30 Under 30 list in the music category, and again in 2020 in its \"All-Star Alumni\" category. Billboard named Gomez the Woman of the Year in 2017, included her in its list of Greatest of All Time Pop Songs Artists in 2018, and named her one of the 100 most successful artist of the 2010s in 2019. Time included her on its annual list of the 100 most influential people in 2020. In the same year, she was also honored as one of the Leading Ladies of Entertainment by The Latin Recording Academy. From 2022-2023, The Hollywood Reporter included her on its annual list of the 100 most powerful women in entertainment.Gomez has broken many variety of world records. In 2016, she was the most-followed person on Instagram, and became the first person to reach 100 million followers on it. In February 2023, she regained her status as the most-followed woman on Instagram, and became the first woman to reach 400 million followers on it the following month. She is one of the most-followed people on Twitter, Spotify, Facebook, and TikTok. Gomez has topped three three consecutive times the Billboard 200, and one time the Billboard Hot 100, and Billboard Artist 100. As of May 2017, she has sold 24.3 million songs in the United States, and as of August 2023, she has sold 3.6 million albums in the U.S., and shifted more than 11.5 million album equivalent units. According to the Recording Industry Association of America (RIAA), she has achieved 63 million certified units in the U.S. She is one of the most-streamed artist on Spotify Globally. Six of Gomez's songs have reached over one billion streams on Spotify, and two of her music videos have reached over two billion views on YouTube (\"We Don't Talk Anymore\" is the most-viewed music video published in 2016 on it)."}, {"text": "== Filmography ==According to the review aggregator site Rotten Tomatoes, Gomez's most critically acclaimed television and film projects include The Suite Life of Zack & Cody (2006), Hannah Montana (2007), Wizards of Waverly Place (2007–2012), Another Cinderella Story (2008), Princess Protection Program (2009), Ramona and Beezus (2010), The Muppets (2011), Spring Breakers (2012), Hotel Transylvania (2012–2022), Girl Rising (2013), The Wizards Return: Alex vs. Alex (2013), Rudderless (2014), The Fundamentals of Caring (2016), Neighbors 2: Sorority Rising (2016), The Dead Don't Die (2019), A Rainy Day in New York (2019), Selena + Chef (2020–present), Only Murders in the Building (2021–present), and Selena Gomez: My Mind & Me (2022).Gomez also executive produced the television series 13 Reasons Why (2017–2020) and Living Undocumented (2019)."}, {"text": "== Discography ==Selena Gomez & the Scene albumsKiss & Tell (2009)"}, {"text": "== Discography ==A Year Without Rain (2010)"}, {"text": "== Discography ==When the Sun Goes Down (2011)Solo albumsStars Dance (2013)"}, {"text": "== Discography ==Revival (2015)"}, {"text": "== Discography ==Rare (2020)"}, {"text": "== Tours ==Selena Gomez & the Scene tours"}, {"text": "== Tours ==Live in Concert (2009–2010)"}, {"text": "== Tours ==A Year Without Rain Tour (2010–2011)"}, {"text": "== Tours ==We Own the Night Tour (2011–2012)Solo toursStars Dance Tour (2013–2014)"}, {"text": "== Tours ==Revival Tour (2016)"}, {"text": "== See also ==List of artists who reached number one in the United States"}, {"text": "== See also ==List of artists who reached number one on the Billboard Mainstream Top 40 chart"}, {"text": "== See also ==List of most-followed Instagram accounts"}, {"text": "== See also ==List of artists who reached number one on the U.S. Dance Club Songs chart"}, {"text": "== See also ==List of Billboard Social 50 number-one artists"}, {"text": "== See also ==History of Mexican Americans in Dallas–Fort Worth"}, {"text": "== External links ==Official website"}, {"text": "== External links ==Selena Gomez at Amazon MusicSelena Gomez at IMDb"}]