[{"text": "Susan Alexandra \"Sigourney\" Weaver (; born October 8, 1949) is an American actress. A figure in science fiction and popular culture, she has received various accolades, including a British Academy Film Award, two Golden Globe Awards, and a Grammy Award, in addition to nominations for three Academy Awards, four Primetime Emmy Awards, and a Tony Award.  In 2003, she was voted Number 20 in Channel 4's countdown of the 100 greatest movie stars of all time.Weaver rose to fame for starring as Ellen Ripley in Ridley Scott's science fiction film Alien (1979). She reprised her role in James Cameron's Aliens (1986), for which she received her first Academy Award nomination, and again in Alien 3 (1992) and Alien Resurrection (1997). The character is regarded as a significant female protagonist in cinema history. She reunited with Cameron in Avatar (2009) and Avatar: The Way of Water (2022), two of the highest-grossing films of all time. She also played Dana Barrett in the Ghostbusters films starting in 1984."}, {"text": "On Broadway, she received a Tony Award nomination for her role in the play Hurlyburly (1984). In 1988, Weaver received dual Academy Award nominations—Best Actress and Best Supporting Actress—for the respective roles of primatologist Dian Fossey in Gorillas in the Mist and a young associate in Working Girl, both of which won her Golden Globe Awards. She won the BAFTA Award for Best Supporting Actress for her role in The Ice Storm (1997). Her other notable films include Copycat (1995), Galaxy Quest (1999), The Village (2004), Vantage Point (2008), Chappie (2015), and A Monster Calls (2016)."}, {"text": "Weaver has also performed voice roles in the animated films The Tale of Despereaux (2008) and Pixar films WALL-E (2008) and Finding Dory (2016) as well as several documentaries, such as the BBC series Planet Earth (2006) and The Beatles: Eight Days a Week (2016). In television, she has received Primetime Emmy Award nominations for her starring roles in the movies Snow White: A Tale of Terror (1998), Prayers for Bobby (2009), and Political Animals (2013). She won the Grammy Award for Best Spoken Word Album for narrating the humor book Earth (The Book) (2010)."}, {"text": "== Early life ==Susan Alexandra Weaver was born in New York City on October 8, 1949. Her mother, Elizabeth Inglis (born Desiree Mary Lucy Hawkins), was a British actress and a native of Colchester, England. Weaver's father, Sylvester \"Pat\" Weaver Jr., was an American television executive born in Los Angeles, who served as president of NBC from 1953 to 1955 and created NBC's Today Show in 1952. Pat's brother, Winstead \"Doodles\" Weaver, was a comedian and contributor to Mad. Her father's American family was of Dutch, English, Scots-Irish, and Scottish ancestry.At the age of 14, Weaver began using the name Sigourney, taking it from a minor character in The Great Gatsby. She briefly attended the Brearley School and Chapin School in New York before arriving at the Ethel Walker School (Walker's) in Simsbury, Connecticut, where she developed an early interest in performance art. One of her early roles was in a school adaptation of the poem \"The Highwayman\", and on another occasion she played a Rudolph Valentino character in an adaptation of The Sheik. She was also involved in theatrical productions of A Streetcar Named Desire and You Can't Take It with You during one summer at Southbury, Connecticut. Weaver reportedly reached the height of 179 cm (5 ft 10 in) by the age of 11, which had a negative impact on her self-esteem. She recalled feeling like \"a giant spider\" and never having \"the confidence to ever think I could act.\"In 1967, shortly before turning 18, Weaver visited Israel and volunteered on a kibbutz for several months. On her return to the United States, she attended Sarah Lawrence College. After her freshman year, she transferred to Stanford University as an English major. At Stanford, Weaver was extensively involved in theater. She performed in a group named the Palo Alto Company, doing Shakespeare plays and \"commedia dell'arte in a covered wagon\" around the Bay Area, the nature of which she considered \"outrageous\". She avoided Stanford's drama department, as she believed their productions were too \"stuffy\" and \"safe\". Weaver had planned to enter Stanford's Ph.D. English program and eventually pursue a career as a writer or a journalist, but changed her mind after getting frustrated by the \"deadly dry\" honors courses. She eventually graduated in 1972 with a Bachelor of Arts in English. Weaver subsequently applied to Yale University's School of Drama, performing Bertolt Brecht's Saint Joan of the Stockyards at her audition, and was accepted.Weaver admitted that she had a difficult time at Yale. She was not fond of the shows at Yale Repertory Theatre, and had little luck getting lead roles in school productions. Some acting teachers referred to her as \"talentless\" and advised her to stick to comedy. Weaver credited her friends such as Christopher Durang, who kept hiring her for his plays, as well as her time at the Yale Cabaret, as crucial in helping her pull through. She graduated from Yale with a Master of Fine Arts in 1974."}, {"text": "=== 1970s: Initial work and breakthrough ===Weaver performed in the first production of the Stephen Sondheim musical The Frogs while at Yale in 1974, alongside Larry Blyden and fellow students Meryl Streep and Durang. She was briefly an understudy in a John Gielgud production of Captain Brassbound's Conversion thereafter. She also acted in original plays by Durang. She appeared in an off-Broadway production of Durang's comedy Beyond Therapy in 1981, which was directed by then-fledgling director Jerry Zaks. Before her on-screen breakthrough, she had appeared only in commercials, a few television roles (including an appearance in the soap opera Somerset), and had a small part in the Woody Allen-directed romantic comedy-drama Annie Hall (1977). Her originally more substantial Annie Hall role was scaled back due to her commitment to the Durang play Titanic. "}, {"text": "=== 1970s: Initial work and breakthrough ===Weaver appeared two years later as Warrant Officer / Lieutenant Ripley in Ridley Scott's blockbuster film Alien (1979), in a role initially designated to co-star British-born actress Veronica Cartwright until a late change in casting. Cartwright stated to World Entertainment News Network (WENN) that she was in England ready to start work on Alien when she discovered that she would be playing the navigator Lambert in the project, and Weaver had been given the lead role of Ellen Ripley."}, {"text": "=== 1980s: Critical acclaim and awards success ===Weaver reprised the role of Ellen Ripley seven years later in the sequel to Alien, similarly titled Aliens, directed by James Cameron. Critic Roger Ebert wrote \"Weaver, who is onscreen almost all the time, comes through with a very strong, sympathetic performance: She's the thread that holds everything together.\" For Aliens, she won the Saturn Award for Best Actress and earned her first nominations for the Academy Award for Best Actress and the Golden Globe Award for Best Actress in a Motion Picture – Drama."}, {"text": "=== 1980s: Critical acclaim and awards success ===She next appeared opposite Mel Gibson as British Embassy officer Jill Bryant in The Year of Living Dangerously (1982) released to critical acclaim, and as Dana Barrett in Ghostbusters and Ghostbusters II. In 1988, Weaver starred as primatologist Dian Fossey in the biographical drama Gorillas in the Mist. The same year, she appeared opposite Harrison Ford in a supporting role as Katharine Parker in the comedy-drama Working Girl. Both these films earned Weaver Golden Globe Awards for Best Actress in a Motion Picture – Drama and Best Supporting Actress – Motion Picture for her two roles that year. At the Golden Globes that year, Weaver was one of three actresses to win in Best Actress, alongside Jodie Foster and Shirley MacLaine, in a three-way tie. Weaver received simultaneous Academy Award nominations in 1988—Best Actress for Gorillas in the Mist and Best Supporting Actress for Working Girl. She was the first of four actresses (as of 2023) to have won two Golden Globes in the same year."}, {"text": "=== 1990s: Continued success ===Weaver returned to the big screen with Alien 3 (1992) and Ridley Scott's 1492: Conquest of Paradise (1992) in which she played the role of Queen Isabella. In the early 1990s, Weaver appeared in several films including Dave opposite Kevin Kline and Frank Langella. In 1994, she starred in Roman Polanski's drama Death and the Maiden as Paulina Escobar. She played the role of agoraphobic criminal psychologist Helen Hudson in the film Copycat (1995). Weaver also concentrated on smaller and supporting roles such as Jeffrey (1994) with Nathan Lane and Patrick Stewart. In 1997, she appeared in Ang Lee's The Ice Storm. Her role in The Ice Storm as Janey Carver, earned her a second nomination for the Golden Globe Award for Best Supporting Actress – Motion Picture, and won her the BAFTA Award for Best Actress in a Supporting Role. In 1999, she co-starred in the science fiction comedy Galaxy Quest and the drama A Map of the World, earning her a third nomination for the Golden Globe Award for Best Actress in a Motion Picture – Drama for the latter."}, {"text": "=== 2000s ===In 2001, Weaver appeared in the comedy Heartbreakers playing the lead role of a con-artist alongside Jennifer Love Hewitt, Ray Liotta, Gene Hackman and Anne Bancroft. She appeared in several films throughout the decade including Holes (2003), the M. Night Shyamalan horror film The Village (2004), Vantage Point (2008), and Baby Mama (2008). In 2007, Weaver returned to Rwanda for the BBC special Gorillas Revisited, in which Weaver reunites with the Rwandan apes from the film Gorillas in the Mist, some 20 years later. She has done voice work in various television series and in animated feature films. In February 2002, she featured as a guest role in the Futurama episode \"Love and Rocket\", playing the female Planet Express Ship.In 2006, she was the narrator for the American version of the BBC Emmy Award-winning documentary series Planet Earth; the original British series version was narrated by David Attenborough. In 2008, Weaver was featured as the voice of the ship's computer in the Pixar and Disney release WALL•E. In 2008, she voiced a narrating role in the computer-animated film The Tale of Despereaux (2008), based on the novel by Kate DiCamillo. The film opens with Weaver as narrator recounting the story of the pastel-hued Kingdom of Dor. She also made a rare guest appearance on television playing herself in season 2 episode of the television series Eli Stone in the fall of 2008.In 2009, Weaver starred as Mary Griffith in her first TV movie Prayers for Bobby, for which she was nominated for an Emmy Award, Golden Globe Award, and Screen Actors Guild Award. Weaver reunited with Aliens director James Cameron for his film Avatar (2009), playing a major role as Dr. Grace Augustine, leader of the AVTR (avatar) program on the film's fictional moon Pandora, which is the highest-grossing film of all time."}, {"text": "=== 2010s ===Weaver has hosted two episodes of the long-running NBC sketch show Saturday Night Live: once on the 12th-season premiere in 1986, and again, on a season 35 episode in January 2010. In March 2010, she was cast for the lead role as Queen of the Vampires in Amy Heckerling's Vamps. She was honored at the 2010 Scream Awards earning The Heroine Award which honored her work in science fiction, horror and fantasy films. In December 2013, Weaver was a guest narrator at Disney's Candlelight Processional at Walt Disney World.In 2014, Weaver reprised the role of Ripley for the first time in 17 years by voicing the character in the video game Alien: Isolation. Her character has a voice cameo in the main story, and has a central role in the two DLCs set during the events of Alien, with most of the original cast voicing their respective characters. Weaver appeared in the film Exodus: Gods and Kings (2014) playing Tuya, directed by Ridley Scott, alongside Christian Bale, Joel Edgerton and Ben Kingsley. In 2015, she co-starred in Neill Blomkamp's science-fiction film Chappie, and stated that she would agree to appear in an Alien sequel, provided that Blomkamp directs. On February 18, 2015, it was officially announced that an Alien sequel would be made, with Blomkamp slated to direct. On February 25, 2015, Weaver confirmed that she would reprise her role as Ellen Ripley in the new Alien film. In 2016, Weaver voiced herself in a cameo in the Pixar film Finding Dory. On January 21, 2017, in response to a fan question on Twitter asking what the chances were of his Alien project actually happening, Blomkamp responded \"slim\"."}, {"text": "=== 2010s ===Weaver played Alexandra, the leader of the Hand, in Netflix and Marvel's miniseries The Defenders, released in 2017. "}, {"text": "=== 2010s ===On June 7, 2019, Weaver confirmed that she would reprise her role as Dana Barrett in Ghostbusters: Afterlife, which was released on November 19, 2021. On September 23, 2019, Variety reported that Weaver and Kevin Kline are set to reunite again (after Dave and The Ice Storm) for The Good House, a drama from Steven Spielberg's Amblin Partners and Universal Pictures. Her voice has been used for audiobooks, film soundtracks, and video games including James Cameron's Avatar: The Game (2009) and Alien: Isolation (2014). She has also voiced roles for Futurama, Penn Zero: Part-Time Hero, and SpongeBob SquarePants."}, {"text": "=== 2020s: Present work ===In September 2011, it was confirmed that Weaver would be returning to Avatar: The Way of Water, with James Cameron stating that \"no one ever dies in science fiction.\" The Way of Water, alike to its predecessor, was released to critical and commercial success. Principal photography for Avatar: The Way of Water and Avatar 3 started simultaneously on September 25, 2017; Weaver portrayed Kiri, Jake and Neytiri's daughter, and reprised her role as Dr. Grace Augustine. The film became the third highest grossing film of all time, and it received a nomination for the Academy Award for Best Picture."}, {"text": "== Personal life ==Weaver has been married to stage director Jim Simpson since October 1, 1984. They live in Manhattan and have one child born in 1990 who is non-binary. Together, the couple founded The Flea Theater in 1996."}, {"text": "== Personal life ==Weaver is a friend of Jamie Lee Curtis, with whom she starred in the romantic comedy You Again (2010). In a 2015 interview together, Curtis admitted to Weaver that she never saw Alien in its entirety because she was too scared. Weaver appeared in two episodes of the UK television series Doc Martin in 2015 and 2017 playing an American tourist. She revealed that the reason behind her appearances was her 40-year friendship with Doc Martin star Selina Cadell.After making Gorillas in the Mist, Weaver became a supporter of the Dian Fossey Gorilla Fund, and later its honorary chairperson. She was honored by the Explorers Club for this work, and is considered to be an environmentalist. In October 2006, she gave a news conference at the start of a United Nations General Assembly policy deliberation where she outlined the  threat to ocean habitats posed by deep-sea trawling, an industrial method for catching fish. On April 8, 2008, in the Rainbow Room, she hosted the annual gala of the Trickle Up Program, a non-profit organization focusing on those in extreme poverty, mainly women and disabled people."}, {"text": "== Works and accolades ==Weaver has appeared in numerous works across her career; among these, her highest-acclaimed film roles include Alien (1979), The Year of Living Dangerously (1982), Ghostbusters (1984), Aliens (1986), Gorillas in the Mist (1988), Working Girl (1988), The Ice Storm (1997), Dave (1993), Death and the Maiden (1994), Copycat (1995), Galaxy Quest (1999), Holes (2003), WALL-E (2008), Avatar (2009), The Cabin in the Woods (2011) and A Monster Calls (2016)."}, {"text": "== Works and accolades ==Weaver was nominated for the British Academy Film Award for Most Promising Newcomer to Leading Film Roles and the Saturn Award for Best Actress for her performance in the first installment of the Alien franchise. For the second installment of Alien, similarly titled Aliens, Weaver won the Saturn Award for Best Actress, and earned nominations for the Academy Award for Best Actress and the Golden Globe Award for Best Actress."}, {"text": "== Works and accolades ==In 1988, Weaver earned simultaneous Academy Award nominations—Best Actress and Best Supporting Actress—for her respective performances in Gorillas in the Mist and Working Girl; these roles also won her two Golden Globe Awards. She was nominated for a Tony Award for her performance in the play Hurlyburly, which was her 1985 stage debut."}, {"text": "== Works and accolades ==Weaver won the BAFTA Award for Best Actress in a Supporting Role for appearing in The Ice Storm. She has been nominated for four Primetime Emmy Awards, three for Outstanding Lead Actress in a Limited or Anthology Series or Movie and one for Outstanding Narrator. Her role in Political Animals earned her a nomination for a Critics' Choice Award."}, {"text": "== Works and accolades ==In 2024, the Academy of Cinematographic Arts and Sciences of Spain awarded her with the International Goya Award for \"her impressive career full of unforgettable films and inspiring us by creating complex and strong female characters.\""}, {"text": "== External links ==Sigourney Weaver at IMDb "}, {"text": "== External links ==Sigourney Weaver at the Internet Broadway Database "}, {"text": "== External links ==Sigourney Weaver at the Internet Off-Broadway Database "}, {"text": "== External links ==Sigourney Weaver at the TCM Movie Database "}, {"text": "== External links ==Sigourney Weaver at AllMovie "}, {"text": "== External links ==Sigourney Weaver at Emmys.com"}, {"text": "== External links ==BBC News article on Sigourney Weaver"}, {"text": "== External links ==Daily Telegraph interview with Sigourney Weaver"}, {"text": "== External links ==Weaver talks about her first screen role, in Annie Hall"}]