[{"text": "Sofía Margarita Vergara Vergara (Spanish: [soˈfi.a βeɾˈɣaɾa]; born July 10, 1972) is a Colombian and American actress and television personality. She is known for her role as Gloria Delgado-Pritchett in the ABC sitcom Modern Family (2009–2020) and drug lord Griselda Blanco in the miniseries Griselda (2024). For the former, she was nominated for four Golden Globe Awards and four Primetime Emmy Awards. The role established her as one of the highest-paid actresses in America.Vergara rose to prominence while co-hosting two television shows for Spanish-language television network Univision in the late 1990s. Her first notable acting job in English was in the film Chasing Papi (2003). She subsequently appeared in Four Brothers (2005) and Tyler Perry's comedies Meet the Browns (2008) and Madea Goes to Jail (2009), receiving an ALMA Award nomination for the latter. She also acted in New Year's Eve (2011), The Three Stooges (2012), Machete Kills (2013), Fading Gigolo (2013), Chef (2014), and Hot Pursuit (2015). Vergara has also had voice-over roles in the animated films Happy Feet Two (2011), Escape from Planet Earth (2013), and The Emoji Movie (2017). "}, {"text": "Since 2020, Vergara has been a judge on the television talent show America's Got Talent. She is also known as a businesswoman, and brand ambassador. She designs her own fashion line for Kmart and signed with both Pepsi and CoverGirl in 2011. Vergara launched her first fragrance \"Sofia by Sofia Vergara\" in 2014 and has since released four more fragrances. She is one of the few Latinas in ad campaigns in the United States."}, {"text": "== Early life ==Vergara was born to a Roman Catholic family in Barranquilla. Her mother, Margarita Vergara de Vergara, was a homemaker, and her father, Julio Enrique Vergara Robayo, was a cattle rancher for the meat industry. She was nicknamed \"Toti\" by her five siblings and many cousins.Vergara initially studied dentistry for three years at National University of Colombia, but she left two semesters away from completing her degree to pursue opportunities in modeling and show business. In 1998, her older brother Rafael was murdered in Colombia during an attempt to kidnap him. Not wanting to be caught in the unrest that resulted in the murder, Vergara emigrated to the United States, settling in Miami, Florida. Her cousin and adopted sister, Sandra, is also a television actress in the United States."}, {"text": "== Career ==Vergara was discovered by a photographer while walking on a beach in Colombia, and she was quickly presented with offers of modeling and television work. She was \"apprehensive about doing her first television commercial—until her Catholic schoolteachers gave her their personal permission to take the assignment.\" She made her first appearance, aged 17, in a Pepsi commercial aired in Latin America. She then began studies at the Creative Workshops School of Acting, where Gloria Estefan also trained.In 2009, Vergara appeared in Chicago on Broadway as Matron Mama Morton for six weeks. She was scheduled to star in The Paperboy, an independent drama directed by Lee Daniels. However shooting was delayed and the revised resumption conflicted with her shooting schedule for the third season of Modern Family and she dropped out. In July 2011, she finished filming the Farrelly brothers' The Three Stooges, her first leading role in a major film. She said, \"I play a mean woman that tries to manipulate the Three Stooges into killing her husband so that she gets all the money.\" In April 2012, she appeared in her son Manolo's YouTube web series Vida con Toty."}, {"text": "== Career ==She starred on the ABC sitcom Modern Family as Gloria Delgado-Pritchett, for which she was nominated for the Primetime Emmy Award for Outstanding Supporting Actress in a Comedy Series from 2010 to 2013. Vergara was the highest-earning woman in U.S. television, earning $19 million for the previous 12 months, according to a list released by Forbes.com on July 18, 2012. Vergara was named one of People magazine's \"50 most beautiful people\", and named by The Hollywood Reporter and Billboard as one of the most influential Latin women in Hollywood. Vergara received a star on the Hollywood Walk of Fame on May 7, 2015. In 2015, Forbes estimated Vergara's annual income at $28.5 million.In June 2016, the Human Rights Campaign released a video in tribute to the victims of the Orlando nightclub shooting; in the video, Vergara and others told the stories of the people killed there. As of September 2016, Forbes reported that Vergara was the highest-paid actress in television, bringing in $43 million in the past year. In February 2020, it was announced that Vergara would be a judge on America's Got Talent, starting with its fifteenth season. She returned for her second season in 2021, her third in 2022, her fourth in 2023, and is set to return for her fifth in 2024."}, {"text": "== Business ventures ==In 2011, it was announced that Vergara was designing a clothing line for Kmart targeting soccer moms. In 2011, Vergara was named the face of CoverGirl, with the first advertisements appearing in January 2012. In April 2011, she appeared in a Diet Pepsi commercial with David Beckham and another in January 2012. Also in 2011, she appeared in a number of commercials for Comcast's Xfinity brand and State Farm. In 2013, she signed endorsement contracts with Diet Pepsi, Rooms To Go, and the medicine Synthroid. Vergara launched a furniture line with Rooms To Go in 2013. She wanted to create well-made and affordable furniture, saying: \"Everyone should be able to make their home look amazing and be proud of their home.\" In 2014, Vergara became a brand ambassador for the American anti-dandruff shampoo brand Head & Shoulders.In March 2017, she reached a settlement with Venus Concept for alleged improper use of her likeness, which Vergara said created the false impression that she endorsed their beauty products. She launched her first fragrance \"Sofia by Sofia Vergara\" in 2014 and has since released four more fragrances. In June 2023, Vergara launched the beauty brand Toty. The brand is named after her childhood nickname."}, {"text": "== Personal life ==Vergara has naturally blonde hair. For movies and television, she is sometimes asked to colour her hair dark brown or black to make her look more stereotypically Hispanic. Vergara was married at the age of 18 to her high-school sweetheart, Joe Gonzalez. They have a son named Manolo, who was born in Colombia on September 16, 1991. They divorced in 1993. Vergara and her boyfriend Nick Loeb became engaged in 2012 after dating for two years. On May 23, 2014, Vergara announced that the engagement had been called off. Vergara and True Blood star Joe Manganiello became engaged on Christmas Eve 2014 after dating for six months. They married in Palm Beach, Florida, on November 21, 2015. On July 17, 2023, Vergara and Manganiello announced to Page Six that they have separated and are planning to divorce after seven years of marriage. The divorce was finalized in February 2024.Vergara was diagnosed with thyroid cancer in 2000 at the age of 28. She had her thyroid removed, underwent radioiodine therapy, and made a full recovery. She takes medication to prevent hypothyroidism. On May 9, 2011, Vergara's younger brother Julio was deported from the United States to Colombia after being arrested in April that year; Julio also had a longtime drug addiction and previous brushes with the law. Vergara told Parade magazine, \"To see somebody dying over 10 years, little by little, that's the worst punishment. Now he's like another person.\" During her December 2014 appearance on Jimmy Kimmel Live!, Vergara revealed that she had become a United States citizen after getting a perfect score on her citizenship test.From 2015 to 2017, Vergara was involved in a legal dispute regarding the future of two fertilized embryos produced by in vitro fertilization while she was still in a relationship with Loeb; the embryos were kept in storage in cryopreservation in a medical clinic in California. Following the couple's split in 2014, Loeb filed a lawsuit for custody of the embryos in a California court, but he later dropped that lawsuit when the court demanded that Loeb identify two women who had abortions after he had impregnated them. In December 2016, a right-to-life lawsuit against Vergara was initiated in Louisiana with Vergara's embryos as plaintiffs. The embryos were named \"Emma\" and \"Isabella\" in the lawsuit, and their \"trustee\" was listed as James Charbonnet, a New Orleans resident of no relation to Vergara. The intent of the suit was to give the embryos a chance to further develop using a surrogate carrier, hence to be born, and to benefit from an inheritance trust that had been created for them and is administered by Charbonnet. Loeb had written \"Keeping them frozen forever is tantamount to killing them,\" in a 2015 op-ed in The New York Times. The suit also tried to terminate parental rights of Vergara because by keeping them in cryopreservation in a medical clinic she allegedly abandoned and neglected the embryos. The legal case was novel and took advantage of Louisiana's embryo laws; the state passed a law in 1986 that declares embryos to be \"juridical persons\", giving embryos the right to sue or be sued. In August 2017, a Louisiana judge dismissed the case on the grounds that the court had no jurisdiction over the embryos, which were conceived in California."}, {"text": "=== Theatre ===Chicago as Matron \"Mama\" Morton (2009)"}, {"text": "== Awards and nominations ==In 2014, Vergara was ranked as the 32nd most powerful woman in the world by Forbes; her position was 38 the previous year."}, {"text": "== External links ==Official website"}, {"text": "== External links ==Sofía Vergara at IMDb"}, {"text": "== External links ==Sofía Vergara at AllMovie"}, {"text": "== External links ==Sofía Vergara at Fashion Model Directory"}]