[{"text": "Edward Bridge Danson III (born December 29, 1947) is an American actor. He achieved stardom playing the lead character Sam Malone on the NBC sitcom Cheers, for which he received two Primetime Emmy Awards and two Golden Globe Awards. He was nominated for more Emmy Awards for roles in the legal drama Damages (2007–2010) and the NBC dramedy The Good Place (2016–2020). He was awarded a star on Hollywood's Walk of Fame in 1999.Danson made his film debut in 1978 in the crime drama The Onion Field. His breakout film role was as Jack Holden in the films Three Men and a Baby (1987) and Three Men and a Little Lady (1990). His other film roles include Body Heat (1981), Dad (1989) and Saving Private Ryan (1998)."}, {"text": "Danson's other leading roles on television include the CBS sitcom Becker, CBS drama CSI: Crime Scene Investigation (2011–2015), and CSI: Cyber (2015–2016). In 2015, he starred in the second season of FX's anthology series Fargo. He has played roles in the HBO comedies Bored to Death (2009–2011) and Curb Your Enthusiasm (2000–2024), and the NBC sitcom Mr. Mayor (2021–2022)."}, {"text": "Danson is also known for his longtime activism in ocean conservation. In March 2011, he published his first book, Oceana: Our Endangered Oceans and What We Can Do to Save Them which was written with journalist Michael D'Orso. He has been married to actress Mary Steenburgen since 1995."}, {"text": "== Early life and education ==On December 29, 1947, Danson was born in San Diego to Edward Bridge \"Ned\" Danson, Jr., an archaeologist and curator of the Museum of Northern Arizona, from 1959 to 1975, and Jessica Harriet (née MacMaster). He has an older sister, Jessica Ann \"Jan\" Haury. Danson was primarily raised in Flagstaff, Arizona. He has Scottish and English heritage. Their ancestors lived in colonial New England and are descended from historical figures like Anne Hutchinson.In 1961, at age 14, Danson enrolled at the Kent School, a university-preparatory school in Connecticut; he was a star player on the basketball team. He became interested in drama while later attending Stanford University; in his search for a better acting program, he transferred to Carnegie Mellon University, Pittsburgh. He was graduated with a B.F.A. in Drama in 1972."}, {"text": "==== Early career ====Danson began his television career as a contract player on the daytime soap opera Somerset. He played the role of Tom Conway from 1975 to 1976. In 1977, he played Dr. Mitchell Pierson on the daytime soap opera The Doctors, having also appeared earlier in 1975 as another character, Dr. Chuck Weldon. He was also in a number of commercials, most notably as the \"Aramis man\".His guest appearances on television in the late 1970s and early 1980s include being on Laverne & Shirley, B. J. and the Bear, Family, Benson, Taxi, Magnum, P.I., The Amazing Spider-Man, Tucker's Witch, and Mrs. Columbo."}, {"text": "==== Career breakthrough: Cheers ====In 1982, Danson was cast in the role of Sam Malone, a former local-legend baseball player and bartender, for the NBC sitcom Cheers. On the show, he has an on-again-off-again relationship with the college-educated, sophisticated Diane Chambers. Although the show finished last in ratings in its first season, it was well-received by critics. Ratings gradually improved by 1983, and by 1986, Cheers was among the top ten most-viewed shows on television. The series ran for 11 seasons (1982-1993), with the series finale (May 20, 1993) being watched by 80 million people, the second-most watched series finale in television history (in 1993). Cheers won four Emmy Awards for Outstanding Comedy Series, plus a Golden Globe for Best Series–Musical or Comedy. During his time on the show, Danson won two of his 11 consecutive Emmy nominations for the role of Sam Malone, and won two of his nine Golden Globe nominations. In 2002, TV Guide magazine named Cheers the 18th “Greatest Show of All Time”. It was included in Time's “100 Greatest Shows of All Time”."}, {"text": "==== Career breakthrough: Cheers ====Danson reprised the role of Sam Malone in a second-season episode of Frasier, and did the voiceover for his character in an episode of The Simpsons, \"Fear of Flying\"."}, {"text": "==== Later career ====Although he was best known for his work in comedy, he also appeared in a drama, Something About Amelia, about a family devastated by the repercussions of incest, which co-starred his later co-star on Damages, Glenn Close. He won a Golden Globe Award for Best Actor in a Miniseries or Television Movie and was nominated for an Emmy Award. In 1996, three years after Cheers concluded, Danson starred in the short-lived CBS sitcom Ink with his real-life wife Mary Steenburgen. In the same year, they starred as Lemuel Gulliver and his wife in an acclaimed television miniseries of Gulliver's Travels."}, {"text": "==== Later career ====Danson went on to star in the successful CBS sitcom Becker (produced by Paramount Television which also produced Cheers), which ran from 1998 to 2004. Danson also plays a fictionalized version of himself on Curb Your Enthusiasm."}, {"text": "==== Later career ====In 1999, Danson was presented with a star on Hollywood's Walk of Fame."}, {"text": "==== Later career ====Danson returned to series television in the fall of 2006, playing a psychiatrist in the ABC sitcom Help Me Help You, which was canceled at midseason due to low ratings.In 2006, Danson received a nomination for a Screen Actors Guild Award for Outstanding Performance by a Male Actor in a TV Movie or Miniseries for his role in Knights of the South Bronx."}, {"text": "==== Later career ====In 2007, Danson starred in the FX Network drama Damages as a corrupt billionaire, Arthur Frobisher. The role earned him an Emmy nomination for Outstanding Supporting Actor in a Drama Series, but he lost to co-star Željko Ivanek. During the second season Danson became a recurring character instead of one of the principal cast. He received an Emmy nomination for Outstanding Guest Actor in a Drama Series but lost to Michael J. Fox for Fox's guest appearance in Rescue Me. In 2011, Danson appeared in the music video for \"Make Some Noise\" by the Beastie Boys. He is also mentioned in the song's lyrics."}, {"text": "==== Later career ====Danson starred in the HBO sitcom Bored to Death as George Christopher, the laconic and sometime downright infantile editor of Edition magazine. Critics often praised Danson as being the highlight of the program, calling his character a \"scene stealer.\"In July 2011, CBS announced that Danson would star in its police drama CSI: Crime Scene Investigation. He played D.B. Russell, a new graveyard-shift supervisor who previously headed a crime lab in Seattle. Tony Shalhoub, Robin Williams, and John Lithgow were also considered for the role.In March 2013, it was announced that Danson signed a deal to be on CSI for two more years. It was planned for the character he played to move to the third CSI spin-off, CSI: Cyber in the show's second season. CSI: Cyber was canceled after two seasons.In 2015, Danson appeared in the second season of the TV show Fargo. He portrays Sheriff Hank Larsson. From September 2016 to January 2020 Danson appeared opposite Kristen Bell as the character Michael in the NBC sitcom The Good Place. He has both been nominated for and won numerous awards for his performance as Michael."}, {"text": "==== Later career ====In July 2019, Danson was cast as one of the main lead roles for the situation comedy Mr. Mayor, in which he plays a wealthy businessman who runs for mayor of Los Angeles for all the wrong reasons. NBC added the show to the 2020–2021 television season."}, {"text": "=== Film ===Danson has also been featured in numerous films. His most notable film appearances included Three Men and a Baby with Tom Selleck and Steve Guttenberg, its sequel Three Men and a Little Lady, and Cousins with Isabella Rossellini. He also appeared in The Onion Field (his first film, as the bagpipe-playing Officer Ian Campbell), Creepshow, Body Heat, Little Treasure, Just Between Friends (with Mary Tyler Moore), A Fine Mess, Dad, Made in America, Getting Even with Dad, Loch Ness, and Saving Private Ryan."}, {"text": "== Personal life ==Danson and his first wife, actress Randall \"Randy\" Gosch (known as Randy Danson), were married in 1970 and divorced in 1975.Danson's second wife was producer Cassandra \"Casey\" Coates, whom he married in 1977. On December 24, 1979, while giving birth to their first daughter, Kate, Coates suffered a stroke. Danson spent several years caring for her and helping her recuperate. They later adopted a second daughter, Alexis. His affair with actress Whoopi Goldberg contributed to their divorce in 1993. At the time, it was known as one of Hollywood's costliest divorces and reportedly cost Danson $30 million.On October 7, 1995, Danson married actress Mary Steenburgen, whom he met on the set of Pontiac Moon in 1993, and became the stepfather to Steenburgen's children, Lilly and Charlie, from her previous marriage to actor Malcolm McDowell.Danson has been on a plant-based diet multiple times, but as of 2016, he is on a pescetarian diet."}, {"text": "=== Relationship with Whoopi Goldberg ===While a guest on The Arsenio Hall Show in late 1988, he met actress Whoopi Goldberg; he describes her as \"a sexy, funny woman\". They became friends and were in Help Save Planet Earth in 1990 which is about saving the environment (Danson played himself, Goldberg portrayed Mother Earth). While making Made in America in April 1992, the two became romantically involved, a pairing that was heavily featured in gossip tabloids such as the National Enquirer. The couple also appeared on the Rock the Vote TV special in the same year; they were set to star in a Paramount-produced version of Neal Barrett Jr.'s Pink Vodka Blues, written by Marshall Brickman.Danson received negative press attention October 8, 1993, after his appearance wearing blackface at a Friars Club comedy roast in honor of Goldberg, and for using many racist slurs. Later, Goldberg defended the sketch, explaining that she had helped write much of the material and referred Danson to the makeup artist who painted his face as a societal critique."}, {"text": "=== Environmentalism ===Danson's interest in environmental concerns began when he was 12 years old. Bill Breed, then curator of geology at the Museum of Northern Arizona, introduced Danson and their friend Marc Gaede to a \"game\" he referred to as \"billboarding\". Armed with axes and saws, Breed, Gaede, and Danson destroyed over 500 outdoor advertising signs.Danson's interest in environmentalism continued over the years, and he began to be concerned with the state of the world's oceans. He was a contributing founder of the American Oceans Campaigns in the 1980s; it merged with Oceana in 2001 and he is a board member. His commitment to the environment led him to host the A&E television series \"Challenge of the Seas\" in 1991, filming 26 one-hour episodes.In March 2011, Danson published his first book, Oceana: Our Endangered Oceans and What We Can Do To Save Them which was written with journalist Michael D'Orso.On October 25, 2019, Danson was arrested and charged along with actress Jane Fonda at a climate-change protest outside the United States Capitol in Washington, D.C."}, {"text": "=== Political activity ===Danson is a friend of former President Bill Clinton, who attended Danson and Steenburgen's wedding. Danson has donated $85,000+ to Democratic candidates, including Al Gore, John Edwards, Barbara Boxer, Bill Clinton, Al Franken, and John Kerry. He has also donated to the Democratic Party of Arkansas and the Democratic Senatorial Campaign Committee. Danson and Steenburgen campaigned for Senator Hillary Clinton during her 2008 presidential campaign. He attended the wedding of Bill Clinton and Hillary Clinton's daughter Chelsea on July 31, 2010. He appeared with Steenburgen at the 2016 Democratic National Convention. On October 3, 2016, he attended the opening of Hillary Clinton's new campaign office in Lancaster, Pennsylvania at the old Queen Pharmacy on King Street."}, {"text": "== Book ==Danson, Ted (with Michael D'Orso). (March 15, 2011) Oceana: Our Endangered Oceans and What We Can Do to Save Them. New York: Rodale Books. ISBN 978-1605292625"}, {"text": "== Further reading ==Piccalo, Gina (October 18, 2009). \"Ted Danson is hip again\". Los Angeles Times."}, {"text": "== Further reading ==Bianculli, David (September 17, 2009). \"Ted Danson, On Life (And 'Death') After 'Cheers'\". Fresh Air. NPR."}, {"text": "== External links ==Ted Danson at IMDb"}, {"text": "== External links ==Ted Danson at Rotten Tomatoes"}, {"text": "== External links ==Ted Danson at AllMovie"}, {"text": "== External links ==Ted Danson at the Internet Off-Broadway Database"}, {"text": "== External links ==Ted Danson discography at Discogs"}, {"text": "== External links ==\"Actor Ted Danson Headlines Prestigious Group of Alumni Award Winners\". Carnegie Mellon University. 2003."}, {"text": "== External links ==Bruni, Frank (March 19, 2010). \"The Humble Egotist\". The New York Times."}, {"text": "== External links ==Virtel, Louis (July 22, 2014). \"Ted Danson and Zach Galifianakis: Broadway Rock Stars?\". Uproxx."}]