[{"text": "Thomas William Selleck (; born January 29, 1945) is an American actor. His breakout role was playing private investigator Thomas Magnum in the television series Magnum, P.I. (1980–1988), for which he received five Emmy Award nominations for Outstanding Lead Actor in a Drama Series, winning in 1985. Since 2010, Selleck has co-starred as New York City Police Commissioner Frank Reagan in the series Blue Bloods. From 2005–2015, he portrayed troubled small-town police chief Jesse Stone in nine television films based on the Robert B. Parker novels."}, {"text": "In films, Selleck has played bachelor architect Peter Mitchell in Three Men and a Baby (1987) and its sequel Three Men and a Little Lady (1990). He has also appeared in more than 50 other film and television roles since Magnum, P.I., including the films Quigley Down Under, Mr. Baseball, and Lassiter. He appeared in recurring television roles as Monica Geller's love interest Dr. Richard Burke in Friends, as Lance White, the likeable and naive partner on The Rockford Files, and as casino owner A.J. Cooper on Las Vegas. He also had a lead role in the television western film The Sacketts, based on two of Louis L'Amour's books."}, {"text": "Selleck is a California Army National Guard veteran, a spokesman for the National Rifle Association of America (NRA), an endorser in advertisements for National Review magazine, and co-founder of the Character Counts! organization."}, {"text": "=== Family ===Thomas William Selleck was born in Detroit, Michigan, on January 29, 1945, to housewife Martha Selleck (née Jagger) and Robert Dean Selleck, who was an executive and real estate investor. He has an elder brother Robert (born 1944), a younger sister Martha (born 14 Nov 1953), and a younger brother Daniel (born 1956).Selleck is of mostly English descent, although he also has some German ancestry. Through an entirely paternal line, Selleck is a direct descendant of English colonist David Selleck who moved to Massachusetts from Somerset, England in 1633. Through this line, Selleck is of the 11th generation of his family born in North AmericaSelleck's family moved to Sherman Oaks, California in 1948."}, {"text": "=== Education ===Selleck graduated from Grant High School in 1962 and enrolled at Los Angeles Valley College, living at home and saving money. Selleck, who stands 6 feet 4 inches (1.93 m) tall, transferred to the University of Southern California during his junior year to play for the USC Trojans men's basketball team. He also was a pitcher and designated hitter for the USC baseball team. He is a member of Sigma Chi fraternity and a member of the Trojan Knights. While Selleck was majoring in Business Administration, a drama coach suggested he try acting and, in his senior year, he dropped out of the university. Selleck then studied acting at the Beverly Hills Playhouse, under Milton Katselas."}, {"text": "=== California National Guard ===Upon receiving a draft notice during the Vietnam War, Selleck joined the California National Guard. He served in the 160th Infantry Regiment of the California Army National Guard from 1967 to 1973."}, {"text": "=== Early work ===Selleck's first television appearance was as a college senior on The Dating Game in 1965 and again in 1967. Soon after, he appeared in commercials for products such as Pepsi-Cola."}, {"text": "=== Early work ===He began his career with bit parts in smaller movies, including Myra Breckinridge (invited on the set by Mae West), Coma, and The Seven Minutes. He appeared in a number of TV series, mini-series and TV movies. He was also the face of Salem cigarettes and Revlon's Chaz cologne. Selleck appeared in a commercial for Right Guard deodorant in 1971, with Farrah Fawcett in 1972 for the aperitif Dubonnet, and another in 1977 for the toothpaste Close-Up. He was also in a Safeguard deodorant soap commercial (1972). In 1972, he starred in the B-movie Daughters of Satan. He had a recurring role in the 1970s as private investigator Lance White in The Rockford Files."}, {"text": "=== Early work ===Selleck is an avid outdoorsman, marksman and firearms collector. These interests led him to leading-man cowboy roles in Western films, starting with his role as cowboy and frontier marshal Orrin Sackett in the 1979 film The Sacketts, opposite Sam Elliott, Jeff Osterhage, and Western legends Glenn Ford and Ben Johnson, and that same year, Concrete Cowboys with Jerry Reed. The Shadow Riders followed in 1982. Then Selleck shifted gears, portraying a cat burglar in 1930s London in Lassiter in 1984. Quigley Down Under is one of his best-known Western films, but it was for his 1997 role in Last Stand at Saber River that he won a \"Western Heritage Award\"."}, {"text": "=== Magnum stardom ===Selleck's big break came when he was cast in the lead role as Thomas Magnum in Magnum, P.I. The producers would not release the actor for other projects, so Selleck had to pass on the role of Indiana Jones in Raiders of the Lost Ark, which meant that the role went to actor Harrison Ford instead. It turned out that the shooting of the pilot for Magnum was delayed for over six months by a writers' strike, which would have enabled him to complete Raiders."}, {"text": "=== Magnum stardom ===Look, I made a deal with Magnum, and it was the best thing that ever happened to me. I'm proud that I lived up to my contract, and some people said, \"You've got to get into a car and drive into a brick wall and get injured and get out of Magnum and do [Raiders].\" I said, \"I gotta look my mom and dad in the eye, and we don't do that,\" so I did Magnum... That's not so bad, is it?"}, {"text": "=== Magnum stardom ===Selleck played the role of Thomas Magnum in 1980 after filming six other TV pilots that were never sold. Magnum was a former U.S. Navy SEAL officer who had served in the Vietnam War; after the war, Magnum had been in the \"Naval Intelligence Agency\" (a fictional version of the Office of Naval Intelligence) and then resigned from the Navy to become a private investigator living in Hawaii. The show continued until 1988, lasting 8 seasons and 163 episodes, winning him an Emmy Award for Outstanding Lead Actor in a Drama Series in 1984."}, {"text": "=== Magnum stardom ===Selleck was famous for his mustache, a Hawaiian-style aloha shirt and a Detroit Tigers baseball cap."}, {"text": "=== Magnum stardom ===Magnum drove a Ferrari 308 GTS in the series. "}, {"text": "=== Magnum stardom ===After the end of the show in 1988, it established itself as the top-rated one-hour show in the history of syndicated reruns (at least until 1998). Selleck confirmed that he was the most popular choice by fans to play the role of Magnum in the once-rumored Magnum, P.I. movie.In 1984, he introduced Nancy Reagan at the 1984 Republican National Convention.Selleck was offered the lead role of Mitch Buchannon in Baywatch but he turned it down because he did not want to be seen as a sex symbol. The role eventually went to David Hasselhoff.During the Magnum years, he also starred as an acrophobic police detective in Runaway and a stand-in father in Three Men and a Baby, which was the biggest hit at the American box office in 1987. In 1989, he ended the decade by starring in the romantic comedy Her Alibi and crime drama An Innocent Man."}, {"text": "=== TV and advertising ===In 1990, he starred as an American 19th-century sharpshooter in the Australian Western Quigley Down Under, a role and film that he considers one of his best. During the 1990s, he also starred in Three Men and a Little Lady, Folks!, Christopher Columbus: The Discovery, Mr. Baseball, In & Out and The Love Letter. Selleck's role in In & Out is his first as a gay character (Peter Malloy).In the mid-1990s Selleck played the role of Richard Burke, Monica's older boyfriend, beginning at the end of the second season of the TV series Friends. Richard was a divorced ophthalmologist who was a friend of Monica's parents, and at first the relationship was hidden from her parents. The relationship eventually ended over Richard's reluctance to commit to having children, though Selleck did make a few more appearances in later episodes. His decision to star in a six-episode plot of Friends was seen as a digression from the movies back to TV shows and a mistake by his career advisers. Selleck recruited a new agent and accepted the part. This role earned him an Emmy Award nomination in 2000 for Outstanding Guest Actor in a Comedy Series.He did the voice-over for the 1993 AT&T advertising campaigns titled \"You Will.\" These advertisements had a futuristic feel, and posed the question of, \"What if you had the technology to _____? Well, you will ... and the company that will bring it to you? AT&T.\""}, {"text": "=== TV and advertising ===In the mid-1990s Selleck hosted a special series on TLC called The Practical Guide to the Universe, in which he talked about the stars, planets, galaxies, etc."}, {"text": "=== TV and advertising ===In February 1998, he accepted the lead role in a sitcom for CBS called The Closer. This role was his big comeback on prime-time TV. In it he played Jack McLaren, a legendary publicist heading up a brand new marketing firm. His costars included Ed Asner, David Krumholtz, and Penelope Ann Miller. Despite the high pedigree, and the expectations for Selleck's first series since Magnum, P.I., low ratings caused the show to be canceled after ten episodes."}, {"text": "=== TV and advertising ===His last two cowboy roles to date were in the 2001 TNT movie Crossfire Trail (based on a Louis L'Amour novel of the same name), and the 2003 motion picture Monte Walsh. In 2001, Selleck played the lead role of Murray in a Broadway revival of Herb Gardner's comedic play A Thousand Clowns. The production toured for four months, playing in North Carolina, Chicago and Boston before opening on Broadway at the Longacre Theatre. Critics, though far from uniformly negative about Selleck's performance, generally compared it unfavorably to that of Jason Robards, who won awards in the 1960s for playing the character on the stage and in a movie version. The production closed as a result of the attacks on 9/11."}, {"text": "=== TV and advertising ===Selleck played the role of General Dwight D. Eisenhower in A&E's 2004 made-for-TV movie Ike: Countdown to D-Day. The movie showed the planning, politics, and preparation for the 1944 Invasion of Normandy, and Selleck was critically lauded for playing a cool, calm Eisenhower."}, {"text": "=== TV and advertising ===Since 2005, Selleck has starred in the role of transplanted lawman Jesse Stone in a series of made-for-TV movies based on Robert B. Parker's novels. To date, the series comprises nine films, with the most recent released in October 2015. In addition to his portrayal of the films' protagonist, Selleck now acts as producer for the series. The fifth film, Jesse Stone: Thin Ice, was not adapted from Parker's novels, but was instead an original story by Selleck.He joined the cast of the NBC drama Las Vegas in the season-five premiere on September 28, 2007. He played A.J. Cooper, the new owner of the Montecito Casino. He replaced James Caan, who left the cast in the same episode. This was Selleck's first regular role in a drama show since he played Thomas Magnum in Magnum, P.I. As of December 30, 2007, he began doing commercial voice-overs for Florida's Natural orange juice.Since 2010, he has starred as Frank Reagan in the CBS American police procedural/drama series Blue Bloods, filmed on location in New York City. Frank Reagan is the Police Commissioner, and the series follows the Reagan family of police officers with the New York City Police Department. The show premiered on September 24, 2010, and is in its final season as of 2024."}, {"text": "=== TV and advertising ===In 2012, Selleck was featured in Coldwell Banker's television ad campaign focusing on homeownership. On August 1, 2016, reverse-mortgage lender American Advisors Group (AAG) said its new television commercials would have Selleck as the company's new national spokesperson following the death of Fred Thompson, their previous spokesperson. The commercials began running across cable and national networks including ABC, NBC and CBS.Selleck appeared in a recurring role on the acclaimed ABC drama Boston Legal as Ivan Tiggs, the troubled ex-husband of Shirley Schmidt (Candice Bergen)."}, {"text": "=== TV and advertising ===In 2021, Selleck made his album debut singing “Yessir, That’s My Baby” with Nicolas King (recorded live in 2001 during their run of “A Thousand Clowns”) on King's album “Act One” released by Club44 Records."}, {"text": "== Personal life ==From 1971 to 1982, Selleck was married to model Jacqueline Ray. During that time, he adopted her son, Kevin Shepard (born 1966), who would go on to be the drummer for the American rock band Tonic. On August 7, 1987, Selleck married Jillie Joan Mack (born 1957). They have one daughter, Hannah (born December 16, 1988).Selleck and his family live near Thousand Oaks-Westlake Village, California, on a 60-acre (24 ha) avocado ranch in Hidden Valley formerly owned by Dean Martin. In a 2012 interview with People, Selleck talked about living and working on his ranch: \"So I like to get outside and work on the ranch, from fixing roads to clearing brush. I hate going to the gym, so sweating outdoors sure beats sitting on a stationary bike staring at my navel. And I work cheaper than anyone I could hire to do it.\""}, {"text": "== Personal life ==Selleck is an accomplished indoor and beach volleyball player, playing the outside hitter position for the Outrigger Canoe Club, Honolulu. (Son Kevin attended Selleck's alma mater, USC, and became a volleyball team All-American in 1990.) Outrigger Canoe Club teammate Dennis Berg, in the summer 2011 issue of Volleyball USA magazine, said of Selleck, \"Tom was a great teammate, appreciative of being included with such a talented and experienced group, practicing and playing hard when his Magnum schedule permitted.... He was very patient with all of us, and we relished the big crowds that replaced the usual sparse number of players' friends and spouses at the national tourney matches.\"Selleck is an avid ice hockey fan and has been seen attending Los Angeles Kings games at Staples Center. He lists Anže Kopitar and Alexander Frolov as two of his favorite players. He was once a minority owner of the Detroit Tigers, his favorite baseball team since childhood. In 1986, Selleck hit a batting practice home run while working out with the Tigers.  In preparation for his role in the film Mr. Baseball, Selleck reached out to the Tigers to practice with them during the spring of 1991. He took batting practice for three weeks, even making an appearance in an exhibition game against Cincinnati, where Tiger manager Sparky Anderson put him into a game as a pinch-hitter.  He managed to foul off 3 pitches from Reds pitcher Tim Layana before striking out. Selleck believes his training helped him considerably in his film role, having gained valuable experience from attending team meetings and developing an understanding of how competitive players function together.One of Selleck's Magnum co-stars, Larry Manetti, in his 1996 memoir Aloha Magnum, was lavish in his praise of Selleck. Manetti lauded Selleck for his extraordinary work ethic on a grueling show (shooting for hours in the midday Hawaiian sun), Selleck's work with Hawaiian charities, and his willingness to support the program's cast and crew members."}, {"text": "== Personal life ==In February 2009, Selleck joined the Vietnam Veterans Memorial Fund as national spokesman for the new Education Center being built on the National Mall.Upon James Garner's death in 2014, he said, \"Jim was a mentor to me and a friend, and I will miss him.\" Two years after Garner's death, Selleck said, prior to filming his then 6th season of Blue Bloods: \"It's kind of like my mentor, who never wanted to hear he was my mentor [James Garner], I don't accept the mentor role. That they feel that way is, I think flattering although it adds a certain amount of pressure.\""}, {"text": "=== 2015 water lawsuit ===Selleck was sued by the Calleguas Municipal Water District for allegedly improperly transferring approximately 1.4 million gallons of water from the Calleguas Municipal Water District to the Hidden Valley Municipal Water District during the driest California drought since record-keeping began, which he used to water his avocado farm. He settled the suit by paying $21,685.55 to the Calleguas Municipal Water District, an amount which represented the district's private investigator fees in connection with the case."}, {"text": "== Political views ==Selleck has been a member of the board of directors of the National Rifle Association of America and served as a spokesman for the organization. He resigned from the board on September 18, 2018, though he remained a member of the organization. After his close friend Charlton Heston stepped down from his role as an NRA spokesman in 2003, Selleck succeeded him. In 2002, Selleck donated the rifle he used in Quigley Down Under (a custom 13-pound [6 kg], single-shot, 1874 Sharps Rifle, with a 34-inch [86-cm] barrel), along with six other firearms from his other films, to the NRA. The firearms are part of the NRA's exhibit \"Real Guns of Reel Heroes\" at the National Firearms Museum in Fairfax, Virginia.To promote his film The Love Letter, Selleck was invited to be on The Rosie O'Donnell Show on May 19, 1999. During the appearance, O'Donnell questioned Selleck about his support of gun ownership and an ad in which he appeared supporting the NRA. At the end of the interview, Selleck stated, \"It's your show and you can talk about it after I leave.\" Selleck later confided to Shaun Robinson: \"I still like Rosie. I think she needs to take a deep breath and stop thinking everybody who disagrees with her is evil.\"For a number of years, Selleck appeared in television advertising for National Review. He also subscribes to The New Republic. Selleck describes himself as \"a registered independent with a lot of libertarian leanings.\"In the 2016 presidential election, Selleck did not support either Hillary Clinton or Donald Trump, instead writing in former Dallas Police Department Chief David Brown, saying that he was deeply touched by the grace and leadership Brown showed through the 2016 Dallas police shooting."}, {"text": "== Awards and honors ==On April 28, 2000, Selleck received an honorary doctorate degree from Pepperdine University. He was chosen because of his outstanding character and ethic. He is a board member of the non-profit Joseph and Edna Josephson Institute of Ethics and co-founder of the Character Counts Coalition. He received a Star on the Hollywood Walk of Fame in 1986. The star is situated at 6925 Hollywood Blvd. In 1989, he received the Golden Plate Award of the American Academy of Achievement."}, {"text": "== External links ==Tom Selleck at IMDb "}, {"text": "== External links ==Tom Selleck at the TCM Movie Database "}, {"text": "== External links ==Tom Selleck at the Internet Broadway Database "}, {"text": "== External links ==Tom Selleck at Emmys.com "}, {"text": "== External links ==Appearances on C-SPAN"}]