[{"text": "Sir Anthony Charles Lynton Blair  (born 6 May 1953) is a British politician who served as Prime Minister of the United Kingdom from 1997 to 2007 and Leader of the Labour Party from 1994 to 2007. He served as Leader of the Opposition from 1994 to 1997 and held various shadow cabinet posts from 1987 to 1994. Blair was Member of Parliament (MP) for Sedgefield from 1983 to 2007. He is the second-longest-serving prime minister in post-war British history (after Margaret Thatcher) and the longest-serving Labour Prime Minister."}, {"text": "Blair attended Fettes College, studied law at St John's College, Oxford, and became a barrister. He joined the Labour Party and was elected to the House of Commons in 1983 for the Sedgefield constituency in County Durham. As a backbencher, Blair supported moving the party to the political centre of British politics. He was appointed to Neil Kinnock's shadow cabinet in 1988 and was appointed shadow home secretary by John Smith in 1992. Following Smith's death in 1994, Blair won the leadership election to succeed him. As leader, Blair began a historic rebranding of the party, which became known as \"New Labour\"."}, {"text": "Blair became the youngest Prime Minister of the 20th century after winning the 1997 general election, Labour's largest general election victory in history. During his first term, Blair significantly increased public spending on healthcare and education, introduced controversial market-based reforms, a minimum wage, university tuition fees, devolution in Scotland and Wales, an extensive expansion of LGBT rights in the UK and significant progress in the Northern Ireland peace process with the passing of the Good Friday Agreement. On foreign policy, Blair oversaw British interventions in Kosovo in 1999 and Sierra Leone in 2000, which were generally perceived to be successful. Blair was re-elected in a second landslide in 2001. Three months into his second term, the 9/11 terrorist attacks hit the United States, starting the war on terror. Blair supported the foreign policy of U.S. President George W. Bush by ensuring that the British Armed Forces participated in the War in Afghanistan to overthrow the Taliban, destroy al-Qaeda and capture Osama bin Laden. In 2003, Blair supported the invasion of Iraq and had the British Armed Forces participate in the Iraq War, believing Saddam Hussein's regime possessed weapons of mass destruction and had developed close ties with al-Qaeda."}, {"text": "Blair was re-elected in 2005, in part thanks to the UK's strong economic performance, but with a substantially reduced majority, due to the UK's involvement in the Iraq War. During his third term, Blair pushed for more systemic public sector reform and brokered a settlement to restore powersharing to Northern Ireland. The Afghanistan and Iraq wars continued, and in 2006, Blair announced he would resign within a year. He resigned as Leader of the Labour Party on 24 June 2007 and as Prime Minister on 27 June, and was succeeded in both posts by Gordon Brown, his chancellor. After leaving office, Blair gave up his seat in the House of Commons and was appointed special envoy of the Quartet on the Middle East, a diplomatic post he held until 2015. He has been the executive chairman of the Tony Blair Institute for Global Change since 2016 and has made occasional political interventions. He was knighted by Elizabeth II as a Knight Companion of the Garter in 2022."}, {"text": "Throughout his premiership, Blair has been considered the most popular and unpopular Prime Minister in British history. During his time in office, he achieved the highest recorded approval ratings in his first term but also one of the lowest ratings during and in the aftermath of the Iraq War."}, {"text": "== Early years ==Anthony Charles Lynton Blair was born on 6 May 1953 at Queen Mary Maternity Home in Edinburgh, Scotland. He was the second son of Leo and Hazel (née Corscadden) Blair. Leo Blair was the illegitimate son of two entertainers and was adopted as a baby by the Glasgow shipyard worker James Blair and his wife, Mary. Hazel Corscadden was the daughter of George Corscadden, a butcher and Orangeman who moved to Glasgow in 1916. In 1923, he returned to Ballyshannon, County Donegal, in Ulster. In Ballyshannon, Corscadden's wife, Sarah Margaret (née Lipsett), gave birth above the family's shop to Blair's mother, Hazel."}, {"text": "== Early years ==Blair has an elder brother, William, and a younger sister, Sarah. Blair's first home was with his family at Paisley Terrace in the Willowbrae area of Edinburgh. During this period, his father worked as a junior tax inspector whilst studying for a law degree from the University of Edinburgh."}, {"text": "== Early years ==Blair's first relocation was when he was nineteen months old. In 1954, Blair's parents and their two sons moved from Paisley Terrace to Adelaide, South Australia. His father became a law professor at the University of Adelaide. In Australia, Blair's sister, Sarah, was born. The Blairs lived in the suburb of Dulwich close to the university. The family returned to the United Kingdom in mid-1958. They lived for a time with Hazel's mother and stepfather (William McClay) at their home in Stepps on the outskirts of north-east Glasgow. Blair's father accepted a job as a professor at Durham University, and moved the family to Durham, England, when Blair was five. It was the beginning of a long association Blair was to have with Durham."}, {"text": "== Early years ==Since childhood, Blair has been a fan of Newcastle United football club."}, {"text": "== Education and legal career ==Now living in Durham, Blair attended Chorister School from 1961 to 1966. Aged 13, he enrolled at Fettes College in Edinburgh, staying there for five years. According to Blair, he hated his time at Fettes. His teachers were unimpressed with him, his biographer, John Rentoul, reported that \"all the teachers I spoke to when researching the book said he was a complete pain in the backside and they were very glad to see the back of him.\" Blair modelled himself on Mick Jagger, lead singer of the Rolling Stones. Leaving Fettes College at the age of 18, Blair spent a gap year in London working as a rock music promoter."}, {"text": "== Education and legal career ==In 1972, at the age of 19, Blair matriculated at St John's College, Oxford, studyingl jurisprudence for three years. As a student, he played guitar and sang in a rock band called Ugly Rumours, and performed stand-up comedy. He was influenced by fellow student and Anglican priest Peter Thomson, who awakened his religious faith and left-wing politics. While at Oxford, Blair has stated that he was briefly a Trotskyist, after reading the first volume of Isaac Deutscher's biography of Leon Trotsky, which was \"like a light going on\". He graduated from Oxford at the age of 22 in 1975 with a second-class Honours B.A. in jurisprudence."}, {"text": "== Education and legal career ==In 1975, while Blair was at Oxford, his mother Hazel died aged 52 of thyroid cancer, which greatly affected him."}, {"text": "== Education and legal career ==After Oxford, Blair served his barrister pupillage at Lincoln's Inn, where he was called to the Bar. He met his future wife, Cherie Booth, at the chambers founded by Derry Irvine (who was to be Blair's first lord chancellor), 11 King's Bench Walk Chambers."}, {"text": "== Early political career ==Blair joined the Labour Party shortly after graduating from Oxford in 1975. In the early 1980s, he was involved in Labour politics in Hackney South and Shoreditch, where he aligned himself with the \"soft left\" of the party. He stood as a candidate for the Hackney council elections of 1982 in Queensbridge ward, a safe Labour area, but was not selected."}, {"text": "== Early political career ==In 1982, Blair was selected as the Labour Party candidate for the safe Conservative seat of Beaconsfield, where there was a forthcoming by-election. Although Blair lost the Beaconsfield by-election and Labour's share of the vote fell by 10 percentage points, he acquired a profile within the party. Despite his defeat, William Russell, political correspondent for The Glasgow Herald, described Blair as \"a very good candidate\", while acknowledging that the result was \"a disaster\" for the Labour Party. In contrast to his later centrism, Blair made it clear in a letter he wrote to Labour leader Michael Foot in July 1982 (published in  2006) that he had \"come to Socialism through Marxism\" and considered himself on the left. Like Tony Benn, Blair believed that the \"Labour right\" was bankrupt, saying \"[s]ocialism ultimately must appeal to the better minds of the people. You cannot do that if you are tainted overmuch with a pragmatic period in power.\" Yet, he saw the hard left as no better, saying:"}, {"text": "== Early political career ==There is an arrogance and self-righteousness about many of the groups on the far left which is deeply unattractive to the ordinary would-be member ... There's too much mixing only with people [with] whom they agree."}, {"text": "== Early political career ==With a general election due, Blair had not been selected as a candidate anywhere. He was invited to stand again in Beaconsfield, and was initially inclined to agree but was advised by his head of chambers Derry Irvine to find somewhere else which might be winnable. The situation was complicated by the fact that Labour was fighting a legal action against planned boundary changes, and had selected candidates on the basis of previous boundaries. When the legal challenge failed, the party had to rerun all selections on the new boundaries; most were based on existing seats, but unusually in County Durham a new Sedgefield constituency had been created out of Labour-voting areas which had no obvious predecessor seat."}, {"text": "== Early political career ==The selection for Sedgefield did not begin until after the 1983 general election was called. Blair's initial inquiries discovered that the left was trying to arrange the selection for Les Huckfield, sitting MP for Nuneaton who was trying elsewhere; several sitting MPs displaced by boundary changes were also interested in it. When he discovered the Trimdon branch had not yet made a nomination, Blair visited them and won the support of the branch secretary John Burton, and with Burton's help was nominated by the branch. At the last minute, he was added to the shortlist and won the selection over Huckfield. It was the last candidate selection made by Labour before the election, and was made after the Labour Party had issued biographies of all its candidates (\"Labour's Election Who's Who\")."}, {"text": "== Early political career ==John Burton became Blair's election agent and one of his most trusted and longest-standing allies. Blair's election literature in the 1983 general election endorsed left-wing policies that Labour advocated in the early 1980s. He called for Britain to leave the EEC as early as the 1970s, though he had told his selection conference that he personally favoured continuing membership and voted \"Yes\" in the 1975 referendum on the subject. He opposed the Exchange Rate Mechanism (ERM) in 1986 but supported the ERM by 1989. He was a member of the Campaign for Nuclear Disarmament, despite never strongly being in favour of unilateral nuclear disarmament. Blair was helped on the campaign trail by soap opera actress Pat Phoenix, his father-in-law's girlfriend. At the age of thirty, he was elected as MP for Sedgefield in 1983; despite the party's landslide defeat at the general election."}, {"text": "== Early political career ==In his maiden speech in the House of Commons on 6 July 1983, Blair stated, \"I am a socialist not through reading a textbook that has caught my intellectual fancy, nor through unthinking tradition, but because I believe that, at its best, socialism corresponds most closely to an existence that is both rational and moral. It stands for cooperation, not confrontation; for fellowship, not fear. It stands for equality.\""}, {"text": "== Early political career ==Once elected, Blair's political ascent was rapid. He received his first front-bench appointment in 1984 as assistant Treasury spokesman. In May 1985, he appeared on BBC's Question Time, arguing that the Conservative Government's Public Order White Paper was a threat to civil liberties."}, {"text": "== Early political career ==Blair demanded an inquiry into the Bank of England's decision to rescue the collapsed Johnson Matthey bank in October 1985. By this time, Blair was aligned with the reforming tendencies in the party (headed by leader Neil Kinnock) and in 1988 was promoted to the shadow Trade and Industry team as spokesman on the City of London."}, {"text": "=== Leadership roles ===In 1987, he stood for election to the Shadow Cabinet, receiving 71 votes. When Kinnock resigned after a fourth consecutive Conservative victory in the 1992 general election, Blair became shadow home secretary under John Smith. The old guard argued that trends showed they were regaining strength under Smith's strong leadership.  Meanwhile, the breakaway SDP faction had merged with the Liberal Party; the resulting Liberal Democrats seemed to pose a major threat to the Labour base. Blair, the leader of the modernising faction, had an entirely different vision, arguing that the long-term trends had to be reversed. The Labour Party was too locked into a base that was shrinking, since it was based on the working-class, on trade unions, and on residents of subsidised council housing. The rapidly growing middle-class was largely ignored, especially the more ambitious working-class families. They aspired to middle-class status but accepted the Conservative argument that Labour was holding ambitious people back with its levelling-down policies. They increasingly saw Labour in terms defined by the opposition, regarding higher taxes and higher interest rates. The steps towards what would become New Labour were procedural but essential. Calling on the slogan \"One member, one vote\", John Smith (with limited input from Blair) secured an end to the trade union block vote for Westminster candidate selection at the 1993 conference. But Blair and the modernisers wanted Smith to go further still, and called for radical adjustment of Party goals by repealing \"Clause IV\", the historic commitment to nationalisation of industry. This would be achieved in 1995."}, {"text": "=== Leader of the Opposition ===John Smith died suddenly in 1994 of a heart attack. Blair defeated John Prescott and Margaret Beckett in the subsequent leadership election and became Leader of the Opposition. As is customary for the holder of that office, Blair was appointed a Privy Counsellor."}, {"text": "=== Leader of the Opposition ===During his speech at the 1994 Labour Party conference, Blair announced a forthcoming proposal to update the party's objects and objectives, which was widely interpreted to relate to replacing Clause IV of the party's constitution with a new statement of aims and values. This involved the deletion of the party's stated commitment to \"the common ownership of the means of production and exchange\", which was generally understood to mean wholesale nationalisation of major industries. At a special conference in April 1995, the clause was replaced by a statement that the party is \"democratic socialist\", and Blair also claimed to be a \"democratic socialist\" himself in the same year. However, the move away from nationalisation in the old Clause IV made many on the left wing of the Labour Party feel that Labour was moving away from traditional socialist principles of nationalisation set out in 1918, and was seen by them as part of a shift of the party towards \"New Labour\"."}, {"text": "=== Leader of the Opposition ===He inherited the Labour leadership at a time when the party was ascendant over the Conservatives in the opinion polls, since the Conservative government's reputation in monetary  policy was left in tatters by the Black Wednesday economic disaster of September 1992. Blair's election as leader saw Labour support surge higher still in spite of the continuing economic recovery and fall in unemployment that the Conservative government (led by John Major) had overseen since the end of the 1990–92 recession. At the 1996 Labour Party conference, Blair stated that his three top priorities on coming to office were \"education, education, and education\"."}, {"text": "=== Leader of the Opposition ===Aided by the unpopularity of John Major's Conservative government (itself deeply divided over the European Union), \"New Labour\" won a landslide victory at the 1997 general election, ending eighteen years of Conservative Party rule, with the heaviest Conservative defeat since 1906."}, {"text": "=== Leader of the Opposition ===According to diaries released by Paddy Ashdown, during Smith's leadership of the Labour Party, there were discussions with Ashdown about forming a coalition government if the next general election resulted in a hung parliament. Ashdown also claimed that Blair was a supporter of proportional representation (PR). In addition to Ashdown, Liberal Democrat MPs Menzies Campbell and Alan Beith were earmarked for places in the cabinet if a Labour-Lib Dem coalition was formed. Blair was forced to back down on these proposals because John Prescott and Gordon Brown opposed the PR system, and many members of the Shadow Cabinet were worried about concessions being made towards the Lib Dems. In the event, virtually every opinion poll since late-1992 put Labour ahead with enough support to form an overall majority."}, {"text": "== Prime Minister (1997–2007) ==Blair became Prime Minister of the United Kingdom on 2 May 1997; aged 43, he was the youngest person to reach that office since Lord Liverpool became prime minister aged 42 in 1812. He was also the first prime minister born after the Second World War and the accession of Elizabeth II to the throne. With victories in 1997, 2001, and 2005, Blair was the Labour Party's longest-serving prime minister, and the first person (and the only one, to date) to lead the party to three consecutive general election victories."}, {"text": "=== Northern Ireland ===His contribution towards assisting the Northern Ireland peace process by helping to negotiate the Good Friday Agreement (after 30 years of conflict) was widely recognised. Following the Omagh bombing on 15 August 1998, by members of the Real IRA opposed to the peace process, which killed 29 people and wounded hundreds, Blair visited the County Tyrone town and met with victims at Royal Victoria Hospital, Belfast."}, {"text": "=== Military intervention and the War on Terror ===In his first six years in office, Blair ordered British troops into combat five times, more than any other prime minister in British history. This included Iraq in both 1998 and 2003, Kosovo (1999), Sierra Leone (2000) and Afghanistan (2001)."}, {"text": "=== Military intervention and the War on Terror ===The Kosovo War, which Blair had advocated on moral grounds, was initially a failure when it relied solely on air strikes; the threat of a ground offensive convinced Serbia's Slobodan Milošević to withdraw. Blair had been a major advocate for a ground offensive, which Bill Clinton was reluctant to do, and ordered that 50,000 soldiers – most of the available British Army – should be made ready for action. The following year, the limited Operation Palliser in Sierra Leone swiftly swung the tide against the rebel forces; before deployment, the United Nations Mission in Sierra Leone had been on the verge of collapse. Palliser had been intended as an evacuation mission but Brigadier David Richards was able to convince Blair to allow him to expand the role; at the time, Richards' action was not known and Blair was assumed to be behind it."}, {"text": "=== Military intervention and the War on Terror ===Blair ordered Operation Barras, a highly successful SAS/Parachute Regiment strike to rescue hostages from a Sierra Leone rebel group. Journalist Andrew Marr has argued that the success of ground attacks, real and threatened, over air strikes alone was influential on how Blair planned the Iraq War, and that the success of the first three wars Blair fought \"played to his sense of himself as a moral war leader\". When asked in 2010 if the success of Palliser may have \"embolden[ed] British politicians\" to think of military action as a policy option, General Sir David Richards admitted there \"might be something in that\"."}, {"text": "=== Military intervention and the War on Terror ===From the start of the War on Terror in 2001, Blair strongly supported the foreign policy of George W. Bush, participating in the 2001 invasion of Afghanistan and 2003 invasion of Iraq. The invasion of Iraq was particularly controversial, as it attracted widespread public opposition and 139 of Blair's own MPs opposed it."}, {"text": "=== Military intervention and the War on Terror ===As a result, he faced criticism over the policy itself and the circumstances of the decision. Alastair Campbell described Blair's statement that the intelligence on WMDs was \"beyond doubt\" as his \"assessment of the assessment that was given to him.\" In 2009, Blair stated that he would have supported removing Saddam Hussein from power even in the face of proof that he had no such weapons. Playwright Harold Pinter and former Malaysian prime minister Mahathir Mohamad accused Blair of war crimes."}, {"text": "=== Military intervention and the War on Terror ===Testifying before the Iraq Inquiry on 29 January 2010, Blair said Saddam was a \"monster and I believe he threatened not just the region but the world.\" Blair said that British and American attitude towards Saddam Hussein had \"changed dramatically\" after the 11 September attacks. Blair denied that he would have supported the invasion of Iraq even if he had thought Saddam had no weapons of mass destruction. He said he believed the world was safer as a result of the invasion. He said there was \"no real difference between wanting regime change and wanting Iraq to disarm: regime change was US policy because Iraq was in breach of its UN obligations.\" In an October 2015 CNN interview with Fareed Zakaria, Blair apologised for his \"mistakes\" over Iraq War and admitted there were \"elements of truth\" to the view that the invasion helped promote the rise of ISIS. The Chilcot Inquiry report of 2016 gave a damning assessment of Blair's role in the Iraq War, though the former prime minister again refused to apologise for his decision to back the US-led invasion."}, {"text": "=== Relationship with Parliament ===One of Blair's first acts as prime minister was to replace the then twice-weekly 15-minute sessions of Prime Minister's Questions held on Tuesdays and Thursdays with a single 30-minute session on Wednesdays. In addition to PMQs, Blair held monthly press conferences at which he fielded questions from journalists and – from 2002 – broke precedent by agreeing to give evidence twice yearly before the most senior Commons select committee, the Liaison Committee. Blair was sometimes perceived as paying insufficient attention both to the views of his own Cabinet colleagues and to those of the House of Commons. His style was sometimes criticised as not that of a prime minister and head of government, which he was, but of a president and head of state – which he was not. Blair was accused of excessive reliance on spin. He was the first UK prime minister to have been formally questioned by police, though not under caution, while still in office."}, {"text": "=== Events before resignation ===As the casualties of the Iraq War mounted, Blair was accused of misleading Parliament, and his popularity dropped as a result, with Labour's overall majority at the 2005 election reduced from 167 to 66 seats. As a combined result of the Blair–Brown pact, the Iraq War and low approval ratings, pressure built up within the Labour Party for Blair to resign. Over the summer of 2006, many MPs criticised Blair for not calling for a ceasefire in the Israel–Lebanon conflict. On 7 September 2006, Blair publicly stated he would step down as leader by the time of the Trades Union Congress conference held from 10 to 13 September 2007, despite promising to serve a full term during the previous general election campaign. On 10 May 2007, during a speech at the Trimdon Labour Club, Blair announced his intention to resign as both Labour leader and prime minister, triggering a leadership election in which Brown was the only candidate."}, {"text": "=== Events before resignation ===At a special party conference in Manchester on 24 June 2007, Blair formally handed over the leadership of the Labour Party to Brown, who had been Chancellor of the Exchequer in Blair's three ministries. Blair tendered his resignation as prime minister on 27 June and Brown assumed office the same afternoon. Blair resigned from his Sedgefield seat in the traditional form of accepting the Stewardship of the Chiltern Hundreds, to which he was appointed by Brown in one of the latter's last acts as chancellor; the resulting by-election was won by Labour candidate Phil Wilson. Blair decided not to issue a list of Resignation Honours, making him the first prime minister of the modern era not to do so."}, {"text": "== Policies ==In 2001, Blair said, \"We are a left of centre party, pursuing economic prosperity and social justice as partners and not as opposites\". Blair rarely applies such labels to himself, but he promised before the 1997 election that New Labour would govern \"from the radical centre\", and according to one lifelong Labour Party member, has always described himself as a social democrat. However, in a 2007 opinion piece in The Guardian, left-wing commentator Neil Lawson described Blair as to the right of centre. A YouGov opinion poll in 2005 found that a small majority of British voters, including many New Labour supporters, placed Blair on the right of the political spectrum. The Financial Times on the other hand has argued that Blair is not conservative, but instead a populist."}, {"text": "== Policies ==Critics and admirers tend to agree that Blair's electoral success was based on his ability to occupy the centre ground and appeal to voters across the political spectrum, to the extent that he has been fundamentally at odds with traditional Labour Party values. Some left-wing critics, such as Mike Marqusee in 2001, argued that Blair oversaw the final stage of a long term shift of the Labour Party to the right."}, {"text": "== Policies ==There is some evidence that Blair's long term dominance of the centre forced his Conservative opponents to shift a long distance to the left to challenge his hegemony there. Leading Conservatives of the post-New Labour era hold Blair in high regard: George Osborne describes him as \"the master\", Michael Gove thought he had an \"entitlement to conservative respect\" in February 2003, while David Cameron reportedly maintained Blair as an informal adviser."}, {"text": "=== Social reforms ===Blair introduced significant constitutional reforms; promoted new rights for gay people; and signed treaties integrating Britain more closely with the EU. With specifical regards to Blair's LGBTQ+ reforms, Blair introduced the Civil Partnership Act 2004 which granted civil partners rights and responsibilities similar to those in civil marriages, equalised the age of consent between straight and gay couples, ended the ban on gay people serving in the British military, introduced the Gender Recognition Act 2004 which allows those with gender dysphoria to legally change their gender, repealed Section 28, gave gay couples the right to adopt and enacted several anti-discrimination policies into law. In 2014 he was proclaimed a 'gay icon' by the Gay Times."}, {"text": "=== Social reforms ===The New Labour government increased police powers by adding to the number of arrestable offences, compulsory DNA recording and the use of dispersal orders. Under Blair's government the amount of new legislation increased which attracted criticism. He also introduced tough anti-terrorism and identity card legislation."}, {"text": "=== Economic policies ===Tony Blair has been credited with overseeing a strong economy, with real incomes of British citizens growing 18% between 1997 and 2006. Britain saw rapid productivity growth and significant GDP growth, as well as falling poverty rates and inequality which, despite stubbornly failing to fall, stalled thanks to New Labour's economic policies (such as tax credits). Despite the financial bubble developing in the property markets, studies have credited the growth to investments in education and the maintenance of fiscal responsibility, rather than a financial sugar-high."}, {"text": "=== Economic policies ===During his time as prime minister, Blair kept direct taxes low, while raising indirect taxation; invested a significant amount in Human capital; introduced a National Minimum Wage and some new employment rights (while keeping Margaret Thatcher's trade union reforms). He introduced substantial market-based reforms in the education and health sectors; introduced student tuition fees; introduced a welfare to work scheme and sought to reduce certain categories of welfare payments. He did not reverse the privatisation of the railways enacted by his predecessor John Major and instead strengthened regulation (by creating the Office of Rail Regulation) and limited fare rises to inflation +1%."}, {"text": "=== Economic policies ===Blair and Brown raised spending on the NHS and other public services, increasing spending from 39.9% of GDP to 48.1% in 2010–11. They pledged in 2001 to bring NHS spending to the levels of other European countries, and doubled spending in real terms to over £100 billion in England alone."}, {"text": "=== Immigration ===Non-European immigration rose significantly during the period from 1997, not least because of the government's abolition of the primary purpose rule in June 1997. This change made it easier for UK residents to bring foreign spouses into the country. The former government advisor Andrew Neather in the Evening Standard stated that the deliberate policy of ministers from late 2000 until early 2008 was to open up the UK to mass migration. Neather later stated that his words had been twisted, saying: \"The main goal was to allow in more migrant workers at a point when – hard as it is to imagine now – the booming economy was running up against skills shortages.... Somehow this has become distorted by excitable Right-wing newspaper columnists into being a \"plot\" to make Britain multicultural. There was no plot.\""}, {"text": "=== Environmental record ===Blair criticised other governments for not doing enough to solve global climate change. In a 1997 visit to the United States, he made a comment on \"great industrialised nations\" that fail to reduce greenhouse gas emissions. Again in 2003, Blair went before the United States Congress and said that climate change \"cannot be ignored\", insisting \"we need to go beyond even Kyoto.\" Blair and his party promised a 20% reduction in carbon dioxide. The Labour Party also claimed that by 2010 10% of the energy would come from renewable resources; however, it only reached 7% by that point."}, {"text": "=== Environmental record ===In 2000, Blair \"flagged up\" 100 million euros for green policies and urged environmentalists and businesses to work together."}, {"text": "=== Foreign policy ===Blair built his foreign policy on basic principles (close ties with U.S. and E.U.) and added a new activist philosophy of \"interventionism\". In 2001, Britain joined the U.S. in the global war on terror."}, {"text": "=== Foreign policy ===Blair forged friendships with several European leaders, including Silvio Berlusconi of Italy, Angela Merkel of Germany and later Nicolas Sarkozy of France."}, {"text": "=== Foreign policy ===Along with enjoying a close relationship with Bill Clinton, Blair formed a strong political alliance with George W. Bush, particularly in the area of foreign policy. For his part, Bush lauded Blair and the UK. In his post-9/11 speech, for example, he stated that \"America has no truer friend than Great Britain\"."}, {"text": "=== Foreign policy ===The alliance between Bush and Blair seriously damaged Blair's standing in the eyes of Britons angry at American influence; a 2002 poll revealed that a large amount of Britons viewed Blair as a \"lapdog\" of Bush. Blair argued it was in Britain's interest to \"protect and strengthen the bond\" with the United States regardless of who was in the White House."}, {"text": "=== Foreign policy ===However, a perception of one-sided compromising personal and political closeness led to discussion of the term \"Poodle-ism\" in the UK media, to describe the \"Special Relationship\" of the UK government and prime minister with the US White House and president. A revealing conversation between Bush and Blair, with the former addressing the latter as \"Yo [or Yeah], Blair\" was recorded when they did not know a microphone was live at the G8 summit in Saint Petersburg in 2006."}, {"text": "==== Middle East policy ====On 30 January 2003, Blair signed The letter of the eight supporting U.S. policy on Iraq."}, {"text": "==== Middle East policy ====Blair showed a deep feeling for Israel, born in part from his faith. Blair has been a longtime member of the pro-Israel lobby group Labour Friends of Israel."}, {"text": "==== Middle East policy ====In 1994, Blair forged close ties with Michael Levy, a leader of the Jewish Leadership Council. Levy ran the Labour Leader's Office Fund to finance Blair's campaign before the 1997 election and raised £12 million towards Labour's landslide victory, Levy was rewarded with a peerage, and in 2002, Blair appointed Lord Levy as his personal envoy to the Middle East. Levy praised Blair for his \"solid and committed support of the State of Israel\". Tam Dalyell, while Father of the House of Commons, suggested in 2003 that Blair's foreign policy decisions were unduly influenced by a \"cabal\" of Jewish advisers, including Levy, Peter Mandelson and Jack Straw (the last two are not Jewish but have some Jewish ancestry)."}, {"text": "==== Middle East policy ====Blair, on coming to office, had been \"cool towards the right-wing Netanyahu government\". During his first visit to Israel, Blair thought the Israelis bugged him in his car. After the election in 1999 of Ehud Barak, with whom Blair forged a close relationship, he became much more sympathetic to Israel. From 2001, Blair built up a relationship  with Barak's successor, Ariel Sharon, and responded positively to Arafat, whom he had met thirteen times since becoming prime minister and regarded as essential to future negotiations. In 2004, 50 former diplomats, including ambassadors to Baghdad and Tel Aviv, stated they had \"watched with deepening concern\" at Britain following the US into war in Iraq in 2003. They criticised Blair's support for the road map for peace which included the retaining of Israeli settlements on the West Bank."}, {"text": "==== Middle East policy ====In 2006 Blair was criticised for his failure to immediately call for a ceasefire in the 2006 Lebanon War. The Observer newspaper claimed that at a cabinet meeting before Blair left for a summit with Bush on 28 July 2006, a significant number of ministers pressured Blair to publicly criticise Israel over the scale of deaths and destruction in Lebanon. Blair was criticised for his solid stance alongside US president George W. Bush on Middle East policy."}, {"text": "==== Syria and Libya ====A Freedom of Information request by The Sunday Times in 2012 revealed that Blair's government considered knighting Syria's President Bashar al-Assad. The documents showed Blair was willing to appear alongside Assad at a joint press conference even though the Syrians would probably have settled for a farewell handshake for the cameras; British officials sought to manipulate the media to portray Assad in a favourable light; and Blair's aides tried to help Assad's \"photogenic\" wife Asma al-Assad boost her profile. The newspaper noted:"}, {"text": "==== Syria and Libya ====The Arab leader was granted audiences with the Queen and the Prince of Wales, lunch with Blair at Downing Street, a platform in parliament and many other privileges ... The red carpet treatment he and his entourage received is embarrassing given the bloodbath that has since taken place under his rule in Syria ... The courtship has parallels with Blair's friendly relations with Muammar Gaddafi."}, {"text": "==== Syria and Libya ====Blair had been on friendly terms with Colonel Gaddafi, the leader of Libya, when sanctions imposed on the country were lifted by the US and the UK."}, {"text": "==== Syria and Libya ====Even after the Libyan Civil War in 2011, he said he had no regrets about his close relationship with the late Libyan leader. During Blair's premiership, MI6 rendered Abdelhakim Belhaj to the Gaddafi regime in 2004, though Blair later claimed he had \"no recollection\" of the incident."}, {"text": "==== Zimbabwe ====Blair had an antagonistic relationship with Zimbabwean president Robert Mugabe and allegedly planned regime change against Mugabe in the early 2000s. Zimbabwe had embarked on a program of uncompensated land redistribution from the country's white commercial farmers to the black population, a policy that disrupted agricultural production and threw Zimbabwe's economy into chaos. General Charles Guthrie, the Chief of the Defence Staff, revealed in 2007 that he and Blair had discussed the invasion of Zimbabwe. Guthrie advised against military action: \"Hold hard, you'll make it worse.\" In 2013, South African president Thabo Mbeki said that Blair had pressured South Africa to join in a \"regime change scheme, even to the point of using military force\" in Zimbabwe. Mbeki refused because he felt that \"Mugabe is part of the solution to this problem.\" However, a spokesman for Blair said that \"he never asked anyone to plan or take part in any such military intervention.\""}, {"text": "==== Russia ====Blair went on a trip to Moscow to watch a performance of the War and Peace opera with Vladimir Putin, while he was the acting president of Russia. This meeting was criticised by groups such as Human Rights Watch and Amnesty International. In 2018, Sir Richard Dearlove, former head of MI6, said there was \"significant regret\" over this trip, which helped Putin rise to power. Dearlove also alleged that in 2000, a KGB officer approached him, seeking Britain's help in boosting Putin's political profile, and this was why Blair met Putin in Russia."}, {"text": "==== Russia ====Blair also hosted Putin in London in April 2000, despite hesitation towards Putin from other world leaders, and opposition from human rights groups over atrocities committed in Chechnya. Blair told Jim Hoagland of The Washington Post that \"[Putin's] vision of the future is one that we would feel comfortable with. Putin has a very clear agenda of modernizing Russia. When he talks of a strong Russia, he means strength not in a threatening way but in a way that means the country economically and politically is capable of standing up for itself, which is a perfectly good aim to have\". During the meeting, Blair acknowledged and discussed \"concerns about Chechnya\", but described Putin as a political reformer \"who is ready to embrace a new relationship with the European Union and the United States, who wants a strong and modern Russia and a strong relationship with the West\"."}, {"text": "=== Rupert Murdoch ===Blair was reported by The Guardian in 2006 to have been supported politically by Rupert Murdoch, the founder of the News Corporation organisation. In 2011, Blair became godfather to one of Rupert Murdoch's children with Wendi Deng, but he and Murdoch later ended their friendship, in 2014, after Murdoch suspected him of having an affair with Deng while they were still married, according to The Economist magazine."}, {"text": "=== Contacts with UK media proprietors ===A Cabinet Office freedom of information response, released the day after Blair handed over power to Gordon Brown, documents Blair having various official phone calls and meetings with Rupert Murdoch of News Corporation and Richard Desmond of Northern and Shell Media."}, {"text": "=== Contacts with UK media proprietors ===The response includes contacts \"clearly of an official nature\" in the specified period, but excludes contacts \"not clearly of an official nature.\" No details were given of the subjects discussed. In the period between September 2002 and April 2005, Blair and Murdoch are documented speaking 6 times; three times in the 9 days before the Iraq War, including the eve of 20 March US and UK invasion, and on 29 January 25 April and 3 October 2004. Between January 2003 and February 2004, Blair had three meetings with Richard Desmond; on 29 January and 3 September 2003 and 23 February 2004."}, {"text": "=== Contacts with UK media proprietors ===The information was disclosed after a 3+1⁄2-year battle by the Liberal Democrats' Lord Avebury. Lord Avebury's initial October 2003 information request was dismissed by then leader of the Lords, Baroness Amos. A following complaint was rejected, with Downing Street claiming the information compromised free and frank discussions, while Cabinet Office claimed releasing the timing of the PM's contacts with individuals is undesirable, as it might lead to the content of the discussions being disclosed. While awaiting a following appeal from Lord Avebury, the cabinet office announced that it would release the information. Lord Avebury said: \"The public can now scrutinise the timing of his (Murdoch's) contacts with the former prime minister, to see whether they can be linked to events in the outside world.\""}, {"text": "=== Contacts with UK media proprietors ===Blair appeared before the Leveson Inquiry on Monday 28 May 2012. During his appearance, a protester, later named as David Lawley-Wakelin, got into the court-room and claimed he was guilty of war crimes before being dragged out."}, {"text": "=== Media portrayal ===Blair has been noted as a charismatic, articulate speaker with an informal style. Film and theatre director Richard Eyre opined that \"Blair had a very considerable skill as a performer\". A few months after becoming prime minister Blair gave a tribute to Diana, Princess of Wales, on the morning of her death in August 1997, in which he famously described her as \"the People's Princess\"."}, {"text": "=== Media portrayal ===After taking office in 1997, Blair gave particular prominence to his press secretary, who became known as the prime minister's official spokesman (the two roles have since been separated). Blair's first PMOS was Alastair Campbell, who served in that role from May 1997 to 8 June 2001, after which he served as the prime minister's director of communications and strategy until his resignation on 29 August 2003 in the aftermath of the Hutton Inquiry."}, {"text": "=== Media portrayal ===Blair had close relationships with the Clinton family. The strong partnership with Bill Clinton was made into the film The Special Relationship in 2010."}, {"text": "== Relationship with Labour Party ==Blair's apparent refusal to set a date for his departure was criticised by the British press and Members of Parliament. It has been reported that a number of cabinet ministers believed that Blair's timely departure from office would be required to be able to win a fourth election. Some ministers viewed Blair's announcement of policy initiatives in September 2006 as an attempt to draw attention away from these issues."}, {"text": "=== Gordon Brown ===After the death of John Smith in 1994, Blair and his close colleague Gordon Brown (they shared an office at the House of Commons) were both seen as possible candidates for the party leadership. They agreed not to stand against each other, it is said, as part of a supposed Blair–Brown pact. Brown, who considered himself the senior of the two, understood that Blair would give way to him: opinion polls soon indicated, however, that Blair appeared to enjoy greater support among voters. Their relationship in power became so turbulent that (it was reported) the deputy prime minister, John Prescott, often had to act as \"marriage guidance counsellor\"."}, {"text": "=== Gordon Brown ===During the 2010 election campaign Blair publicly endorsed Gordon Brown's leadership, praising the way he had handled the financial crisis."}, {"text": "=== Diplomacy ===On 27 June 2007, Blair officially resigned as prime minister after ten years in office, and he was officially confirmed as Middle East envoy for the United Nations, European Union, United States, and Russia. Blair originally indicated that he would retain his parliamentary seat after his resignation as prime minister came into effect; however, on being confirmed for the Middle East role he resigned from the Commons by taking up an office of profit. President George W. Bush had preliminary talks with Blair to ask him to take up the envoy role. White House sources stated that \"both Israel and the Palestinians had signed up to the proposal\". In May 2008 Blair announced a new plan for peace and for Palestinian rights, based heavily on the ideas of the Peace Valley plan. Blair resigned as envoy in May 2015."}, {"text": "=== Private sector ===In January 2008, it was confirmed that Blair would be joining investment bank JPMorgan Chase in a \"senior advisory capacity\" and that he would advise Zurich Financial Services on climate change. His salary for this work is unknown, although it has been claimed it may be in excess of £500,000 per year. Blair also gives lectures, earning up to US$250,000 for a 90-minute speech, and in 2008 he was said to be the highest paid speaker in the world."}, {"text": "=== Private sector ===Blair taught a course on issues of faith and globalisation at the Yale University Schools of Management and Divinity as a Howland distinguished fellow during the 2008–09 academic year. In July 2009, this accomplishment was followed by the launching of the Faith and Globalisation Initiative with Yale University in the US, Durham University in the UK, and the National University of Singapore in Asia, to deliver a postgraduate programme in partnership with the Foundation."}, {"text": "=== Private sector ===Blair's links with, and receipt of an undisclosed sum from, UI Energy Corporation, have also been subject to media comment in the UK."}, {"text": "=== Private sector ===In July 2010 it was reported that his personal security guards claimed £250,000 a year in expenses from the tax payer, Foreign Secretary William Hague said; \"we have to make sure that [Blair's security] is as cost-effective as possible, that it doesn't cost any more to the taxpayer than is absolutely necessary\"."}, {"text": "=== Tony Blair Associates ===Blair established Tony Blair Associates to \"allow him to provide, in partnership with others, strategic advice on a commercial and pro bono basis, on political and economic trends and governmental reform\". The profits from the firm go towards supporting Blair's \"work on faith, Africa and climate change\"."}, {"text": "=== Tony Blair Associates ===Blair has been subject to criticism for potential conflicts of interest between his diplomatic role as a Middle East envoy, and his work with Tony Blair Associates, and a number of prominent critics have even called for him to be sacked. Blair has used his Quartet Tony Blair Associates works with the Kazakhstan government, advising the regime on judicial, economic and political reforms, but has been subject to criticism after accusations of \"whitewashing\" the image and human rights record of the regime."}, {"text": "=== Tony Blair Associates ===Blair responded to such criticism by saying his choice to advise the country is an example of how he can \"nudge controversial figures on a progressive path of reform\", and has stated that he receives no personal profit from this advisory role. The Kazakhstan foreign minister said that the country was \"honoured and privileged\" to be receiving advice from Blair. A letter obtained by The Daily Telegraph in August 2014 revealed Blair had given damage-limitation advice to Nursultan Nazarbayev after the December 2011 Zhanaozen massacre. Blair was reported to have accepted a business advisory role with President Abdel Fattah el-Sisi of Egypt, a situation deemed incompatible with his role as Middle East envoy. Blair described the report as \"nonsense\"."}, {"text": "=== Charity and non-profits ===In November 2007 Blair launched the Tony Blair Sports Foundation, which aims to \"increase childhood participation in sports activities, especially in the North East of England, where a larger proportion of children are socially excluded, and to promote overall health and prevent childhood obesity.\" On 30 May 2008, Blair launched the Tony Blair Faith Foundation as a vehicle for encouraging different faiths to join in promoting respect and understanding, as well as working to tackle poverty. Reflecting Blair's own faith but not dedicated to any particular religion, the Foundation aims to \"show how faith is a powerful force for good in the modern world\". \"The Foundation will use its profile and resources to encourage people of faith to work together more closely to tackle global poverty and conflict,\" says its mission statement."}, {"text": "=== Charity and non-profits ===In February 2009 he applied to set up a charity called the Tony Blair Africa Governance Initiative: the application was approved in November 2009. Blair's foundation hit controversy in October 2012, when news emerged that it was taking on unpaid interns."}, {"text": "=== Charity and non-profits ===In December 2016, Blair created the Tony Blair Institute to promote global outlooks by governments and organisations. In September 2023 former Finnish prime minister Sanna Marin joined him as a strategic adviser on political leaders' reform programmes in the institute."}, {"text": "=== Memoirs ===In March 2010, it was reported that Blair's memoirs, titled The Journey, would be published in September 2010. In July 2010 it was announced the memoirs would be retitled A Journey. The memoirs were seen by many as controversial and a further attempt to profit from his office and from acts related to overseas wars that were widely seen as wrong, leading to anger and suspicion prior to launch."}, {"text": "=== Memoirs ===On 16 August 2010 it was announced that Blair would give the £4.6 million advance and all royalties from his memoirs to the Royal British Legion – the charity's largest ever single donation."}, {"text": "=== Memoirs ===Media analysis of the sudden announcement was wide-ranging, describing it as an act of \"desperation\" to obtain a better launch reception of a humiliating \"publishing flop\" that had languished in the ratings, \"blood money\" for the lives lost in the Iraq and Afghanistan wars, an act with a \"hidden motive\" or an expression of \"guilt\", a \"genius move\" to address the problem that \"Tony Blair ha[d] one of the most toxic brands around\" from a PR perspective, and a \"cynical stunt to wipe the slate\", but also as an attempt to make amends. Friends had said that the act was partly motivated by the wish to \"repair his reputation\"."}, {"text": "=== Memoirs ===The book was published on 1 September and within hours of its launch had become the fastest-selling autobiography of all time. On 3 September Blair gave his first live interview since publication on The Late Late Show in Ireland, with protesters lying in wait there for him. On 4 September, Blair was confronted by 200 anti-war and hardline Irish nationalist demonstrators before the first book signing of his memoirs at Eason's bookstore on O'Connell Street in Dublin, with angry activists chanting \"war criminal\" and that he had \"blood on his hands\", and clashing with Irish Police (Garda Síochána) as they tried to break through a security cordon outside the Eason's store. Blair was pelted with eggs and shoes, and encountered an attempted citizen's arrest for war crimes."}, {"text": "=== Accusations of war crimes ===Since the Iraq War, Blair has been the subject of war crimes accusations. Critics of his actions, including Bishop Desmond Tutu, Harold Pinter and Arundhati Roy have called for his trial at the International Criminal Court."}, {"text": "=== Accusations of war crimes ===In November 2011, a war crimes tribunal of the Kuala Lumpur War Crimes Commission, established by Malaysia's former prime minister Mahathir Mohamad, reached a unanimous conclusion that Blair and George W. Bush are guilty of crimes against peace, crimes against humanity, and genocide as a result of their roles in the 2003–2011 Iraq War. The proceedings lasted for four days, and consisted of five judges of judicial and academic backgrounds, a tribunal-appointed defence team in lieu of the defendants or representatives, and a prosecution team including international law professor Francis Boyle."}, {"text": "=== Accusations of war crimes ===In September 2012, Desmond Tutu suggested that Blair should follow the path of former African leaders who had been brought before the International Criminal Court in The Hague. The human rights lawyer Geoffrey Bindman concurred with Tutu's suggestion that there should be a war crimes trial. In a statement made in response to Tutu's comments, Blair defended his actions. He was supported by Lord Falconer, who stated that the war had been authorised by United Nations Security Council Resolution 1441."}, {"text": "=== Accusations of war crimes ===In July 2017, former Iraqi general Abdulwaheed al-Rabbat launched a private war crimes prosecution in the High Court in London, asking for Tony Blair, former foreign secretary Jack Straw and former attorney general Lord Goldsmith to be prosecuted for \"the crime of aggression\" for their role in the 2003 invasion of Iraq. The High Court ruled that, although the crime of aggression was recognised in international law, it was not an offence under UK law, and therefore the prosecution could not proceed."}, {"text": "==== Blair defended ====Some, such as John Rentoul, John McTernan and Iain Dale, have countered accusations that Blair committed war crimes during his premiership, often highlighting how no case against Blair has ever made it to trial, suggesting that Blair broke no laws."}, {"text": "==== Blair defended ====Blair himself has defended his involvement in the Iraq War by highlighting the findings of the Iraq Survey Group, which found that Saddam had attempted to get sanctions lifted by undermining them, which would have enabled him to restart his WMD program."}, {"text": "==== Response to the Iraq Inquiry ====The Chilcot report issued after the conclusion of the Iraq Inquiry was published on 6 July 2016; it criticised Blair for joining the US in the war in Iraq in 2003. Afterward, Blair issued a statement and held a two-hour press conference to apologise, to justify the decisions he had made in 2003 \"in good faith\" and to deny allegations that the war had led to a significant increase in terrorism. He acknowledged that the report made \"real and material criticisms of preparation, planning, process and of the relationship with the United States\" but cited sections of the report that he said \"should lay to rest allegations of bad faith, lies or deceit\". He stated: \"whether people agree or disagree with my decision to take military action against Saddam Hussein; I took it in good faith and in what I believed to be the best interests of the country. ... I will take full responsibility for any mistakes without exception or excuse. I will at the same time say why, nonetheless, I believe that it was better to remove Saddam Hussein and why I do not believe this is the cause of the terrorism we see today whether in the Middle East or elsewhere in the world\"."}, {"text": "==== Iran–West tensions ====In an op-ed published by The Washington Post on 8 February 2019, Blair said: \"Where Iran is exercising military interference, it should be strongly pushed back. Where it is seeking influence, it should be countered. Where its proxies operate, it should be held responsible. Where its networks exist, they should be disrupted. Where its leaders are saying what is unacceptable, they should be exposed. Where the Iranian people — highly educated and connected, despite their government — are protesting for freedom, they should be supported.\" The Tony Blair Institute for Global Change warned of a growing Iranian threat. The Tony Blair Institute confirmed that it has received donations from the U.S. State Department and Saudi Arabia."}, {"text": "==== European Union ====Blair did not want the UK to leave the EU and called for a referendum on the Brexit withdrawal agreement. Blair also maintained that once the terms deciding how the UK leaves the EU were known, the people should be able to vote again on those terms. Blair stated, \"We know the options for Brexit. Parliament will have to decide on one of them. If Parliament can't then it should decide to go back to the people.\""}, {"text": "==== European Union ====However, after the 2019 general election in which the pro-withdrawal Conservative party won a sizeable majority of seats, Blair argued that remain supporters should \"face up to one simple point: we lost\" and \"pivot to a completely new position...We're going to have to be constructive about it and see how Britain develops a constructive relationship with Europe and finds its new niche in the world.\""}, {"text": "==== American power ====Blair was interviewed in June 2020 for an article in the American magazine The Atlantic on European views of U.S. foreign policy concerning the COVID-19 pandemic and resulting recession, the rise of China, and the George Floyd protests. He affirmed his belief in the continued strength of American soft power and the need to address Iranian military aggression, European military underinvestment, and illicit Chinese trade practices. He said, however, \"I think it's fair to say a lot of political leaders in Europe are dismayed by what they see as the isolationism growing in America and the seeming indifference to alliances. But I think there will come a time when America decides in its own interest to reengage, so I'm optimistic that America will in the end understand that this is not about relegating your self-interest behind the common interest; it's an understanding that by acting collectively in alliance with others you promote your own interests.\" Blair warned that structural issues plaguing American domestic policy needed to be addressed imminently."}, {"text": "==== American power ====In August 2021, Blair criticised the withdrawal of U.S. and NATO troops from Afghanistan, saying that it was \"in obedience to an imbecilic slogan about ending 'the forever wars'\". Blair admitted mistakes in the management of the war but warned that \"the reaction to our mistakes has been, unfortunately, further mistakes\"."}, {"text": "==== Labour Party ====Blair was a critic of Jeremy Corbyn's leadership of the Labour Party, seeing it as too left-wing. He wrote in an opinion piece for The Guardian during the party's 2015 leadership election that if the party elected Corbyn, it would face a \"rout, possibly annihilation\" at the next election. He accused Corbyn of turning the party into a \"glorified protest movement\" and in a May 2021 New Statesman article, Blair suggested that the party needed to undergo a programme of \"total deconstruction and reconstruction\", adding Labour leader Keir Starmer was being backed into \"electorally off-putting positions\" and lacked a compelling economic message. He also said the party needed to shift to the centre on social issues in order to survive. Blair touched on controversial topics such as transgender rights, the Black Lives Matter movement, climate change and Corbyn's leadership of the party. In 2023, Blair's continued influence on the party, and on Starmer led him to be ranked sixteenth in the New Statesman's Left Power List 2023, described by the paper as electorally an \"incomparable authority on how to win\"."}, {"text": "=== Family ===Blair married Cherie Booth on 29 March 1980. They have four children: Euan, Nicky, Kathryn, and Leo. Leo was the first legitimate child born to a serving prime minister in over 150 years – since Francis Russell was born to Lord John Russell on 11 July 1849. All four children have Irish passports, by virtue of Blair's mother, Hazel Elizabeth Rosaleen Corscadden (12 June 1923 – 28 June 1975). The family's primary residence is in Connaught Square; the Blairs own eight residences in total."}, {"text": "=== Family ===His first grandchild (a girl) was born in October 2016."}, {"text": "=== Wealth ===Blair's financial assets are structured in an opaque manner, and estimates of their extent vary widely. These include figures of up to £100 million. Blair stated in 2014 that he was worth \"less than £20 million\". A 2015 assertion, by Francis Beckett, David Hencke and Nick Kochan, concluded that Blair had acquired $90 million and a property portfolio worth $37.5 million in the eight years since he had left office."}, {"text": "=== Wealth ===In October 2021, Blair was named in the Pandora Papers."}, {"text": "=== Religious faith ===In 2006, Blair referred to the role of his Christian faith in his decision to go to war in Iraq, stating that he had prayed about the issue, and saying that God would judge him for his decision: \"I think if you have faith about these things, you realise that judgement is made by other people ... and if you believe in God, it's made by God as well.\""}, {"text": "=== Religious faith ===According to Press Secretary Alastair Campbell's diary, Blair often read the Bible before taking any important decisions. He states that Blair had a \"wobble\" and considered changing his mind on the eve of the bombing of Iraq in 1998."}, {"text": "=== Religious faith ===A longer exploration of his faith can be found in an interview with Third Way Magazine. There he says that \"I was brought up as [a Christian], but I was not in any real sense a practising one until I went to Oxford. There was an Australian priest at the same college as me who got me interested again. In a sense, it was a rediscovery of religion as something living, that was about the world around me rather than some sort of special one-to-one relationship with a remote Being on high. Suddenly I began to see its social relevance. I began to make sense of the world\"."}, {"text": "=== Religious faith ===At one point Alastair Campbell intervened in an interview, preventing Blair from answering a question about his Christianity, explaining, \"We don't do God.\" Campbell later said that he had intervened only to end the interview because the journalist had been taking an excessive time, and that the comment had just been a throwaway line."}, {"text": "=== Religious faith ===Cherie Blair's friend and \"spiritual guru\" Carole Caplin is credited with introducing her and her husband to various New Age symbols and beliefs, including \"magic pendants\" known as \"BioElectric Shields\". The most controversial of the Blairs' New Age practices occurred when on holiday in Mexico. The couple, wearing only bathing costumes, took part in a rebirthing procedure, which involved smearing mud and fruit over each other's bodies while sitting in a steam bath."}, {"text": "=== Religious faith ===Later on, Blair questioned the Pope's attitude towards homosexuality, arguing that religious leaders must start \"rethinking\" the issue. Blair was reprimanded by Cardinal Basil Hume in 1996 for receiving Holy Communion at Mass, while still an Anglican, in contravention of canon law. On 22 December 2007, it was disclosed that Blair had joined the Catholic Church. The move was described as \"a private matter\". He had informed Pope Benedict XVI on 23 June 2007 that he wanted to become a Catholic. The Pope and his advisors criticised some of Blair's political actions, but followed up with a reportedly unprecedented red-carpet welcome, which included the Cardinal Archbishop of Westminster, Cormac Murphy-O'Connor, who would be responsible for Blair's Catholic instruction. In 2010, The Tablet named him as one of Britain's most influential Catholics."}, {"text": "=== Appearances ===Blair made an animated cameo appearance as himself in The Simpsons episode \"The Regina Monologues\" (2003). He has also appeared as himself at the end of the first episode of The Amazing Mrs Pritchard, a British television series about an unknown housewife becoming prime minister. On 14 March 2007, Blair appeared as a celebrity judge on Masterchef Goes Large after contestants had to prepare a three-course meal in the Downing Street kitchens for Blair and Bertie Ahern. On 16 March 2007, Blair featured in a comedy sketch with Catherine Tate, who appeared in the guise of her character Lauren Cooper from The Catherine Tate Show. The sketch was made for the BBC Red Nose Day fundraising programme of 2007. During the sketch, Blair used Lauren's catchphrase \"Am I bovvered?\""}, {"text": "=== Portrayals ===Michael Sheen has portrayed Blair three times, in the films The Deal (2003), The Queen (2006), and The Special Relationship (2009). Robert Lindsay portrayed Blair in the TV programme A Very Social Secretary (2005), and reprised the role in The Trial of Tony Blair (2007). He was also portrayed by James Larkin in The Government Inspector (2005), and by Ioan Gruffudd in W. (2008). In the 2006 Channel 4 comedy drama documentary, Tony Blair: Rock Star, he was portrayed by Christian Brassington."}, {"text": "=== Portrayals ===He was portrayed by Damian Lewis in the Confessions of a Diary Secretary (2007) and by Toby Stephens in The Journey (2017). Bertie Carvel played Blair in the fifth and sixth seasons of The Crown (2022–23). In 2023, comedian Charlie Baker portrayed Blair in TONY! The Tony Blair Rock Opera, written by Harry Hill."}, {"text": "=== Blair in fiction and satire ===When Blair resigned as prime minister, Robert Harris, a former Fleet Street political editor, dropped his other work to write The Ghost. The CIA-influenced British prime minister in the book is said to be a thinly disguised version of Blair. The novel was filmed as The Ghost Writer (2010) with Pierce Brosnan portraying the Blair character, Adam Lang. Stephen Mangan portrays Blair in The Hunt for Tony Blair (2011), a one-off The Comic Strip Presents... satire presented in the style of a 1950s film noir. In the film, he is wrongly implicated in the deaths of Robin Cook and John Smith and on the run from Inspector Hutton. In 2007, the scenario of a possible war crimes trial for the former British prime minister was satirised by the British broadcaster Channel 4, in a \"mockumentary\", The Trial of Tony Blair, which concluded with the fictional Blair being dispatched to the Hague."}, {"text": "== Honours == Privy Counsellor (1994)"}, {"text": "== Honours == Congressional Gold Medal (2003)"}, {"text": "== Honours ==Honorary Doctor of Law (LLD) from Queen's University Belfast (2008)"}, {"text": "== Honours == Presidential Medal of Freedom (2009)"}, {"text": "== Honours ==Dan David Prize (2009)"}, {"text": "== Honours == Liberty Medal (2010)"}, {"text": "== Honours == Order of Freedom (2010)"}, {"text": "== Honours ==  Knight Companion of the Most Noble Order of the Garter (2022)"}, {"text": "== Honours ==In May 2007, Blair was invested as a paramount chief by the chiefs and people of the village of Mahera in Sierra Leone. The honour was bestowed upon him in recognition of the role played by his government in the Sierra Leone Civil War."}, {"text": "== Honours ==On 22 May 2008, Blair received an honorary law doctorate from Queen's University Belfast, alongside Bertie Ahern, for distinction in public service and roles in the Northern Ireland peace process."}, {"text": "== Honours ==On 13 January 2009, Blair was awarded the Presidential Medal of Freedom by President George W. Bush. Bush stated that Blair was given the award \"in recognition of exemplary achievement and to convey the utmost esteem of the American people\" and cited Blair's support for the War on Terror and his role in achieving peace in Northern Ireland as two reasons for justifying his being presented with the award."}, {"text": "== Honours ==On 16 February 2009, Blair was awarded the Dan David Prize by Tel Aviv University for \"exceptional leadership and steadfast determination in helping to engineer agreements and forge lasting solutions to areas in conflict\". He was awarded the prize in May 2009."}, {"text": "== Honours ==On 8 July 2010, Blair was awarded the Order of Freedom by President Fatmir Sejdiu of Kosovo. As Blair is considered to have been instrumental in ending the conflict in Kosovo, some boys born in the country following the war have been given the name Toni or Tonibler."}, {"text": "== Honours ==On 13 September 2010, Blair was awarded the Liberty Medal at the National Constitution Center in Philadelphia, Pennsylvania. It was presented by former president Bill Clinton, and is awarded annually to \"men and women of courage and conviction who strive to secure the blessings of liberty to people around the globe\"."}, {"text": "== Honours ==On 31 December 2021, it was announced that the Queen had appointed Blair a Knight Companion of the Order of the Garter (KG). Blair had reportedly indicated when he left office that he did not want the traditional knighthood or peerage bestowed on former prime ministers. A petition cited his role in the Iraq War as a reason to remove the knighthood and garnered more than one million signatures."}, {"text": "== Honours ==He received his Garter insignia on 10 June 2022 from the Queen during an audience at Windsor Castle."}, {"text": "== Works ==Blair, Tony (2010). A Journey. London: Random House. ISBN 0-09-192555-X. OCLC 657172683."}, {"text": "== Works ==Blair, Tony (2002). The Courage of Our Convictions. London: Fabian Society. ISBN 0-7163-0603-4."}, {"text": "== Works ==Blair, Tony (2000). Superpower: Not Superstate? (Federal Trust European Essays). London: Federal Trust for Education & Research. ISBN 1-903403-25-1."}, {"text": "== Works ==Blair, Tony (1998). The Third Way: New Politics for the New Century. London: Fabian Society. ISBN 0-7163-0588-7."}, {"text": "== Works ==Blair, Tony (1998). Leading the Way: New Vision for Local Government. London: Institute for Public Policy Research. ISBN 1-86030-075-8."}, {"text": "== Works ==Blair, Tony (1997). New Britain: My Vision of a Young Country. New York: Basic Books. ISBN 0-8133-3338-5."}, {"text": "== Works ==Blair, Tony (1995). Let Us Face the Future. London: Fabian Society. ISBN 0-7163-0571-2."}, {"text": "== Works ==Blair, Tony (1994). What Price a Safe Society?. London: Fabian Society. ISBN 0-7163-0562-3."}, {"text": "== Works ==Blair, Tony (1994). Socialism. London: Fabian Society. ISBN 0-7163-0565-8."}, {"text": "== See also ==Blatcherism"}, {"text": "== See also ==Bush–Blair 2003 Iraq memo"}, {"text": "== See also ==Cash-for-Honours scandal"}, {"text": "== See also ==Cultural depictions of Tony Blair"}, {"text": "== See also ==Parliamentary motion to impeach Tony Blair"}, {"text": "== See also ==Halsbury's Laws of England (2004), reference to impeachment in volume on Constitutional Law and Human Rights, paragraph 416"}, {"text": "== Notes and references ==NotesReferences"}, {"text": "== External links ==The Office of Tony Blair Archived 17 January 2012 at the Wayback Machine – Official website"}, {"text": "== External links ==Tony Blair Faith Foundation Archived 10 December 2010 at the Wayback Machine"}, {"text": "== External links ==Tony Blair collected news and commentary at The Guardian "}, {"text": "== External links ==Tony Blair collected news and commentary at The New York Times"}, {"text": "== External links ==The Blair Years – Timeline at BBC News"}, {"text": "== External links ==Tony Blair at IMDb"}, {"text": "== External links ==Appearances on C-SPAN"}, {"text": "== External links ==Portraits of Tony Blair at the National Portrait Gallery, London "}, {"text": "== External links ==The Prime Minister Tony Charles Lynton Blair at the Wayback Machine (archived 7 June 2007) at www.pm.gov.uk"}, {"text": "== External links ==Contributions in Parliament at Hansard 1803–2005"}, {"text": "== External links ==Voting record at Public Whip"}, {"text": "== External links ==Record in Parliament at TheyWorkForYou"}]