[{"text": "Travis Michael Kelce (  KEL-see; born October 5, 1989) is an American football tight end for the Kansas City Chiefs of the National Football League (NFL). He was selected by the Chiefs in the third round of the 2013 NFL draft and later won Super Bowls LIV, LVII, and LVIII with the team. He played college football for the Cincinnati Bearcats."}, {"text": "Considered one of the greatest tight ends of all time, Kelce is a nine-time Pro Bowler and a seven-time All-Pro, with 4 first-team and 3 second-team selections. He holds the NFL records for most consecutive and most overall seasons with 1,000 receiving yards by a tight end: seven. He holds the record for most receiving yards by a tight end in a single season with 1,416 in 2020, despite playing in only 15 games. During the 2022 season, Kelce became the fifth NFL tight end to reach 10,000 career receiving yards and reached the milestone faster than any tight end in NFL history. Kelce was named to the NFL 2010s All-Decade Team. During the 2023 season, he surpassed Jerry Rice in career playoff receptions en route to Super Bowl LVIII, his fourth Super Bowl appearance in five seasons."}, {"text": "Outside of football, Kelce has appeared on reality and scripted television and in advertisements. He co-hosts the podcast New Heights with his brother Jason, covering topics from football to popular culture. Kelce's relationship with singer-songwriter Taylor Swift has drawn massive media coverage and stimulated viewership and revenue for his team and its league."}, {"text": "== Early life, education and career ==Kelce was born on October 5, 1989, in Westlake, Ohio. His father, Ed Kelce, is a sales representative in the steel industry, and his mother, Donna, is a former bank executive. Kelce's older brother Jason played center for the Philadelphia Eagles for 13 seasons.Kelce attended Cleveland Heights High School in his hometown of Cleveland Heights, Ohio, where he played football, basketball, and baseball. He was a three-year letter winner as quarterback for the Tigers. As a senior in 2007, he ran for 1,016 yards and 10 touchdowns and threw for 1,523 yards, 21 touchdowns, and eight interceptions. His 2,539 yards of total offense garnered him All-Lake Erie League honors."}, {"text": "== College career ==Considered a two-star recruit by Rivals.com, Kelce accepted a scholarship offer from the University of Cincinnati over offers from Akron, Eastern Michigan, and Miami (OH). He joined his brother, Jason Kelce, who was the starting left guard for the Bearcats. After redshirting in 2008, he appeared in 11 games in 2009, playing at tight end and quarterback out of the Wildcat formation. He tallied eight rushes for 47 yards and two touchdowns and had one reception for three yards. He was suspended for the 2010 season after testing positive for marijuana, a violation of team rules. Returning for the 2011 season, he played tight end, recording 13 catches totaling 150 yards and two touchdowns. In 2012, his last collegiate season, he set personal season highs in receptions (45), receiving yards (722), yards per receptions (16.0), and receiving touchdowns (8). Kelce earned first-team all-conference honors and in March 2013,  was named the College Football Performance Awards Tight End of the Year. Kelce graduated in 2022 with a Bachelor of Interdisciplinary Studies degree, he received his diploma during a April 2024 podcast event at the Fifth Third Arena with his brother Jason."}, {"text": "=== 2013 season ===Kelce was drafted by the Kansas City Chiefs in the third round (63rd pick overall) of the 2013 NFL draft. The Chiefs had hired Andy Reid as their new head coach during the off-season. Reid was familiar with Kelce, having drafted and coached his brother, Jason Kelce, in 2011 during his time as the head coach of the Eagles. On June 6, 2013, the Chiefs signed Kelce to a four-year, $3.12 million rookie contract that also included a signing bonus of $703,304.Kelce injured his knee in the preseason. The injury was later diagnosed as a bone bruise. After being limited the first two weeks of the season due to the injury and being inactive the next three games, Kelce was placed on injured reserve on October 12, 2013, after having a microfracture surgery performed on his knee. He only played one snap, on special teams in the Chiefs' Week 2 game against the Dallas Cowboys."}, {"text": "=== 2014 season ===During Week 3 against the Miami Dolphins, Kelce recorded his first NFL touchdown on a 20-yard reception from quarterback Alex Smith. On November 30, he was fined $11,025 for \"unsportsmanlike conduct\" during a 29–16 loss to the Denver Broncos. Kelce made an inappropriate hand gesture and motion at Broncos linebacker Von Miller. Chiefs' head coach Andy Reid later called this \"immature\". In the next game against the Arizona Cardinals, Kelce had seven receptions for 110 yards for his first NFL game with over 100 receiving yards. In the regular-season finale against the San Diego Chargers, he had an offensive fumble recovery for a touchdown in the 19–7 victory. Kelce was the Chiefs' leading receiver during the 2014 season, totaling 862 yards off 67 receptions."}, {"text": "=== 2015 season ===Kelce began the 2015 season with his first NFL multiple touchdown game, with six receptions for 106 yards and two touchdowns in the 27–20 victory over the Houston Texans. It was his only 100-plus-yard game, but he had at least one reception in all 16 games, and was ranked a top-five tight end by ESPN. He started all 16 regular season games and recorded 72 catches for 875 yards and five touchdowns, earning his way to his first Pro Bowl. The Chiefs finished the regular season with an 11–5 record and made the playoffs. In his first NFL playoff game, Kelce had eight receptions for 128 yards in a 30–0 Wild Card Round victory over the Texans. In the Divisional Round against the New England Patriots, Kelce had six receptions for 23 yards as the Chiefs lost 27–20. He was ranked 91st by his peers on the NFL Top 100 Players of 2016."}, {"text": "=== 2016 season ===On January 29, 2016, Kelce signed a five-year, $46 million contract extension. He was ranked 91st by his fellow players on the NFL Top 100 Players of 2016.During Week 8 against the Indianapolis Colts, Kelce had seven receptions for 101 yards and a touchdown. In the next game against the Jacksonville Jaguars, he was ejected after receiving two unsportsmanlike conduct penalties after arguing with two officials over not having a pass interference penalty called. The second resulted from him sarcastically throwing his towel at field judge Mike Weatherford in a flagging motion due to being upset about the first penalty. He was later fined $24,309 for his outburst. During Week 13 against the Atlanta Falcons, he had eight receptions for 140 yards. In the next game, Kelce recorded 101 receiving yards against the Oakland Raiders, his fourth consecutive game topping 100. He joined Jimmy Graham and former Chiefs tight end Tony Gonzalez as the only NFL tight ends ever to do so. In a Christmas Day win over the Broncos, Kelce had career bests of 11 receptions for 160 yards and a career-long 80-yard touchdown on a screen pass. He finished the season with career highs in yards (1,125) and receptions (85). His 1,125 receiving yards led the league among tight ends and his 85 receptions were second among tight ends behind Dennis Pitta of the Baltimore Ravens. Kelce's 634 yards after the catch also led all NFL tight ends. He was named as a starter in his second career Pro Bowl, held on December 20, 2016. He was also named First-team All-Pro. He was ranked 26th by his fellow players, and second among tight ends, on the NFL Top 100 Players of 2017.The Chiefs finished atop the AFC West with a 12–4 record and earned a first-round bye in the playoffs. In the Divisional Round against the Pittsburgh Steelers, Kelce had five receptions for 77 yards in the 18–16 loss."}, {"text": "=== 2017 season ===During Week 2 against the Eagles, Kelce had eight receptions for 103 yards and a touchdown in the 27–20 victory. After just one reception for one yard in Week 3 against the Los Angeles Chargers, Kelce recorded seven receptions for 111 yards and a touchdown in Week 4 against the Washington Redskins followed by eight for 98 in Week 5 against the Texans. During Week 8, Kelce had seven receptions for 133 yards to pass Zach Ertz as the NFL's leading tight end in both categories, along with a touchdown. During Week 13 against the New York Jets, Kelce opened the game with spectacular fashion, scoring two receiving touchdowns on 90 receiving yards in the first 2 minutes and 46 seconds of regulation. He finished the game with 94 receiving yards on four receptions in the 38–31 loss. On December 19, 2017, Kelce was named to his third straight Pro Bowl. Kelce finished the season with a career-high eight receiving touchdowns. He finished second among tight ends with 1,038 receiving yards, only trailing Gronkowski's 1,084 receiving yards. He was ranked 24th by his peers on the NFL Top 100 Players of 2018.The 10–6 Chiefs entered the Wild Card Round of the playoffs against the Tennessee Titans, where Kelce finished with four receptions for 66 yards and a touchdown in the 21–22 defeat. He was not able to finish the game as he suffered a concussion in the first half on a hit to his helmet."}, {"text": "=== 2018 season ===In the 2018 season, Kelce benefited from the rise of new quarterback Patrick Mahomes, who was named NFL MVP at the end of the season. After being held to a lone reception for six yards in the season opener against the Chargers, he rebounded with seven receptions for 106 yards and two touchdowns in a Week 2 road victory over the Steelers. In two of the next three games, he was able to reach 100 receiving yards against the San Francisco 49ers and the Jaguars. He added 99 yards and two touchdowns in a Week 9 win over the Cleveland Browns, and went into the Week 12 bye with 10 receptions for 127 yards and a touchdown in an offensively spectacular 54–51 loss to the Los Angeles Rams. In the Week 13 win over the Raiders, Kelce had career-bests of 12 receptions and 168 yards, including two short touchdowns in the first half. At this point, he was well on his way to an NFL record, but his production tapered off; over the final four weeks, Kelce averaged six receptions for 63.5 yards and had only one touchdown reception. In Week 17, Kelce indeed broke the NFL record for most receiving yards by a tight end in a single season, but 49ers tight end George Kittle passed him to claim the record less than an hour later. Kelce ended the regular season at 10th in the NFL in receptions with 103 and receiving yards with 1,336, and sixth in receiving touchdowns with 10. He was named to the 2018 Pro Bowl and was named first-team All-Pro.The Chiefs finished atop the AFC West with a 12–4 record and earned a first-round bye. In the Divisional Round against the Colts, he had seven receptions for 108 yards in the 31–13 victory. In the AFC Championship against the Patriots, he had three receptions for 23 yards and a receiving touchdown in the 37–31 overtime loss. He was ranked 21st by his fellow players on the NFL Top 100 Players of 2018."}, {"text": "=== 2019 season: First Super Bowl win ===During Week 2 against the Raiders, Kelce caught seven passes for 107 yards and a touchdown of the season as the Chiefs won by a score of 28–10. Despite injuries to Patrick Mahomes and just two touchdowns, at the midpoint of the season Kelce led all tight ends and Chiefs players in receiving yards with 604. During Week 11 against the Chargers on Monday Night Football in Mexico, Kelce caught seven passes for 92 yards and a touchdown in the 24–17 win. During Week 14 against the Patriots, Kelce caught seven passes for 66 yards and rushed the ball once for a one-yard touchdown during the 23–16 road victory. In the next game against the Broncos, Kelce finished with 11 catches for 142 receiving yards as the Chiefs won 23–3. In the next game against the Chicago Bears on Sunday Night Football, he caught eight passes for 74 yards and a touchdown in the 26–3 win. During the game, he became the fastest tight end in NFL history to record 500 career receptions.Kelce finished the 2019 season with 97 receptions for 1,229 receiving yards and five receiving touchdowns to go along with his one rushing touchdown. Kelce became the first tight end in NFL history to record four consecutive seasons with at least 1,000 receiving yards. He was named to his fifth Pro Bowl for his 2019 season.In the Divisional Round against the Texans, the Chiefs began the game with a 24–0 deficit. The Chiefs then went on a 51–7 run, including 41 unanswered points, to win 51–31. After a drop on third down on the Chiefs first drive that would have been a first down if it had been caught, Kelce caught 10 passes for 134 yards and three touchdowns (all in the second quarter) as he helped lead the Chiefs to their second consecutive conference championship game. In the AFC Championship Game against the Titans, Kelce caught three passes for 30 yards during the 35–24 win. In Super Bowl LIV against the San Francisco 49ers, Kelce caught six passes for 43 receiving yards and a receiving touchdown and had one carry for two rushing yards during the 31–20 win. He was ranked 18th by his fellow players on the NFL Top 100 Players of 2020."}, {"text": "=== 2020 season ===Following the release of long-time Chiefs punter Dustin Colquitt in the offseason, Kelce became tied with Anthony Sherman and fellow 2013 draftee Eric Fisher as the team's longest tenured members. On August 14, 2020, Kelce signed a four-year, $57 million contract extension with the Chiefs through the 2025 season. In Week 6, he caught two touchdowns in a 26–17 victory over the Buffalo Bills. In Week 8 against the Jets, Kelce dunked the ball through the goal posts after scoring a touchdown, paying homage to former Chiefs tight end Tony Gonzalez. He was penalized for unsportsmanlike conduct and was fined $12,500. In Week 9, against the Carolina Panthers, he had ten receptions for 159 receiving yards in the 33–31 victory.In Week 11 against the Las Vegas Raiders on Sunday Night Football, Kelce recorded eight catches for 127 yards and scored the game-winning touchdown in a 35–31 win."}, {"text": "=== 2020 season ===In Week 13 against the Broncos on Sunday Night Football, he caught eight passes for 136 yards and a touchdown during the 22–16 win. In the following game against the Dolphins, he again posted eight catches for 136 yards and a touchdown in a 33–27 victory. In Week 16, Kelce became the first tight end with two 100-catch seasons. Kelce caught seven passes, giving him a career-high 105 for the season. Kelce set the single-season yardage record for a tight end with 1,416, topping George Kittle's 1,377 in 2018. His yardage ranked second overall in the 2020 NFL season (behind Stefon Diggs' 1,535), while his total receptions ranked fifth in the NFL and second among tight ends (behind Darren Waller's 107). He was named to his sixth Pro Bowl and earned First-team All-Pro honors.In the Divisional Round of the playoffs against the Browns, Kelce caught eight passes for 109 yards and a touchdown during the 22–17 win. In the AFC Championship against the Bills, Kelce recorded 13 catches for 118 yards and two touchdowns in a 38–24 win to advance to Super Bowl LV. In the Super Bowl, he caught 10 passes for 133 yards—a record for receiving yards by a tight end in the championship game—but the Chiefs did not score a touchdown in the 31–9 loss to the Tampa Bay Buccaneers. He was ranked fifth by his fellow players on the NFL Top 100 Players of 2021."}, {"text": "=== 2021 season ===After Fisher was released and Sherman retired in the offseason, Kelce became the longest-tenured member of the Chiefs. In the Chiefs' second game of the season, against the Ravens, he became the fastest tight end in NFL history to record 8,000 career yards, surpassing Rob Gronkowski's record in 113 games. In the Chiefs' week-15 game against the Chargers, Kelce set a career high for receiving yards in a game with 191 yards. He also caught two touchdowns, including the game-winning 34-yard touchdown in overtime. Kelce was named AFC Offensive Player of the Week for his performance. The game also put him over 1,000 yards for the season, his NFL record (among tight ends) extending sixth consecutive 1,000-yard season. It also extended Kelce's record for most 1,000-yard seasons by a tight end with six. He was placed on the Reserve/COVID-19 list on December 20, 2021. Kelce was activated on December 25, 2021. However, due to NFL protocols for COVID-19, since he tested positive for the virus and did not test negative before the day of the game, he was ruled out for the Chiefs' week 16 game against the Steelers. It was the first game Kelce had missed due to injury or illness since his rookie season. In the regular season-ending game against the Broncos, Kelce became the fastest tight end in NFL history to reach 9,000 career yards in just 127 games, a record also previously held by Gronkowski with 140 games. He finished the season with 92 receptions for 1,125 receiving yards and nine touchdowns. He was named Second-Team All-Pro by the AP, his sixth overall All-Pro selection. He was also named to his seventh consecutive Pro Bowl.In the Wild Card Round against the Pittsburgh Steelers, Kelce had five receptions for 108 yards and a receiving touchdown to go along with a two-yard touchdown pass to Byron Pringle in the 42–21 victory. In the Divisional Round against the Bills, he had eight receptions for 96 yards and the game-winning touchdown in the 42–36 overtime victory. Kelce was wearing an NFL Films microphone for the game, and audio footage from the two offensive plays of the 13-second drive revealed that Kelce instructed Tyreek Hill to run the route which led to the success of the first completion, and revealed him suggesting to Mahomes that he might improvise his own route on the second offensive play if the Bills' defensive scheme didn't change. Prior to the snap, Mahomes realized Kelce's suggested improvised route would work and shouted \"Do it, Kelce!\", before finding his tight-end for a completion of 25 yards.In the AFC Championship against the Cincinnati Bengals, he had 10 receptions for 95 yards and a touchdown in the 27–24 overtime loss. He was ranked tenth by his fellow players on the NFL Top 100 Players of 2022."}, {"text": "=== 2022 season: Second Super Bowl win ===In Week 5, Kelce had four receiving touchdowns in the 30–29 victory over the Raiders. Kelce tied the franchise record for receiving touchdowns in a game. In the Chiefs' Week 11 game against the Chargers, he recorded his NFL record-breaking (among tight ends) 33rd 100-yard receiving game with 115 yards. He also scored three touchdowns, including the game-winning touchdown, his second straight season recording a game-winning touchdown against the Chargers. In Week 14 against the Broncos, he became the fifth tight end in NFL history to have 10,000 receiving yards. He also officially recorded his seventh consecutive 1,000-yard season, extending his records (among tight ends) of consecutive 1,000-yard seasons and most overall 1,000 seasons. He finished the 2022 season with 110 receptions for 1,338 receiving yards and 12 receiving touchdowns."}, {"text": "=== 2022 season: Second Super Bowl win ===Kelce set a single-game NFL postseason record for a tight end with 14 receptions in a 27–20 victory over the Jaguars in the Divisional Round. He scored two receiving touchdowns in the game. Kelce and the Chiefs appeared in Super Bowl LVII against the Eagles. Kelce's brother Jason played for the Eagles, making it the first Super Bowl to feature two brothers as players on opposing teams. Kelce caught six passes for 81 yards and a touchdown as the Chiefs beat the Eagles 38–35 to win his second Super Bowl. He was ranked fifth by his fellow players on the NFL Top 100 Players of 2023."}, {"text": "=== 2023 season: Third Super Bowl win ===Kelce was inactive for the Chiefs' game against the Detroit Lions due to a knee injury he suffered earlier in the week. It was his first game missed due to an injury since his rookie season. Kelce made his season debut the following week against the Jaguars. In the Chiefs' week 7 game against the Chargers, Kelce tied a career high with 12 receptions. He also had 179 receiving yards, the second highest of his career. In the Chiefs' Week 9 game against the Dolphins, he broke the Chiefs franchise record for career receiving yards. Kelce finished the regular season with 984 receiving yards and five touchdowns. He elected to not play in the Chiefs' Week 18 matchup against the Los Angeles Chargers, ending his NFL-record streak of seven consecutive seasons to finish with 1,000 receiving yards.In the Divisional Round victory over the Bills, Kelce had two receiving touchdowns. Kelce, along with Mahomes, broke the record for most career touchdowns in the playoffs for a quarterback/receiver duo. In the AFC Championship Game victory against the top-seeded Baltimore Ravens, Kelce caught 11 passes for 116 yards and a touchdown, surpassing Jerry Rice for most playoff receptions and tying Rice for first in 100+ receiving yard games. The victory marked Kelce's fourth Super Bowl appearance in five seasons.During Super Bowl LVIII, Kelce had nine receptions for 93 yards and was the leading yards receiver for the game. The Chiefs would win 25–22 in just the second Super Bowl in history to go to overtime, earning Kelce his third Super Bowl win. The Chiefs became the first team to repeat as Super Bowl champions since the New England Patriots accomplished the feat in the 2003 and 2004 seasons. During the game, following a fumble by Chiefs running back Isiah Pacheco when Kelce was not on the field, he was shown screaming at the Chiefs' head coach Andy Reid. The incident drew criticism, for which Kelce later apologized through his podcast."}, {"text": "=== NFL record (any position) ===Career postseason receptions: 165"}, {"text": "=== NFL records (among tight ends) ===Consecutive 1,000-plus-yard seasons (7, 2016–2022)"}, {"text": "=== NFL records (among tight ends) ===1,000-yard seasons (7, 2016–2022)"}, {"text": "=== NFL records (among tight ends) ===Receiving yards in a season (1,416, 2020)"}, {"text": "=== NFL records (among tight ends) ===Career postseason receiving yards (1,903)"}, {"text": "=== NFL records (among tight ends) ===100+ reception seasons (3)"}, {"text": "=== NFL records (among tight ends) ===Fewest games to 10,000 career receiving yards (140)"}, {"text": "=== NFL records (among tight ends) ===100 receiving yard games (37)"}, {"text": "=== NFL records (among tight ends) ===Career postseason receiving touchdowns: 19"}, {"text": "=== NFL records (among tight ends) ===Career postseason games started: 22"}, {"text": "=== Chiefs franchise records (any position) ===100-plus-yard receiving games (37)"}, {"text": "=== Chiefs franchise records (any position) ===Receiving touchdowns in a game (tied, 4)"}, {"text": "=== Chiefs franchise records (any position) ===Career receiving yards (11,328)"}, {"text": "== Awards and honors ==NFL"}, {"text": "== Awards and honors ==3× Super Bowl champion (LIV, LVII, LVIII)"}, {"text": "== Awards and honors ==4× First-team All-Pro (2016, 2018, 2020, 2022)"}, {"text": "== Awards and honors ==3× Second-team All-Pro (2017, 2019, 2021)"}, {"text": "== Awards and honors ==9× Pro Bowl (2015–2023)"}, {"text": "== Awards and honors ==NFL 2010s All-Decade TeamNCAA"}, {"text": "== Awards and honors ==First-team All-Big East (2012)Non-football awards"}, {"text": "== Awards and honors ==People's Choice Awards – Athlete of the Year (2024)"}, {"text": "=== Philanthropy and activism ===Noted for being generous with his time and resources, Kelce has received several awards for his philanthropic efforts. He received the Chiefs' Ed Block Courage Award in 2014. In 2020, the Chiefs nominated him for the Walter Payton Man of the Year Award. That same year, fans voted him the winner of the NFL's Charity Challenge Award.In 2015, Kelce created a nonprofit organization called Eighty-Seven & Running in his hometown of Cleveland, Ohio. Its website says its goal is \"empowering underprivileged youth to achieve success by providing resources and support to their communities and cultivating their talents.In 2018, Kelce announced the development of a Robotics Lab with Operation Breakthrough, a Kansas City-based nonprofit. The Lab is accessible to nearly 300 students from elementary to high school levels in the area. 2 years later, Kelce made a $500,000 donation for the purchase and transformation of a building in Kansas City into a coworking space for disadvantaged children to have the opportunity to explore careers in STEM. The workforce development program set up in the building was named \"Ignition Lab\". Kelce organizes an annual fundraising event in Kansas City, including an auto show and a fashion show, to raise money for various causes in both Kansas City and Cleveland. In 2024, Kelce donated 25,000 breakfast meals to students from Kansas City. Kelce also launched an initiative called \"Catching for a Cause\" to which he pledges to donate money for every catch and touchdown that he makes. Following the 2024 Kansas City parade shooting, Kelce donated $100,000 to the family of two children who were seriously wounded by gunshots.Kelce is also an active supporter of various non-profit organizations and initiatives, including Boys & Girls Clubs of America and Read Across America Day. He has donated autographed items to benefit the Make-A-Wish Foundation.  Kelce has made several appearances at Kansas City hospitals and schools to support local charities. He donated $140,000 to Operation Breakthrough and the Heights Schools Foundation in Ohio to help both during COVID-19 pandemic. Kelce and his brother Jason have also donated to the Heights Schools Foundation for equipment funding and after school activities. In 2019, Kelce participated in a charity celebrity softball game to raise funds for the  Lake Health Foundation. In 2022, Kelce's foundation endowed a Health and Wellness fund for the University of Cincinnati's Sports Psychology and Counseling Department.In 2017, Kelce became one of the highest-profile white NFL players to kneel during the national anthem in protest against police brutality, racism and social inequalities in America. Following the shooting of Jacob Blake by police officer Rusten Sheskey, Kelce, along with teammate Patrick Mahomes, spoke publicly in support of social justice. Kelce has also continuously extended his support to the Black Lives Matter movement. Kelce, along with several other NFL players, joined students in virtual class discussions around the US to discuss a documentary titled Black Boys. The film, which was produced by Malcolm Jenkins, focuses on social and emotional effects of racism against Black men."}, {"text": "=== Entertainment ===In January 2016, Kelce starred in the E! Entertainment Television dating show Catching Kelce, choosing Maya Benberry as the winner. In 2020, Kelce appeared as a fictionalized version of himself in the first episode of the comedy series Moonbase 8. Kelce was featured in Kelce, a feature-length documentary about his brother Jason's football career and private life that was released on Amazon Prime on September 11, 2023, Within 24 hours, it was the most-watched movie among U.S. subscribers to the streaming service. In May 2023, he signed with Creative Artists Agency for off-the-field representation while keeping his agent for his NFL representation. Kelce hosted Saturday Night Live on March 4, 2023, and appeared in a sketch with his brother Jason and SNL cast members Heidi Gardner and Chloe Fineman. He also made a cameo appearance on the October 14, 2023, episode. Kelce is executive producer of the war comedy-drama film My Dead Friend Zoe and of the documentary King Pleasure about the life of American artist Jean-Michel Basquiat.Through his Super Bowl runs with the Chiefs, Kelce became known for reciting the chorus from the Beastie Boys' 1986 song \"(You Gotta) Fight for Your Right (To Party!)\" during team celebrations, first after the 2019 AFC Championship Game then again at the parade in Kansas City after clinching Super Bowl LIV. The Chiefs responded by making \"Fight for Your Right\" its touchdown song during games at Arrowhead Stadium. In 2023, Kelce performed the song with Jimmy Fallon on The Tonight Show.Kelce was featured, with his brother Jason, on the cover of \"Fairytale of New York\" (1987) by the Pogues featuring Kirsty MacColl, titled \"Fairytale of Philadelphia\", which appeared on the 2023 album A Philly Special Christmas Special; proceeds from the album benefit various charity institutions in Philadelphia. \"Fairytale of Philadelphia\" topped the US iTunes chart, following which the brothers thanked the Swifties. The song further debuted at number five on the Billboard Digital Song Sales chart and number two on Billboard Rock Digital Song Sales with 6,000 downloads sold in the first week. The song climbed to number one on both charts on its second week of release, making the brothers Billboard-charting artists. In April 2023, Kelce announced the launch of his own annual music festival called Kelce Jam. The first edition of the event, held in Bonner Springs, Kansas during the 2023 NFL draft weekend, featured artists including Machine Gun Kelly, Rick Ross, Loud Luxury and Tech N9ne. The festival sold its first 10,000 tickets in 20 minutes, and was eventually sold out with 18,000 people in attendance.On March 19, 2024, it was announced that the game show Are You Smarter than a 5th Grader? would be revived for Amazon Prime Video, with Kelce in talks to host the reboot. It was later revealed the show will be titled Are You Smarter than a Celebrity? with a 20-episode season. On April 17, Kelce's involvement with the show was confirmed."}, {"text": "=== New Heights with Jason & Travis Kelce podcast ===In September 2022, Kelce and his brother Jason launched a weekly sports podcast called New Heights with Jason & Travis Kelce, produced with Wave Sports + Entertainment. The name is a nod to the brothers' upbringing in Cleveland Heights, Ohio. During the podcast, the brothers discuss NFL news, rumors, and sports headlines as well as each other's games. New Heights features special guests including NFL players, celebrities, and members of their family. The brothers record the podcast before cameras; it is broadcast live on YouTube and released in video and audio forms.Within weeks of its launch, the podcast was the most-listened-to sports podcast on Spotify and third-most on Apple podcast sports charts. In February 2023, the podcast experienced a rise in popularity when Travis and Jason faced off in Super Bowl LVII, it marked the first time two brothers played against each other. It reached the No. 1 in Apple sports podcasts, No. 2 among all podcasts on Apple, and No. 3 on Spotify in all podcast categories. The podcast is regularly highlighted on Monday Night Football on ESPN and Sunday Night Football on NBC. In 2022, it was named the Sports Podcast of the Year by Sports Illustrated. After the premiere of the second season in September 2023, New Heights became the No. 1 sports podcast in the U.S. and the No. 1 sports podcast globally on Spotify as well as No. 1 among all podcasts on Apple."}, {"text": "=== Endorsements ===Kelce has appeared in print, television and online advertisements for brands such as Dick's Sporting Goods, LG, McDonald's, Nike, Papa John's, Bud Light, Old Spice, Walgreens, Pfizer, State Farm, DirectTV, Experian, Lowe's, and Campbell's Soup among others. In August 2022, Hy-Vee began manufacturing \"Kelce's Krunch\", a limited-edition frosted cornflakes breakfast cereal named after and endorsed by Kelce. A portion of proceeds from the sale of the cereal was donated to Kelce's charity foundation. In 2023, Business Insider estimated that Kelce makes $5 million a year in off-the-field earnings and stated that \"he was one of football's most successful endorsers.\"In 2019, Kelce founded his own health brand, Hilo Nutrition, which sells gummy supplements for performance nutrition and other health benefits. In January 2020, Kelce launched his own clothing brand, Tru Kolors. It became the first brand by an NFL player to launch an official merchandise collaboration with an NFL franchise: the Kansas City Chiefs in 2022. In 2021, Kelce released a signature sneaker collection as part of a deal with Nike. The collection was called Nike x Kelce Blazer Mid '77 Vintage and included six shoes that inspired by facets of Kelce's life, including his brand and his team's colors. Kelce is co-owner of a car wash chain named Club Car Wash that operates in 109 locations in eight  states in the central U.S. In October 2023, Kelce and  Walmart launched Travis Kelce's Kitchen, a line of seven barbecue products inspired by the flavors of Kansas City.In 2019, Kelce invested in the private equity firm L Catterton's purchase of the condiment brand Cholula Hot Sauce. He earned four times his investment when  McCormick & Company acquired the brand for $800 million in 2020. Kelce is also an angel investor in several companies, including the tequila brand Casa Azul, the whole-grain pancake and waffle mixes Kodiak Cakes, and the made-to-measure menswear retailer Indochino. In 2023, Kelce joined a group of investors, including actor Ryan Reynolds and teammate Mahomes, to buy a stake in  Alpine, a UK-based French Formula One team. The exact amount or stake was not disclosed."}, {"text": "== Personal life ==Kelce and Maya Benberry, the winner of his dating show, started dating after the show ended in April 2016. In January 2017, Benberry confirmed that they had broken up. From 2017 to 2022, Kelce was in a relationship with social media influencer Kayla Nicole Brown.Kelce began dating singer-songwriter Taylor Swift in 2023. There is evidence that the highly publicized relationship and Swift's attendance at games has increased NFL viewership. Some NFL games that Swift attended broke viewership, ticket sales, and merchandise sales records: a Chiefs–Chicago Bears game drew the most television viewers of the weekend, a Chiefs–New York Jets game averaged 27 million viewers, making it the most-watched Sunday-night television show since Super Bowl LVII, and a Chiefs–Buffalo Bills game on January 21, 2024, became the most-watched NFL divisional playoff game ever and the most-watched program on any network since Super Bowl LVII. The Chiefs–Baltimore Ravens AFC Conference Championship Game, was the most watched AFC Championship game of all time. Kelce and Swift have been widely referred to as a supercouple; some call them \"America's very own royal couple\". With the Chiefs advancing to Super Bowl LVIII, the game has been referred to as the Taylor Swift Bowl. One widely cited estimate by a sports marketing company said the Kelce-Swift relationship had so stimulated ticket sales, viewership, and merchandising that the Chiefs franchise had gained $331.4 million in value in six months.Kelce plays golf during the offseason. He has participated in several celebrity tournaments, including the American Century Championship, at which he won the long drive contest in the 2023 edition. In 2023, he participated in The Match VIII, teaming up with his Chiefs teammate Patrick Mahomes against Golden State Warriors teammates Stephen Curry and Klay Thompson. Mahomes and Kelce won.  Kelce owns homes in the Kansas City area and a condo in Orlando, Florida. He is also an avid car collector."}, {"text": "== See also ==List of National Football League career receiving touchdowns leaders"}, {"text": "== See also ==List of National Football League career receiving yards leaders"}, {"text": "== See also ==List of National Football League career receptions leaders"}, {"text": "== External links ==Career statistics and player information from NFL.com · ESPN · Pro Football Reference"}, {"text": "== External links ==Cincinnati Bearcats profile Archived March 20, 2017, at the Wayback Machine"}, {"text": "== External links ==Kansas City Chiefs profile"}, {"text": "== External links ==Eighty-Seven & Running"}]