[{"text": "Vanna Marie White (née Rosich; born February 18, 1957) is an American television personality and game-show hostess, best known as the co-host of the game show Wheel of Fortune, a position she has held since 1982. She began her career as a model while studying fashion, competing in Miss Georgia USA in 1978. In addition to her work on Wheel of Fortune, she has played minor characters or appeared as herself in many films and television series, and is the author of the 1987 autobiography Vanna Speaks. She also participates in real-estate investment, owns the yarn brand Vanna's Choice, and is a patron of St. Jude Children's Research Hospital."}, {"text": "== Early life ==Vanna Marie Rosich was born on February 18, 1957, near North Myrtle Beach in Horry County, South Carolina, the daughter of Joan Marie (Nicholas) and Miguel Angel Rosich. According to census records her paternal (Rosich) 2nd great-grandparents  were Spanish from Mallorca, who settled in Ponce, Puerto Rico. Her parents divorced when she was an infant, and she was raised by her mother Joan, and Joan's second husband Herbert White Jr., a former real estate broker, in North Myrtle Beach, and she took his surname. After graduating from high school, White moved to Atlanta, Georgia, where she attended the Atlanta School of Fashion and Design and worked as a model. She headed to Los Angeles in 1979 to pursue an acting career, but in the summer of 1980, she returned briefly to South Carolina to see her mother, who was dying of ovarian cancer."}, {"text": "=== Television, motion picture, and other media appearances ===Before her appearance on TV, White was a contestant in the Miss Georgia USA 1978 pageant.Her first appearance in a game show was on the June 20, 1980, episode of The Price Is Right, where she was among the first four contestants. She did not make it on stage, but the clip of her running to Contestants' Row was rebroadcast as part of The Price Is Right 25th Anniversary Special in August 1996 and The Price Is Right Celebrates 50 Years in September 2021 (in which she also appeared as a Guest Model during the show), and also was featured on the special broadcast Game Show Moments Gone Bananas."}, {"text": "=== Television, motion picture, and other media appearances ===In 1980, White acted in a film that was not completed; it was subsequently edited and released in June 1990 as Gypsy Angels. In 1981, she got a bit part in the film Looker and also appeared as Doris in the horror movie Graduation Day, an American slasher film directed by Herb Freed and produced by Troma Entertainment.Her 1987 autobiography, Vanna Speaks!, was a best-seller. Also in 1987, she was featured in a Playboy pictorial, showing photos taken of her before her career on Wheel of Fortune, wearing see-through lingerie. She starred as the title character, Venus, in the 1988 television movie Goddess of Love.She has made cameo appearances on television shows such as L.A. Law, 227, Super Mario Bros. Super Show, Simon and Simon, The King of Queens, Full House, RuPaul's Drag Race All Stars and in films such as Naked Gun 33+1⁄3: The Final Insult (1994) Double Dragon (1994) and the Australian variety series Hey Hey It's Saturday."}, {"text": "=== Television, motion picture, and other media appearances ===She guest-starred on Married...With Children; in a gender-bending parody of the film Indecent Proposal, White had the Robert Redford role while Al Bundy had that of Demi Moore. She served as guest timekeeper and provided interviews from the backstage area throughout the evening for WrestleMania IV. In 1996, she was the main narrator and singer in the CD release of Leslie Bricusse's \"Santa's Last Ride\".On April 20, 2006, she was honored with a star on the Hollywood Walk of Fame, with Pat Sajak, Merv Griffin, and Alex Trebek as key witnesses.White lent her voice to the Canadian animated television special The Real Story of Twinkle, Twinkle Little Star and the American animated television series Captain Planet and the Planeteers.White presented a set of luggage in a special guest appearance on The Price Is Right Celebrates 50 Years in September 2021.In May 2022, White appeared as a special guest in the seventh season of RuPaul's Drag Race: All Stars where the contestants did a runway in tribute to her past looks.On April 21, 2023, it was announced that White would be featured in a four-episode documentary by ABC News titled The Game Show Show, covering the history of game shows in America over the last eight decades. The four-part documentary premiered on May 10, 2023."}, {"text": "=== Wheel of Fortune television game show ===After Wheel of Fortune hostess Susan Stafford left in October 1982, White was selected as one of three substitute hostesses (along with Vicki McCarty and Summer Bartholomew) to co-host the show. On December 13, 1982, White became the regular hostess."}, {"text": "=== Wheel of Fortune television game show ===White temporarily took over hosting Wheel of Fortune as master of ceremonies starting with the week of episodes that were slated to air starting on December 9, 2019. The announcement was made after a taping day was postponed when Sajak was hospitalized with a blocked intestine and needed emergency surgery to clear it. White hosted that taping day and the subsequent rescheduled taping the next day. Guest letter activators were implemented during her shows hosting; the weeks of December 9 and 16 had Mickey Mouse and Minnie Mouse during the Secret Santa Holiday Giveaway.  Subsequently, the show went on hiatus during Christmas week (December 23, 2019) and then a week of previously taped \"America's Game\" episodes (Wheel tapes six episodes per day, with each studio audience receiving three shows each; the third show in the afternoon session is an \"America's Game\" episode) that Sajak hosted, before White returned to hosting on January 6, 2020, for a final week; she was assisted by a \"special guest\", Pat Sajak's daughter Maggie. Fully recovered from his surgery, Sajak returned to the show on December 5, 2019, with episodes to be broadcast beginning on January 13, 2020.White missed filming five episodes in August 2023 after contracting COVID-19. She was temporarily replaced by Bridgette Donald-Blue but returned as host in October 2023. Filming on additional episodes was delayed until after her recovery. This marked the first time that White had missed an episode since 1991. In September 2023, White extended her contract as host of Wheel of Fortune through the 2025–26 season.Since 2021, Sajak and White hosted Celebrity Wheel of Fortune on ABC. Later in the year it was announced that both Sajak and White have been signed on to continue as hosts of Wheel of Fortune through the 2023–24 season. She extended her contract on Celebrity Wheel of Fortune again in July 2023.In May 2023, White competed as a contestant on a celebrity edition of Wheel of Fortune against Jeopardy! hosts Mayim Bialik and Ken Jennings."}, {"text": "=== Real-estate investing ===White uses her income to invest in apartment buildings, and she likes flipping houses. In 2017, she listed her Beverly Hills home for $47.5 million. In 2023, she began renting her home in Sherman Oaks."}, {"text": "=== Crochet and knitting endorsements ===When White was five, her grandmother taught her how to crochet. White had lost interest in the hobby over time, until on the Wheel of Fortune set, she noticed her pregnant hairdresser was crocheting a baby blanket for herself. White told her that she previously crocheted and asked the hairdresser to help her relearn crochet. When she has downtime on the set, she often crochets, as she finds it very relaxing and has something to show for the time she has spent doing it.White began her relationship with Lion Brand Yarns when she spoke about her love of crochet on The Tonight Show Starring Johnny Carson; the yarn company subsequently contacted her and negotiated a contract. She has her own line of yarn called Vanna's Choice and endorses crochet and knitting books published in her name."}, {"text": "=== World record ===White is famous for her seamless revealing of letters on the game board, her smile, and her constant clapping in support of each episode's contestants. On the May 24, 2013 episode of Wheel of Fortune, White was presented with a Guinness World Record certificate for most frequent clapper. As of January 31, 2013, she had clapped an estimated 3,480,864 times across the show's 30 seasons. She had appeared in all but 10 of Wheel's 5,754 episodes to that point, during the show's modern syndicated run, which began on September 19, 1983. That works out to an average number of 606 claps per show."}, {"text": "== Personal life ==In the 1980s, White dated and became engaged to soap opera actor John Gibson, a Playgirl magazine centerfold and Chippendales dancer. However, Gibson died in a 1986 airplane crash. In 1990, White married restaurant owner George Santo Pietro. She first became pregnant in September 1992. An episode of Wheel of Fortune contained \"Vanna's pregnant\" as the answer to a puzzle. She miscarried shortly after the episode's taping. White gave birth to a son in 1994 and a daughter in 1997 from her marriage to Santo Pietro. The couple divorced in November 2002. From 2004 to 2006, she was engaged to Southern California businessman Michael Kaye. The two never wed. Since 2012, White has been in a relationship with contractor John Donaldson, whom she met through mutual friends.White is a Baptist.White is sometimes described as the \"niece\" of actor Christopher George. While George is not a biological relation, White's mother grew up with him, and George and his wife took White \"under their wing\" in Los Angeles. In an interview with Larry King, White said that her children often come to Wheel of Fortune tapings.On April 1, 2022, White announced that her stepfather Herbert White Jr. had died peacefully that morning."}, {"text": "=== Philanthropy ===As of 2019, White has donated $1.8 million to St. Jude Children's Research Hospital and plans to continue her philanthropy after her retirement."}, {"text": "== Litigation ==In 1993, White sued Samsung Electronics over an advertisement featuring a robot turning letters on a game show, alleging a violation of her personality rights. The lower court's decision in Samsung's favor was reversed by the United States Court of Appeals for the Ninth Circuit, which denied a rehearing, but Judge Alex Kozinski issued a dissent. The U.S. Supreme Court denied certiorari. A jury awarded White $403,000 in damages."}, {"text": "== In popular culture ==Parody song \"Vanna, Pick Me a Letter\" (a riff on Wayne Carson's \"The Letter\") was released by David Kolin (aka Dr. Dave) in 1987. "}, {"text": "== In popular culture ==The second track of \"Weird Al\" Yankovic's 1988 album, Even Worse, features the song Stuck in a Closet with Vanna White."}, {"text": "== In popular culture ==The 2001 Nelly single \"Ride wit Me\", mentions White with the lyrics \"I’m getting pages out of New Jersey from Courtney B. Telling me bout a party up in NYC. And can I make it? Damn right, I be on the next flight,. Paying cash, first class, sitting next to Vanna White…\""}, {"text": "== Publications ==White, Vanna (1987). Vanna Speaks. New York: Warner Books. ISBN 0-446-51366-0."}, {"text": "== External links ==Vanna White at IMDb"}, {"text": "== External links ==Vanna White's biography on wheeloffortune.com"}, {"text": "== External links ==Judge Alex Kozinski's dissent in the White v. Samsung Electronics appeal"}, {"text": "== External links ==Vanna White at The Interviews: An Oral History of Television"}]