[{"text": "Mark Sinclair (born July 18, 1967), known professionally as Vin Diesel, is an American actor and film producer. One of the world's highest-grossing actors, he is best known for portraying Dominic Toretto in the Fast & Furious franchise."}, {"text": "Born in California, Diesel attended NYC's Hunter College, where studies in creative writing led him to begin screenwriting. He wrote, directed, produced, and starred in the short drama film Multi-Facial (1995) and his debut feature Strays (1997). He came to prominence in the late 1990s, and first became known for appearing in Steven Spielberg's Saving Private Ryan in 1998. He followed up with commercially successful films such as Boiler Room (2000), The Pacifier (2005) and Find Me Guilty (2006). He gained stardom as a leading action star headlining numerous franchises, including Fast & Furious, XXX, and The Chronicles of Riddick."}, {"text": "His voice acting work includes The Iron Giant (1999), the video games The Chronicles of Riddick: Escape from Butcher Bay (2004) and The Chronicles of Riddick: Assault on Dark Athena (2009), and the voices of Groot I and Groot II in the Marvel Cinematic Universe (MCU); he portrayed the characters in six superhero films, beginning with Guardians of the Galaxy (2014). Diesel has reprised his role as Groot for the Disney+ animated shorts series I Am Groot (2022–present), the television special The Guardians of the Galaxy Holiday Special (2022), and the animated film Ralph Breaks the Internet (2018). "}, {"text": "He founded the production company One Race Films, where he has also served as a producer or executive producer for his star vehicles. Diesel also founded the record label Racetrack Records and video game developer Tigon Studios, providing his voice and motion capture for all of Tigon's releases."}, {"text": "== Early life ==Diesel was born Mark Sinclair on July 18, 1967, in Alameda County, California, where his mother was also born, though later moved to New York City with his fraternal twin brother, Paul. His mother, Delora Sherleen Vincent (née Sinclair), is an astrologer. He was raised by his white mother and adoptive African-American father, Irving H. Vincent, an acting instructor and theater manager. Diesel has stated that he is \"of ambiguous ethnicity.\" His mother has Scottish roots. He has never met his biological father, and has said that \"all I know from my mother is that I have connections to many different cultures\"; Diesel believes that his parents' relationship would have been illegal in parts of the United States due to anti-miscegenation laws."}, {"text": "== Early life ==Diesel made his stage debut at age seven when he appeared in the children's play Dinosaur Door, written by Barbara Garson. The play was produced at Theater for the New City in New York's Greenwich Village. His involvement in the play came about when he, his brother and some friends had broken into the Theater for the New City space on Jane Street with the intent to vandalize it. They were confronted by the theater's artistic director, Crystal Field, who offered them roles in the upcoming show instead of calling the police. Diesel remained involved with the theater throughout adolescence, going on to attend NYC's Hunter College, where studies in creative writing led him to begin screenwriting. He has identified himself as a \"multi-faceted\" actor."}, {"text": "== Early life ==Sinclair began going by his stage name \"Vin Diesel\" while working as a bouncer at the New York nightclub Tunnel, wanting a tougher sounding name for his occupation. Vin comes from his mother's married last name Vincent, while the surname Diesel came from his friends due to his tendency to be energetic."}, {"text": "== Career ==Diesel's first film role was as an uncredited extra in the drama film Awakenings in 1990. After several years of struggle to gain acting roles, Diesel decided to make his own short film to secure funds for his feature film debut. In 1994, he wrote, directed, produced, and starred in the short drama film Multi-Facial, a semi-autobiographical film which follows a struggling multiracial actor stuck in the audition process. The film was selected for screening at the 1995 Cannes Festival. As well as acting, Vin Diesel supported himself by working as a bouncer and telemarketer selling lightbulbs."}, {"text": "== Career ==In 1997, Diesel secured funds to make his first feature-length film, Strays, an urban drama in which he played a gang leader whose love for a woman inspires him to try to change his ways. Written, directed, and produced by Diesel, the film was selected for competition at the 1997 Sundance Festival, leading to an MTV deal to turn it into a series which never came to fruition. Director Steven Spielberg took notice of Diesel after seeing him in Multi-Facial and cast him in a small role as a soldier in his 1998 Oscar-winning war film Saving Private Ryan. This marked Diesel’s first major Hollywood film role. In 1999, he provided the voice of the title character in the animated film The Iron Giant."}, {"text": "== Career ==In 2000, Diesel had a supporting role in the drama thriller Boiler Room, where he appeared alongside Giovanni Ribisi and Ben Affleck. He got his breakthrough leading role as the anti-hero Riddick in the science-fiction film Pitch Black later that year."}, {"text": "== Career ==Diesel attained action hero stardom with his portrayal of Dominic Toretto in the street racing action film The Fast and the Furious (2001) and as Xander Cage in the action thriller XXX (2002). He turned down the chance to reprise his roles in the sequels 2 Fast 2 Furious (2003) and XXX: State of the Union (2005). Instead he chose to reprise his role as Riddick in The Chronicles of Riddick (2004), which was a box office failure considering the large budget. He also voiced the character in two spin-off video games and the anime film The Chronicles of Riddick: Dark Fury."}, {"text": "== Career ==In a departure from his previous tough guy action hero persona, in 2005, he played a lighthearted role in the action comedy film The Pacifier, which was a box office success."}, {"text": "== Career ==In 2006, he chose a dramatic role playing real-life mobster Jack DiNorscio in Find Me Guilty. Although he received critical acclaim for his performance, the film did poorly at the box office grossing only $2 million against a budget of $13 million. Later that year, Diesel made a cameo appearance in The Fast and the Furious: Tokyo Drift, reprising his role from The Fast and the Furious."}, {"text": "== Career ==In 2007, Diesel was set to produce and star as Agent 47 in the film adaptation of the video game Hitman, but eventually pulled back and served as executive producer on the film instead. In 2008, he starred in the science-fiction action thriller Babylon A.D. which was a critical and box office failure. Diesel returned to the Fast & Furious series, alongside most of the principal cast from the original 2001 film, in Fast & Furious, which was released in April 2009."}, {"text": "== Career ==Diesel reprised his role as Dominic Toretto in later installments of the Fast & Furious franchise, Fast Five (2011), Fast & Furious 6 (2013), Furious 7 (2015), The Fate of the Furious (2017), F9 (2021) and the most recent entry, Fast X (2023). He reprised his role as Riddick in the third film of The Chronicles of Riddick series, simply titled Riddick (2013). In August 2013, Diesel received a star on the Hollywood Walk of Fame. He voiced Groot in the 2014 Marvel Cinematic Universe film Guardians of the Galaxy."}, {"text": "== Career ==In 2015, he starred in the supernatural action film The Last Witch Hunter. In 2016, Diesel appeared as a supporting character in Ang Lee's war drama Billy Lynn's Long Halftime Walk."}, {"text": "== Career ==In 2017, Diesel also reprised his roles as Xander Cage in XXX: Return of Xander Cage, and Groot in Guardians of the Galaxy Vol. 2. Over the course of several years, Diesel has discussed playing two separate roles within the Marvel Cinematic Universe. In November 2016 director of Guardians of the Galaxy, James Gunn, confirmed that Diesel had been in talks to play Blackagar Boltagon / Black Bolt for the planned Inhumans film, but it was turned into a television series instead without Diesel involved."}, {"text": "== Career ==Diesel reprised his role of Groot once again in the crossover films Avengers: Infinity War (2018) and Avengers: Endgame (2019) which combined the superhero teams of Guardians of the Galaxy and The Avengers. He has said, \"[I] think there's gonna be a moment that we're all waiting for, and whether you know it or not, you are waiting to see [Groot] and [the Hulk] get down.\""}, {"text": "== Career ==Diesel portrayed Valiant Comics character Bloodshot in the film of the same name which released in March 2020."}, {"text": "== Career ==In September 2020, Diesel announced his venture into music, with the release of the song \"Feel Like I Do\", produced by Kygo. He debuted the song on The Kelly Clarkson Show on September 24, stating: \"I am blessed that on a year that I would normally be on a movie set — and as you know, that's not possible — I've had another creative outlet. Another way to show you, or share with you, my heart.\""}, {"text": "== Career ==Diesel will appear in Riddick: Furya, the fourth installment of The Chronicles of Riddick franchise, announced in February 2023."}, {"text": "== Personal life ==Diesel has said he prefers to maintain his privacy regarding his personal life, stating: \"I'm not gonna put it out there on a magazine cover like some other actors. I come from the Harrison Ford, Marlon Brando, Robert De Niro, Al Pacino code of silence.\""}, {"text": "=== Relationships and marriage ===Sometime around 2001, Diesel dated his Fast & Furious co-star Michelle Rodriguez. Since 2007, he has been in a relationship with Mexican model Paloma Jimenez; the couple have three children, two daughters born in April 2008 and March 2015, and a son born 2010. The youngest daughter is named in honor of his co-star and close friend Paul Walker, who died in November 2013. He is also the godfather of Walker's daughter, Meadow. Diesel also shares a close friendship with Fast & Furious co-star Tyrese Gibson."}, {"text": "=== Voice ===Diesel is noted for his distinctive deep voice. He said his voice broke around age 15, giving him a mature-sounding voice on the telephone, which he often uses for his acting performances. Diesel is a longtime Dungeons & Dragons fan, and wrote the foreword for 30 Years of Adventure: A Celebration of Dungeons & Dragons (2004). Canadian video game designer and developer Merritt k created the 2015 ASMR game Vin Diesel DMing a Game of D&D Just For You for him. He has expressed his love for the Dominican Republic and how he relates to its multicultural facets. He is acquainted with its former president, Leonel Fernández, and appeared in one of Fernández's earlier campaign advertisements. He later secured film production in the country for Los Bandoleros and Fast & Furious (both 2009)."}, {"text": "=== Legal issues ===In December 2023, former assistant Asta Jonasson sued Diesel for sexual battery and retaliation. The lawsuit alleges that, in 2010 during the filming of Fast Five in Atlanta, he brought her to his suite at the St. Regis Hotel and forced her onto his bed. Jonasson accuses him of \"forcibly grabbing [her] and groping her breasts, and kissing her chest..and trying to pull down her underwear\". She further accuses him of pressing her against the wall and forcing her to touch his erect penis, and then he began to masturbate. She was fired a few days later which she believes was retaliatory with the suit reading, \"It was clear to her that she was being fired because she was no longer useful — Vin Diesel had used her to fulfill his sexual desires and she had resisted his sexual assaults\"."}, {"text": "== External links ==Vin Diesel at IMDb"}, {"text": "== External links ==Vin Diesel at Rotten Tomatoes"}, {"text": "== External links ==Vin Diesel at Curlie"}]