[{"text": "Whitney Elizabeth Houston (August 9, 1963 – February 11, 2012) was an American singer, actress, film producer, and philanthropist. Known as \"the Voice\", she was ranked second on Rolling Stone's list of the greatest singers of all time and is one of the best-selling music artists of all time, with over 220 million records sold worldwide. Houston influenced many singers in the recording industry and was known for her powerful, soulful vocals, vocal improvisation skills, as well as popularizing the use of gospel singing techniques in pop music, and live performances. She had 11 number-one singles on the Billboard Hot 100 and is the only artist to have seven consecutive number-one singles on the chart. Houston also enhanced her popularity by entering the film industry. Her accolades include eight Grammy Awards, 22 American Music Awards, two Emmy Awards, and 30 Guinness World Records. Houston's inductions include the Grammy Hall of Fame (twice), the Rock and Roll Hall of Fame, the Rhythm and Blues Music Hall of Fame, the BET Walk of Fame, the Soul Train Hall of Fame, the Georgia Music Hall of Fame, the New Jersey Hall of Fame, and the National Recording Registry at the Library of Congress."}, {"text": "Houston began singing at New Hope Baptist Church in Newark, New Jersey, as a child and became a background vocalist while in high school. She was one of the first black women to appear on the cover of Seventeen after becoming a teen model in 1981. With the guidance of Arista Records chairman Clive Davis, Houston signed to the label at age 19. Her first two studio albums, Whitney Houston (1985) and Whitney (1987), both peaked at number one on the Billboard 200 and are among the best-selling albums of all time. Hit singles from the albums, including \"How Will I Know\", \"Greatest Love of All\" and \"I Wanna Dance with Somebody (Who Loves Me)\", established her as a catalyst in the acceptance of black female artists on MTV. Her third studio album, I'm Your Baby Tonight (1990), yielded two Billboard Hot 100 number-one singles, the title track and \"All the Man That I Need\". Houston's rendition of \"The Star-Spangled Banner\" at Super Bowl XXV in 1991 received widespread media coverage."}, {"text": "Houston made her acting debut with the romantic thriller film The Bodyguard (1992), which despite its mixed reviews became the tenth highest-grossing film to that date. Its soundtrack won the Grammy Award for Album of the Year and remains the bestselling soundtrack album of all time. It generated multiple hit singles, including \"I Have Nothing\", \"I'm Every Woman\" and \"I Will Always Love You\"; the latter won the Grammy Award for Record of the Year, spent a then-record 14 weeks atop the Billboard Hot 100 and became the best-selling single by a woman in music history. Subsequently, she went on to star in the films Waiting to Exhale (1995) and The Preacher's Wife (1996), and she recorded their respective soundtracks; the former scored her last Billboard Hot 100 number-one single, \"Exhale (Shoop Shoop)\", while the latter, produced by Houston herself, became the bestselling gospel album of all time. Houston's first studio album in eight years, My Love Is Your Love (1998), spawned multiple hit singles, including the title track, \"Heartbreak Hotel\", \"It's Not Right but It's Okay\" and the Academy Award-winning Mariah Carey duet \"When You Believe\". As a film producer, she produced hit series such as The Princess Diaries, The Cheetah Girls and multicultural movies such as Cinderella (1997) and Sparkle (2012)."}, {"text": "Following the music and film success, she renewed her contract with Arista Records for $100 million in 2001, one of the biggest recording deals of all time. However, her personal problems began to overshadow her music career. Her 2002 studio album, Just Whitney, received mixed reviews, while her drug use and a tumultuous marriage to singer Bobby Brown received widespread media coverage. After divorcing Brown, Houston returned to the top of the Billboard 200 chart with her final studio album, I Look to You (2009). In February 2012, Houston accidentally drowned in a bathtub at the Beverly Hilton hotel in Beverly Hills, with heart disease and cocaine use as contributing factors. News of her death coincided with the 2012 Grammy Awards, which took place the day following her death, was covered prominent internationally along with her memorial service and created a spike in sales of her music. Coverage of Houston's death was ranked as the most memorable entertainment event in television history, according to a study by Sony Electronics and the Nielsen Television Research Company. Her assets amounted to $250 million, earned over a 25-year career. Her life and career were dramatized in the 2022 biopic I Wanna Dance with Somebody."}, {"text": "== Early life and family ==Whitney Elizabeth Houston was born on August 9, 1963, at Newark Beth Israel Hospital (now Newark Beth Israel Medical Center) in Newark, New Jersey, the daughter of Emily \"Cissy\" (née Drinkard) and John Russell Houston Jr. (1920–2003). Houston's mother Cissy was a Grammy-winning gospel and soul singer, who was a member of The Drinkard Singers and the founder of The Sweet Inspirations, a popular session vocal group that recorded background vocals for the likes of Aretha Franklin, Jimi Hendrix and Elvis Presley. The group later earned a Grammy nomination for their hit, \"Sweet Inspiration\". Cissy later left the Sweet Inspirations, starting a solo career that later resulted in two Grammy Award wins for gospel work. Her father John was a former Army serviceman who later became an administrator who worked for Newark mayor Kenneth A. Gibson."}, {"text": "== Early life and family ==Her parents were both African-American. On her mother's side, Houston was alleged to have partial Dutch and Native American ancestry. Through Cissy, Houston was a first cousin of accomplished singers Dionne and Dee Dee Warwick as well as a distant cousin of opera singer Leontyne Price. Aretha Franklin became an \"honorary aunt\", while Darlene Love later became Houston's godmother. Through her father, her great-great-grandfather Jeremiah Burke Sanderson was an American abolitionist and advocate for the civil and educational rights of black Americans during the mid-19th century. Houston was the youngest child of her parents. She had three older brothers, paternal half-brother John III (1943–2021), maternal half-brother Gary Garland, a former basketball player and singer, and Michael Houston, a songwriter and road manager."}, {"text": "== Early life and family ==The family later relocated to a suburban area of East Orange three years following the Newark race riots of 1967. Houston attended Franklin Elementary School (now Whitney E. Houston Academy of Creative and Performing Arts) before transferring to Mount Saint Dominic Academy by sixth grade. Houston was raised in the Baptist faith by her parents and joined the church choir of the New Hope Baptist Church in Newark at age five where she also learned to play piano. Houston later recalled being exposed to the Pentecostal church nearby as well. Houston made her solo performance debut at New Hope singing the hymn \"Guide Me O Thou Great Jehovah\" at age 12. When Houston became a teenager, she told her mother that she wanted to pursue a career in music. Throughout her teenage years, Houston would be taught how to sing by Cissy. Along with her mother, cousins Dionne and Dee Dee and Franklin, Houston was also influenced by other singers such as Chaka Khan, Gladys Knight and Roberta Flack."}, {"text": "=== 1978–1984: Early career ===After placing second place at a statewide talent showcase in 1977, Houston began singing background for her mother's band on the cabaret club circuit in New York City. On February 18, 1978, a fourteen-year-old Houston made her non-church performance debut at Manhattan's Town Hall singing the Broadway standard \"Tomorrow\" from the musical Annie, receiving her first standing ovation. Later that year, Houston sang background on mother Cissy's solo album, Think It Over, with the title track later reaching the top 5 of the Billboard disco chart. The album's producer Michael Zager recorded her lead vocal on his disco song, \"Life's a Party\", with the album of the same name released later in 1978. Houston's session vocal career took off when she sang background for Chaka Khan and Lou Rawls on their respective albums, Naughty and Shades of Blue, both released in 1980."}, {"text": "=== 1978–1984: Early career ===Houston became a fashion model after she was discovered by a photographer who filmed her and her mother during a performance for the United Negro College Fund at Carnegie Hall. She became one of the first black women to appear on the cover of a fashion magazine when she appeared on the cover of Seventeen. She would also appear inside other magazines such as Glamour, Cosmopolitan and Young Miss. Her looks and girl-next-door charm made her one of the most sought-after teen models. In February 1981, Houston recorded three demo recordings of gospel music with producer and music executive Steven Abdul Khan Brown in hopes of Houston getting signed to a recording deal. Khan Brown later would claim the demos helped Houston secure her deal with Arista Records in early 1983. During this period, Houston was sought after for record deals between 1979 and 1981 by the likes of Michael Zager and Luther Vandross. The offers, however, were turned down by her mother because she wanted Houston to finish school. Weeks after graduation, Houston signed with Tara Productions, under the advice of her cousin Dionne, and hired Gene Harvey as her manager, with co-managers Daniel Gittelman and Seymour Flics, also working closely with the singer."}, {"text": "=== 1978–1984: Early career ===Houston would see her profile raised after being hired to sing on the song \"Memories\" by the band Material, later released on their 1982 album, One Down. Robert Christgau of The Village Voice called her contribution \"one of the most gorgeous ballads you've ever heard\". Later in 1982, she recorded the soul ballad, \"Eternal Love\", by producer and songwriter Paul Jabara, which was later featured on Jabara's 1983 album, Paul Jabara & Friends, with its original title including Houston's name on the cover. The song was later covered by R&B singer Stephanie Mills for her album, Merciless that same year. During this time, she was sought after by Elektra president Bruce Lundvall, who offered her a contract at the end of 1982. In March 1983, Gerry Griffith, an A&R representative for Arista Records, saw Houston performing with her mother at the Seventh Avenue South nightclub in Manhattan. He convinced Arista head Clive Davis to make time to see her perform at another nightclub called Sweetwaters the following week. Davis was impressed and immediately offered a worldwide record deal, which Houston eventually signed on April 10, 1983; since she was only nineteen, her parents also signed for her. Two weeks later, on April 29, Houston performed on The Merv Griffin Show, after an introduction from Davis. Her performance later aired on June 23. She performed \"Home\", a song from the musical The Wiz."}, {"text": "=== 1978–1984: Early career ===Houston did not begin work on an album immediately. The label wanted to make sure no other label signed her away and Davis wanted to ensure he had the right material and producers for her debut album. Some producers passed on the project because of prior commitments. Houston first recorded a duet with Teddy Pendergrass, \"Hold Me\", which appeared on his gold album, Love Language. The single was released in 1984 and gave Houston her first taste of success, becoming a top ten hit on the R&B and adult contemporary charts. It would also appear on her debut album in 1985. She also appeared as a duet vocalist and background singer on Jermaine Jackson's Dynamite and Kashif's Send Me Your Love albums. During this early period, Houston continued to model, appeared in a commercial for the Canada Dry soft drink, and also began singing commercial jingles, including one for the restaurant brand, Steak & Ale."}, {"text": "=== 1985–1986: Whitney Houston and rise to international prominence ===After nearly two years of sessions, Whitney Houston was released on Valentine's Day, February 14, 1985. Co-produced by Kashif, Jermaine Jackson, Michael Masser and Narada Michael Walden, the album would spend more than three years on the Billboard 200 and shot up to No. 1 on the chart in March 1986, over a year after its release, where it would stay for fourteen weeks. The album would hit number one or hit the top five in more than ten other countries. Certified Diamond in the United States for sales of 14 million copies, the album has reportedly sold 25 million copies worldwide. Rolling Stone magazine praised Houston, calling her \"one of the most exciting new voices in years\" while The New York Times called the album \"an impressive, musically conservative showcase for an exceptional vocal talent\"."}, {"text": "=== 1985–1986: Whitney Houston and rise to international prominence ===The album launched seven singles in various countries, including four alone in the United States. The album spawned four top ten singles on the Billboard Hot 100, including the top five crossover hit, \"You Give Good Love\", and three consecutive number one singles, \"Saving All My Love for You\", \"How Will I Know\" and \"Greatest Love of All\". This feat made Houston the first solo female recording artist to launch three number one singles off a single album. Outside the US, \"Saving All My Love for You\" hit number one in the UK and Ireland, \"How Will I Know\" reached number one in Canada, and \"Greatest Love of All\" topped the charts in Australia. In addition, the album's international success was further buoyed by the ballad \"All at Once\", which hit the top five in selected European countries. Another song, \"Thinking About You\", became a top ten single on the R&B chart."}, {"text": "=== 1985–1986: Whitney Houston and rise to international prominence ===The album would receive four Grammy Award nominations, including three at the 1986 ceremony, including Album of the Year, winning one in the Best Female Pop Vocal Performance category for \"Saving All My Love for You\". A controversy arose after Houston was deemed ineligible for entry for a nomination for Best New Artist. Despite an angry letter from Clive Davis, the committee defended the decision, noting Houston's previous chart duet with Teddy Pendergrass. Houston received more awards from her work on the album including 14 Billboard Awards, including \"Top Pop Artist\" and \"Top Pop Album\", the first album by a female artist to receive that distinction, and an NAACP Image Award. Houston's music video for \"How Will I Know\" won her an MTV Video Music Award. Houston's performance of \"Saving All My Love for You\" at the 1986 Grammys later resulted in Houston winning an Emmy Award. Houston would also receive seven American Music Awards, including five alone in 1987."}, {"text": "=== 1985–1986: Whitney Houston and rise to international prominence ===Houston first supported the album by being an opening act for singer Jeffrey Osborne before moving on to open for Luther Vandross. By October 1985, Houston had become a solo headliner, later opening at Carnegie Hall. Houston embarked on her first world tour, The Greatest Love World Tour, in July 1986. Houston toured for 50 dates up until the end of the year. The album's success was attributed to Houston's performances on late night talk shows, something that was usually not accessible to emerging black acts. Though Houston's early music video clips for \"You Give Good Love\" and \"Saving All My Love for You\" found heavy airplay on stations such as BET and VH1, the singer and Arista struggled to submit these videos to MTV. At that time, the channel received harsh criticism for not playing enough videos by artists of color while favoring predominantly white acts. In 2001, Houston explained in an interview with the channel how it rejected \"You Give Good Love\" because it was a \"very kind of R&B song\". Following the release of \"Saving All My Love for You\", MTV agreed to play its video clip on light rotation because, Houston said, the song \"hit so hard and exploded so heavy\" that they \"had no choice but to play it.\""}, {"text": "=== 1985–1986: Whitney Houston and rise to international prominence ===In December 1985, Arista submitted the video to \"How Will I Know\", which immediately gained heavy rotation and introduced Houston to the young MTV audience. Though other artists such as Donna Summer and Tina Turner had enjoyed heavy rotation on the channel prior to Houston's entrance, black female artists were still \"woefully underrepresented on MTV's playlist\". According to author Ann Kaplan, in her book, Rocking Around the Clock: Television, Postmodernism and Consumer Culture, \"until the recent advent of Whitney Houston, Tina Turner was the only female Black singer featured regularly, and even so, her videos are far and few between.\" Houston was credited for breaking barriers for black female artists on the channel resulting in videos by Janet Jackson, Jody Watley and Tracy Chapman to be immediately accepted to the channel's playlist. Houston's success also made it possible for other African American female artists to break through on pop radio following the fallout of disco, opening doors for Jackson and Anita Baker among others. Houston's debut album is listed as one of Rolling Stone's 500 Greatest Albums of All Time and on the Rock and Roll Hall of Fame's Definitive 200 list. Houston's grand entrance into the music industry is considered one of the 25 musical milestones of the last 25 years, according to USA Today."}, {"text": "=== 1987–1989: Whitney and social activism ===In June 1987, Houston's second album, Whitney, was released. Produced majorly by Narada Michael Walden, the album also featured productions from past collaborators Michael Masser and Kashif, with the sole new producer, Jellybean Benitez, contributing the hit dance song, \"Love Will Save the Day\". Critics complained that the material was too similar to her previous album. Rolling Stone said, \"the narrow channel through which this talent has been directed is frustrating\". The album nonetheless enjoyed commercial success. Houston became the first woman in music history to debut at number one on the Billboard 200 chart and the first artist ever to enter number one in the US and UK, while also hitting number one or top ten in dozens of other countries around the world. The album would stay at number one on the Billboard 200 for its first eleven weeks, a record by a female artist that remains so to this day."}, {"text": "=== 1987–1989: Whitney and social activism ===The album's first single, \"I Wanna Dance with Somebody (Who Loves Me)\", released a month earlier in May, was also a massive hit worldwide, peaking at number one on the Billboard Hot 100 and topping the singles chart in 17 countries, including Australia, West Germany and the UK. To date, the single has sold over 14 million copies worldwide. Following that single was three more singles, \"Didn't We Almost Have It All\", \"So Emotional\" and \"Where Do Broken Hearts Go\", all of which peaked at number one on the Billboard Hot 100. With this feat, Houston became the first recording artist in history to earn seven consecutive number one hits, besting the previous record of six, held by the Beatles and the Bee Gees. Houston remains the only artist to ever accomplish this feat as of 2024. In addition, Houston also became the first female artist to generate four number one singles off one album. Whitney has been certified Diamond in the US for shipments of over ten million copies and has sold a total of 20 million copies worldwide."}, {"text": "=== 1987–1989: Whitney and social activism ===The album was nominated for the Grammy Award for Album of the Year at the 1988 ceremony. Houston would eventually win her second Grammy that year in the Best Female Pop Vocal Performance category for \"I Wanna Dance with Somebody (Who Loves Me)\". In addition, Houston would win four American Music Awards for her work on the album. She also won her first Soul Train Music Award when the album won for best R&B album by a female artist. In addition, the album also won Houston six Billboard Awards."}, {"text": "=== 1987–1989: Whitney and social activism ===Just a month after the album's release, Houston launched her second world tour, the Moment of Truth World Tour at Tampa Stadium in July 1987. The tour eventually ended its North American leg as one of the ten highest-grossing concert tours of the year and the highest-grossing of the year by a female performer, topping tours by both Madonna and Tina Turner. Houston would eventually toured 150 dates throughout the nearly two-year tour, including eight sold out dates at London's Wembley Arena. The singer's unprecedented successes helped her to earn notices on Forbes magazine. In 1987, she was ranked the eighth highest-ranking entertainer of the year on its Forbes 40 list, earning $43 million in that year alone. The highest-earning musician and highest black female entertainer on the list, she was only the third highest after Bill Cosby and Eddie Murphy. In 1988, she ranked 17th."}, {"text": "=== 1987–1989: Whitney and social activism ===Houston was a supporter of Nelson Mandela and the anti-apartheid movement. During her modeling days, she refused to work with agencies who did business with the then-apartheid South Africa. On June 11, 1988, during the European leg of her tour, Houston joined other musicians to perform a set at Wembley Stadium in London to celebrate a then-imprisoned Nelson Mandela's 70th birthday. Over 72,000 people attended Wembley Stadium and over a billion people tuned in worldwide as the rock concert raised over $1 million for charities while bringing awareness to apartheid. Houston then flew back to the US for a concert at Madison Square Garden in New York City in August. The show was a benefit concert that raised a quarter of a million dollars for the United Negro College Fund. In the same year, she recorded a song for NBC's coverage of the 1988 Summer Olympics, \"One Moment in Time\", which became a Top 5 hit in the US, while reaching number one in the UK and Germany. The song later won Houston and her producer Narada Michael Walden a Sports Emmy Award. In January 1989, Houston formed The Whitney Houston Foundation For Children, a nonprofit organization that has raised funds for the needs of children around the world. The organization cares for homelessness, children with cancer or AIDS and other issues of self-empowerment. The organization now functions under the name, the Whitney E. Houston Legacy Foundation."}, {"text": "=== 1990–1991: I'm Your Baby Tonight and \"The Star-Spangled Banner\" ===With the success of her first two albums, Houston became an international crossover superstar, appealing to all demographics. However, some black critics believed she was \"selling out\". They felt her singing on record lacked the soul that was present during her live concerts. At the 1989 Soul Train Music Awards, when Houston's name was called out for a nomination, a few in the audience jeered. Houston defended herself against the criticism, stating, \"If you're gonna have a long career, there's a certain way to do it and I did it that way. I'm not ashamed of it.\""}, {"text": "=== 1990–1991: I'm Your Baby Tonight and \"The Star-Spangled Banner\" ===Houston took a more urban direction with her third studio album, I'm Your Baby Tonight, released in November 1990. The first album in which she served as executive producer and exerted creative control for the first time in her career, Houston chose mostly black producers such as the team of L.A. Reid and Babyface, as well as Luther Vandross and Stevie Wonder, while maintaining Narada Michael Walden as one of the main producers. The album showed Houston's versatility on a new batch of tough rhythmic grooves, soulful ballads and uptempo dance tracks. Reviews were mixed. Rolling Stone felt it was her \"best and most integrated album\", while Entertainment Weekly, at the time thought Houston's shift towards an urban direction was \"superficial\"."}, {"text": "=== 1990–1991: I'm Your Baby Tonight and \"The Star-Spangled Banner\" ===Reaching number three on the Billboard 200, the album stayed inside the top ten for 22 weeks, becoming the tenth best-selling album of 1991. The album also became Houston's second number one album on the Top R&B Albums chart, staying there for eight consecutive weeks. The album launched six singles, three of which - \"I'm Your Baby Tonight\", \"All the Man That I Need\" and \"Miracle\", made the top ten, with the former two topping the Billboard Hot 100. That feat helped Houston become the first female solo artist to have multiple number one singles off three or more albums. The fourth single, \"My Name Is Not Susan\", peaked inside the top 20, while the latter two - \"I Belong to You\" and \"We Didn't Know\", a duet with Wonder, was only issued to R&B stations. It became Houston's third album to yield five or more top ten singles on the R&B chart. The album would be certified four times platinum in the US for sales of four million copies, while shipping 10 million copies worldwide. The album would eventually win Houston eight Billboard awards, including four trophies at the actual Billboard Music Awards in December 1991, including Top R&B Artist. Three of the songs, including \"I'm Your Baby Tonight\" and \"All the Man That I Need\", received Grammy nominations. The remix to \"My Name Is Not Susan\", with British rapper Monie Love, marked one of the first instances of a remix of a pop song to feature a rapper. A bonus track from the album's Japanese edition, \"Higher Love\", was remixed by Norwegian DJ and record producer Kygo and released posthumously in 2019 to commercial success. It topped the US Dance Club Songs chart and peaked at number two in the UK, becoming Houston's highest-charting single in the country since 1999."}, {"text": "=== 1990–1991: I'm Your Baby Tonight and \"The Star-Spangled Banner\" ===During the Persian Gulf War, on January 27, 1991, Houston performed \"The Star-Spangled Banner\", the US national anthem, at Super Bowl XXV at Tampa Stadium. Houston's vocals were pre-recorded, prompting criticism. Dan Klores, a spokesman for Houston, said: \"This is not a Milli Vanilli thing. She sang live, but the microphone was turned off. It was a technical decision, partially based on the noise factor. This is standard procedure at these events.\" Nevertheless, a commercial single and video of the performance reached the Top 20 on the US Hot 100, giving Houston the biggest chart hit for a performance of the national anthem."}, {"text": "=== 1990–1991: I'm Your Baby Tonight and \"The Star-Spangled Banner\" ===Houston donated her share of the proceeds to the American Red Cross Gulf Crisis Fund and was named to the Red Cross Board of Governors. Her rendition was critically acclaimed and is considered the benchmark for singers; VH1 listed the performance as one of the greatest moments that rocked TV. Following the September 11, 2001, terrorist attacks, the single was rereleased, with all profits going towards the firefighters and victims of the attacks. It peaked at No. 6 in the Hot 100 and was certified platinum."}, {"text": "=== 1990–1991: I'm Your Baby Tonight and \"The Star-Spangled Banner\" ===Later in 1991, Houston put together her Welcome Home Heroes concert with HBO for the soldiers fighting in the Persian Gulf War and their families. The free concert took place at Naval Station Norfolk in Norfolk, Virginia in front of 3,500 servicemen and women. HBO descrambled the concert so that it was free for everyone to watch. The show gave HBO its highest ratings ever. Houston then embarked on her third world tour, the I'm Your Baby Tonight World Tour, which Houston would give 96 shows, including a historic ten date sold-out residency at Wembley Arena in London. The concert tour produced mixed to positive reviews. While The Sun Sentinel argued that Houston should've opted for smaller venues and theaters that were \"far more suitable to her sophistication and talent\", USA Today praised Houston for \"shak[ing] the confinements of her recordings' calculated productions and gets downright gutsy and soulful\""}, {"text": "=== 1992–1994: The Bodyguard ===With the success of her music, Houston received offers of film work, including work with Robert De Niro, Quincy Jones and Spike Lee, but she did not feel the time was right. Her first film role was in The Bodyguard, released in 1992. Houston played a star who is stalked by a crazed fan and hires a bodyguard (played by Kevin Costner) to protect her. Houston's mainstream appeal allowed audiences to look past the interracial nature of her character's relationship with Costner's character. However, controversy arose as some felt Houston's face had been intentionally left out of the advertising to hide the film's interracial relationship. In a 1993 interview with Rolling Stone, Houston said that \"people know who Whitney Houston is – I'm black. You can't hide that fact.\" The film received mixed reviews. Writing for The Washington Post, Rita Kempley wrote that Houston was merely \"playing herself\", but came out \"largely unscathed if that is possible in so cockamamie an undertaking\". Janet Maslin of The New York Times felt Houston lacked chemistry with Costner. Houston was nominated for a Razzie Award but also received favorable acting nods, including a nomination for Outstanding Actress at the NAACP Image Awards, four acting nods at the 1993 MTV Movie Awards and a People's Choice Award nod for Favorite Actress in a Dramatic Motion Picture. Upon its release, The Bodyguard grossed more than $121 million in the U.S. and $410 million worldwide, making it one of the top 100 highest-grossing films in history at its time of release. It remains in the top forty of most successful R-rated films in box office history."}, {"text": "=== 1992–1994: The Bodyguard ===The film's soundtrack also enjoyed success. Houston executive produced the soundtrack along with Davis and recorded six songs for the album. Rolling Stone described it as \"nothing more than pleasant, tasteful and urbane\". The soundtrack's lead single was \"I Will Always Love You\", written and originally recorded by Dolly Parton in 1974. Houston's version was highly acclaimed by critics, regarding it as her \"signature song\" or \"iconic performance\". Rolling Stone and USA Today called her rendition a tour-de-force. The single peaked at number one on the Billboard Hot 100 and Hot R&B Singles charts for fourteen and eleven weeks respectively, record-setting numbers at the time, while also topping the Adult Contemporary chart for five weeks, resulting in her fourth record-setting \"triple-crown\" number one single. The single was later certified diamond by the RIAA for sales of ten million copies, becoming Houston's first diamond single. She posthumously joined singers Taylor Swift and Mariah Carey as only the third female artist to earn both a diamond single and album. In January 1993, the song became the first single by a solo artist in US history to sell four million copies, later being certified 4x platinum by the RIAA and becoming the bestselling single in US history, a feat later surpassed by Elton John's \"Candle in the Wind '97\". It remains the bestselling US physical single in history by a female recording artist."}, {"text": "=== 1992–1994: The Bodyguard ===The song was a global success, topping the charts in almost all countries. With 24 million copies sold, it became the best-selling single ever by a female solo artist. Houston won the Grammy Award for Record of the Year in 1994 for \"I Will Always Love You\". In addition, it won the MTV Movie Award for Best Song from a Film, two American Music Awards in the favorite pop and soul song categories and two Soul Train Music Awards, including best single by a woman and song of the year. The soundtrack topped the Billboard 200 chart and remained there for 20 weeks. It remains the second longest cumulative number one album by a female artist on the chart after singer Adele's 21. The soundtrack also became one of the fastest-selling albums in history. During Christmas week of 1992, it sold over a million copies within a week, becoming the first album in music history to achieve that feat under the Nielsen SoundScan system. Houston released four more singles from the soundtrack. Two of which, \"I'm Every Woman\" and \"I Have Nothing\", both reaching the top five. On the week of March 13, 1993, Houston became the first solo artist in history to ever have three singles in the top 11 simultaneously and the first artist in general to do so since the beginning of SoundScan. Both \"I'm Every Woman\" and \"I Have Nothing\" hit number one in other Billboard charts, with the former topping the Dance Club Songs chart, and the latter becoming Houston's tenth number one song on the adult contemporary chart. \"Run to You\" was released, peaking at number 31 on the Hot 100, while a remix of \"Queen of the Night\" made number one on the dance chart. On November 3, 1993, Houston made history again when The Bodyguard became the first album by a female artist to be certified ten times platinum by the Recording Industry Association of America, which also made it technically the first album by a female artist to be certified Diamond. It has since gone on to sell more than 18 million copies alone in the United States, with total sales reaching 50 million copies worldwide, becoming the best-selling album by a female artist ever and also the best-selling soundtrack album in history, earning Houston several Guinness World Records."}, {"text": "=== 1992–1994: The Bodyguard ===Houston won the 1994 Grammy Award for Album of the Year for the soundtrack, making her just the second black female artist to win in the category after Natalie Cole won it in 1992 for her album, Unforgettable... with Love. Houston won a record eight American Music Awards, with the album winning in the pop, R&B and adult contemporary album categories, the only album in its history to do so. Houston also received its highest honor, the Award of Merit, becoming at thirty, the youngest female recipient. In addition, the album also won Houston a record fifteen Billboard awards, including 11 at the actual ceremony, three Soul Train Music Awards, including the Sammy Davis, Jr. Award as Entertainer of the Year, five NAACP Image Awards including Entertainer of the Year, a record five World Music Awards, a Juno Award and a BRIT award. Nine years after she first appeared on the charts, Houston was a cover story for Rolling Stone, appearing on the June 10, 1993, issue."}, {"text": "=== 1992–1994: The Bodyguard ===Following the success of The Bodyguard, Houston embarked on another expansive global tour (The Bodyguard World Tour) in 1993–94. Her concerts, movie and recording grosses made her the third highest-earning female entertainer of 1993–94, just behind Oprah Winfrey and Barbra Streisand according to Forbes. Houston placed in the top five of Entertainment Weekly's annual \"Entertainer of the Year\" ranking and was labeled by Premiere magazine as one of the 100 most powerful people in Hollywood."}, {"text": "=== 1992–1994: The Bodyguard ===In October 1994, Houston attended and performed at a state dinner in the White House honoring newly elected South African president Nelson Mandela. At the end of her world tour, Houston performed three concerts in South Africa to honor President Mandela, playing to over 200,000 people; this made her the first major musician to visit the newly unified and apartheid free nation following Mandela's winning election. Portions of Whitney: The Concert for a New South Africa were broadcast live on HBO with funds of the concerts being donated to various charities in South Africa. The event was considered the nation's \"biggest media event since the inauguration of Nelson Mandela\". After two performances in Brunei and Singapore early in 1995,  Houston's children's charity organization was awarded a VH1 Honor for all the charitable work in June of that year."}, {"text": "=== 1995–1997: Waiting to Exhale, The Preacher's Wife and Cinderella ===In 1995, Houston starred alongside Angela Bassett, Loretta Devine and Lela Rochon in her second film, Waiting to Exhale, a motion picture about four African-American women struggling with relationships. Houston played the lead character Savannah Jackson, a TV producer in love with a married man. She chose the role because she saw the film as \"a breakthrough for the image of black women because it presents them both as professionals and as caring mothers\". After opening at number one and grossing $67 million in the US at the box office and $81 million worldwide, it proved that a movie primarily targeting a black audience can cross over to success, while paving the way for other all-black movies such as How Stella Got Her Groove Back and the Tyler Perry movies that became popular in the 2000s. The film is also notable for its portrayal of black women as strong middle class citizens rather than as stereotypes. The reviews were mainly positive for the ensemble cast. The New York Times said: \"Ms. Houston has shed the defensive hauteur that made her portrayal of a pop star in 'The Bodyguard' seem so distant.\" Houston was nominated for a second acting NAACP Image Awards nod for Outstanding Actress in a Motion Picture for her role in the film, but lost to her co-star Bassett."}, {"text": "=== 1995–1997: Waiting to Exhale, The Preacher's Wife and Cinderella ===The film's accompanying soundtrack was written and produced by Babyface and was executive produced by Houston and Clive Davis. Though Babyface originally wanted Houston to record the entire album, she declined. Instead, she \"wanted it to be an album of women with vocal distinction\" and thus gathered several African-American female artists for the soundtrack, to go along with the film's message about strong women. Consequently, the album featured a range of contemporary R&B female recording artists along with Houston, such as Mary J. Blige, Brandy, Toni Braxton, Aretha Franklin and Patti LaBelle. Houston's \"Exhale (Shoop Shoop)\" became just the third single in music history to debut at number one on the Billboard Hot 100 after Michael Jackson's \"You Are Not Alone\" and Mariah Carey's \"Fantasy\". It would be Houston's eleventh and final number one single in her lifetime. It also would spend a record eleven consecutive weeks at the No. 2 spot and eight weeks on top of the R&B charts, her second most successful single on that chart after \"I Will Always Love You\"."}, {"text": "=== 1995–1997: Waiting to Exhale, The Preacher's Wife and Cinderella ===\"Count On Me\", a song Houston co-wrote and composed with her brother Michael and Babyface and made into a duet with longtime friend CeCe Winans, hit the top ten of the Billboard Hot 100 and later won Houston two ASCAP Awards, a BMI Award and two Grammy Award nominations including Best Song Written for Visual Media. A third Houston single, and the last song from the soundtrack to be released, \"Why Does It Hurt So Bad\", reached number 26 on the Hot 100. The album reached number one on the Billboard 200 in January 1996 and would later be certified seven-times platinum in the United States, with total worldwide sales reaching 12 million. The soundtrack received strong reviews; as Entertainment Weekly stated: \"the album goes down easy, just as you'd expect from a package framed by Whitney Houston tracks ... the soundtrack waits to exhale, hovering in sensuous suspense\" and has since ranked it as one of the 100 Best Movie Soundtracks. Houston would win two American Music Awards at the 1997 ceremony for the soundtrack including Top Soundtrack and for Favorite Adult Contemporary Artist."}, {"text": "=== 1995–1997: Waiting to Exhale, The Preacher's Wife and Cinderella ===In 1996, Houston starred in the holiday comedy The Preacher's Wife, with Denzel Washington. She plays the gospel-singing wife of a pastor (Courtney B. Vance). It was largely an updated remake of the 1948 film The Bishop's Wife, which starred Loretta Young, David Niven and Cary Grant. Houston earned $10 million for the role, making her one of the highest-paid actresses in Hollywood at the time and the highest-earning African-American actress in Hollywood. The movie, with its all African-American cast, was a moderate success, earning about $50 million at the U.S. box offices. The movie gave Houston the strongest reviews of her acting career. The San Francisco Chronicle said Houston \"is rather angelic herself, displaying a divine talent for being virtuous and flirtatious at the same time\" and she \"exudes gentle yet spirited warmth, especially when praising the Lord in her gorgeous singing voice\". Houston won the NAACP Image Award for Outstanding Actress in a Motion Picture for her role in the film."}, {"text": "=== 1995–1997: Waiting to Exhale, The Preacher's Wife and Cinderella ===For the film's accompanying gospel soundtrack, Houston co-produced nine of the album's fifteen tracks with Mervyn Warren. Six of the more traditional gospel material was recorded with the Georgia Mass Choir at the Great Star Rising Baptist Church in Atlanta. Houston also recorded a duet with Shirley Caesar and the soundtrack also featured her mother Cissy Houston. Upon its release, it became the first gospel album by a female artist to debut at number one on the Billboard Top Gospel Albums chart. The album sold six million copies worldwide, including three million alone in the United States, becoming the best-selling gospel album ever. The album featured two hit singles, the Grammy-nominated \"I Believe in You and Me\" and \"Step by Step\". In addition to its commercial success, it was also received positively by critics. The album itself was nominated for the Best R&B Album at the 1998 Grammys. However, Houston snubbed the ceremony due to the album not getting a gospel nomination. That year, Houston received two Dove Awards for the album, including Best Traditional Gospel Recorded Song for \"I Go to the Rock\", while also receiving the NAACP Image Award for Outstanding Gospel Artist alongside the Georgia Mass Choir."}, {"text": "=== 1995–1997: Waiting to Exhale, The Preacher's Wife and Cinderella ===In 1997, Houston's production company changed its name to BrownHouse Productions from Houston Productions and was joined by Debra Martin Chase. Their goal was \"to show aspects of the lives of African-Americans that have not been brought to the screen before\" while improving how African-Americans are portrayed in film and television. Their first project was a made-for-television remake of Rodgers and Hammerstein's Cinderella. In addition to co-producing, Houston starred in the film as the Fairy Godmother along with Brandy, Jason Alexander, Whoopi Goldberg and Bernadette Peters. Houston was initially offered the role of Cinderella in 1993, but other projects intervened. The film is notable for its multi-racial cast and non-stereotypical message. An estimated 60 million viewers tuned into the special giving ABC its highest TV ratings in 16 years. The movie received seven Emmy nominations including Outstanding Variety, Musical or Comedy, while winning Outstanding Art Direction in a Variety, Musical or Comedy Special."}, {"text": "=== 1995–1997: Waiting to Exhale, The Preacher's Wife and Cinderella ===Houston and Chase then obtained the rights to the story of Dorothy Dandridge. Houston was to play Dandridge, the first African-American actress to be nominated for an Academy Award for Best Actress. Houston wanted the story told with dignity and honor. However, Halle Berry also had rights to the project and got her version going first. Later that year, Houston paid tribute to her idols, such as Aretha Franklin, Diana Ross and Dionne Warwick, by performing their hits during the three-night HBO Concert Classic Whitney: Live from Washington, D.C. The special raised over $300,000 for the Children's Defense Fund. In February 1998, Houston, 34, received the Quincy Jones Award for outstanding career achievements in the field of entertainment at the 12th Soul Train Music Awards."}, {"text": "=== 1998–2000: My Love Is Your Love and Whitney: The Greatest Hits ===By 1998, Houston hadn't recorded a full-length studio album in eight years. During discussion over a possible greatest hits album with Clive Davis, however, it was agreed that Houston should return to the studio for a brand new album instead. Recorded and mixed in a six-week period - fastest for any Houston recording - Houston released the album, My Love Is Your Love, on November 17, 1998. The album featured production from Rodney Jerkins, Wyclef Jean and Missy Elliott. Led by the Academy Award-winning duet, \"When You Believe\", with singer Mariah Carey off the Prince of Egypt soundtrack in a week full of star-studded releases, the album debuted and peaked at number thirteen on the Billboard 200, while later topping the European Top 100 Albums chart for six weeks, starting in August 1999. The album gave Houston some of her strongest reviews ever. Rolling Stone said Houston was singing \"with a bite in her voice\" and The Village Voice called it \"Whitney's sharpest and most satisfying so far\". Billboard magazine noted the album had a \"funkier and edgier sound than past releases\" and saw Houston \"handling urban dance, hip hop, mid-tempo R&B, reggae, torch songs and ballads all with great dexterity.\""}, {"text": "=== 1998–2000: My Love Is Your Love and Whitney: The Greatest Hits ===The album launched five top 40 singles in the Billboard Hot 100, including three top five singles, \"Heartbreak Hotel\", \"It's Not Right but It's Okay\" and \"My Love Is Your Love\". \"When You Believe\" peaked at No. 15 on the Hot 100 while the album's final single, \"I Learned from the Best\", reached No. 27. The album would itself stay on the charts for more than two years and would later be certified four times platinum in the US for sales of four million copies, moving 11 million copies globally altogether. Four of the five singles reached number one on the US Dance Club Songs chart thanks to remixes by the likes of Hex Hector, Junior Vasquez and Thunderpuss. In Europe, the title track became massively successful, topping the Eurochart Hot 100 and selling over three million copies worldwide. In February 2000, Houston won her sixth and final competitive Grammy for \"It's Not Right but It's Okay\" in the Best Female R&B Vocal Performance category. The European success of the album helped it to win the MTV Europe Music Award for Best R&B. Houston earned four additional Grammy nominations for the album and the music video for \"Heartbreak Hotel\" gave Houston her first MTV Video Music Award nomination in 13 years."}, {"text": "=== 1998–2000: My Love Is Your Love and Whitney: The Greatest Hits ===In 1999, Houston participated in VH-1's Divas Live '99, alongside Brandy, Mary J. Blige, Tina Turner and Cher. The same year, Houston hit the road with her 70-date My Love Is Your Love World Tour. While the North American leg was plagued by cancellations with Houston's publicist citing \"throat problems and a 'bronchitis situation'\", the European leg became hugely successful ending the year as the highest-grossing arena tour of the year in Europe. In November 1999, the Recording Industry Association of America hosted its Century Awards and named Houston the top-selling R&B female artist of the century with certified US sales of 51 million records at the time while the soundtrack to The Bodyguard received awards for being the top-selling soundtrack album of the century and the best-selling album of the century by a female artist. In March 2000, Houston earned a special honor at the 2000 Soul Train Music Awards as the female artist of the decade for her extraordinary artistic contributions during the 1990s."}, {"text": "=== 1998–2000: My Love Is Your Love and Whitney: The Greatest Hits ===In May 2000, Whitney: The Greatest Hits was released worldwide. The double disc set peaked at number five in the United States, reaching number one in the United Kingdom. In addition, the album reached the Top 10 in many other countries. While ballad songs were left unchanged, the album features house/club remixes of many of Houston's up-tempo hits. Included on the album were four new songs: \"Could I Have This Kiss Forever\" (a duet with Enrique Iglesias), \"Same Script, Different Cast\" (a duet with Deborah Cox), \"If I Told You That\" (a duet with George Michael) and \"Fine\" and three hits that had never appeared on a Houston album: \"One Moment in Time\", \"The Star-Spangled Banner\" and \"If You Say My Eyes Are Beautiful\", a duet with Jermaine Jackson from his 1986 Precious Moments album. Along with the album, an accompanying VHS and DVD was released featuring the music videos to Houston's greatest hits, as well as several hard-to-find live performances including her 1983 debut on The Merv Griffin Show and interviews. The set was later certified five times platinum in the US for sales of five million copies, while worldwide sales reached 11 million."}, {"text": "=== 2000–2008: Just Whitney and personal struggles ===Though Houston was seen as a \"good girl\" with a perfect image in the 1980s and early 1990s, her behavior had changed by 2000. She was often hours late for interviews, photo shoots and rehearsals, she canceled concerts and talk-show appearances and there were reports of erratic behavior. Missed performances and weight loss led to rumors about Houston using drugs with her husband. On January 11, 2000, while traveling with Brown, airport security guards discovered half an ounce of marijuana in Houston's handbag at Keahole-Kona International Airport in Hawaii, but she departed before authorities could arrive. Charges against her were later dropped, but rumors of drug usage by Houston and Brown would continue to surface. Two months later, Clive Davis was inducted into the Rock and Roll Hall of Fame; Houston had been scheduled to perform at the event, but was a no-show."}, {"text": "=== 2000–2008: Just Whitney and personal struggles ===Shortly thereafter, Houston was scheduled to perform at the Academy Awards, but was fired from the event by musical director and longtime friend Burt Bacharach. Her publicist cited throat problems as the reason for the cancellation. In his book The Big Show: High Times and Dirty Dealings Backstage at the Academy Awards, author Steve Pond revealed that \"Houston's voice was shaky, she seemed distracted and jittery and her attitude was casual, almost defiant\"; though she was supposed to perform \"Over the Rainbow\", she would sing a different song during rehearsals. Houston later admitted she had been fired."}, {"text": "=== 2000–2008: Just Whitney and personal struggles ===In May 2000, Houston's longtime executive assistant and friend, Robyn Crawford, resigned from Houston's management company. In 2019, Crawford said she had left after Houston declined to seek help for her drug dependency. The following month, Rolling Stone published a story stating that Cissy Houston and others had held a July 1999 intervention in which they unsuccessfully attempted to persuade Whitney to obtain drug treatment."}, {"text": "=== 2000–2008: Just Whitney and personal struggles ===In August 2001, Houston signed one of the biggest record deals in music history, with Arista/BMG. She renewed her contract for $100 million to release six new albums, for which she would also earn royalties. She later made an appearance on Michael Jackson: 30th Anniversary Special, where her extremely thin frame further spurred rumors of drug use. Her publicist stated, \"Whitney has been under stress due to family matters and when she is under stress she doesn't eat.\" In a 2009 interview with Oprah Winfrey, Houston acknowledged that drug use had been the reason for her weight loss. She canceled a second performance scheduled for the following night. Within weeks, Houston's rendition of \"The Star-Spangled Banner\" was re-released after the September 11 attacks, with the proceeds donated to the New York Firefighters 9/11 Disaster Relief Fund and the New York Fraternal Order of Police. It reached No. 6 on the US Hot 100, topping its previous position."}, {"text": "=== 2000–2008: Just Whitney and personal struggles ===In 2002, Houston became embroiled in a legal dispute with John Houston Enterprise. Although the company was started by her father to manage her career, it was actually run by company president Kevin Skinner. Skinner filed a breach of contract lawsuit and sued for $100 million (but lost), stating that Houston owed the company previously unpaid compensation for helping to negotiate her $100 million contract with Arista Records and for sorting out legal matters. Houston stated that her 81-year-old father had nothing to do with the lawsuit. Although Skinner tried to claim otherwise, John Houston never appeared in court. Houston's father later died in February 2003. The lawsuit was dismissed on April 5, 2004, and Skinner was awarded nothing."}, {"text": "=== 2000–2008: Just Whitney and personal struggles ===Also in 2002, Houston gave an interview with Diane Sawyer to promote her then-upcoming album. During the primetime special, she spoke about her drug use and marriage, among other topics. Addressing the ongoing rumors that she was abusing crack cocaine, she said, \"First of all, let's get one thing straight. Crack is cheap. I make too much money to ever smoke crack. Let's get that straight. Okay? We don't do crack. We don't do that. Crack is wack.\" The \"crack is wack\" line was drawn from a mural that Keith Haring painted in 1986 on the handball court at 128th Street and Second Avenue in Manhattan. Houston did, however, admit to using alcohol, marijuana, cocaine and pills; she also acknowledged that her mother had urged her to seek help regarding her drug use. She also denied having an eating disorder and that her very thin appearance was connected to drug use. She further stated that Bobby Brown had never hit her, but acknowledged that she had hit him."}, {"text": "=== 2000–2008: Just Whitney and personal struggles ===In December 2002, Houston released her fifth studio album, Just Whitney. The album included productions from then-husband Bobby Brown, as well as Missy Elliott and Babyface, and marked the first time that Houston did not produce with Clive Davis, as Davis had been released by top management at BMG. Upon its release, Just Whitney received mixed reviews. The album debuted at number 9 on the Billboard 200 chart and it had the highest first week sales of any album Houston had ever released. The four singles released from the album did not fare well on the Billboard Hot 100, but became dance chart hits. Just Whitney was certified platinum in the United States and sold about two million worldwide."}, {"text": "=== 2000–2008: Just Whitney and personal struggles ===In late 2003, Houston released her first Christmas album One Wish: The Holiday Album, with a collection of traditional holiday songs. Houston produced the album with Mervyn Warren and Gordon Chambers. A single titled \"One Wish (for Christmas)\" reached the Top 20 on the Adult Contemporary chart and the album was certified gold in the US."}, {"text": "=== 2000–2008: Just Whitney and personal struggles ===In December 2003, Brown was charged with battery following an altercation during which he threatened to beat Houston and then assaulted her. Police reported that Houston had visible injuries to her face."}, {"text": "=== 2000–2008: Just Whitney and personal struggles ===Having always been a touring artist, Houston spent most of 2004 touring and performing in Europe, the Middle East, Asia and Russia. In September 2004, she gave a surprise performance at the World Music Awards in a tribute to long-time friend Clive Davis. After the show, Davis and Houston announced plans to go into the studio to work on her new album."}, {"text": "=== 2000–2008: Just Whitney and personal struggles ===In early 2004, Brown starred in his own reality TV program, Being Bobby Brown, on Bravo. The show provided a view of the domestic goings-on in the Brown household. Houston was a prominent figure throughout the show, receiving as much screen time as Brown. The series aired in 2005 and featured Houston in unflattering moments. Years later, The Guardian opined that through her participation in the show, Houston had lost \"the last remnants of her dignity\". The Hollywood Reporter said that the show was \"undoubtedly the most disgusting and execrable series ever to ooze its way onto television\". Despite the perceived train-wreck nature of the show, the series gave Bravo its highest ratings in its time slot and continued Houston's successful forays into film and television. The show was not renewed for a second season after Houston said that she would no longer appear in it and Brown and Bravo could not come to an agreement for another season."}, {"text": "=== 2009–2012: Return and I Look to You ===Houston gave her first interview in seven years in September 2009, appearing on Oprah Winfrey's season premiere. The interview was billed as \"the most anticipated music interview of the decade\". Houston admitted on the show to having used drugs with Brown during their marriage; she said Brown had \"laced marijuana with rock cocaine\". She told Winfrey that before The Bodyguard her drug use was light, that she used drugs more heavily after the film's success and the birth of her daughter and that by 1996 \"[doing drugs] was an everyday thing ... I wasn't happy by that point in time. I was losing myself.\""}, {"text": "=== 2009–2012: Return and I Look to You ===Houston told Winfrey that she had attended a 30-day rehabilitation program. Houston also acknowledged to Oprah that her drug use had continued after rehabilitation and that at one point, her mother obtained a court order and the assistance of law enforcement to press her into receiving further drug treatment. (In her 2013 book, Remembering Whitney: My Story of Love, Loss and the Night the Music Stopped, Cissy Houston described the scene she encountered at Whitney Houston's house in 2005 as follows: \"Somebody had spray-painted the walls and door with big glaring eyes and strange faces. Evil eyes, staring out like a threat... In another room, there was a big, framed photo of [Whitney] – but someone had cut [her] head out. It was beyond disturbing, seeing my daughter's face cut out like that.\" This visit led Cissy to return with law enforcement and perform an intervention.) Houston also told Winfrey that Brown had been emotionally abusive during their marriage and had even spat on her on one occasion. When Winfrey asked Houston if she was drug-free, Houston responded, \"'Yes, ma'am. I mean, you know, don't think I don't have desires for it.'\""}, {"text": "=== 2009–2012: Return and I Look to You ===Houston released her new album, I Look to You, in August 2009. The album's first two singles were the title track \"I Look to You\" and \"Million Dollar Bill\". The album entered the Billboard 200 at No. 1, with Houston's best opening week sales of 305,000 copies, marking Houston's first number one album since The Bodyguard and Houston's first studio album to reach number one since 1987's Whitney. Houston also appeared on European television programs to promote the album. She performed the song \"I Look to You\" on the German television show Wetten, dass..?. Houston appeared as a guest mentor on The X Factor in the United Kingdom. She performed \"Million Dollar Bill\" on the following day's results show, completing the song even as a strap in the back of her dress popped open two seconds into the performance. She later commented that she \"sang [herself] out of [her] clothes\". The performance was poorly received by the British media and was described as \"weird\" and \"ungracious\"."}, {"text": "=== 2009–2012: Return and I Look to You ===Despite this reception, \"Million Dollar Bill\" jumped to its peak from 14 to number 5 (her first UK top 5 for over a decade). Three weeks after its release, I Look to You went gold. Houston appeared on the Italian version of The X Factor, where she performed \"Million Dollar Bill\" to excellent reviews. In November, Houston performed \"I Didn't Know My Own Strength\" at the 2009 American Music Awards in Los Angeles, California. Two days later, Houston performed \"Million Dollar Bill\" and \"I Wanna Dance with Somebody (Who Loves Me)\" on the Dancing with the Stars season 9 finale."}, {"text": "=== 2009–2012: Return and I Look to You ===Houston later embarked on a world tour, entitled the Nothing but Love World Tour. It was her first world tour in over ten years and was announced as a triumphant comeback. However, some poor reviews and rescheduled concerts brought negative media attention. Houston canceled some concerts because of illness and received widespread negative reviews from fans who were disappointed in the quality of her voice and performance. Some fans reportedly walked out of her concerts."}, {"text": "=== 2009–2012: Return and I Look to You ===In January 2010, Houston was nominated for two NAACP Image Awards, one for Best Female Artist and one for Best Music Video. She won the award for Best Music Video for her single \"I Look to You\". On January 16, she received The BET Honors Award for Entertainer citing her lifetime achievements spanning over 25 years in the industry. Houston also performed the song \"I Look to You\" on the 2011 BET Celebration of Gospel, with gospel–jazz singer Kim Burrell, held at the Staples Center, Los Angeles. The performance aired on January 30, 2011."}, {"text": "=== 2009–2012: Return and I Look to You ===In May 2011, Houston enrolled in a rehabilitation center again, citing drug and alcohol problems. A representative for Houston said that the outpatient treatment was a part of Houston's \"longstanding recovery process\". In September 2011, The Hollywood Reporter announced that Houston would produce and star alongside Jordin Sparks and Mike Epps in the remake of the 1976 film Sparkle. In the film, Houston portrays Sparks's \"not-so encouraging\" mother. Houston is also credited as an executive producer of the film. Debra Martin Chase, producer of Sparkle, stated that Houston deserved the title considering she had been there from the beginning in 2001, when Houston obtained Sparkle production rights. R&B singer Aaliyah – originally tapped to star as Sparkle – died in a 2001 plane crash. Her death derailed production, which would have begun in 2002. Houston's remake of Sparkle was filmed in late 2011 over two months and was released by TriStar Pictures. On May 21, 2012, \"Celebrate\", the last song Houston recorded with Sparks, premiered at RyanSeacrest.com. It was made available for digital download on iTunes on June 5. The song was featured on the Sparkle: Music from the Motion Picture soundtrack as the first official single. The movie was released on August 17, 2012, in the United States."}, {"text": "== Personal life ==When Houston was 16, she met Robyn Crawford, then a collegiate basketball player for Monmouth University, while both worked as counselors at a youth summer camp in East Orange. The two became fast friends and Houston later described Crawford as the \"sister [she] never had\". After Houston graduated, they became roommates at an apartment complex in Woodbridge, 20 miles from East Orange. Shortly after Houston signed with Arista, Crawford became the singer's executive assistant. During Houston's early fame, rumors speculated of a romance between Houston and Crawford, which both denied during a Time magazine interview in 1987. In 2019, Crawford admitted in her memoirs, A Song for You: My Life with Whitney Houston, that their early relationship included sexual activity but stopped before Houston signed a recording deal. Crawford remained a close friend and employee of Houston's until 2000."}, {"text": "== Personal life ==Throughout the 1980s, Houston was romantically linked to musician Jermaine Jackson, American football star Randall Cunningham, restaurateur Brad Johnson and actor Eddie Murphy. She then met R&B singer Bobby Brown at the 1989 Soul Train Music Awards. After a three-year courtship, the two were married on July 18, 1992. The two singers occasionally collaborated on songs, including the hit record, \"Something in Common\". Brown would go on to have several run-ins with the law for drunken driving, drug possession and battery, including some jail time. On March 4, 1993, Houston gave birth to their daughter Bobbi Kristina Brown (March 4, 1993 – July 26, 2015), the couple's only child. Houston revealed in a 1993 interview with Barbara Walters that she had a miscarriage during the filming of The Bodyguard. Throughout their marriage, Houston and Brown tried having another child, with Houston suffering several miscarriages, including one in July 1994 and another in December 1996."}, {"text": "== Personal life ==In December 2003, Brown was charged with battery following an altercation during which he threatened to beat Houston and then assaulted her. Police reported that Houston had visible injuries to her face. In September 2006, a year after Being Bobby Brown aired, Houston filed for legal separation from Brown, later filing for divorce the following month. The divorce was granted on April 24, 2007, with Houston admitting Brown was \"unreliable\" in supporting their teenage daughter."}, {"text": "== Death and funeral ==Houston reportedly appeared \"disheveled\" and \"erratic\" in the days before her death. On February 9, 2012, Houston visited singers Brandy and Monica, together with Clive Davis, at their rehearsals for Davis's pre-Grammy Awards party at The Beverly Hilton in Beverly Hills. That same day, she made her last public performance when she joined Kelly Price on stage in Hollywood, California, and sang \"Jesus Loves Me.\""}, {"text": "== Death and funeral ==Two days later, on February 11, Houston was found unconscious in Suite 434 at the Beverly Hilton, submerged in the bathtub. Beverly Hills paramedics arrived about 3:30 pm, found Houston unresponsive, and performed CPR. Houston was pronounced dead at 3:55 pm PST. The cause of death was not immediately known; local police said there were \"no obvious signs of criminal intent\". "}, {"text": "== Death and funeral ==An invitation-only memorial service was held for Houston on February 18, 2012, at her home church, the New Hope Baptist Church, in Newark, New Jersey. The service was scheduled for two hours, but lasted four. Among those who performed at the funeral were Stevie Wonder (rewritten version of \"Ribbon in the Sky\" and \"Love's in Need of Love Today\"), CeCe Winans (\"Don't Cry\" and \"Jesus Loves Me\"), Alicia Keys (\"Send Me an Angel\"), Kim Burrell (rewritten version of \"A Change Is Gonna Come\") and R. Kelly (\"I Look to You\")."}, {"text": "== Death and funeral ==The performances were interspersed with hymns by the church choir and remarks by Clive Davis, Houston's record producer; Kevin Costner; Rickey Minor, her music director; Dionne Warwick, her cousin; and Ray Watson, her security guard for the last 11 years. Aretha Franklin was listed on the program, and was expected to sing, but was unable to attend the service. Bobby Brown departed shortly after the service began. Houston was buried on February 19, 2012, in Fairview Cemetery, in Westfield, New Jersey, next to her father, John Russell Houston, who had died in 2003."}, {"text": "== Death and funeral ==On March 22, 2012, the Los Angeles County Coroner's Office reported that Houston's death was caused by drowning and the \"effects of atherosclerotic heart disease and cocaine use\". The office said the amount of cocaine found in Houston's body indicated that she used the substance shortly before her death. Toxicology results revealed additional drugs in her system: diphenhydramine (Benadryl), alprazolam (Xanax; a potent tranquilizer of moderate duration within the triazolobenzodiazepine group of chemicals called benzodiazepines), cannabis, and cyclobenzaprine (Flexeril). The manner of death was listed as an \"accident\"."}, {"text": "==== Pre-Grammy party ====The February 11, 2012, Clive Davis pre-Grammy party that Houston had been expected to attend, which featured many of the biggest names in music and film, went on as scheduled – although it was quickly turned into a tribute to Houston. Davis spoke about Houston's death at the evening's start:"}, {"text": "==== Pre-Grammy party ====By now you have all learned of the unspeakably tragic news of our beloved Whitney's passing. I don't have to mask my emotion in front of a room full of so many dear friends. I am personally devastated by the loss of someone who has meant so much to me for so many years. Whitney was so full of life. She was so looking forward to tonight even though she wasn't scheduled to perform. Whitney was a beautiful person and a talent beyond compare. She graced this stage with her regal presence and gave so many memorable performances here over the years. Simply put, Whitney would have wanted the music to go on and her family asked that we carry on."}, {"text": "==== Pre-Grammy party ====Tony Bennett spoke of Houston's death before performing at Davis's party. He said, \"First, it was Michael Jackson, then Amy Winehouse, now, the magnificent Whitney Houston.\" Bennett sang \"How Do You Keep the Music Playing?\" and said of Houston: \"When I first heard her, I called Clive Davis and said, 'You finally found the greatest singer I've ever heard in my life.'\""}, {"text": "==== Pre-Grammy party ====Some celebrities opposed Davis's decision to continue with the party while a police investigation was being conducted in Houston's hotel room and her body was still in the building. Chaka Khan, in an interview with CNN's Piers Morgan on February 13, 2012, shared that she felt the party should have been canceled, saying: \"I thought that was complete insanity. And knowing Whitney I don't believe that she would have said 'the show must go on.' She's the kind of woman that would've said 'Stop everything! Un-unh. I'm not going to be there.'\""}, {"text": "==== Pre-Grammy party ====Sharon Osbourne condemned the Davis party, declaring: \"I think it was disgraceful that the party went on. I don't want to be in a hotel room when there's someone you admire who's tragically lost their life four floors up. I'm not interested in being in that environment and I think when you grieve someone, you do it privately, you do it with people who understand you. I thought it was so wrong.\""}, {"text": "==== Further reaction and tributes ====Many other celebrities released statements responding to Houston's death. Darlene Love, Houston's godmother, hearing the news of her death, said, \"It felt like I had been struck by a lightning bolt in my gut.\" Dolly Parton, whose song \"I Will Always Love You\" was covered by Houston, said, \"I will always be grateful and in awe of the wonderful performance she did on my song and I can truly say from the bottom of my heart, 'Whitney, I will always love you. You will be missed.'\" Aretha Franklin said, \"It's so stunning and unbelievable. I couldn't believe what I was reading coming across the TV screen.\" Others paying tribute included Mariah Carey, Quincy Jones, and Oprah Winfrey."}, {"text": "==== Further reaction and tributes ====Moments after news of her death emerged, ABC, CBS, NBC and CNN, MSNBC, Fox News, BBC News, Sky News all broke from their regularly scheduled programming to dedicate time to non-stop coverage of Houston's death. The networks and channels featured live interviews with people who had known Houston, including those that had worked with her, along with some of her peers in the music industry. Saturday Night Live displayed a photo of a smiling Houston, alongside Molly Shannon, from her 1996 appearance. MTV and VH1 interrupted their regularly scheduled programming on Sunday, February 12, to air many of Houston's classic videos, with MTV often airing news segments in between and featuring various reactions from fans and celebrities."}, {"text": "==== Further reaction and tributes ====The first full hour after the news of Houston's death broke saw 2,481,652 tweets and retweets on Twitter alone."}, {"text": "==== Further reaction and tributes ====Houston's former husband, Bobby Brown, was reported to be \"in and out of crying fits\" after receiving the news. He did not cancel a scheduled performance, and within hours of his ex-wife's sudden death, an audience in Mississippi watched as Brown blew kisses skyward, tearfully saying: \"I love you, Whitney.\""}, {"text": "==== Further reaction and tributes ====Ken Ehrlich, executive producer of the 54th Grammy Awards, announced that Jennifer Hudson would perform a tribute to Houston at the February 12, 2012, ceremony. He said, \"Event organizers believed Hudson – an Academy Award-winning actress and Grammy Award-winning artist – could perform a respectful musical tribute to Houston.\" Ehrlich went on to say, \"It's too fresh in everyone's memory to do more at this time, but we would be remiss if we didn't recognize Whitney's remarkable contribution to music fans in general and in particular her close ties with the Grammy telecast and her Grammy wins and nominations over the years.\" At the start of the awards ceremony, footage of Houston performing \"I Will Always Love You\" from the 1994 Grammys was shown following a prayer read by host LL Cool J. Later in the program, following a montage of photos of musicians who died in 2011 with Houston singing \"Saving All My Love for You\" at the 1986 Grammys, Hudson paid tribute to Houston and the other artists by performing \"I Will Always Love You\". The tribute was partially credited for the Grammys telecast getting its second highest ratings in history."}, {"text": "==== Further reaction and tributes ====Houston was honored with various tributes at the 43rd NAACP Image Awards, held on February 17. An image montage of Houston and important black figures who died in 2011 was followed by video footage from the 1994 ceremony, which depicted her accepting two Image Awards for outstanding female artist and entertainer of the year. Following the video tribute, Yolanda Adams delivered a rendition of \"I Love the Lord\" from The Preacher's Wife Soundtrack. In the finale of the ceremony, Kirk Franklin and the Family started their performance with \"The Greatest Love of All\"."}, {"text": "==== Further reaction and tributes ====New Jersey Governor Chris Christie said that all New Jersey state flags would be flown at half-staff on Tuesday, February 21, to honor Houston. The 2012 Brit Awards, which took place at the O2 Arena in London on February 21, also paid tribute to Houston by playing a 30-second video montage of her music videos with a snippet of \"One Moment in Time\" as the background music in the ceremony's first segment. Houston was also featured, alongside other recently deceased figures from the film industry, in the In Memoriam montage at the 84th Academy Awards on February 26, 2012."}, {"text": "==== Further reaction and tributes ====In June 2012, the year's McDonald's Gospelfest in Newark was dedicated as a tribute to Houston."}, {"text": "==== Further reaction and tributes ====Beyoncé performed a tribute to Houston during her revue Revel Presents: Beyoncé Live in May 2012 at the Revel resort by performing the first verse and chorus of \"I Will Always Love You\"."}, {"text": "==== Further reaction and tributes ====Houston topped the list of Google searches in 2012, both globally and in the United States, according to Google's Annual Zeitgeist most-popular searches list. Her death was ranked as the most memorable entertainment event in television history, according to a study by Sony Electronics and the Nielsen Television Research Company. "}, {"text": "==== Further reaction and tributes ====On May 17, 2017, Bebe Rexha released a single titled \"The Way I Are (Dance with Somebody)\" from her two-part album All Your Fault. The song mentions Houston's name in the opening lyrics, \"I'm sorry, I'm not the most pretty, I'll never ever sing like Whitney\", before going on to sample some of Houston's lyrics from \"I Wanna Dance with Somebody (Who Loves Me)\" in the chorus. The song was in part made as a tribute to Whitney Houston's life."}, {"text": "=== Posthumous sales ===According to representatives from Houston record label, Houston sold 8 million records worldwide in the first ten months of the year she died. With just 24 hours passing between news of Houston's death and Nielsen SoundScan tabulating the weekly album charts, Whitney: The Greatest Hits climbed into the Top 10 with 64,000 copies sold; it was a 10,419 percent gain compared to the previous week. 43 of the top 100 most-downloaded tracks on iTunes were Houston songs, including \"I Will Always Love You\" from The Bodyguard at number one. Two other Houston classics, \"I Wanna Dance With Somebody (Who Loves Me)\" and \"Greatest Love of All\", were in the top 10. As fans of Houston rushed to rediscover the singer's music, single digital track sales of the artist's music rose to more than 887,000 paid song downloads in 24 hours in the US alone."}, {"text": "=== Posthumous sales ===The single \"I Will Always Love You\" returned to the Billboard Hot 100 after almost twenty years, peaking at number three and becoming a posthumous top-ten single for Houston, the first one since 2001. Two other Houston songs also jumped back on the Hot 100: \"I Wanna Dance With Somebody (Who Loves Me)\" at 25 and \"Greatest Love of All\" at 36. Her death on February 11 ignited an incredible drive to her YouTube and Vevo pages. She went from 868,000 views in the week prior to her death to 40,200,000 views in the week following her death, a 45-fold increase."}, {"text": "=== Posthumous sales ===On February 29, 2012, Houston became the first female artist, first solo artist and first posthumous artist in history ever to place three or more albums in the top ten of the US Billboard 200 simultaneously, with Whitney: The Greatest Hits at number 2, The Bodyguard at number 6 and Whitney Houston at number 9. On March 7, 2012, Houston claimed two more additional feats on the US Billboard charts: she became the first female act to place nine albums within the top 100 (with Whitney: The Greatest Hits at number 2, The Bodyguard at number 5, Whitney Houston at number 10, I Look to You at number 13, Triple Feature at number 21, My Love Is Your Love at number 31, I'm Your Baby Tonight at number 32, Just Whitney at number 50 and The Preacher's Wife at number 80); in addition, other Houston albums were also on the US Billboard Top 200 Album Chart at this time. Houston also became the second female act, after Adele, to place two albums in the top five of the US Billboard Top 200, with Whitney: The Greatest Hits at number 2 and The Bodyguard at number 5. In addition, Houston set a Guinness World Record by being the first female artist to place the most albums inside the Billboard 200 simultaneously by a female artist with ten. In October 2023, Houston made the list of the top ten highest-earning posthumous celebrities on Forbes earning $30 million, later winning Houston a posthumous Guinness World Records entry as the highest-earning posthumous female celebrity, her record 30th."}, {"text": "=== Posthumous releases ===Houston's first posthumous greatest hits album, I Will Always Love You: The Best of Whitney Houston, was released on November 13, 2012, by RCA Records. It features the remastered versions of her number-one hits, an unreleased song titled \"Never Give Up\" and a duet version of \"I Look to You\" with R. Kelly. The album won two NAACP Image Awards for 'Outstanding Album' and 'Outstanding Song' (\"I Look to You\"). It was certified Gold by the RIAA in 2020. In October 2021, the album was reissued on vinyl and included Houston's first posthumous hit, \"Higher Love\". Since its release, it has spent more than 190 weeks on the Billboard 200, making it one of the longest-charting compilations in chart history, the second by a woman after H.E.R.. On the week of May 27, 2023, it replaced Madonna's The Immaculate Collection as the longest charting greatest hits album by a woman in the history of the Billboard 200 after it notched 149 weeks on the chart."}, {"text": "=== Posthumous releases ===Houston's posthumous live album, Her Greatest Performances (2014), was a US R&B number-one and received positive reviews by music critics. In 2017, the 25th anniversary reissue of The Bodyguard (soundtrack)—I Wish You Love: More from The Bodyguard—was released by Legacy Recordings. It includes film versions, remixes and live performances of Houston's Bodyguard songs."}, {"text": "=== Posthumous releases ===In 2019, Houston and Kygo's version of \"Higher Love\" was released as a single. The record became a worldwide hit. It peaked at number two in the UK Singles Chart and reached the top ten in several countries. \"Higher Love\" was nominated at the 2020 Billboard Music Awards for \"Top Dance/Electronic Song of the Year\", the 2020 iHeartRadio Music Awards for \"Dance Song of the Year\" and \"Best Remix\". It was certified multi-platinum in the United States, Australia, Canada, Poland and the United Kingdom. The song was also a platinum hit in Denmark, Switzerland, Belgium, and Spain."}, {"text": "=== Posthumous releases ===On December 16, 2022, RCA released the soundtrack album to Houston's featured film biopic, titled, I Wanna Dance with Somebody (The Movie: Whitney New, Classic and Reimagined), to every digital download platform all over the world. The soundtrack includes reimagined remixes of some of Houston's classics and several newly discovered songs such as Houston's cover of CeCe Winans' \"Don't Cry\" (labeled as \"Don't Cry for Me\" on Houston's soundtrack) at the Commitment to Life AIDS benefit concert in Los Angeles in January 1994, remixed by house producer Sam Feldt."}, {"text": "=== Posthumous releases ===In March 2023, Arista, Legacy Recordings and Gaither Music Group released Houston's first gospel compilation, I Go to the Rock: The Gospel Music of Whitney Houston. The album included three 1981 demo recordings recorded when Houston was 17, including \"Testimony\" and \"He Can Use Me\", while also featuring unearthed live recordings of Houston performing the gospel standards, \"This Day\", \"He/I Believe\" and, with CeCe Winans, an inspired rendition of \"Bridge Over Troubled Water\", recorded live at the second annual VH1 Honors in 1995 as well as previous recordings from The Bodyguard, The Preacher's Wife, and Sparkle. The album debuted at number two on Billboard's Top Gospel Albums chart, marking her first new entry on the chart since 1996. The album earned Houston a posthumous Billboard Music Award nomination for Top Gospel Album."}, {"text": "== Artistry ==Houston had a mezzo-soprano vocal range, and was referred to as \"the Voice\" for her vocal talent. Jon Pareles of The New York Times stated Houston \"always had a great big voice, a technical marvel from its velvety depths to its ballistic middle register to its ringing and airy heights\". In 2023, Rolling Stone ranked Houston second on their list of the greatest singers of all time, stating, \"The standard-bearer for R&B vocals, Whitney Houston possessed a soprano that was as powerful as it was tender. Take her cover of Dolly Parton's \"I Will Always Love You\", which became one of the defining singles of the 1990s; it opens with her gently brooding, her unaccompanied voice sounding like it's turning over the idea of leaving her lover behind with the lightest touch. By the end, it's transformed into a showcase for her limber, muscular upper register; she sings the title phrase with equal parts bone-deep feeling and technical perfection, turning the conflicted emotions at the song's heart into a jumping-off point for her life's next step.\""}, {"text": "== Artistry ==Matthew Perpetua of Rolling Stone also acknowledged Houston's vocal prowess, enumerating ten performances, including \"How Will I Know\" at the 1986 MTV VMAs and \"The Star-Spangled Banner\" at the 1991 Super Bowl. \"Whitney Houston was blessed with an astonishing vocal range and extraordinary technical skill, but what truly made her a great singer was her ability to connect with a song and drive home its drama and emotion with incredible precision\", he stated. \"She was a brilliant performer and her live shows often eclipsed her studio recordings.\" According to Newsweek, Houston had a four-octave range."}, {"text": "== Artistry ==Elysa Gardner of the Los Angeles Times in her review for The Preacher's Wife Soundtrack highly praised Houston's vocal ability, commenting, \"She is first and foremost a pop diva – at that, the best one we have. No other female pop star – not Mariah Carey, not Celine Dion, not Barbra Streisand – quite rivals Houston in her exquisite vocal fluidity and purity of tone and her ability to infuse a lyric with mesmerizing melodrama.\""}, {"text": "== Artistry ==Singer and entertainer Michael Jackson named Houston as one of his musical inspirations, calling her a \"wonderful singer, real stylist. You hear one line, and you know who it is''."}, {"text": "== Artistry ==R&B singer Faith Evans stated: \"Whitney was not just a singer with a beautiful voice. She was a true musician. Her voice was an instrument and she knew how to use it. With the same complexity as someone who has mastered the violin or the piano, Whitney mastered the use of her voice. From every run to every crescendo—she was in tune with what she could do with her voice and it's not something simple for a singer—even a very talented one—to achieve. Whitney is 'the Voice' because she worked for it. This is someone who was singing backup for her mom when she was 14 years old at nightclubs across the country. This is someone who sang backup for Chaka Khan when she was only 17. She had years and years of honing her craft on stage and in the studio before she ever got signed to a record label. Coming from a family of singers and surrounded by music; she pretty much had a formal education in music, just like someone who might attend a performing arts high school or major in voice in college.\""}, {"text": "== Artistry ==Jon Caramanica of The New York Times commented, \"Her voice was clean and strong, with barely any grit, well suited to the songs of love and aspiration. [ ... ] Hers was a voice of triumph and achievement and it made for any number of stunning, time-stopping vocal performances.\" Mariah Carey stated, \"She [Whitney] has a really rich, strong mid-belt that very few people have. She sounds really good, really strong.\" While in her review of I Look to You, music critic Ann Powers of the Los Angeles Times writes, \"[Houston's voice] stands like monuments upon the landscape of 20th century pop, defining the architecture of their times, sheltering the dreams of millions and inspiring the climbing careers of countless imitators\", adding \"When she was at her best, nothing could match her huge, clean, cool mezzo-soprano.\""}, {"text": "== Artistry ==Lauren Everitt from BBC News commented on melisma used in Houston's recording and its influence. \"An early 'I' in Whitney Houston's 'I Will Always Love You' takes nearly six seconds to sing. In those seconds the former gospel singer-turned-pop star packs a series of different notes into the single syllable\", stated Everitt. \"The technique is repeated throughout the song, most pronouncedly on every 'I' and 'you'. The vocal technique is called melisma and it has inspired a host of imitators. Other artists may have used it before Houston, but it was her rendition of Dolly Parton's love song that pushed the technique into the mainstream in the 90s. [ ... ] But perhaps what Houston nailed best was moderation.\" Everitt said that \"[i]n a climate of reality shows ripe with 'oversinging,' it's easy to appreciate Houston's ability to save melisma for just the right moment.\""}, {"text": "== Artistry ==Houston's vocal stylings have had a significant impact on the music industry. According to Linda Lister in Divafication: The Deification of Modern Female Pop Stars, she has been called the \"Queen of Pop\" for her influence during the 1990s, commercially rivaling Mariah Carey and Celine Dion. Stephen Holden from The New York Times, in his review of Houston's Radio City Music Hall concert on July 20, 1993, praised her attitude as a singer, writing, \"Whitney Houston is one of the few contemporary pop stars of whom it might be said: the voice suffices. While almost every performer whose albums sell in the millions calls upon an entertainer's bag of tricks, from telling jokes to dancing to circus pyrotechnics, Ms. Houston would rather just stand there and sing.\" With regard to her singing style, he added: \"Her [Houston's] stylistic trademarks – shivery melismas that ripple up in the middle of a song, twirling embellishments at the ends of phrases that suggest an almost breathless exhilaration – infuse her interpretations with flashes of musical and emotional lightning.\""}, {"text": "== Artistry ==Houston struggled with vocal problems in her later years. Gary Catona, a voice coach who began working with Houston in 2005, stated: \"'When I first started working with her in 2005, she had lost 99.9 percent of her voice ... She could barely speak, let alone sing. Her lifestyle choices had made her almost completely hoarse.'\" After Houston's death, Catona asserted that Houston's voice reached \"'about 75 to 80 percent'\" of its former capacity after he had worked with her. However, during the world tour that followed the release of I Look to You, \"YouTube videos surfaced, showing [Houston's] voice cracking, seemingly unable to hold the notes she was known for\"."}, {"text": "== Artistry ==Regarding the musical style, Houston's vocal performances incorporated a wide variety of genres, including R&B, pop, rock, soul, gospel, funk, dance, Latin pop, disco, house, hip hop soul, new jack swing, opera, Reggae, and Christmas. The lyrical themes in her recordings are mainly about love, social, religious and feminism. The Rock and Roll Hall of Fame stated: \"Her sound expanded through collaborations with a wide array of artists, including Stevie Wonder, Luther Vandross, Babyface, Missy Elliott, Bobby Brown, and Mariah Carey.\" While AllMusic commented that, \"Houston was able to handle big adult contemporary ballads, effervescent, stylish dance-pop and slick urban contemporary soul with equal dexterity\"."}, {"text": "== Legacy and influence ==Houston has been regarded as one of the greatest vocalists of all time and a cultural icon. She is also recognized as one of the most influential R&B artists in history."}, {"text": "== Legacy and influence ==During the 1980s, MTV was coming into its own and received criticism for not playing enough videos by black artists. With Michael Jackson breaking down the color barrier for black men, Houston did the same for black women. She became the first black woman to receive heavy rotation on the network following the success of the \"How Will I Know\" video."}, {"text": "== Legacy and influence ==Black female artists, such as Janet Jackson and Anita Baker, were successful in popular music partly because Houston paved the way. Baker commented that \"Because of what Whitney and Sade did, there was an opening for me ... For radio stations, black women singers aren't taboo anymore.\""}, {"text": "== Legacy and influence ==AllMusic noted her contribution to the success of black artists on the pop scene. The New York Times stated that \"Houston was a major catalyst for a movement within black music that recognized the continuity of soul, pop, jazz and gospel vocal traditions\". Richard Corliss of Time magazine commented on her initial success breaking various barriers:"}, {"text": "== Legacy and influence ==Of her first album's ten cuts, six were ballads. This chanteuse [Houston] had to fight for air play with hard rockers. The young lady had to stand uncowed in the locker room of macho rock. The soul strutter had to seduce a music audience that anointed few black artists with superstardom. [ ... ] She was a phenomenon waiting to happen, a canny tapping of the listener's yen for a return to the musical middle. And because every new star creates her own genre, her success has helped other blacks, other women, other smooth singers find an avid reception in the pop marketplace."}, {"text": "== Legacy and influence ==Stephen Holden of The New York Times said that Houston \"revitalized the tradition of strong gospel-oriented pop-soul singing\". Ann Powers of the Los Angeles Times referred to Houston as a \"national treasure\". Jon Caramanica, another music critic of The New York Times, called Houston \"R&B's great modernizer\", adding \"slowly but surely reconciling the ambition and praise of the church with the movements and needs of the body and the glow of the mainstream\". He also drew comparisons between Houston's influence and other big names on 1980s pop:"}, {"text": "== Legacy and influence ==She was, alongside Michael Jackson and Madonna, one of the crucial figures to hybridize pop in the 1980s, though her strategy was far less radical than that of her peers. Jackson and Madonna were by turns lascivious and brutish and, crucially, willing to let their production speak more loudly than their voices, an option Ms. Houston never went for. Also, she was less prolific than either of them, achieving most of her renown on the strength of her first three solo albums and one soundtrack, released from 1985 to 1992. If she was less influential than they were in the years since, it was only because her gift was so rare, so impossible to mimic. Jackson and Madonna built worldviews around their voices; Ms. Houston's voice was the worldview. She was someone more to be admired, like a museum piece, than to be emulated."}, {"text": "== Legacy and influence ==The Independent's music critic Andy Gill also wrote about Houston's influence on modern R&B and singing competitions, comparing it to Michael Jackson's. \"Because Whitney, more than any other single artist – Michael Jackson included – effectively mapped out the course of modern R&B, setting the bar for standards of soul vocalese and creating the original template for what we now routinely refer to as the 'soul diva' \", stated Gill. \"Jackson was a hugely talented icon, certainly, but he will be as well remembered (probably more so) for his presentational skills, his dazzling dance moves, as for his musical innovations. Whitney, on the other hand, just sang and the ripples from her voice continue to dominate the pop landscape.\" Gill said that there \"are few, if any, Jackson imitators on today's TV talent shows, but every other contestant is a Whitney wannabe, desperately attempting to emulate that wondrous combination of vocal effects – the flowing melisma, the soaring mezzo-soprano confidence, the tremulous fluttering that carried the ends of lines into realms of higher yearning\"."}, {"text": "== Legacy and influence ==Similarly, Steve Huey from Allmusic wrote that the shadow of Houston's prodigious technique still looms large over nearly every pop diva and smooth urban soul singer – male or female – in her wake and spawned a legion of imitators. Rolling Stone stated that Houston \"redefined the image of a female soul icon and inspired singers ranging from Mariah Carey to Rihanna\". The magazine placed her 34th on their \"100 Greatest Singers of All Time\" list. Over a decade later, in 2023, Houston was placed at second place, behind just Aretha Franklin. Essence ranked Houston at number five on their list of 50 Most Influential R&B Stars ever, calling her \"the diva to end all divas\". In October 2022, the same magazine ranked Houston at number one on its list of the ten greatest R&B solo artists of all time."}, {"text": "== Legacy and influence ==A number of artists have acknowledged Whitney as an influence and inspiration, including Michael Jackson, Taylor Swift, Rihanna, Beyoncé, Sam Smith, Britney Spears, Lady Gaga, Celine Dion, Adele, Lucky Daye, Demi Lovato, Kelly Clarkson, Nicole Scherzinger, Kelly Rowland, Toni Braxton, Ashanti, Deborah Cox, Robin Thicke, Ciara, Brandy, Monica, LeAnn Rimes, Melanie Fiona, Jennifer Hudson, Christina Aguilera, Jordin Sparks, Alicia Keys, Leona Lewis, Ariana Grande, Mariah Carey, Jennifer Lopez, and Nicki Minaj."}, {"text": "== Awards and achievements ==Houston won numerous accolades, including two Emmy Awards, eight Grammy Awards (including two Grammy Hall of Fame honors), fourteen World Music Awards, sixteen Billboard Music Awards (46 Billboard awards in all) and twenty-two American Music Awards. Houston holds the record for the most American Music Awards received in a single year by a woman with eight wins in 1994 (overall tied with Michael Jackson). Houston was the first artist at the Billboard Music Awards to win more than 11 awards in one night at its fourth annual ceremony in 1993, which set a Guinness World Record at the time. Houston continues to hold the record for the most WMAs won in a single year, winning five trophies at the sixth World Music Awards in 1994. Houston is also the black female artist with the most Guinness World Records in history with 30."}, {"text": "== Awards and achievements ==In 1996, eleven years after debuting on BET for her music video to \"You Give Good Love\", Houston became the first female recipient of the BET Walk of Fame and the youngest-ever recipient of this honor at just 33 years old. Five years later, in 2001, Houston was the first artist to be given a BET Lifetime Achievement Award. Houston also remains the youngest recipient of the honor as she received the honor at just the age of 37. BET honored her again in 2010 when she received an award from The BET Honors. Houston is only one of two artists to receive all three honors from the BET network. "}, {"text": "== Awards and achievements ==In May 2003, Houston placed at number three on VH1's list of \"50 Greatest Women of the Video Era\". In 2008, Billboard magazine released a list of the Hot 100 All-Time Top Artists to celebrate the US singles chart's 50th anniversary, ranking Houston at number nine. Similarly, she was ranked as one of the \"Top 100 Greatest Artists of All Time\" by VH1 in September 2010. In November 2010, Billboard released its \"Top 50 R&B/Hip-Hop Artists of the Past 25 Years\" list and ranked Houston at number three who not only went on to earn eight number-one singles on the R&B/Hip-Hop Songs chart, but also landed five number ones on R&B/Hip-Hop Albums."}, {"text": "== Awards and achievements ==Houston's debut album is listed as one of the 500 Greatest Albums of All Time by Rolling Stone magazine and is on Rock and Roll Hall of Fame's Definitive 200 list. In 2004, Billboard picked the success of her first release on the charts as one of 110 Musical Milestones in its history. Houston's entrance into the music industry is considered one of the 25 musical milestones of the last 25 years, according to USA Today in 2007. It stated that she paved the way for Mariah Carey's chart-topping vocal gymnastics. In 2015, she was placed at number nine (second as a female) by Billboard on the list \"35 Greatest R&B Artists Of All Time\"."}, {"text": "== Awards and achievements ==Houston is one of the best-selling recording artists of all time, with more than 220 million records sold worldwide. She is also the best-selling female R&B artist of the 20th century. Houston had also sold more physical singles than any other female solo artist in history. As of 2023, she was ranked as one of the best-selling artists in the United States by the Recording Industry Association of America with 61 million certified albums. Houston released seven studio albums and two soundtrack albums, all of which have been certified diamond, multi-platinum or platinum."}, {"text": "== Awards and achievements ==In November 1993, Houston became the first solo female recording artist to go Diamond with an album when her soundtrack to The Bodyguard was certified ten times platinum. In January 1994, she became the first solo artist to receive two Diamond albums after her debut album, Whitney Houston, was also certified ten times platinum. In October 2020, her 1987 release, Whitney, was certified Diamond as well, making Houston the first and only black recording artist to have three Diamond-certified albums. Those three albums are also among the best-selling albums of all time. Houston also is the only black female recording artist with more than six albums that have sold ten million copies or more globally. The Bodyguard remains the best-selling soundtrack album of all time, as well as the best-selling album of all time by a female recording artist, with global sales of over 50 million copies. Houston's \"I Will Always Love You\" became the best-selling physical single by a woman in music history, as well as the best-selling single ever by a black recording artist, with sales of over 20 million copies worldwide. Her 1996 soundtrack for The Preacher's Wife is the best-selling gospel album of all time."}, {"text": "== Awards and achievements ==In 1997, the Franklin School in East Orange, New Jersey was renamed to The Whitney E. Houston Academy School of Creative and Performing Arts. She held an honorary Doctorate in Humanities from Grambling State University, Louisiana. Houston was inducted into the New Jersey Hall of Fame in 2013. In August 2014, she was inducted into the official Rhythm and Blues Music Hall of Fame in its second class. On January 15, 2020, more than 35 years after releasing her first record and on the 35th anniversary of the release of her landmark debut, Houston was inducted into the Rock and Roll Hall of Fame after her first nomination. In March 2020, the Library of Congress announced that Houston's 1992 single \"I Will Always Love You\" had been added to its National Recording Registry, a list of \"aural treasures worthy of preservation\" due to their \"cultural, historical and aesthetic importance\" in the American soundscape. In October 2020, the music video for \"I Will Always Love You\" surpassed 1 billion views on YouTube, making Houston the first solo 20th-century artist to have a video reach that milestone. In May 2023, Houston was one of the first of thirteen artists to be given the Brits Billion Award by the BPI for reaching 1 billion career streams in the United Kingdom. In July 2023, Houston became the first solo artist who debuted in the 1980s to have a song streamed over a billion times after her 1987 hit, \"I Wanna Dance with Somebody (Who Loves Me)\", reached that feat. In December 2023, the New Jersey Hall of Fame unveiled the Whitney Houston Service Area, formerly known as the Vauxhal Service Area at the Garden State Parkway."}, {"text": "== Awards and achievements ==The New Jersey Hall of Fame explained that the renaming was part of their \"ongoing program to honor its inductees by renaming Garden State Parkway service areas after them, and building displays about them\". Houston joined other New Jersey notables such as Toni Morrison, Frank Sinatra, Celia Cruz and Jon Bon Jovi in having service areas renamed after them."}, {"text": "== Philanthropy ==Houston was a long-time supporter of several charities all around the world. In 1989, she established the Whitney Houston Foundation for Children. It offered medical assistance to sick and homeless children, fought to prevent child abuse, taught children to read, created inner-city parks and playgrounds and granted college scholarships, including one to the Juilliard School."}, {"text": "== Philanthropy ==At a 1988 Madison Square Garden concert, Houston earned more over $250,000 for the United Negro College Fund (UNCF)."}, {"text": "== Philanthropy ==Houston donated all of the earnings from her 1991 Super Bowl XXV performance of \"The Star-Spangled Banner\" sales to Gulf War servicemen and their families. The record label followed suit and she was voted to the American Red Cross Board of Directors as a result. Following the terrorist attacks in 2001, Houston re-released \"The Star-Spangled Banner\" to support the New York Firefighters 9/11 Disaster Relief Fund and the New York Fraternal Order of Police. She waived her royalty rights to the song, which reached number one on charts in October 2001 and generated more than $1 million."}, {"text": "== Philanthropy ==Houston declined to perform in apartheid-era South Africa in the 1980s. Her participation at the 1988 Freedomfest performance in London (for a then-imprisoned Nelson Mandela) grabbed the attention of other musicians and the media."}, {"text": "== Philanthropy ==In addition, Houston became an activist for the fight against HIV and AIDS during the first decade of the AIDS epidemic. The Whitney Houston Foundation for Children, in particular, focused on helping children who suffered from HIV/AIDS, among other issues. In 1990, Whitney took part in Arista Records' 15th anniversary gala, which was an AIDS benefit, where she sang \"I Wanna Dance with Somebody (Who Loves Me)\", \"Greatest Love of All\" and, with cousin Dionne Warwick, \"That's What Friends Are For\". A year later, Whitney participated in the Reach Out & Touch Someone AIDS vigil at London in September 1991 while she was finishing her historic ten-date residency at London's Wembley Arena; there, she stressed the importance of AIDS research and addressing HIV stigma."}, {"text": "== Philanthropy ==Noting of her influence as a gay icon, during the middle of her tour to promote the My Love Is Your Love album in June 1999, Whitney gave a surprise performance at the 13th Annual New York City Lesbian & Gay Pride Dance, titled Dance 13: The Last Dance of the Century, at one of the city's West Side piers. According to Instinct magazine, Houston's unannounced performance at the Piers \"ushered in a new era that would eventually make high-profile artists performing at LGBTQ events virtually commonplace.\" Before hitting the stage, Houston was asked by MTV veejay John Norris why she decided to attend the event, Houston replied, \"we're all God's children, honey\"."}, {"text": "=== Documentaries ===Since Houston's sudden death in 2012, her life, career and death have been the subject of many documentaries and specials. A television documentary film entitled Whitney: Can I Be Me aired on Showtime on August 25, 2017. The film was directed by Nick Broomfield. "}, {"text": "=== Documentaries ===On April 27, 2016, it was announced that Kevin Macdonald would work with the film production team Altitude, producers of the Amy Winehouse documentary film Amy (2015), on a new documentary film based on Houston's life and death. It is the first documentary authorized by Houston's estate. That film, entitled Whitney, premiered at the 2018 Cannes Film Festival and was released internationally in theaters on July 6, 2018."}, {"text": "=== Documentaries ===Lifetime released the documentary Whitney Houston & Bobbi Kristina: Didn't We Almost Have It All in 2021, which The Atlanta Journal-Constitution called \"...less an exposé and more a loving tribute to these two women\". On the tenth anniversary of her death, ESPN ran a thirty-minute documentary of Houston's acclaimed performance of The Star Spangled Banner at Super Bowl XXV in 1991 titled Whitney's Anthem."}, {"text": "=== Portrayals ===In 2015, Lifetime premiered the biographical film Whitney, which mentions that Whitney Houston was named after prominent television actress Whitney Blake, the mother of Meredith Baxter, star of the television series Family Ties. The film was directed by Houston's Waiting to Exhale co-star Angela Bassett, and Houston was portrayed by model Yaya DaCosta."}, {"text": "=== Portrayals ===In April 2020, it was announced that a biopic based on Houston's life, said to be \"no holds barred\", titled I Wanna Dance with Somebody, would be produced, with Bohemian Rhapsody screenwriter Anthony McCarten writing the script and director Kasi Lemmons at the helm. Clive Davis, the Houston estate and Primary Wave were behind the biopic, with Sony Pictures & TriStar Pictures. On December 15, 2020, it was announced that actress Naomi Ackie had been picked to portray Houston. The film opened on December 23, 2022 and grossed around $60 million, becoming one of the highest grossing biopics based on a historical African American female figure after the Tina Turner biopic, What's Love Got to Do with It."}, {"text": "=== Portrayals ===Each actress listed portrays Houston:"}, {"text": "=== Portrayals ===Whitney – Yaya DaCosta, 2015"}, {"text": "=== Portrayals ===Bobbi Kristina – Demetria McKinney, 2017"}, {"text": "=== Portrayals ===The Bobby Brown Story – Gabrielle Dennis, 2018"}, {"text": "=== Portrayals ===Selena: The Series – Shauntè Massard, 2021 (S2, E6)"}, {"text": "=== Portrayals ===I Wanna Dance with Somebody – Naomi Ackie, 2022"}, {"text": "== Discography ==Whitney Houston (1985)"}, {"text": "== Discography ==Whitney (1987)"}, {"text": "== Discography ==I'm Your Baby Tonight (1990)"}, {"text": "== Discography ==My Love Is Your Love (1998)"}, {"text": "== Discography ==Just Whitney (2002)"}, {"text": "== Discography ==One Wish: The Holiday Album (2003)"}, {"text": "== Discography ==I Look to You (2009)"}, {"text": "== Filmography ==The Bodyguard (1992)"}, {"text": "== Filmography ==Waiting to Exhale (1995)"}, {"text": "== Filmography ==The Preacher's Wife (1996)"}, {"text": "== Filmography ==Cinderella (1997)"}, {"text": "== Filmography ==Sparkle (2012)"}, {"text": "== Filmography ==Whitney: Can I Be Me (2017)"}, {"text": "== Filmography ==Whitney (2018)"}, {"text": "=== Headlining tours ===US Summer Tour (1985)"}, {"text": "=== Headlining tours ===The Greatest Love World Tour (1986)"}, {"text": "=== Headlining tours ===Moment of Truth World Tour (1987–1988)"}, {"text": "=== Headlining tours ===Feels So Right Tour (1990)"}, {"text": "=== Headlining tours ===I'm Your Baby Tonight World Tour (1991)"}, {"text": "=== Headlining tours ===The Bodyguard World Tour (1993–1994)"}, {"text": "=== Headlining tours ===Pacific Rim Tour (1997)"}, {"text": "=== Headlining tours ===The European Tour (1998)"}, {"text": "=== Headlining tours ===My Love Is Your Love World Tour (1999)"}, {"text": "=== Headlining tours ===Nothing but Love World Tour (2009–2010)"}, {"text": "=== Headlining tours ===Whitney Houston Hologram Tour (2020)"}, {"text": "=== Co-headlining tours ===Soul Divas Tour (2004)"}, {"text": "== See also ==List of awards and nominations received by Whitney Houston"}, {"text": "== See also ==Honorific nicknames in popular music"}, {"text": "== See also ==List of artists who reached number one in the United States"}, {"text": "== See also ==List of artists who reached number one on the U.S. dance chart"}, {"text": "== See also ==List of bestselling music artists"}, {"text": "== See also ==List of best-selling gospel music artists"}, {"text": "== Further reading ==Ammons, Kevin; Bacon, Nancy (1998). Good Girl, Bad Girl: An Insider's Biography of Whitney Houston. Secaucus, NJ: Carol Publ. Group. ISBN 978-0-8065-8012-8."}, {"text": "== Further reading ==Bowman, Jeffery (1995). Diva: The Totally Unauthorized Biography of Whitney Houston. New York: Harper. ISBN 978-0-06-100853-5."}, {"text": "== Further reading ==Halstead, Craig (2010). Whitney Houston: For the Record. Sandy, Bedfordshire, UK: Authors OnLine. ISBN 978-0-7552-1278-1. OCLC 751138536."}, {"text": "== Further reading ==Houston, Whitney (March 1999). My Love Is Your Love: Piano, Vocal, Chords. Los Angeles: Alfred Publishing Co. ISBN 978-0-7692-7734-9."}, {"text": "== Further reading ==Kennedy, Gerrick (2022). Didn't We Almost Have it All: In Defense of Whitney Houston. New York: Abrams. ISBN 9781419749698. OCLC 1289268049."}, {"text": "== Further reading ==Parish, James Robert (September 2003). Whitney Houston: The Unauthorized Biography. London: Aurum Press. ISBN 978-1-85410-921-7."}, {"text": "== Further reading ==Parish, James Robert (April 2010). Whitney Houston: Return of the Diva. Chicago: John Blake. ISBN 978-1-84454-919-1."}, {"text": "== External links ==Whitney Houston at AllMovie"}, {"text": "== External links ==Whitney Houston at AllMusic "}, {"text": "== External links ==Whitney Houston discography at Discogs "}, {"text": "== External links ==Whitney Houston at IMDb"}, {"text": "== External links ==Whitney Houston at the TCM Movie Database"}]