[{"text": "Winona Laura Horowitz (born (1971-10-29)October 29, 1971), known professionally as Winona Ryder, is an American actress. Having come to attention with quirkier roles in the initial phase of her career, she achieved fame and critical success with her more diverse performances in various genres throughout the 1990s. Ryder's many accolades include a Golden Globe Award, as well as nominations for two Academy Awards, a BAFTA, and a Grammy."}, {"text": "Following her film debut in Lucas (1986), Ryder rose to prominence when played the supporting part of Lydia Deetz in Beetlejuice (1988). Major parts in Heathers (1989), Edward Scissorhands, Mermaids (both 1990), and Bram Stoker's Dracula (1992) came next. She earned two consecutive Oscar nominations—Best Supporting Actress and Best Actress—for her portrayals of May Welland in The Age of Innocence (1993) and Jo March in Little Women (1994), respectively. Her subsequent work included starring roles in Reality Bites (1994), How to Make an American Quilt (1995), The Crucible (1996), Alien Resurrection (1997), Celebrity (1998), Girl, Interrupted (1999), Autumn in New York (2000), and Mr. Deeds (2002)."}, {"text": "Ryder took a break from acting in the early 2000s, later returning with smaller appearances in films such as A Scanner Darkly (2006), Star Trek (2009), Black Swan (2010), and The Dilemma (2011). For her portrayal of Lois Wilson in the Hallmark television film When Love Is Not Enough (2010), she was nominated for the Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Miniseries or Television Movie. Since 2016, she has played Joyce Byers on the Netflix series Stranger Things, for which she received her third Golden Globe nomination. Her other television projects include the HBO miniseries The Plot Against America (2020)."}, {"text": "== Early life ==Winona Laura Horowitz was born in Winona County, Minnesota, to Cynthia Palmer (née Istas) and Michael D. Horowitz. Her mother is an author, video producer, and editor, and her father is an author, editor, publisher, and antiquarian bookseller. He also worked as an archivist for psychologist Timothy Leary (Ryder's godfather). Her father's family is of Ashkenazi Jewish descent and hails from Ukraine and Romania. Growing up, she visited her paternal grandparents in Brooklyn for the Jewish Holiday of Passover, every year.Named after Winona, Minnesota, Ryder was given her middle name, Laura, because of her parents' friendship with Laura Huxley, writer Aldous Huxley's wife. Her stage name derives from Mitch Ryder, a soul and rock singer of whom her father was a fan. Ryder's father is an atheist and her mother is a Buddhist. Ryder has a younger brother, Urie (named in honor of the first man in space, Yuri Gagarin), and two older half-siblings from her mother's prior marriage: half-brother Jubal Palmer and half-sister Sunyata Palmer. Ryder's family friends were her godfather Timothy Leary, the Beat Movement poets Allen Ginsberg and Lawrence Ferlinghetti, and the science fiction novelist Philip K. Dick. In 1978, when Ryder was seven years old, she and her family relocated to Rainbow, a commune near Elk, Mendocino County, California, where they lived with seven other families on a 300-acre (120 ha) plot of land. As the remote property had no electricity or television sets, Ryder began to devote her time to reading and became an avid fan of J. D. Salinger's The Catcher in the Rye.When she was ten, Ryder and her family moved to Petaluma, California. During her first week at Kenilworth Junior High, she was bullied by children who mistook her for an effeminate boy. In 1983, 12-year-old Ryder enrolled at the American Conservatory Theater in nearby San Francisco, where she took her first acting lessons. During the same year she nearly drowned, which caused her to develop aquaphobia. This psychological trauma caused problems later in her life during the underwater scenes in Alien Resurrection (1997), some of which had to be reshot numerous times. Ryder's bullying experiences continued through high school, when she achieved early film success with Beetlejuice: \"I remember thinking, 'Ooh, it's like the number-one movie. This is going to make things great at school.' But it made things worse. They called me a witch.\" In 1989, Ryder graduated from Petaluma High School with a 4.0 GPA.Ryder has stated that her natural hair color is brown, but she was \"really blonde as a kid\", and when she was 11 or 12 she started dyeing her blonde hair, blue and purple. At the time of her audition for the 1986 film Lucas, her hair had been dyed black and the filmmakers asked her to keep it."}, {"text": "=== 1985–1990: Early roles and breakthrough ===In 1985, Ryder sent a videotaped audition, where she recited a monologue from the novel Franny and Zooey by J. D. Salinger, to appear in the film Desert Bloom. Although the role went to Annabeth Gish, writer/director David Seltzer cast her in his high school drama Lucas (1986), which starred Corey Haim, Charlie Sheen, and Kerri Green. When asked how she wanted her name to appear in the credits, she suggested \"Ryder\" as her surname because a Mitch Ryder album that belonged to her father was playing in the background. Ryder's next film was Square Dance (1987), where her teenage character creates a bridge between two different worlds—a traditional farm in the middle of nowhere and a large city. She won acclaim for the performance, with the Los Angeles Times calling it \"a remarkable debut.\" Both films were only marginally successful commercially."}, {"text": "=== 1985–1990: Early roles and breakthrough ===After seeing her in Lucas, director Tim Burton cast Ryder in his film Beetlejuice (1988). Ryder starred as a goth teenager whose family moves to a haunted house populated by ghosts played by Geena Davis, Alec Baldwin, and Michael Keaton. The film was a success at the box office, and the film as well as Ryder's performance received mostly positive reviews from critics. Also in 1988, Ryder appeared alongside Kiefer Sutherland and Robert Downey Jr. in 1969, a drama about the Vietnam War and the tensions it created in American families."}, {"text": "=== 1985–1990: Early roles and breakthrough ===Ryder next starred in the independent film Heathers (1989). The film, a satirical take on teenage life, featured Ryder and Christian Slater as high school sweethearts who begin killing off popular students. Ryder's agent initially begged her to turn the role down, saying the film would \"ruin her career\". Critical reaction to the film was largely positive, and Ryder's performance was positively received, with The Washington Post calling Ryder \"Hollywood's most impressive ingénue […] Ryder […] makes us love her teen-age murderess, a bright, funny girl with a little Bonnie Parker in her. She is the most likable, best-drawn young adult protagonist since the sexual innocent of Gregory's Girl.\" Despite its critical success, Heathers was a box-office flop, but has achieved the status of a cult film in the following decades. Ryder’s other 1989 starring role was in the biopic Great Balls of Fire!, in which she played the 13-year-old bride (and cousin) of rock’n’roll idol Jerry Lee Lewis. The film was a box-office failure and received mixed reviews from critics. Ryder also appeared in 1989 in the music video for Mojo Nixon's \"Debbie Gibson Is Pregnant with My Two-Headed Love Child\".Ryder began the 1990s with three starring roles. In the fantasy film Edward Scissorhands (1990), she reunited with director Tim Burton to play the female lead alongside her then-boyfriend Johnny Depp. The film was a significant box office success, grossing $86 million and receiving much critical devotion. Ryder's second role of the year was in the family comedy-drama Mermaids (1990), which co-starred Cher, Bob Hoskins, and Christina Ricci. Mermaids was a moderate box-office success and Ryder's performance was acclaimed; critic Roger Ebert of the Chicago Sun-Times wrote: \"Winona Ryder, in another of her alienated outsider roles, generates real charisma.\" For her performance, Ryder received a Golden Globe Award nomination for Best Actress in a Supporting Role and a National Board Review award for the same category. Following Mermaids, Ryder had the lead role as a troubled teenager in the comedy-drama Welcome Home, Roxy Carmichael (1990). The film co-starred Jeff Daniels and was deemed a commercial flop. In 1990, Ryder also made a cameo in Roy Orbison's music video \"A Love So Beautiful\" with Matthew Modine, and was awarded 'ShoWest's Female Star of Tomorrow' by The National Association of Theatre Owners. She was next slated to appear as Mary Corleone in Francis Ford Coppola's The Godfather Part III, but withdrew from the project in the beginning of filming in 1990 due to nervous exhaustion."}, {"text": "=== 1991–1995: Major roles ===In 1991, Ryder played a young taxicab driver in Jim Jarmusch's independent film Night on Earth. The film was given a limited release, but received critical praise. Ryder then starred in three big-budget adaptations of literary classics. The first was Bram Stoker's Dracula (1992), directed by Francis Ford Coppola and featuring Ryder in the dual role of Mina Murray and Count Dracula’s past lover, Princess Elisabeta. The script was originally intended for a television adaptation but Ryder liked it so much she brought it to Coppola’s attention. The film premiered in November 1992 to critical and commercial success.Ryder continued her work in period films with Martin Scorsese's The Age of Innocence (1993), an adaptation of Edith Wharton's novel that co-starred Michelle Pfeiffer and Daniel Day-Lewis. Ryder considers Scorsese \"the best director in the world\". For her portrayal of May Welland, the fiancée of Newland Archer (Day-Lewis), Ryder won a Golden Globe and received Academy Award and BAFTA nominations as well. Although not a commercial success, the Age of Innocence received critical praise upon its release in October 1993. Vincent Canby in the New York Times wrote, \"Ms Ryder is wonderful as this sweet young thing who's hard as nails, as much out of ignorance as of self-interest.\"Ryder next starred alongside Meryl Streep, Jeremy Irons, Antonio Banderas, and Glenn Close in the melodrama The House of the Spirits (1993), based on Isabel Allende's novel. Also released in October 1993, the film was poorly reviewed and a box-office flop, grossing just $6 million on its $40 million budget. Ebert wrote that Ryder ”seems an unlikely casting choice but she is more convincing, with more abandon and passion, and she makes her character work.\" Ryder was next set to star in Broken Dreams with actor River Phoenix. The project was put on hold due to his death on October 31, 1993. In 1993, Ryder also appeared on the music video \"Without a Trace\" by Soul Asylum, whose member Dave Pirner was her boyfriend at the time."}, {"text": "=== 1991–1995: Major roles ===Ryder's next film, the Generation X drama Reality Bites (1994), marked a departure from period films. Directed by Ben Stiller and co-starring Ethan Hawke, the film featured Ryder as a recent college graduate searching for direction in life. According to Hawke and Stiller, the film got greenlit only due to Ryder's star status. Her performance received acclaim but the film did not meet its studio’s expectations in the box office. Ryder returned to period films later that year, appearing as Jo March in Little Women, an adaptation of Louisa May Alcott's novel. The film received widespread praise; critic Janet Maslin of The New York Times wrote that it was the greatest adaptation of the novel and that \"Ms. Ryder, whose banner year also includes a fine comic performance in Reality Bites, plays Jo with spark and confidence. Her spirited presence gives the film an appealing linchpin, and she plays the self-proclaimed 'man of the family' with just the right staunchness.\" Ryder received her second Oscar nomination for the role, this time as Best Actress. In 1994, Ryder also made a guest appearance in The Simpsons episode \"Lisa's Rival\" as Allison Taylor, whose intelligence and over-achieving personality makes her an adversary of Lisa."}, {"text": "=== 1991–1995: Major roles ===Ryder's next starring role was in How to Make an American Quilt (1995), an adaptation of the novel of the same name by Whitney Otto, co-starring Anne Bancroft, Maya Angelou, and Ellen Burstyn. The film grossed nearly four times its budget and received mixed to positive reviews from critics. The same year, Ryder narrated Anne Frank's The Diary of a Young Girl, for which she received a Grammy Award nomination. A review by Audiofile praised her performance, saying, \"Winona Ryder is the perfect narrator for this work. Her voice sounds very young, matching the 14-year-old's enthusiasm and frustrations.\""}, {"text": "=== 1996–2000: Further lead roles ===Ryder made several film appearances in 1996, the first in Boys. The film failed to become a box office success and attracted mostly negative critical reaction. Ebert wrote: \"Boys is a low-rent, dumbed-down version of Before Sunrise, with a rent-a-plot substituting for clever dialogue\", calling the film a waste of Ryder's talent. Her next role was in Looking for Richard, Al Pacino's meta-documentary on a production of William Shakespeare's Richard III, which grossed only $1 million at the box office but drew moderate critical acclaim. She starred in The Crucible with Daniel Day-Lewis and Joan Allen. The film, an adaptation of Arthur Miller's play, centered on the Salem witch trials. It was expected to be a success, considering its budget, but was a commercial failure. Despite this, it was well received and Ryder's performance was lauded, with Peter Travers of Rolling Stone writing, \"Ryder offers a transfixing portrait of warped innocence.\" Ryder later claimed that the role of Abigail Williams was the hardest in her whole career.Ryder next took on a role as an android in Alien Resurrection (1997), alongside Sigourney Weaver, who stars in the entire Alien trilogy. Ryder's brother, Uri, was a fan of the series, and when approached about it, she agreed to the project. The film became one of the least successful entries in the Alien film series, but irrespective of the film series was considered a success as it grossed $161 million worldwide. Ryder's and Weaver's performances drew mostly positive reviews, and Ryder won a Blockbuster Entertainment Award for Best Actress. In his review of the film, Ebert commented that Ryder lacked the conviction and presence to stand alongside Weaver and the rest of the cast. He compared her with Jenette Goldstein in Aliens. \"Ryder is a wonderful actress, one of the most gifted of her generation, but wrong for this movie,\" he wrote. At 1997's ShoWest event, she was presented with the 'Female Star of the Year' award.On Valentine's Day, 1998, Ryder performed in Eve Ensler's play The Vagina Monologues. She then starred in Woody Allen's Celebrity (1998), after Drew Barrymore turned down Ryder's role, in an ensemble cast. The film satirizes the lives of several celebrities. In 1998, Ryder also appeared in the music video for Jon Spencer Blues Explosion's song \"Talk About the Blues\"; a screenshot from the video later appeared on the cover of their album Xtra-Acme USA. In 1998, Ryder and Leonardo DiCaprio narrated Survivors: Testimonies of the Holocaust, a CD-ROM produced by Steven Spielberg's Shoah Foundation. She also served as a member of the jury, led by Martin Scorsese, at the 1998 Cannes Film Festival.In 1999, Ryder starred in and served as an executive producer for Girl, Interrupted, based on the 1993 memoir of the same name by Susanna Kaysen. The film had been in development since late 1996, but took time to begin filming. Ryder was deeply attached to the project, calling it her \"child of the heart.\" She played Kaysen, who has borderline personality disorder and was admitted to a psychiatric hospital for recovery. Directed by James Mangold and co-starring Angelina Jolie, the film was expected to mark Ryder's comeback playing leading roles. Instead, it turned out to be the \"welcome-to-Hollywood coronation\" for Jolie, who won the Academy Award for Best Supporting Actress for her performance. Ebert wrote: \"Ryder shows again her skill at projecting mental states; one of her gifts is to let us know exactly what she's thinking, without seeming to.\" He later called Ryder one of the reasons to see the film. The same year, Ryder was parodied in South Park: Bigger, Longer & Uncut. She also started her own music company, Roustabout Studios, in 1999.In April 2000, Ryder was awarded the Peter J. Owens Award at the San Francisco Film Festival. Her next film, the melodrama Autumn in New York, co-starring Richard Gere, was released in August. The film received mixed reviews, but was a commercial success, grossing $90 million at the worldwide box office. In September, Ryder made a guest appearance in the series finale of Comedy Central's Strangers With Candy. She then played a nun of a secret society loosely connected to the Roman Catholic Church and determined to prevent Armageddon in Lost Souls (2000), a commercial failure. Ryder refused to do commercial promotion for the film. She later said, \"I was attracted to Lost Souls because I know nothing about this subject. I personally don't believe in demonic possession. For me to play this woman was a real challenge. She is the ultimate believer. Most of all, I just wanted to do a movie in the thriller genre, at least one.\" On October 6, 2000, Ryder received a star on the Hollywood Walk of Fame."}, {"text": "=== 2001–2005: Hiatus ===In 2001, Ryder began a four-year career hiatus. Apart from a guest appearance on NBC's sitcom Friends, playing Rachel's college sorority sister, and a brief cameo in Ben Stiller's comedy Zoolander (2001), she appeared in no new releases in 2001. She was scheduled to appear in Lily and the Secret of Planting, but withdrew from the project after being hospitalized for a severe stomach-related disorder in August 2001. In December 2001, Ryder was arrested for shoplifting, which made it difficult for her to be insured for further film projects. Woody Allen wanted to cast Robert Downey Jr. and Ryder in his film Melinda and Melinda (2003), but was unable to do so because \"I couldn't get insurance on them ... We couldn't get bonded. The completion bonding companies would not bond the picture unless we could insure them. ... We were heartbroken because I had worked with Winona before [on Celebrity] and thought she was perfect for this and wanted to work with her again.\"In 2002, Ryder appeared in two movies filmed before her arrest. The first was a romantic comedy, Mr. Deeds, with Adam Sandler, grossing over $126 million in the United States alone. The film was not a critical success; film critic Philip French called it a terrible film, saying that \"remakes are often bad, but this one was particularly bad.\" The second film was the science fiction drama Simone, in which she portrayed a glamorous star who is replaced by a computer simulated actress due to the clandestine machinations of a director, portrayed by Al Pacino. On May 18, 2002, Ryder hosted Saturday Night Live. In 2005, Ryder co-produced and co-narrated the documentary The Day My God Died (2004) with Tim Robbins, which focuses on international child sex trafficking."}, {"text": "=== 2006–2015: Career revival ===Ryder made a career return with appearances in several independent films in 2006 and 2007. The first was The Darwin Awards (2006), in which she acted alongside Joseph Fiennes. The second was Richard Linklater's A Scanner Darkly, a film adaptation of Philip K. Dick's novel, in which she co-starred opposite Keanu Reeves, Robert Downey, Jr. and Woody Harrelson. The film was made entirely with rotoscope software, which was used to turn live-action scenes into animation. The next year, Ryder appeared in David Wain's comedy The Ten, and reunited with Heathers screenwriter Daniel Waters for the surreal black comedy Sex and Death 101. She also starred in the Kirsten Dunst-directed short horror film Welcome and made a brief appearance in the music video for \"We're All Stuck Out In The Desert\" by Jonathan Rice."}, {"text": "=== 2006–2015: Career revival ===In 2008, Ryder played the female lead opposite Wes Bentley and Ray Romano in Geoffrey Haley's offbeat romantic drama The Last Word. She then starred as a newscaster in the film adaptation of The Informers. She also appeared in director J. J. Abrams's Star Trek, as Spock's human mother Amanda Grayson. Several media outlets noted Ryder's return to film during this time. In 2009, Ryder starred alongside Robin Wright and Julianne Moore in Rebecca Miller's The Private Lives of Pippa Lee (2009)."}, {"text": "=== 2006–2015: Career revival ===The next year, Ryder had a prominent supporting role as an aging ballet star in Darren Aronofsky's Black Swan. She also starred in the independent film Stay Cool alongside Hilary Duff, Mark Polish and Chevy Chase, and in the television movie When Love Is Not Enough: The Lois Wilson Story. For her performance as Lois Wilson, whose husband co-founded Alcoholics Anonymous in 1930s, Ryder was nominated for the Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Television Movie or Miniseries. Entertainment Weekly wrote, \"Ryder played her character with wide eyes of both innocence and terror.\" Ryder next appeared in a leading role in Ron Howard's The Dilemma (2011), co-starring Vince Vaughn and Kevin James."}, {"text": "=== 2006–2015: Career revival ===Ryder then played Deborah Kuklinski, the wife of contract killer Richard Kuklinski, in the thriller The Iceman (2012), co-starring Michael Shannon. She also appeared with her The Iceman co-star James Franco in The Letter (2012). She reunited with director Tim Burton, who directed her in the music video for The Killers' single, \"Here with Me\", and cast her in the animated 3D feature film Frankenweenie (2012). Ryder also worked with the classic film channel TCM in 2012, guest hosting for a week in September, while Robert Osborne was on vacation, and introducing some of her favorite classic films in December.In 2013, Ryder appeared in the action thriller Homefront (2013), again opposite James Franco, this time playing a meth-addicted woman. Steven Boone of RogerEbert.com wrote: \"Ryder often seems on the verge of laughing in Franco's face as he attempts to manhandle and pimp-talk her. But it's nice to see her raven eyes and regal cheekbones on a big screen again, in whatever capacity.\" Ryder also starred in a segment of the Comedy Central television series Drunk History (2013) called \"Boston\". She played religious protester Mary Dyer opposite stern Puritan magistrate John Endicott, played by Michael Cera. She then took on the role of Peggy Shippen, the wife of Benedict Arnold, in her appearance of the second season of Drunk History (2014). In 2014, Ryder appeared in the British television film Turks & Caicos (2014) and modeled in the Fall advertising campaign of fashion label Rag & Bone.In 2015, Ryder was a juror at the Sundance Film Festival. She continued her work in television with the HBO miniseries Show Me a Hero (2015), in which she played the president of the Yonkers City Council. She then starred alongside Peter Sarsgaard in the biopic Experimenter, playing the wife of Stanley Milgram. Experimenter was released to positive reviews in October 2015. Ryder also appeared in advertisements for Marc Jacobs, both for their cosmetics and for their spring 2016 collection."}, {"text": "=== 2016–present ===Since 2016, Ryder has starred in the Netflix science fiction-horror series Stranger Things, created by The Duffer Brothers, playing Joyce Byers, a single mother whose 12-year-old son Will vanishes mysteriously. The Duffer brothers said that Ryder \"has a very intense energy about her ... a wiry unpredictability, a sort of anxiousness that we thought we'd really lean into.\" The series' first season premiered in July 2016 to critical acclaim and high audience ratings. Ryder also received praise for her performance, and the cast won the SAG Award for Best Ensemble in a Drama Series in 2017. The second and third seasons of the series were released in October 2017 and July 2019. For season 3, she was paid a reported $350,000 per episode. The filming for the fourth season had been halted due to the COVID-19 pandemic, but resumed in September 2020. The first volume of season 4 premiered on May 27, 2022, and the second volume on July 1, 2022."}, {"text": "=== 2016–present ===Kate Bush's 1985 song \"Running Up That Hill\" climbed dramatically on music charts and reached number one on iTunes after the song was included in scenes of Stranger Things, after Ryder frequently wore Kate Bush T-shirts and lapel badges on set.In 2018, Ryder appeared in the film Destination Wedding, alongside Keanu Reeves. The two had previously worked together in three other movies (Bram Stoker's Dracula, A Scanner Darkly, and The Private Lives of Pippa Lee), portraying love interests in the first two films. The same year, Ryder also starred in a L'Oréal shampoo commercial, and in H&M's spring collection campaign co-starring Elizabeth Olsen.In early 2020, Ryder appeared in Squarespace's Super Bowl commercial, which aired during the first half of the game. Later that year, she starred in The Plot Against America, an HBO limited series based on Philip Roth's 2004 novel of the same name. David Simon, the creator of the series, said: \"Winona always had the standing of the great American ingenue. Now we're ready for the second act, because she's always been a remarkable actor—always asking questions about the role, doing the research, and then feeling the camera instinctively once the work begins.\" The series was Ryder's second collaboration with Simon; in 2014, she appeared in his HBO miniseries Show Me a Hero.In 2021, Ryder reprised her role as Kim Boggs in Edward Scissorhands alongside Timothée Chalamet in a Super Bowl ad for Cadillac. Her next film was Gone in the Night, co-starring Dermot Mulroney, her co-star in How To Make an American Quilt."}, {"text": "=== 2016–present ===As early as 1992, Ryder had expressed her willingness to appear in a sequel to Beetlejuice, hinting at such a return in a November 2013 interview, provided that Burton and Keaton were involved, and confirmed again in August 2015 that she would reprise her role in the sequel. The sequel, Beetlejuice Beetlejuice, finally went forward in the 2020s, with filming wrapped in late 2023 for a 2024 release."}, {"text": "== Personal life ==Ryder maintains homes in San Francisco, Los Angeles, and Williamsburg in New York City. She is Jewish and has experienced antisemitism. She suffers from insomnia and has been a victim of stalking.She has credited her career to director Tim Burton.Ryder has been involved in philanthropic work since her twenties for the American Indian College Fund, which sends low-income Native Americans to universities."}, {"text": "=== Relationships ===Ryder met Johnny Depp at the Great Balls of Fire! premiere in June 1989 and they began dating shortly afterward, when she was 17. She was engaged to him from 1990 to 1993. She dated Soul Asylum band member Dave Pirner and Helmet frontman Page Hamilton. She dated actor Matt Damon from 1998 to 2000. Since 2011, she has been in a relationship with fashion designer Scott Mackinlay Hahn."}, {"text": "=== Polly Klaas ===In 1993, Ryder offered a reward in the hope that it would lead to the return of kidnapped child Polly Klaas. Klaas lived in Petaluma, where Ryder grew up. Ryder offered a $200,000 reward for Klaas's safe return. After the girl's death, Ryder dedicated her performance as Jo in the 1994 film adaptation of Little Women, one of Klaas's favorite novels, to Klaas's memory.During a sentencing hearing related to her 2001 shoplifting incident, Ryder's attorney, Mark Geragos, referred to her work with the Polly Klaas Foundation and other charitable causes. In response, Deputy District Attorney Ann Rundle said, \"What's offensive to me is to trot out the body of a dead child.\" Polly's father, Marc Klaas, defended Ryder and expressed outrage at the prosecutor's comments."}, {"text": "=== 2001 arrest ===On December 12, 2001, Ryder was arrested on shoplifting charges in Beverly Hills, California, accused of stealing $5,500 worth of designer clothes and accessories at a Saks Fifth Avenue department store. Los Angeles District Attorney Stephen Cooley assembled a team of eight prosecutors and filed four felony charges against her. Ryder hired celebrity defense attorney Mark Geragos. Negotiations failed to produce a plea bargain at the end of summer 2002. Joel Mowbray from National Review noted that the prosecution was not ready to offer her a no-contest plea on misdemeanor charges.She was accused of using drugs, including oxycodone, diazepam, and Vicodin without valid prescription, but prosecutors dropped a drug possession count after it was proved that a doctor provided it to her as a medical treatment. She was convicted of grand theft and shoplifting but acquitted on the charge of burglary. In December 2002, she was sentenced to three years of probation, 480 hours of community service, $3,700 in fines, and $6,355 in restitution to the Saks Fifth Avenue store, and ordered to attend psychological counseling and drug counseling. On June 18, 2004, Superior Court Judge Elden Fox reviewed Ryder's probation report and observed that she had served 480 hours of community service, and the felonies were reduced to misdemeanors. She finished her probation in December 2005.Ryder explained that the incident occurred during a difficult time in her life. She added that the pain-killing medication, which a \"quack\" physician had prescribed her, clouded her judgment significantly. Jules Mark Lusman, who prescribed the medication, subsequently had his medical license revoked by the Medical Board of California for unethically prescribing medication to his patients."}, {"text": "== Filmography and awards ==Ryder has been recognized by the Academy of Motion Picture Arts and Sciences for the following performances:"}, {"text": "== Filmography and awards ==66th Academy Awards (1994): Best Supporting Actress, nomination, for The Age of Innocence"}, {"text": "== Filmography and awards ==67th Academy Awards (1995): Best Actress, nomination, for Little WomenRyder has been nominated for three Golden Globe Awards (winning one), one British Academy Film Award, seven Screen Actor Guild Awards (winning one), and one Grammy Award."}, {"text": "== External links ==Winona Ryder at IMDb"}, {"text": "== External links ==Winona Ryder at TCM"}, {"text": "== External links ==Winona Ryder at AllMovie"}, {"text": "== External links ==Winona Ryder at Rotten Tomatoes"}]